[
    {
        "content": "+++http://www.msnbc.msn.com/id/29703278 Administration open to taxing health benefits Proposal problematic for Obama as he denounced similar one in campaign Video Obama holds health care summit March 5: President Obama turns his focus to health care, holding a summit at the White House to come up with an overhaul of the nation’s health care system. NBC’s John Yang reports. Today show Video A ray of hope seen in stimulus plan March 13: President Barack Obama said Friday his programs are laying a foundation for economic growth, while his chief advisers suggested there is evidence the stimulus plan is starting to have an impact. Nightly News Administration Is Open to Taxing Health Benefits A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five Split on Recession Cure, Leaders Try 3 Approaches President Promises to Bolster Food Safety By Jackie Calmes and Robert Pear updated 5:06 a.m. ET, Sun., March. 15, 2009 WASHINGTON - The Obama administration is signaling to Congress that the president could support taxing some employee health benefits, as several influential lawmakers and many economists favor, to help pay for overhauling the health care system. The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” Most Americans with insurance get it from their employers, and taxing workers for the benefit is opposed by union leaders and some businesses. In television advertisements last fall, Mr. Obama criticized his Republican rival for the presidency, Senator John McCain of Arizona, for proposing to tax all employer-provided health benefits. The benefits have long been tax-free, regardless of how generous they are or how much an employee earns. The advertisements did not point out that Mr. McCain, in exchange, wanted to give all families a tax credit to subsidize the purchase of coverage. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. At a recent Congressional hearing, Senator Ron Wyden, an Oregon Democrat whose own health plan would make benefits taxable, asked Peter R. Orszag, the president’s budget director, about the issue. Mr. Orszag replied that it “most firmly should remain on the table.” Mr. Orszag, an economist who has served as director of the Congressional Budget Office, has written favorably of taxing some employer-provided health benefits and using the revenue savings for other health-related incentives. So has another Obama adviser, Jason Furman, the deputy director of the White House National Economic Council. Click for related content NYT: Obama on spot as rulings aid gay partners NYT: Obama's court nominees focus of speculation NYT: A zealous watchman to follow the money They, like other proponents, cite evidence that tax-free benefits encourage what Mr. McCain called “gold-plated” policies, resulting in inefficient and costly demands for health care and pressure on employers to hold down workers’ pay as insurance expenses rise. And, they say, the policy discriminates against those — many of whom are low-income workers — who do not have employer-provided coverage. When Senator Max Baucus, Democrat of Montana, advocated taxing benefits at a recent hearing of the Finance Committee, which he leads, Treasury Secretary Timothy F. Geithner assured him that the administration was open to all ideas from Congress. Mr. Geithner did, however, allude to the position that Mr. Obama had taken as a candidate. More from NYTimes.com A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five No Clear Accord on Stimulus by Top 20 Nations President Promises to Bolster Food Safety Finding Messages in a Blueprint External links The administration’s receptivity to the idea is owed partly to the advocacy of Mr. Baucus, whose committee has jurisdiction over tax policy and health programs, and to support from Republicans. There is less enthusiasm among Democrats in the House, though the health debate is at an early stage and no comprehensive plans are on the table. Also, Mr. Obama’s own idea for raising revenues for health care — limiting the income tax deductions that the most affluent taxpayers claim — has run into opposition not only from Mr. Baucus but also from his counterpart in the House, Representative Charles B. Rangel, Democrat of New York, who is chairman of the Ways and Means Committee. Mr. Obama’s proposed limit on deductions would raise an estimated $318 billion over 10 years, or half of his proposed “health care reserve fund.” That is a fraction of the revenues that could be raised from taxing employer-provided health benefits. In the campaign, Mr. McCain estimated that taxing all health benefits would raise $3.6 trillion over a decade — “a multitrillion-dollar tax hike,” one Obama advertisement said. The Congressional Budget Office says that including health benefits in taxable income could mean $246 billion in additional revenue for a single year. Stopping short of full taxation, as Mr. Baucus and others suggest, would mean less new revenue. The latest government figures, for 2007, show that 70 percent of the 253 million people with health insurance received at least some of their coverage through employers. Employment-based insurance covers three-fifths of the population under 65.", 
        "intTime": 20090315, 
        "postID": 1, 
        "quote": "", 
        "reply": "+++http://www.msnbc.msn.com/id/29703278 Administration open to taxing health benefits Proposal problematic for Obama as he denounced similar one in campaign Video Obama holds health care summit March 5: President Obama turns his focus to health care, holding a summit at the White House to come up with an overhaul of the nation’s health care system. NBC’s John Yang reports. Today show Video A ray of hope seen in stimulus plan March 13: President Barack Obama said Friday his programs are laying a foundation for economic growth, while his chief advisers suggested there is evidence the stimulus plan is starting to have an impact. Nightly News Administration Is Open to Taxing Health Benefits A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five Split on Recession Cure, Leaders Try 3 Approaches President Promises to Bolster Food Safety By Jackie Calmes and Robert Pear updated 5:06 a.m. ET, Sun., March. 15, 2009 WASHINGTON - The Obama administration is signaling to Congress that the president could support taxing some employee health benefits, as several influential lawmakers and many economists favor, to help pay for overhauling the health care system. The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” Most Americans with insurance get it from their employers, and taxing workers for the benefit is opposed by union leaders and some businesses. In television advertisements last fall, Mr. Obama criticized his Republican rival for the presidency, Senator John McCain of Arizona, for proposing to tax all employer-provided health benefits. The benefits have long been tax-free, regardless of how generous they are or how much an employee earns. The advertisements did not point out that Mr. McCain, in exchange, wanted to give all families a tax credit to subsidize the purchase of coverage. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. At a recent Congressional hearing, Senator Ron Wyden, an Oregon Democrat whose own health plan would make benefits taxable, asked Peter R. Orszag, the president’s budget director, about the issue. Mr. Orszag replied that it “most firmly should remain on the table.” Mr. Orszag, an economist who has served as director of the Congressional Budget Office, has written favorably of taxing some employer-provided health benefits and using the revenue savings for other health-related incentives. So has another Obama adviser, Jason Furman, the deputy director of the White House National Economic Council. Click for related content NYT: Obama on spot as rulings aid gay partners NYT: Obama's court nominees focus of speculation NYT: A zealous watchman to follow the money They, like other proponents, cite evidence that tax-free benefits encourage what Mr. McCain called “gold-plated” policies, resulting in inefficient and costly demands for health care and pressure on employers to hold down workers’ pay as insurance expenses rise. And, they say, the policy discriminates against those — many of whom are low-income workers — who do not have employer-provided coverage. When Senator Max Baucus, Democrat of Montana, advocated taxing benefits at a recent hearing of the Finance Committee, which he leads, Treasury Secretary Timothy F. Geithner assured him that the administration was open to all ideas from Congress. Mr. Geithner did, however, allude to the position that Mr. Obama had taken as a candidate. More from NYTimes.com A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five No Clear Accord on Stimulus by Top 20 Nations President Promises to Bolster Food Safety Finding Messages in a Blueprint External links The administration’s receptivity to the idea is owed partly to the advocacy of Mr. Baucus, whose committee has jurisdiction over tax policy and health programs, and to support from Republicans. There is less enthusiasm among Democrats in the House, though the health debate is at an early stage and no comprehensive plans are on the table. Also, Mr. Obama’s own idea for raising revenues for health care — limiting the income tax deductions that the most affluent taxpayers claim — has run into opposition not only from Mr. Baucus but also from his counterpart in the House, Representative Charles B. Rangel, Democrat of New York, who is chairman of the Ways and Means Committee. Mr. Obama’s proposed limit on deductions would raise an estimated $318 billion over 10 years, or half of his proposed “health care reserve fund.” That is a fraction of the revenues that could be raised from taxing employer-provided health benefits. In the campaign, Mr. McCain estimated that taxing all health benefits would raise $3.6 trillion over a decade — “a multitrillion-dollar tax hike,” one Obama advertisement said. The Congressional Budget Office says that including health benefits in taxable income could mean $246 billion in additional revenue for a single year. Stopping short of full taxation, as Mr. Baucus and others suggest, would mean less new revenue. The latest government figures, for 2007, show that 70 percent of the 253 million people with health insurance received at least some of their coverage through employers. Employment-based insurance covers three-fifths of the population under 65.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 05:47:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” . . At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. The \"H\" in Barack H. Obama stands for \"Hypocrite\". Should this proposal make it into a bill and through Congress, POTUS 44 will own it when he signs it ... He'd do well to remember what sank George H.W. Bush's reelection. I wonder how military families and retirees will react to paying taxes on their TriCare coverage?", 
        "intTime": 20090315, 
        "postID": 2, 
        "quote": "The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” . . At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so.", 
        "reply": " The \"H\" in Barack H. Obama stands for \"Hypocrite\". Should this proposal make it into a bill and through Congress, POTUS 44 will own it when he signs it ... He'd do well to remember what sank George H.W. Bush's reelection. I wonder how military families and retirees will react to paying taxes on their TriCare coverage?", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 05:56:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The more money the gov't gets from new taxes the more money they will print and give away. Enough is never enough. Sad that our country has turned into this sad state of affairs.", 
        "intTime": 20090315, 
        "postID": 3, 
        "quote": "", 
        "reply": "The more money the gov't gets from new taxes the more money they will print and give away. Enough is never enough. Sad that our country has turned into this sad state of affairs.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 06:08:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Duster6"
    }, 
    {
        "content": "If they do this, I bet the perks that they (the Washington DC elite) get will be tax free still. Most everyone I know (regardless of political leanings) are getting damn tired of the Washington DC elite not having to succumb to what we peasants have to endure from their decisions. There needs to be a grass roots push for term limits.", 
        "intTime": 20090315, 
        "postID": 4, 
        "quote": "", 
        "reply": "If they do this, I bet the perks that they (the Washington DC elite) get will be tax free still. Most everyone I know (regardless of political leanings) are getting damn tired of the Washington DC elite not having to succumb to what we peasants have to endure from their decisions. There needs to be a grass roots push for term limits.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 06:42:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "intTime": 20090315, 
        "postID": 5, 
        "quote": "Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so.", 
        "reply": " Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 07:46:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by threerings: At some point people will come to realize that we can not spend government money we do not have. For every massive government bailout and spending program there will be a requirement for increased tax revenue. Where they get that tax revenue will certainly become entertaining but it does not mean they will not get it. They MUST! The day of borrow and spend are long behind us. The interest alone threatens to consume all existing tax revenue in mere decades. You are endentured and the sooner you get a grasp on that reality the sooner we can put an end to the spending that will further endenture us. At the current pace of things we will all be paying 70% or more of our income in taxes. And if we don't get a grip soon our children will be paying 80% or more.", 
        "intTime": 20090315, 
        "postID": 6, 
        "quote": "Originally posted by threerings:", 
        "reply": " At some point people will come to realize that we can not spend government money we do not have. For every massive government bailout and spending program there will be a requirement for increased tax revenue. Where they get that tax revenue will certainly become entertaining but it does not mean they will not get it. They MUST! The day of borrow and spend are long behind us. The interest alone threatens to consume all existing tax revenue in mere decades. You are endentured and the sooner you get a grasp on that reality the sooner we can put an end to the spending that will further endenture us. At the current pace of things we will all be paying 70% or more of our income in taxes. And if we don't get a grip soon our children will be paying 80% or more.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 09:33:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "floersh"
    }, 
    {
        "content": "When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "intTime": 20090315, 
        "postID": 7, 
        "quote": "", 
        "reply": "When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:33:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. You may well think that ... but what I think is the man blatantly criticized such a plan during the campaign to get votes ... and is now showing every appearance of reneging. I was raised to call that ... dishonest. Others call it bait-and-switch. It is fast reaching the point where I attach no credibility to a thing POTUS 44 says.", 
        "intTime": 20090315, 
        "postID": 8, 
        "quote": "Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "reply": " You may well think that ... but what I think is the man blatantly criticized such a plan during the campaign to get votes ... and is now showing every appearance of reneging. I was raised to call that ... dishonest. Others call it bait-and-switch. It is fast reaching the point where I attach no credibility to a thing POTUS 44 says.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:40:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "intTime": 20090315, 
        "postID": 9, 
        "quote": "", 
        "reply": "It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:47:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "intTime": 20090315, 
        "postID": 10, 
        "quote": "Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "reply": " For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:05:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. It's also a fact that he dishonestly criticized \"such a thing\" from McCain ... failing in his attack ad to mention the 5K deduction McCain proposed in conjunction with the tax on employer-provided health benefits. It smells of saying anything to get elected, then reneging ... and wanting to do so in such a way that he isn't the one that actually proposes it. He should ask George H.W. Bush how well that flies in Peoria ...", 
        "intTime": 20090315, 
        "postID": 11, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " It's also a fact that he dishonestly criticized \"such a thing\" from McCain ... failing in his attack ad to mention the 5K deduction McCain proposed in conjunction with the tax on employer-provided health benefits. It smells of saying anything to get elected, then reneging ... and wanting to do so in such a way that he isn't the one that actually proposes it. He should ask George H.W. Bush how well that flies in Peoria ...", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:12:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "intTime": 20090315, 
        "postID": 12, 
        "quote": "", 
        "reply": "The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:17:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "intTime": 20090315, 
        "postID": 13, 
        "quote": "Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "reply": " That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:27:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. The little fella just realized the truth about his new president and he flew into a blind panic - it's a feeling he had best get comfortable with.", 
        "intTime": 20090315, 
        "postID": 14, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "reply": " The little fella just realized the truth about his new president and he flew into a blind panic - it's a feeling he had best get comfortable with.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:40:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. Sorry, this is more than a subtle nuance, it represents a major change in his general outlook and one that will certainly cost people dearly. Basically he lied and no doubt not for the last time.", 
        "intTime": 20090315, 
        "postID": 15, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " Sorry, this is more than a subtle nuance, it represents a major change in his general outlook and one that will certainly cost people dearly. Basically he lied and no doubt not for the last time.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:43:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. I agree with you to a point.. but I do not believe he was so ignorant not to know certain realities... He was selling ice cream to get elected well knowing that he'd have to back off many of the things he said he'd do... typical politician. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090315, 
        "postID": 16, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " I agree with you to a point.. but I do not believe he was so ignorant not to know certain realities... He was selling ice cream to get elected well knowing that he'd have to back off many of the things he said he'd do... typical politician. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:07:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "intTime": 20090315, 
        "postID": 17, 
        "quote": "", 
        "reply": "Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:12:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. I would think from all that he said he'd do and wouldn't do, he would have already had all the facts to step into the job successfully. He didn't. Just a fast smoooooth talker with a bunch of campaign promises thus successfully pulling the wool over the eyes (and brains) of 56% of the votes. I'm proud to say I was not one of the 56% that was duped by his smooooth talk.", 
        "intTime": 20090315, 
        "postID": 18, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position.", 
        "reply": " I would think from all that he said he'd do and wouldn't do, he would have already had all the facts to step into the job successfully. He didn't. Just a fast smoooooth talker with a bunch of campaign promises thus successfully pulling the wool over the eyes (and brains) of 56% of the votes. I'm proud to say I was not one of the 56% that was duped by his smooooth talk.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:22:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by boazjones: Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology. Standard liberal response, divert attention from the present by blathering about some historical artifact no one else gives a d a m n about. The CURRENT topic is political manipulation resulting in more money going to the government. If the ghost of presidents past can help us out, but all means conjur a few up, but I doubt it will do much.", 
        "intTime": 20090315, 
        "postID": 19, 
        "quote": "Originally posted by boazjones: Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "reply": " Standard liberal response, divert attention from the present by blathering about some historical artifact no one else gives a d a m n about. The CURRENT topic is political manipulation resulting in more money going to the government. If the ghost of presidents past can help us out, but all means conjur a few up, but I doubt it will do much.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 15:42:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty:Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one. OBAMA STANDS FOR TWO THINGS: ENFORCED COLLECTIVISM AND RE-ELECTION. IF IT ISN'T SAFE TO DO, HE'LL NOT DO IT. The health care and othe remployer provided perks derived from WW2, when wages and prices were frozen. Both employers and labor interests sought the opportunity to give more to their employees without increasing their wages, and, thus, the implementation of employer-provided benefits grew noticeably. Taxing such benefits becomes a mockery of the New Deal. . . but, then, the New Deal needs some mockery for people to understand its real role (or lack) in the economic development of our nation.", 
        "intTime": 20090315, 
        "postID": 20, 
        "quote": "Originally posted by I_M_Qwerty:Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "reply": " OBAMA STANDS FOR TWO THINGS: ENFORCED COLLECTIVISM AND RE-ELECTION. IF IT ISN'T SAFE TO DO, HE'LL NOT DO IT. The health care and othe remployer provided perks derived from WW2, when wages and prices were frozen. Both employers and labor interests sought the opportunity to give more to their employees without increasing their wages, and, thus, the implementation of employer-provided benefits grew noticeably. Taxing such benefits becomes a mockery of the New Deal. . . but, then, the New Deal needs some mockery for people to understand its real role (or lack) in the economic development of our nation.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 16:08:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! ________________________________________________ Ronald Reagan had to rebuild an entire military decimated by Carter. He took down the Soviet Union and it was Clinton who benefitted from the \"peace dividend.\" The Dems ran up the debt because, now hear this, the President can not pass a spending bill! Period. And if mempory serves me correctly, the GOP didn't have the votes to stop one spending bill. In about '68 the Dems raided the SS system to balance the budget, and continued to spend it away, plus much, much more during Reagan's term. The debt was congressional spending, not Reagans. He was able to cut taxes and bring in more revenue than ever because he went directly to the American people, and they backed him.", 
        "intTime": 20090315, 
        "postID": 21, 
        "quote": "Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "reply": " ________________________________________________ Ronald Reagan had to rebuild an entire military decimated by Carter. He took down the Soviet Union and it was Clinton who benefitted from the \"peace dividend.\" The Dems ran up the debt because, now hear this, the President can not pass a spending bill! Period. And if mempory serves me correctly, the GOP didn't have the votes to stop one spending bill. In about '68 the Dems raided the SS system to balance the budget, and continued to spend it away, plus much, much more during Reagan's term. The debt was congressional spending, not Reagans. He was able to cut taxes and bring in more revenue than ever because he went directly to the American people, and they backed him.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 17:30:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "intTime": 20090315, 
        "postID": 22, 
        "quote": "Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "reply": " We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 17:34:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...! There is ONLY one lense through which to see this: One side wants to control every aspect of our lives. One side wants to control every single dollar we earn. Mandate that I have insurance..and then tax it. Awesome.", 
        "intTime": 20090315, 
        "postID": 23, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "reply": " There is ONLY one lense through which to see this: One side wants to control every aspect of our lives. One side wants to control every single dollar we earn. Mandate that I have insurance..and then tax it. Awesome.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:03:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "Your statement, \"one side wants to control every aspect of our lives. One side wants to control every dollar we earn\" can apply to both sides. If you doubt that - ask me for examples.", 
        "intTime": 20090315, 
        "postID": 24, 
        "quote": "", 
        "reply": "Your statement, \"one side wants to control every aspect of our lives. One side wants to control every dollar we earn\" can apply to both sides. If you doubt that - ask me for examples.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:09:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. Partisan political lens? I opposed McCain's health care reform plan ... now I'm partisan for opposing Baucus' taxation plan on the same grounds? ... and for criticizing Obama for his wishy-washy \"I'll support it but won't propose it\" position after being adamantly opposed to it during the campaign? Not to mention that it'll blow his \"tax relief for the middle class\" out of the water. The man's a hypocrite ... but he's sure got chutzpah.", 
        "intTime": 20090315, 
        "postID": 25, 
        "quote": "Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing.", 
        "reply": " Partisan political lens? I opposed McCain's health care reform plan ... now I'm partisan for opposing Baucus' taxation plan on the same grounds? ... and for criticizing Obama for his wishy-washy \"I'll support it but won't propose it\" position after being adamantly opposed to it during the campaign? Not to mention that it'll blow his \"tax relief for the middle class\" out of the water. The man's a hypocrite ... but he's sure got chutzpah.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:17:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "intTime": 20090315, 
        "postID": 26, 
        "quote": "", 
        "reply": "You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:30:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "intTime": 20090315, 
        "postID": 27, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "reply": " a pile in a pile", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:37:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile or perhaps a pile on top of a load sitting in the pool of crap.", 
        "intTime": 20090315, 
        "postID": 28, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "reply": " or perhaps a pile on top of a load sitting in the pool of crap.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:53:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile yepper, ol'Patooie blasted Bush about how outragous his 600B bailout was and then doesn't bat an eye at 2Trillion....... hmmmmm. Gotta love that woman. NOT!!! One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090315, 
        "postID": 29, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "reply": " yepper, ol'Patooie blasted Bush about how outragous his 600B bailout was and then doesn't bat an eye at 2Trillion....... hmmmmm. Gotta love that woman. NOT!!! One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:55:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone? I'm going to tell you I'm conservative ... and that I'd be making the same argument if it was a Republican president. Now ... a consideration. Assuming you are on TriCare Prime and not yet 65, how would you feel about having Uncle's share of your TriCare Prime coverage added on to your taxable income? How do you think an active duty military family would feel about it? Tell me where you, I, or they are advantaged by Baucus' proposal ... or any other family that already has employer-subsidized health care? As to tax increases ... yeah ... I reject them on principle and will continue to do so until the federal government starts acting in a responsible manner with taxpayer money. Bush's TARP, Pelosi's stimulus bill, and the pork-laden Omnibus bill ... have me in opposition to any tax increase for anything. I've already seen a tax increase under Obama of $700+ this year ... not needing anymore from the man that promised that 95% of Americans would see a reduction or no change.", 
        "intTime": 20090315, 
        "postID": 30, 
        "quote": "Originally posted by mcgreer: You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "reply": " I'm going to tell you I'm conservative ... and that I'd be making the same argument if it was a Republican president. Now ... a consideration. Assuming you are on TriCare Prime and not yet 65, how would you feel about having Uncle's share of your TriCare Prime coverage added on to your taxable income? How do you think an active duty military family would feel about it? Tell me where you, I, or they are advantaged by Baucus' proposal ... or any other family that already has employer-subsidized health care? As to tax increases ... yeah ... I reject them on principle and will continue to do so until the federal government starts acting in a responsible manner with taxpayer money. Bush's TARP, Pelosi's stimulus bill, and the pork-laden Omnibus bill ... have me in opposition to any tax increase for anything. I've already seen a tax increase under Obama of $700+ this year ... not needing anymore from the man that promised that 95% of Americans would see a reduction or no change.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 19:23:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "+++http://www.msnbc.msn.com/id/29703278 Administration open to taxing health benefits Proposal problematic for Obama as he denounced similar one in campaign Video Obama holds health care summit March 5: President Obama turns his focus to health care, holding a summit at the White House to come up with an overhaul of the nation’s health care system. NBC’s John Yang reports. Today show Video A ray of hope seen in stimulus plan March 13: President Barack Obama said Friday his programs are laying a foundation for economic growth, while his chief advisers suggested there is evidence the stimulus plan is starting to have an impact. Nightly News Administration Is Open to Taxing Health Benefits A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five Split on Recession Cure, Leaders Try 3 Approaches President Promises to Bolster Food Safety By Jackie Calmes and Robert Pear updated 5:06 a.m. ET, Sun., March. 15, 2009 WASHINGTON - The Obama administration is signaling to Congress that the president could support taxing some employee health benefits, as several influential lawmakers and many economists favor, to help pay for overhauling the health care system. The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” Most Americans with insurance get it from their employers, and taxing workers for the benefit is opposed by union leaders and some businesses. In television advertisements last fall, Mr. Obama criticized his Republican rival for the presidency, Senator John McCain of Arizona, for proposing to tax all employer-provided health benefits. The benefits have long been tax-free, regardless of how generous they are or how much an employee earns. The advertisements did not point out that Mr. McCain, in exchange, wanted to give all families a tax credit to subsidize the purchase of coverage. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. At a recent Congressional hearing, Senator Ron Wyden, an Oregon Democrat whose own health plan would make benefits taxable, asked Peter R. Orszag, the president’s budget director, about the issue. Mr. Orszag replied that it “most firmly should remain on the table.” Mr. Orszag, an economist who has served as director of the Congressional Budget Office, has written favorably of taxing some employer-provided health benefits and using the revenue savings for other health-related incentives. So has another Obama adviser, Jason Furman, the deputy director of the White House National Economic Council. Click for related content NYT: Obama on spot as rulings aid gay partners NYT: Obama's court nominees focus of speculation NYT: A zealous watchman to follow the money They, like other proponents, cite evidence that tax-free benefits encourage what Mr. McCain called “gold-plated” policies, resulting in inefficient and costly demands for health care and pressure on employers to hold down workers’ pay as insurance expenses rise. And, they say, the policy discriminates against those — many of whom are low-income workers — who do not have employer-provided coverage. When Senator Max Baucus, Democrat of Montana, advocated taxing benefits at a recent hearing of the Finance Committee, which he leads, Treasury Secretary Timothy F. Geithner assured him that the administration was open to all ideas from Congress. Mr. Geithner did, however, allude to the position that Mr. Obama had taken as a candidate. More from NYTimes.com A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five No Clear Accord on Stimulus by Top 20 Nations President Promises to Bolster Food Safety Finding Messages in a Blueprint External links The administration’s receptivity to the idea is owed partly to the advocacy of Mr. Baucus, whose committee has jurisdiction over tax policy and health programs, and to support from Republicans. There is less enthusiasm among Democrats in the House, though the health debate is at an early stage and no comprehensive plans are on the table. Also, Mr. Obama’s own idea for raising revenues for health care — limiting the income tax deductions that the most affluent taxpayers claim — has run into opposition not only from Mr. Baucus but also from his counterpart in the House, Representative Charles B. Rangel, Democrat of New York, who is chairman of the Ways and Means Committee. Mr. Obama’s proposed limit on deductions would raise an estimated $318 billion over 10 years, or half of his proposed “health care reserve fund.” That is a fraction of the revenues that could be raised from taxing employer-provided health benefits. In the campaign, Mr. McCain estimated that taxing all health benefits would raise $3.6 trillion over a decade — “a multitrillion-dollar tax hike,” one Obama advertisement said. The Congressional Budget Office says that including health benefits in taxable income could mean $246 billion in additional revenue for a single year. Stopping short of full taxation, as Mr. Baucus and others suggest, would mean less new revenue. The latest government figures, for 2007, show that 70 percent of the 253 million people with health insurance received at least some of their coverage through employers. Employment-based insurance covers three-fifths of the population under 65.", 
        "intTime": 20090315, 
        "postID": 31, 
        "quote": "", 
        "reply": "+++http://www.msnbc.msn.com/id/29703278 Administration open to taxing health benefits Proposal problematic for Obama as he denounced similar one in campaign Video Obama holds health care summit March 5: President Obama turns his focus to health care, holding a summit at the White House to come up with an overhaul of the nation’s health care system. NBC’s John Yang reports. Today show Video A ray of hope seen in stimulus plan March 13: President Barack Obama said Friday his programs are laying a foundation for economic growth, while his chief advisers suggested there is evidence the stimulus plan is starting to have an impact. Nightly News Administration Is Open to Taxing Health Benefits A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five Split on Recession Cure, Leaders Try 3 Approaches President Promises to Bolster Food Safety By Jackie Calmes and Robert Pear updated 5:06 a.m. ET, Sun., March. 15, 2009 WASHINGTON - The Obama administration is signaling to Congress that the president could support taxing some employee health benefits, as several influential lawmakers and many economists favor, to help pay for overhauling the health care system. The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” Most Americans with insurance get it from their employers, and taxing workers for the benefit is opposed by union leaders and some businesses. In television advertisements last fall, Mr. Obama criticized his Republican rival for the presidency, Senator John McCain of Arizona, for proposing to tax all employer-provided health benefits. The benefits have long been tax-free, regardless of how generous they are or how much an employee earns. The advertisements did not point out that Mr. McCain, in exchange, wanted to give all families a tax credit to subsidize the purchase of coverage. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. At a recent Congressional hearing, Senator Ron Wyden, an Oregon Democrat whose own health plan would make benefits taxable, asked Peter R. Orszag, the president’s budget director, about the issue. Mr. Orszag replied that it “most firmly should remain on the table.” Mr. Orszag, an economist who has served as director of the Congressional Budget Office, has written favorably of taxing some employer-provided health benefits and using the revenue savings for other health-related incentives. So has another Obama adviser, Jason Furman, the deputy director of the White House National Economic Council. Click for related content NYT: Obama on spot as rulings aid gay partners NYT: Obama's court nominees focus of speculation NYT: A zealous watchman to follow the money They, like other proponents, cite evidence that tax-free benefits encourage what Mr. McCain called “gold-plated” policies, resulting in inefficient and costly demands for health care and pressure on employers to hold down workers’ pay as insurance expenses rise. And, they say, the policy discriminates against those — many of whom are low-income workers — who do not have employer-provided coverage. When Senator Max Baucus, Democrat of Montana, advocated taxing benefits at a recent hearing of the Finance Committee, which he leads, Treasury Secretary Timothy F. Geithner assured him that the administration was open to all ideas from Congress. Mr. Geithner did, however, allude to the position that Mr. Obama had taken as a candidate. More from NYTimes.com A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five No Clear Accord on Stimulus by Top 20 Nations President Promises to Bolster Food Safety Finding Messages in a Blueprint External links The administration’s receptivity to the idea is owed partly to the advocacy of Mr. Baucus, whose committee has jurisdiction over tax policy and health programs, and to support from Republicans. There is less enthusiasm among Democrats in the House, though the health debate is at an early stage and no comprehensive plans are on the table. Also, Mr. Obama’s own idea for raising revenues for health care — limiting the income tax deductions that the most affluent taxpayers claim — has run into opposition not only from Mr. Baucus but also from his counterpart in the House, Representative Charles B. Rangel, Democrat of New York, who is chairman of the Ways and Means Committee. Mr. Obama’s proposed limit on deductions would raise an estimated $318 billion over 10 years, or half of his proposed “health care reserve fund.” That is a fraction of the revenues that could be raised from taxing employer-provided health benefits. In the campaign, Mr. McCain estimated that taxing all health benefits would raise $3.6 trillion over a decade — “a multitrillion-dollar tax hike,” one Obama advertisement said. The Congressional Budget Office says that including health benefits in taxable income could mean $246 billion in additional revenue for a single year. Stopping short of full taxation, as Mr. Baucus and others suggest, would mean less new revenue. The latest government figures, for 2007, show that 70 percent of the 253 million people with health insurance received at least some of their coverage through employers. Employment-based insurance covers three-fifths of the population under 65.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 05:47:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” . . At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. The \"H\" in Barack H. Obama stands for \"Hypocrite\". Should this proposal make it into a bill and through Congress, POTUS 44 will own it when he signs it ... He'd do well to remember what sank George H.W. Bush's reelection. I wonder how military families and retirees will react to paying taxes on their TriCare coverage?", 
        "intTime": 20090315, 
        "postID": 32, 
        "quote": "The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” . . At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so.", 
        "reply": " The \"H\" in Barack H. Obama stands for \"Hypocrite\". Should this proposal make it into a bill and through Congress, POTUS 44 will own it when he signs it ... He'd do well to remember what sank George H.W. Bush's reelection. I wonder how military families and retirees will react to paying taxes on their TriCare coverage?", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 05:56:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The more money the gov't gets from new taxes the more money they will print and give away. Enough is never enough. Sad that our country has turned into this sad state of affairs.", 
        "intTime": 20090315, 
        "postID": 33, 
        "quote": "", 
        "reply": "The more money the gov't gets from new taxes the more money they will print and give away. Enough is never enough. Sad that our country has turned into this sad state of affairs.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 06:08:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Duster6"
    }, 
    {
        "content": "If they do this, I bet the perks that they (the Washington DC elite) get will be tax free still. Most everyone I know (regardless of political leanings) are getting damn tired of the Washington DC elite not having to succumb to what we peasants have to endure from their decisions. There needs to be a grass roots push for term limits.", 
        "intTime": 20090315, 
        "postID": 34, 
        "quote": "", 
        "reply": "If they do this, I bet the perks that they (the Washington DC elite) get will be tax free still. Most everyone I know (regardless of political leanings) are getting damn tired of the Washington DC elite not having to succumb to what we peasants have to endure from their decisions. There needs to be a grass roots push for term limits.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 06:42:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "intTime": 20090315, 
        "postID": 35, 
        "quote": "Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so.", 
        "reply": " Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 07:46:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by threerings: At some point people will come to realize that we can not spend government money we do not have. For every massive government bailout and spending program there will be a requirement for increased tax revenue. Where they get that tax revenue will certainly become entertaining but it does not mean they will not get it. They MUST! The day of borrow and spend are long behind us. The interest alone threatens to consume all existing tax revenue in mere decades. You are endentured and the sooner you get a grasp on that reality the sooner we can put an end to the spending that will further endenture us. At the current pace of things we will all be paying 70% or more of our income in taxes. And if we don't get a grip soon our children will be paying 80% or more.", 
        "intTime": 20090315, 
        "postID": 36, 
        "quote": "Originally posted by threerings:", 
        "reply": " At some point people will come to realize that we can not spend government money we do not have. For every massive government bailout and spending program there will be a requirement for increased tax revenue. Where they get that tax revenue will certainly become entertaining but it does not mean they will not get it. They MUST! The day of borrow and spend are long behind us. The interest alone threatens to consume all existing tax revenue in mere decades. You are endentured and the sooner you get a grasp on that reality the sooner we can put an end to the spending that will further endenture us. At the current pace of things we will all be paying 70% or more of our income in taxes. And if we don't get a grip soon our children will be paying 80% or more.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 09:33:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "floersh"
    }, 
    {
        "content": "When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "intTime": 20090315, 
        "postID": 37, 
        "quote": "", 
        "reply": "When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:33:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. You may well think that ... but what I think is the man blatantly criticized such a plan during the campaign to get votes ... and is now showing every appearance of reneging. I was raised to call that ... dishonest. Others call it bait-and-switch. It is fast reaching the point where I attach no credibility to a thing POTUS 44 says.", 
        "intTime": 20090315, 
        "postID": 38, 
        "quote": "Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "reply": " You may well think that ... but what I think is the man blatantly criticized such a plan during the campaign to get votes ... and is now showing every appearance of reneging. I was raised to call that ... dishonest. Others call it bait-and-switch. It is fast reaching the point where I attach no credibility to a thing POTUS 44 says.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:40:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "intTime": 20090315, 
        "postID": 39, 
        "quote": "", 
        "reply": "It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:47:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "intTime": 20090315, 
        "postID": 40, 
        "quote": "Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "reply": " For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:05:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. It's also a fact that he dishonestly criticized \"such a thing\" from McCain ... failing in his attack ad to mention the 5K deduction McCain proposed in conjunction with the tax on employer-provided health benefits. It smells of saying anything to get elected, then reneging ... and wanting to do so in such a way that he isn't the one that actually proposes it. He should ask George H.W. Bush how well that flies in Peoria ...", 
        "intTime": 20090315, 
        "postID": 41, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " It's also a fact that he dishonestly criticized \"such a thing\" from McCain ... failing in his attack ad to mention the 5K deduction McCain proposed in conjunction with the tax on employer-provided health benefits. It smells of saying anything to get elected, then reneging ... and wanting to do so in such a way that he isn't the one that actually proposes it. He should ask George H.W. Bush how well that flies in Peoria ...", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:12:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "intTime": 20090315, 
        "postID": 42, 
        "quote": "", 
        "reply": "The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:17:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "intTime": 20090315, 
        "postID": 43, 
        "quote": "Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "reply": " That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:27:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. The little fella just realized the truth about his new president and he flew into a blind panic - it's a feeling he had best get comfortable with.", 
        "intTime": 20090315, 
        "postID": 44, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "reply": " The little fella just realized the truth about his new president and he flew into a blind panic - it's a feeling he had best get comfortable with.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:40:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. Sorry, this is more than a subtle nuance, it represents a major change in his general outlook and one that will certainly cost people dearly. Basically he lied and no doubt not for the last time.", 
        "intTime": 20090315, 
        "postID": 45, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " Sorry, this is more than a subtle nuance, it represents a major change in his general outlook and one that will certainly cost people dearly. Basically he lied and no doubt not for the last time.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:43:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. I agree with you to a point.. but I do not believe he was so ignorant not to know certain realities... He was selling ice cream to get elected well knowing that he'd have to back off many of the things he said he'd do... typical politician. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090315, 
        "postID": 46, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " I agree with you to a point.. but I do not believe he was so ignorant not to know certain realities... He was selling ice cream to get elected well knowing that he'd have to back off many of the things he said he'd do... typical politician. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:07:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "intTime": 20090315, 
        "postID": 47, 
        "quote": "", 
        "reply": "Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:12:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. I would think from all that he said he'd do and wouldn't do, he would have already had all the facts to step into the job successfully. He didn't. Just a fast smoooooth talker with a bunch of campaign promises thus successfully pulling the wool over the eyes (and brains) of 56% of the votes. I'm proud to say I was not one of the 56% that was duped by his smooooth talk.", 
        "intTime": 20090315, 
        "postID": 48, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position.", 
        "reply": " I would think from all that he said he'd do and wouldn't do, he would have already had all the facts to step into the job successfully. He didn't. Just a fast smoooooth talker with a bunch of campaign promises thus successfully pulling the wool over the eyes (and brains) of 56% of the votes. I'm proud to say I was not one of the 56% that was duped by his smooooth talk.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:22:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by boazjones: Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology. Standard liberal response, divert attention from the present by blathering about some historical artifact no one else gives a d a m n about. The CURRENT topic is political manipulation resulting in more money going to the government. If the ghost of presidents past can help us out, but all means conjur a few up, but I doubt it will do much.", 
        "intTime": 20090315, 
        "postID": 49, 
        "quote": "Originally posted by boazjones: Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "reply": " Standard liberal response, divert attention from the present by blathering about some historical artifact no one else gives a d a m n about. The CURRENT topic is political manipulation resulting in more money going to the government. If the ghost of presidents past can help us out, but all means conjur a few up, but I doubt it will do much.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 15:42:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty:Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one. OBAMA STANDS FOR TWO THINGS: ENFORCED COLLECTIVISM AND RE-ELECTION. IF IT ISN'T SAFE TO DO, HE'LL NOT DO IT. The health care and othe remployer provided perks derived from WW2, when wages and prices were frozen. Both employers and labor interests sought the opportunity to give more to their employees without increasing their wages, and, thus, the implementation of employer-provided benefits grew noticeably. Taxing such benefits becomes a mockery of the New Deal. . . but, then, the New Deal needs some mockery for people to understand its real role (or lack) in the economic development of our nation.", 
        "intTime": 20090315, 
        "postID": 50, 
        "quote": "Originally posted by I_M_Qwerty:Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "reply": " OBAMA STANDS FOR TWO THINGS: ENFORCED COLLECTIVISM AND RE-ELECTION. IF IT ISN'T SAFE TO DO, HE'LL NOT DO IT. The health care and othe remployer provided perks derived from WW2, when wages and prices were frozen. Both employers and labor interests sought the opportunity to give more to their employees without increasing their wages, and, thus, the implementation of employer-provided benefits grew noticeably. Taxing such benefits becomes a mockery of the New Deal. . . but, then, the New Deal needs some mockery for people to understand its real role (or lack) in the economic development of our nation.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 16:08:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! ________________________________________________ Ronald Reagan had to rebuild an entire military decimated by Carter. He took down the Soviet Union and it was Clinton who benefitted from the \"peace dividend.\" The Dems ran up the debt because, now hear this, the President can not pass a spending bill! Period. And if mempory serves me correctly, the GOP didn't have the votes to stop one spending bill. In about '68 the Dems raided the SS system to balance the budget, and continued to spend it away, plus much, much more during Reagan's term. The debt was congressional spending, not Reagans. He was able to cut taxes and bring in more revenue than ever because he went directly to the American people, and they backed him.", 
        "intTime": 20090315, 
        "postID": 51, 
        "quote": "Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "reply": " ________________________________________________ Ronald Reagan had to rebuild an entire military decimated by Carter. He took down the Soviet Union and it was Clinton who benefitted from the \"peace dividend.\" The Dems ran up the debt because, now hear this, the President can not pass a spending bill! Period. And if mempory serves me correctly, the GOP didn't have the votes to stop one spending bill. In about '68 the Dems raided the SS system to balance the budget, and continued to spend it away, plus much, much more during Reagan's term. The debt was congressional spending, not Reagans. He was able to cut taxes and bring in more revenue than ever because he went directly to the American people, and they backed him.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 17:30:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "intTime": 20090315, 
        "postID": 52, 
        "quote": "Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "reply": " We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 17:34:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...! There is ONLY one lense through which to see this: One side wants to control every aspect of our lives. One side wants to control every single dollar we earn. Mandate that I have insurance..and then tax it. Awesome.", 
        "intTime": 20090315, 
        "postID": 53, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "reply": " There is ONLY one lense through which to see this: One side wants to control every aspect of our lives. One side wants to control every single dollar we earn. Mandate that I have insurance..and then tax it. Awesome.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:03:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "Your statement, \"one side wants to control every aspect of our lives. One side wants to control every dollar we earn\" can apply to both sides. If you doubt that - ask me for examples.", 
        "intTime": 20090315, 
        "postID": 54, 
        "quote": "", 
        "reply": "Your statement, \"one side wants to control every aspect of our lives. One side wants to control every dollar we earn\" can apply to both sides. If you doubt that - ask me for examples.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:09:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. Partisan political lens? I opposed McCain's health care reform plan ... now I'm partisan for opposing Baucus' taxation plan on the same grounds? ... and for criticizing Obama for his wishy-washy \"I'll support it but won't propose it\" position after being adamantly opposed to it during the campaign? Not to mention that it'll blow his \"tax relief for the middle class\" out of the water. The man's a hypocrite ... but he's sure got chutzpah.", 
        "intTime": 20090315, 
        "postID": 55, 
        "quote": "Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing.", 
        "reply": " Partisan political lens? I opposed McCain's health care reform plan ... now I'm partisan for opposing Baucus' taxation plan on the same grounds? ... and for criticizing Obama for his wishy-washy \"I'll support it but won't propose it\" position after being adamantly opposed to it during the campaign? Not to mention that it'll blow his \"tax relief for the middle class\" out of the water. The man's a hypocrite ... but he's sure got chutzpah.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:17:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "intTime": 20090315, 
        "postID": 56, 
        "quote": "", 
        "reply": "You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:30:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "intTime": 20090315, 
        "postID": 57, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "reply": " a pile in a pile", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:37:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile or perhaps a pile on top of a load sitting in the pool of crap.", 
        "intTime": 20090315, 
        "postID": 58, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "reply": " or perhaps a pile on top of a load sitting in the pool of crap.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:53:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile yepper, ol'Patooie blasted Bush about how outragous his 600B bailout was and then doesn't bat an eye at 2Trillion....... hmmmmm. Gotta love that woman. NOT!!! One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090315, 
        "postID": 59, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "reply": " yepper, ol'Patooie blasted Bush about how outragous his 600B bailout was and then doesn't bat an eye at 2Trillion....... hmmmmm. Gotta love that woman. NOT!!! One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:55:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone? I'm going to tell you I'm conservative ... and that I'd be making the same argument if it was a Republican president. Now ... a consideration. Assuming you are on TriCare Prime and not yet 65, how would you feel about having Uncle's share of your TriCare Prime coverage added on to your taxable income? How do you think an active duty military family would feel about it? Tell me where you, I, or they are advantaged by Baucus' proposal ... or any other family that already has employer-subsidized health care? As to tax increases ... yeah ... I reject them on principle and will continue to do so until the federal government starts acting in a responsible manner with taxpayer money. Bush's TARP, Pelosi's stimulus bill, and the pork-laden Omnibus bill ... have me in opposition to any tax increase for anything. I've already seen a tax increase under Obama of $700+ this year ... not needing anymore from the man that promised that 95% of Americans would see a reduction or no change.", 
        "intTime": 20090315, 
        "postID": 60, 
        "quote": "Originally posted by mcgreer: You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "reply": " I'm going to tell you I'm conservative ... and that I'd be making the same argument if it was a Republican president. Now ... a consideration. Assuming you are on TriCare Prime and not yet 65, how would you feel about having Uncle's share of your TriCare Prime coverage added on to your taxable income? How do you think an active duty military family would feel about it? Tell me where you, I, or they are advantaged by Baucus' proposal ... or any other family that already has employer-subsidized health care? As to tax increases ... yeah ... I reject them on principle and will continue to do so until the federal government starts acting in a responsible manner with taxpayer money. Bush's TARP, Pelosi's stimulus bill, and the pork-laden Omnibus bill ... have me in opposition to any tax increase for anything. I've already seen a tax increase under Obama of $700+ this year ... not needing anymore from the man that promised that 95% of Americans would see a reduction or no change.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 19:23:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "+++http://www.msnbc.msn.com/id/29703278 Administration open to taxing health benefits Proposal problematic for Obama as he denounced similar one in campaign Video Obama holds health care summit March 5: President Obama turns his focus to health care, holding a summit at the White House to come up with an overhaul of the nation’s health care system. NBC’s John Yang reports. Today show Video A ray of hope seen in stimulus plan March 13: President Barack Obama said Friday his programs are laying a foundation for economic growth, while his chief advisers suggested there is evidence the stimulus plan is starting to have an impact. Nightly News Administration Is Open to Taxing Health Benefits A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five Split on Recession Cure, Leaders Try 3 Approaches President Promises to Bolster Food Safety By Jackie Calmes and Robert Pear updated 5:06 a.m. ET, Sun., March. 15, 2009 WASHINGTON - The Obama administration is signaling to Congress that the president could support taxing some employee health benefits, as several influential lawmakers and many economists favor, to help pay for overhauling the health care system. The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” Most Americans with insurance get it from their employers, and taxing workers for the benefit is opposed by union leaders and some businesses. In television advertisements last fall, Mr. Obama criticized his Republican rival for the presidency, Senator John McCain of Arizona, for proposing to tax all employer-provided health benefits. The benefits have long been tax-free, regardless of how generous they are or how much an employee earns. The advertisements did not point out that Mr. McCain, in exchange, wanted to give all families a tax credit to subsidize the purchase of coverage. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. At a recent Congressional hearing, Senator Ron Wyden, an Oregon Democrat whose own health plan would make benefits taxable, asked Peter R. Orszag, the president’s budget director, about the issue. Mr. Orszag replied that it “most firmly should remain on the table.” Mr. Orszag, an economist who has served as director of the Congressional Budget Office, has written favorably of taxing some employer-provided health benefits and using the revenue savings for other health-related incentives. So has another Obama adviser, Jason Furman, the deputy director of the White House National Economic Council. Click for related content NYT: Obama on spot as rulings aid gay partners NYT: Obama's court nominees focus of speculation NYT: A zealous watchman to follow the money They, like other proponents, cite evidence that tax-free benefits encourage what Mr. McCain called “gold-plated” policies, resulting in inefficient and costly demands for health care and pressure on employers to hold down workers’ pay as insurance expenses rise. And, they say, the policy discriminates against those — many of whom are low-income workers — who do not have employer-provided coverage. When Senator Max Baucus, Democrat of Montana, advocated taxing benefits at a recent hearing of the Finance Committee, which he leads, Treasury Secretary Timothy F. Geithner assured him that the administration was open to all ideas from Congress. Mr. Geithner did, however, allude to the position that Mr. Obama had taken as a candidate. More from NYTimes.com A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five No Clear Accord on Stimulus by Top 20 Nations President Promises to Bolster Food Safety Finding Messages in a Blueprint External links The administration’s receptivity to the idea is owed partly to the advocacy of Mr. Baucus, whose committee has jurisdiction over tax policy and health programs, and to support from Republicans. There is less enthusiasm among Democrats in the House, though the health debate is at an early stage and no comprehensive plans are on the table. Also, Mr. Obama’s own idea for raising revenues for health care — limiting the income tax deductions that the most affluent taxpayers claim — has run into opposition not only from Mr. Baucus but also from his counterpart in the House, Representative Charles B. Rangel, Democrat of New York, who is chairman of the Ways and Means Committee. Mr. Obama’s proposed limit on deductions would raise an estimated $318 billion over 10 years, or half of his proposed “health care reserve fund.” That is a fraction of the revenues that could be raised from taxing employer-provided health benefits. In the campaign, Mr. McCain estimated that taxing all health benefits would raise $3.6 trillion over a decade — “a multitrillion-dollar tax hike,” one Obama advertisement said. The Congressional Budget Office says that including health benefits in taxable income could mean $246 billion in additional revenue for a single year. Stopping short of full taxation, as Mr. Baucus and others suggest, would mean less new revenue. The latest government figures, for 2007, show that 70 percent of the 253 million people with health insurance received at least some of their coverage through employers. Employment-based insurance covers three-fifths of the population under 65.", 
        "intTime": 20090315, 
        "postID": 61, 
        "quote": "", 
        "reply": "+++http://www.msnbc.msn.com/id/29703278 Administration open to taxing health benefits Proposal problematic for Obama as he denounced similar one in campaign Video Obama holds health care summit March 5: President Obama turns his focus to health care, holding a summit at the White House to come up with an overhaul of the nation’s health care system. NBC’s John Yang reports. Today show Video A ray of hope seen in stimulus plan March 13: President Barack Obama said Friday his programs are laying a foundation for economic growth, while his chief advisers suggested there is evidence the stimulus plan is starting to have an impact. Nightly News Administration Is Open to Taxing Health Benefits A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five Split on Recession Cure, Leaders Try 3 Approaches President Promises to Bolster Food Safety By Jackie Calmes and Robert Pear updated 5:06 a.m. ET, Sun., March. 15, 2009 WASHINGTON - The Obama administration is signaling to Congress that the president could support taxing some employee health benefits, as several influential lawmakers and many economists favor, to help pay for overhauling the health care system. The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” Most Americans with insurance get it from their employers, and taxing workers for the benefit is opposed by union leaders and some businesses. In television advertisements last fall, Mr. Obama criticized his Republican rival for the presidency, Senator John McCain of Arizona, for proposing to tax all employer-provided health benefits. The benefits have long been tax-free, regardless of how generous they are or how much an employee earns. The advertisements did not point out that Mr. McCain, in exchange, wanted to give all families a tax credit to subsidize the purchase of coverage. Story continues below ↓ -------------------------------------------------------------------------------- advertisement | your ad here -------------------------------------------------------------------------------- At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. At a recent Congressional hearing, Senator Ron Wyden, an Oregon Democrat whose own health plan would make benefits taxable, asked Peter R. Orszag, the president’s budget director, about the issue. Mr. Orszag replied that it “most firmly should remain on the table.” Mr. Orszag, an economist who has served as director of the Congressional Budget Office, has written favorably of taxing some employer-provided health benefits and using the revenue savings for other health-related incentives. So has another Obama adviser, Jason Furman, the deputy director of the White House National Economic Council. Click for related content NYT: Obama on spot as rulings aid gay partners NYT: Obama's court nominees focus of speculation NYT: A zealous watchman to follow the money They, like other proponents, cite evidence that tax-free benefits encourage what Mr. McCain called “gold-plated” policies, resulting in inefficient and costly demands for health care and pressure on employers to hold down workers’ pay as insurance expenses rise. And, they say, the policy discriminates against those — many of whom are low-income workers — who do not have employer-provided coverage. When Senator Max Baucus, Democrat of Montana, advocated taxing benefits at a recent hearing of the Finance Committee, which he leads, Treasury Secretary Timothy F. Geithner assured him that the administration was open to all ideas from Congress. Mr. Geithner did, however, allude to the position that Mr. Obama had taken as a candidate. More from NYTimes.com A.I.G. Planning Huge Bonuses After $170 Billion Bailout Without a Pastor of His Own, Obama Turns to Five No Clear Accord on Stimulus by Top 20 Nations President Promises to Bolster Food Safety Finding Messages in a Blueprint External links The administration’s receptivity to the idea is owed partly to the advocacy of Mr. Baucus, whose committee has jurisdiction over tax policy and health programs, and to support from Republicans. There is less enthusiasm among Democrats in the House, though the health debate is at an early stage and no comprehensive plans are on the table. Also, Mr. Obama’s own idea for raising revenues for health care — limiting the income tax deductions that the most affluent taxpayers claim — has run into opposition not only from Mr. Baucus but also from his counterpart in the House, Representative Charles B. Rangel, Democrat of New York, who is chairman of the Ways and Means Committee. Mr. Obama’s proposed limit on deductions would raise an estimated $318 billion over 10 years, or half of his proposed “health care reserve fund.” That is a fraction of the revenues that could be raised from taxing employer-provided health benefits. In the campaign, Mr. McCain estimated that taxing all health benefits would raise $3.6 trillion over a decade — “a multitrillion-dollar tax hike,” one Obama advertisement said. The Congressional Budget Office says that including health benefits in taxable income could mean $246 billion in additional revenue for a single year. Stopping short of full taxation, as Mr. Baucus and others suggest, would mean less new revenue. The latest government figures, for 2007, show that 70 percent of the 253 million people with health insurance received at least some of their coverage through employers. Employment-based insurance covers three-fifths of the population under 65.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 05:47:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” . . At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. The \"H\" in Barack H. Obama stands for \"Hypocrite\". Should this proposal make it into a bill and through Congress, POTUS 44 will own it when he signs it ... He'd do well to remember what sank George H.W. Bush's reelection. I wonder how military families and retirees will react to paying taxes on their TriCare coverage?", 
        "intTime": 20090315, 
        "postID": 62, 
        "quote": "The proposal is politically problematic for President Obama, however, since it is similar to one he denounced in the presidential campaign as “the largest middle-class tax increase in history.” . . At the time, even some Obama supporters said privately that he might come to regret his position if he won the election; in effect, they said, he was potentially giving up an important option to help finance his ambitious health care agenda to reduce medical costs and to expand coverage to the 46 million uninsured Americans. Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so.", 
        "reply": " The \"H\" in Barack H. Obama stands for \"Hypocrite\". Should this proposal make it into a bill and through Congress, POTUS 44 will own it when he signs it ... He'd do well to remember what sank George H.W. Bush's reelection. I wonder how military families and retirees will react to paying taxes on their TriCare coverage?", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 05:56:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The more money the gov't gets from new taxes the more money they will print and give away. Enough is never enough. Sad that our country has turned into this sad state of affairs.", 
        "intTime": 20090315, 
        "postID": 63, 
        "quote": "", 
        "reply": "The more money the gov't gets from new taxes the more money they will print and give away. Enough is never enough. Sad that our country has turned into this sad state of affairs.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 06:08:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Duster6"
    }, 
    {
        "content": "If they do this, I bet the perks that they (the Washington DC elite) get will be tax free still. Most everyone I know (regardless of political leanings) are getting damn tired of the Washington DC elite not having to succumb to what we peasants have to endure from their decisions. There needs to be a grass roots push for term limits.", 
        "intTime": 20090315, 
        "postID": 64, 
        "quote": "", 
        "reply": "If they do this, I bet the perks that they (the Washington DC elite) get will be tax free still. Most everyone I know (regardless of political leanings) are getting damn tired of the Washington DC elite not having to succumb to what we peasants have to endure from their decisions. There needs to be a grass roots push for term limits.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 06:42:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so. Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "intTime": 20090315, 
        "postID": 65, 
        "quote": "Now that Mr. Obama has begun the health debate, several advisers say that while he will not propose changing the tax-free status of employee health benefits, neither will he oppose it if Congress does so.", 
        "reply": " Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 07:46:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by threerings: At some point people will come to realize that we can not spend government money we do not have. For every massive government bailout and spending program there will be a requirement for increased tax revenue. Where they get that tax revenue will certainly become entertaining but it does not mean they will not get it. They MUST! The day of borrow and spend are long behind us. The interest alone threatens to consume all existing tax revenue in mere decades. You are endentured and the sooner you get a grasp on that reality the sooner we can put an end to the spending that will further endenture us. At the current pace of things we will all be paying 70% or more of our income in taxes. And if we don't get a grip soon our children will be paying 80% or more.", 
        "intTime": 20090315, 
        "postID": 66, 
        "quote": "Originally posted by threerings:", 
        "reply": " At some point people will come to realize that we can not spend government money we do not have. For every massive government bailout and spending program there will be a requirement for increased tax revenue. Where they get that tax revenue will certainly become entertaining but it does not mean they will not get it. They MUST! The day of borrow and spend are long behind us. The interest alone threatens to consume all existing tax revenue in mere decades. You are endentured and the sooner you get a grasp on that reality the sooner we can put an end to the spending that will further endenture us. At the current pace of things we will all be paying 70% or more of our income in taxes. And if we don't get a grip soon our children will be paying 80% or more.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 09:33:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "floersh"
    }, 
    {
        "content": "When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "intTime": 20090315, 
        "postID": 67, 
        "quote": "", 
        "reply": "When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:33:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. You may well think that ... but what I think is the man blatantly criticized such a plan during the campaign to get votes ... and is now showing every appearance of reneging. I was raised to call that ... dishonest. Others call it bait-and-switch. It is fast reaching the point where I attach no credibility to a thing POTUS 44 says.", 
        "intTime": 20090315, 
        "postID": 68, 
        "quote": "Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "reply": " You may well think that ... but what I think is the man blatantly criticized such a plan during the campaign to get votes ... and is now showing every appearance of reneging. I was raised to call that ... dishonest. Others call it bait-and-switch. It is fast reaching the point where I attach no credibility to a thing POTUS 44 says.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:40:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "intTime": 20090315, 
        "postID": 69, 
        "quote": "", 
        "reply": "It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 10:47:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "intTime": 20090315, 
        "postID": 70, 
        "quote": "Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for.", 
        "reply": " For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:05:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. It's also a fact that he dishonestly criticized \"such a thing\" from McCain ... failing in his attack ad to mention the 5K deduction McCain proposed in conjunction with the tax on employer-provided health benefits. It smells of saying anything to get elected, then reneging ... and wanting to do so in such a way that he isn't the one that actually proposes it. He should ask George H.W. Bush how well that flies in Peoria ...", 
        "intTime": 20090315, 
        "postID": 71, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " It's also a fact that he dishonestly criticized \"such a thing\" from McCain ... failing in his attack ad to mention the 5K deduction McCain proposed in conjunction with the tax on employer-provided health benefits. It smells of saying anything to get elected, then reneging ... and wanting to do so in such a way that he isn't the one that actually proposes it. He should ask George H.W. Bush how well that flies in Peoria ...", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:12:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "intTime": 20090315, 
        "postID": 72, 
        "quote": "", 
        "reply": "The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:17:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "intTime": 20090315, 
        "postID": 73, 
        "quote": "Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "reply": " That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:27:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. The little fella just realized the truth about his new president and he flew into a blind panic - it's a feeling he had best get comfortable with.", 
        "intTime": 20090315, 
        "postID": 74, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "reply": " The little fella just realized the truth about his new president and he flew into a blind panic - it's a feeling he had best get comfortable with.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:40:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. Sorry, this is more than a subtle nuance, it represents a major change in his general outlook and one that will certainly cost people dearly. Basically he lied and no doubt not for the last time.", 
        "intTime": 20090315, 
        "postID": 75, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " Sorry, this is more than a subtle nuance, it represents a major change in his general outlook and one that will certainly cost people dearly. Basically he lied and no doubt not for the last time.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 11:43:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff. I agree with you to a point.. but I do not believe he was so ignorant not to know certain realities... He was selling ice cream to get elected well knowing that he'd have to back off many of the things he said he'd do... typical politician. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090315, 
        "postID": 76, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. That is possible, unless you're an opponent of his and will on general principle criticize everything he does. It's ridiculous to imagine anyone will keep the same opinions and ideas regardless of what facts are presented to them - and it's even more ridiculous to think that anyone in the political arena would. It's a fact that he criticized such a thing from McCain - again, reality tempers that kind of stuff.", 
        "reply": " I agree with you to a point.. but I do not believe he was so ignorant not to know certain realities... He was selling ice cream to get elected well knowing that he'd have to back off many of the things he said he'd do... typical politician. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:07:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "intTime": 20090315, 
        "postID": 77, 
        "quote": "", 
        "reply": "Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:12:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "boazjones"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position. I would think from all that he said he'd do and wouldn't do, he would have already had all the facts to step into the job successfully. He didn't. Just a fast smoooooth talker with a bunch of campaign promises thus successfully pulling the wool over the eyes (and brains) of 56% of the votes. I'm proud to say I was not one of the 56% that was duped by his smooooth talk.", 
        "intTime": 20090315, 
        "postID": 78, 
        "quote": "Originally posted by mcgreer: It very well could be that his promises are being tempered by the reality that is based on knowledge he's gaining now that he's in his position.", 
        "reply": " I would think from all that he said he'd do and wouldn't do, he would have already had all the facts to step into the job successfully. He didn't. Just a fast smoooooth talker with a bunch of campaign promises thus successfully pulling the wool over the eyes (and brains) of 56% of the votes. I'm proud to say I was not one of the 56% that was duped by his smooooth talk.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 12:22:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by boazjones: Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology. Standard liberal response, divert attention from the present by blathering about some historical artifact no one else gives a d a m n about. The CURRENT topic is political manipulation resulting in more money going to the government. If the ghost of presidents past can help us out, but all means conjur a few up, but I doubt it will do much.", 
        "intTime": 20090315, 
        "postID": 79, 
        "quote": "Originally posted by boazjones: Although it's not an excuse, I did want to quote the post that I'm most directly responding to - but I can't do it on the Nokia Symbian Phone OS that I'm using. So, you're right - it does seem like I'm just coming out of left field. Apologies. Yet, the point that I want to express are the so-called \"tax and spend\" or \"borrow and spend\" philosophies. We always seem to double our national debt using the Republican methodology.", 
        "reply": " Standard liberal response, divert attention from the present by blathering about some historical artifact no one else gives a d a m n about. The CURRENT topic is political manipulation resulting in more money going to the government. If the ghost of presidents past can help us out, but all means conjur a few up, but I doubt it will do much.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 15:42:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty:Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one. OBAMA STANDS FOR TWO THINGS: ENFORCED COLLECTIVISM AND RE-ELECTION. IF IT ISN'T SAFE TO DO, HE'LL NOT DO IT. The health care and othe remployer provided perks derived from WW2, when wages and prices were frozen. Both employers and labor interests sought the opportunity to give more to their employees without increasing their wages, and, thus, the implementation of employer-provided benefits grew noticeably. Taxing such benefits becomes a mockery of the New Deal. . . but, then, the New Deal needs some mockery for people to understand its real role (or lack) in the economic development of our nation.", 
        "intTime": 20090315, 
        "postID": 80, 
        "quote": "Originally posted by I_M_Qwerty:Now THAT's leadership ... gives new meaning to Truman's desk sign ... \"The Buck Stops Here There\" Hypocrisy and chutzpah rolled into one.", 
        "reply": " OBAMA STANDS FOR TWO THINGS: ENFORCED COLLECTIVISM AND RE-ELECTION. IF IT ISN'T SAFE TO DO, HE'LL NOT DO IT. The health care and othe remployer provided perks derived from WW2, when wages and prices were frozen. Both employers and labor interests sought the opportunity to give more to their employees without increasing their wages, and, thus, the implementation of employer-provided benefits grew noticeably. Taxing such benefits becomes a mockery of the New Deal. . . but, then, the New Deal needs some mockery for people to understand its real role (or lack) in the economic development of our nation.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 16:08:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! ________________________________________________ Ronald Reagan had to rebuild an entire military decimated by Carter. He took down the Soviet Union and it was Clinton who benefitted from the \"peace dividend.\" The Dems ran up the debt because, now hear this, the President can not pass a spending bill! Period. And if mempory serves me correctly, the GOP didn't have the votes to stop one spending bill. In about '68 the Dems raided the SS system to balance the budget, and continued to spend it away, plus much, much more during Reagan's term. The debt was congressional spending, not Reagans. He was able to cut taxes and bring in more revenue than ever because he went directly to the American people, and they backed him.", 
        "intTime": 20090315, 
        "postID": 81, 
        "quote": "Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed!", 
        "reply": " ________________________________________________ Ronald Reagan had to rebuild an entire military decimated by Carter. He took down the Soviet Union and it was Clinton who benefitted from the \"peace dividend.\" The Dems ran up the debt because, now hear this, the President can not pass a spending bill! Period. And if mempory serves me correctly, the GOP didn't have the votes to stop one spending bill. In about '68 the Dems raided the SS system to balance the budget, and continued to spend it away, plus much, much more during Reagan's term. The debt was congressional spending, not Reagans. He was able to cut taxes and bring in more revenue than ever because he went directly to the American people, and they backed him.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 17:30:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "herd173"
    }, 
    {
        "content": "quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "intTime": 20090315, 
        "postID": 82, 
        "quote": "Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care.", 
        "reply": " We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 17:34:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...! There is ONLY one lense through which to see this: One side wants to control every aspect of our lives. One side wants to control every single dollar we earn. Mandate that I have insurance..and then tax it. Awesome.", 
        "intTime": 20090315, 
        "postID": 83, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by threerings: quote: Originally posted by mcgreer: When your sources of information are limited, you don't have much access to facts. This has been discussed for months. Max Baucus of Montana introduced a policy paper back in December that suggested capping tax breaks for health insurance premiums. These breaks would be based on income or the value of the benefits. This is basically the model for what Obama proposes. The President and Veep have been leaning in this direction for some time now, and they and the Dems in Congress are likely coming to some sort of compromise. As a person whose spouse paid into a national health care system (Germany) with her taxes, it doesn't seem a problem to me; it actually makes sense, as there aren't too many other ways to generate the revenues necessary to create the program the President is advocating. What will hopefully happen is that, as other programs are reduced and the tax burden is reorganized, there may still be a reduction in what you pay in taxes overall, but health care will simply be one of those things your taxes pay for. For some time? Like since..1-20-09? Or since the DAY AFTER he claimed he would never do this? You've stated what you think will \"hopefully\" happen. Let me tell you what will happen if this idea is turned into law: Every single middle class person will be taxed into the lower class. There will be NO middle class.. Just a bunch of under educated, under employeed people..all living in the same government built housing projects..all driving the same \"green\" car..all working for the same $4.75 an hour...all getting crappy health care. We won't be taxed that heavily. Now - this debate has gone on since during the campaign - and right after the election, Baucus introduced that policy paper I'm speaking of (read the actual paper here.). If you don't feel like doing that - and I suspect most here won't - here's a news item from The Hill, dated 12 November 2008, the date of the release of his plan: \"Senate Finance Committee Chairman Max Baucus stepped to the forefront of the national debate over healthcare with a sweeping universal-coverage plan, pushing the issue to the top of the next Congress's agenda. 'In 2009, Congress must take up and act on meaningful health reform legislation that achieves coverage for all Americans while also addressing the underlying problems in our health system,' the Montana Democrat said in a policy paper released Wednesday. 'The urgency of this task has become undeniable.' Under the Montana Democrat's plan, all Americans would be required to hold a health insurance policy, going one step further than President-elect Barack Obama's plan. Individuals could keep their existing health plans or join a nationwide insurance pool to buy coverage, the price tag of which would be reduced with government subsidies. Insurers would not be allowed to discriminate based on pre-existing conditions, a centerpiece of Obama's plan...\" \"http://thehill.com/leading-the-news/baucus-unveils-sweeping-healthcare-plan-2008-11-12.html\" Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. It's always the same old argument. That's tired. Ick...!", 
        "reply": " There is ONLY one lense through which to see this: One side wants to control every aspect of our lives. One side wants to control every single dollar we earn. Mandate that I have insurance..and then tax it. Awesome.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:03:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "threerings"
    }, 
    {
        "content": "Your statement, \"one side wants to control every aspect of our lives. One side wants to control every dollar we earn\" can apply to both sides. If you doubt that - ask me for examples.", 
        "intTime": 20090315, 
        "postID": 84, 
        "quote": "", 
        "reply": "Your statement, \"one side wants to control every aspect of our lives. One side wants to control every dollar we earn\" can apply to both sides. If you doubt that - ask me for examples.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:09:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing. Partisan political lens? I opposed McCain's health care reform plan ... now I'm partisan for opposing Baucus' taxation plan on the same grounds? ... and for criticizing Obama for his wishy-washy \"I'll support it but won't propose it\" position after being adamantly opposed to it during the campaign? Not to mention that it'll blow his \"tax relief for the middle class\" out of the water. The man's a hypocrite ... but he's sure got chutzpah.", 
        "intTime": 20090315, 
        "postID": 85, 
        "quote": "Don't you guys get bored with seeing everything through a partisan political lens? There's a lot more going out here - and you miss the opportunity to get so much more information by doing such a thing.", 
        "reply": " Partisan political lens? I opposed McCain's health care reform plan ... now I'm partisan for opposing Baucus' taxation plan on the same grounds? ... and for criticizing Obama for his wishy-washy \"I'll support it but won't propose it\" position after being adamantly opposed to it during the campaign? Not to mention that it'll blow his \"tax relief for the middle class\" out of the water. The man's a hypocrite ... but he's sure got chutzpah.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:17:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "intTime": 20090315, 
        "postID": 86, 
        "quote": "", 
        "reply": "You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:30:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "intTime": 20090315, 
        "postID": 87, 
        "quote": "Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap.", 
        "reply": " a pile in a pile", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:37:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile or perhaps a pile on top of a load sitting in the pool of crap.", 
        "intTime": 20090315, 
        "postID": 88, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "reply": " or perhaps a pile on top of a load sitting in the pool of crap.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:53:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile yepper, ol'Patooie blasted Bush about how outragous his 600B bailout was and then doesn't bat an eye at 2Trillion....... hmmmmm. Gotta love that woman. NOT!!! One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090315, 
        "postID": 89, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by I_M_Qwerty: quote: Originally posted by boazjones: The Republican Party is no longer viable. Ronald Reagan quadrupled the national debt from $700billion to $3trillion and produced the savings and loan crisis of the 80s - due to borrowing foreign money. Read your history - nothing has changed! That has something to do with this topic ... how? Looks to me like a red herring in a pool of crap. a pile in a pile", 
        "reply": " yepper, ol'Patooie blasted Bush about how outragous his 600B bailout was and then doesn't bat an eye at 2Trillion....... hmmmmm. Gotta love that woman. NOT!!! One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 18:55:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone? I'm going to tell you I'm conservative ... and that I'd be making the same argument if it was a Republican president. Now ... a consideration. Assuming you are on TriCare Prime and not yet 65, how would you feel about having Uncle's share of your TriCare Prime coverage added on to your taxable income? How do you think an active duty military family would feel about it? Tell me where you, I, or they are advantaged by Baucus' proposal ... or any other family that already has employer-subsidized health care? As to tax increases ... yeah ... I reject them on principle and will continue to do so until the federal government starts acting in a responsible manner with taxpayer money. Bush's TARP, Pelosi's stimulus bill, and the pork-laden Omnibus bill ... have me in opposition to any tax increase for anything. I've already seen a tax increase under Obama of $700+ this year ... not needing anymore from the man that promised that 95% of Americans would see a reduction or no change.", 
        "intTime": 20090315, 
        "postID": 90, 
        "quote": "Originally posted by mcgreer: You're going to tell me you aren't partisan? Oh, well... I'm guessing that, if we have a tax levied against us to pay for this, it will be minimal, but a progressive one. A consideration: If a person can't afford health care on their current salary, and they may be taxed an extra, let's say, $20 a month for them to have the opportunity to have access to basic, quality health care, does it make sense for them to reject a tax increase? Or, do you reject any tax increase on principle alone?", 
        "reply": " I'm going to tell you I'm conservative ... and that I'd be making the same argument if it was a Republican president. Now ... a consideration. Assuming you are on TriCare Prime and not yet 65, how would you feel about having Uncle's share of your TriCare Prime coverage added on to your taxable income? How do you think an active duty military family would feel about it? Tell me where you, I, or they are advantaged by Baucus' proposal ... or any other family that already has employer-subsidized health care? As to tax increases ... yeah ... I reject them on principle and will continue to do so until the federal government starts acting in a responsible manner with taxpayer money. Bush's TARP, Pelosi's stimulus bill, and the pork-laden Omnibus bill ... have me in opposition to any tax increase for anything. I've already seen a tax increase under Obama of $700+ this year ... not needing anymore from the man that promised that 95% of Americans would see a reduction or no change.", 
        "threadID": "409192893_2390009712001", 
        "time": "2009-03-15 19:23:00", 
        "title": "Another broken promise..another attack on the middle class..", 
        "userID": "I_M_Qwerty"
    }
]