[
    {
        "content": "Obama's misanthropic economic antics have already weakened the US dollar. The discussions of a \"world currency\" a sort of average value among the dollar, euro, pound, etc. is being pushed by the freedom-destroying collectivists of the one-world maypole dancers union. Betcha good ol' moneychanger and naturalized American Soros already has his (poorly regulated!) hedges placed to net a couple billion on the backs of hard-working Americans when the value of their dollars drops further, due to the currency collectivization. Whaddaya think?", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama's misanthropic economic antics have already weakened the US dollar. The discussions of a \"world currency\" a sort of average value among the dollar, euro, pound, etc. is being pushed by the freedom-destroying collectivists of the one-world maypole dancers union. Betcha good ol' moneychanger and naturalized American Soros already has his (poorly regulated!) hedges placed to net a couple billion on the backs of hard-working Americans when the value of their dollars drops further, due to the currency collectivization. Whaddaya think?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 16:11:00", 
        "title": "A World Currency", 
        "userID": "RRR52"
    }, 
    {
        "content": "Yes, Bush's policies weakened the dollar and increased our debt by vast sums. He was absolutely horrendous for our economic state. But, if these last two months are any indication, I would have to say that Obama is going to make Bush's economic shortcomings look like a tiny drop in the bucket. If you can give an example to the contrary, I am all ears.", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yes, Bush's policies weakened the dollar and increased our debt by vast sums. He was absolutely horrendous for our economic state. But, if these last two months are any indication, I would have to say that Obama is going to make Bush's economic shortcomings look like a tiny drop in the bucket. If you can give an example to the contrary, I am all ears.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 18:06:00", 
        "title": "A World Currency", 
        "userID": "10Tenths"
    }, 
    {
        "content": "World currency....LOL... The world can't even agree on how to feed hungry children, yet some believe they can all come together and accept a global currency?? The only way the NWO will happen is if the world effectively ends....The US becomes a third world dictatorship(A real one clowns) and life just plain sucks... We are no where near that, not even imaginable.", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "", 
        "reply": "World currency....LOL... The world can't even agree on how to feed hungry children, yet some believe they can all come together and accept a global currency?? The only way the NWO will happen is if the world effectively ends....The US becomes a third world dictatorship(A real one clowns) and life just plain sucks... We are no where near that, not even imaginable.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 18:21:00", 
        "title": "A World Currency", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. I agree that they do have a much better record on debt. My opinion on that is that government never, ever wants to stop expanding. And, it definitely doesn't want to get smaller. That is the basic flaw of government regardless of left or right ideologies. While Republicans like to cut taxes, they can never do so and keep a balanced check book due to this fact. Republican Congresses typically do spend far less (about half) than Democrats. But, their tax cuts far outweigh the slowdown in government growth. Democrat Congresses spend a lot of money and increase the size and scope of government. But, they work with the flow of the system. Instead of trying to slow down the growth, they create an equilibrium through the use of taxation. While this taxation doesn't always apply to everybody in the form of income (it usually goes disproportionately to the rich, much like Republican tax cuts), it does get everybody when Federal mandates roll down to the states who cannot keep up with current tide. A good example where we will see this in the near future (next 2-4 years) will be state unemployment. It is Federally mandated, state run (for the most part). The new mandates in accordance with the last stimulus bill will increase the size of UI programs on the state level. For two years that increase will be federally subsidized. But, in the future, employers will have to pay more taxes on UI to maintain the size of UI (remember, government never shrinks). This in turn will cause higher prices in service and goods. Or, in some cases, lower wages. Another good example of higher taxes on things other than income is inflation. Inflation is generally much higher in Democratically controlled Congresses due to the need to have more money in circulation to account for larger government. The general public is usually the last to get their hands on any new money, so while others higher up got to use the money while it was worth more, those of us in the general population get that money when it has depreciated in value. I would call that a tax. The economy will no doubt get back on its feet. But, the playing field has changed. We will be hamstringed with the cost of that stimulus. Artificial stimulus has never worked to fix the problem for the common people. It always is tilted more in the direction of helping special interests. And, it isn't a real market. It is the government trying to pick up the slack for the real market that doesn't want to spend. Look at the crash of 1920/1921 and look at what President Harding did. He did absolutely nothing to interfere with what the market wanted to do. Same goes for Reagan. They let the businesses fail and liquidate. Others stepped up to the plate to take the reins. They saw opportunity just as many smaller companies today would have saw great opportunities if the banks today failed. This stepping up to the plate fills the void and usually causes great growth as it did in both cases (1921 with the Roaring 20's and 1981 with the Reagan Revolution). Both of these points in time marked periods of some of the greatest growth in our history. And, as I have said, the thing that they both have in common is the allowing of failing companies to fail so that good companies can succeed. That is how a free market was designed and it does work. It is just that we instead listen to the people who are proven wrong the majority of the time.", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "Originally posted by dmuhler: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with.", 
        "reply": " I agree that they do have a much better record on debt. My opinion on that is that government never, ever wants to stop expanding. And, it definitely doesn't want to get smaller. That is the basic flaw of government regardless of left or right ideologies. While Republicans like to cut taxes, they can never do so and keep a balanced check book due to this fact. Republican Congresses typically do spend far less (about half) than Democrats. But, their tax cuts far outweigh the slowdown in government growth. Democrat Congresses spend a lot of money and increase the size and scope of government. But, they work with the flow of the system. Instead of trying to slow down the growth, they create an equilibrium through the use of taxation. While this taxation doesn't always apply to everybody in the form of income (it usually goes disproportionately to the rich, much like Republican tax cuts), it does get everybody when Federal mandates roll down to the states who cannot keep up with current tide. A good example where we will see this in the near future (next 2-4 years) will be state unemployment. It is Federally mandated, state run (for the most part). The new mandates in accordance with the last stimulus bill will increase the size of UI programs on the state level. For two years that increase will be federally subsidized. But, in the future, employers will have to pay more taxes on UI to maintain the size of UI (remember, government never shrinks). This in turn will cause higher prices in service and goods. Or, in some cases, lower wages. Another good example of higher taxes on things other than income is inflation. Inflation is generally much higher in Democratically controlled Congresses due to the need to have more money in circulation to account for larger government. The general public is usually the last to get their hands on any new money, so while others higher up got to use the money while it was worth more, those of us in the general population get that money when it has depreciated in value. I would call that a tax. The economy will no doubt get back on its feet. But, the playing field has changed. We will be hamstringed with the cost of that stimulus. Artificial stimulus has never worked to fix the problem for the common people. It always is tilted more in the direction of helping special interests. And, it isn't a real market. It is the government trying to pick up the slack for the real market that doesn't want to spend. Look at the crash of 1920/1921 and look at what President Harding did. He did absolutely nothing to interfere with what the market wanted to do. Same goes for Reagan. They let the businesses fail and liquidate. Others stepped up to the plate to take the reins. They saw opportunity just as many smaller companies today would have saw great opportunities if the banks today failed. This stepping up to the plate fills the void and usually causes great growth as it did in both cases (1921 with the Roaring 20's and 1981 with the Reagan Revolution). Both of these points in time marked periods of some of the greatest growth in our history. And, as I have said, the thing that they both have in common is the allowing of failing companies to fail so that good companies can succeed. That is how a free market was designed and it does work. It is just that we instead listen to the people who are proven wrong the majority of the time.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 18:31:00", 
        "title": "A World Currency", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: My opinion on that is that government never, ever wants to stop expanding. You guys act as if the government is alive. Fact is government grows because people want the services provided. Oh and entitlements like the budget busting medicare grow regardless of who is in charge. Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough.", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "Originally posted by dmuhler: quote: My opinion on that is that government never, ever wants to stop expanding. You guys act as if the government is alive. Fact is government grows because people want the services provided. Oh and entitlements like the budget busting medicare grow regardless of who is in charge.", 
        "reply": " Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 20:07:00", 
        "title": "A World Currency", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct?", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with.", 
        "reply": " This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:01:00", 
        "title": "A World Currency", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough. 10 is right, the flaw of gov't is that it wants to maintain the staus-quo, so therfore requires growth, to create its own ability to stay in power. And what makes the republicans \"hypocrites\" is that those that lead the party are actually liberals and medicare plan D is proof they are liberals. Americans trusted that since some were \"republicans\", that they were going to do republican things, well, those in power outsmarted those that vote. Never rely on lables or trust anyone seeking public trust.", 
        "intTime": 20090408, 
        "postID": 7, 
        "quote": "Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough.", 
        "reply": " 10 is right, the flaw of gov't is that it wants to maintain the staus-quo, so therfore requires growth, to create its own ability to stay in power. And what makes the republicans \"hypocrites\" is that those that lead the party are actually liberals and medicare plan D is proof they are liberals. Americans trusted that since some were \"republicans\", that they were going to do republican things, well, those in power outsmarted those that vote. Never rely on lables or trust anyone seeking public trust.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:08:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct? If Obama called for the death of the first born...somehow, this would be a good thing!", 
        "intTime": 20090408, 
        "postID": 8, 
        "quote": "Originally posted by ACR26: quote: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct?", 
        "reply": " If Obama called for the death of the first born...somehow, this would be a good thing!", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:10:00", 
        "title": "A World Currency", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: I see you have finally seen the light. Interesting that the top republican leaders from congress voted for this stinker and the \"liberals\" voted against it. Seen the light? I'm a John Bircher, we never trusted any of them, and knew they have perverted history to cover their tracks. Your going to be shocked when you figure out what we already know.", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "I see you have finally seen the light. Interesting that the top republican leaders from congress voted for this stinker and the \"liberals\" voted against it.", 
        "reply": " Seen the light? I'm a John Bircher, we never trusted any of them, and knew they have perverted history to cover their tracks. Your going to be shocked when you figure out what we already know.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:19:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it.", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama.", 
        "reply": " Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:02:00", 
        "title": "A World Currency", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: So the massive tax cuts to the rich were a good idea during war and natural calamity? What \"massive\" tax cut are you referring to? The drop from 39% to 36% for income tax? That's hardly \"massive\". Or are you referring to a drop in capital gains taxes? Oh, yeah, encouraging people to invest in businesses is just a terrible concept. We need to nip that s**t in the bud. Yeah, we need to teach those fatcats a lesson, and make them pay their \"fair\" share. Having the % of taxes paid by wealthy people steadily increasing while the tax burden on middle and low income payers steadily decreasing isn't \"fair\" enough. Let's soak 'em. Teach those rich ba****ds a lesson for saving money and investing or starting a small business or spending 8 years in school and getting a 6-figure job. We must stop the madness!", 
        "intTime": 20090408, 
        "postID": 11, 
        "quote": "Originally posted by dmuhler: So the massive tax cuts to the rich were a good idea during war and natural calamity?", 
        "reply": " What \"massive\" tax cut are you referring to? The drop from 39% to 36% for income tax? That's hardly \"massive\". Or are you referring to a drop in capital gains taxes? Oh, yeah, encouraging people to invest in businesses is just a terrible concept. We need to nip that s**t in the bud. Yeah, we need to teach those fatcats a lesson, and make them pay their \"fair\" share. Having the % of taxes paid by wealthy people steadily increasing while the tax burden on middle and low income payers steadily decreasing isn't \"fair\" enough. Let's soak 'em. Teach those rich ba****ds a lesson for saving money and investing or starting a small business or spending 8 years in school and getting a 6-figure job. We must stop the madness!", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:26:00", 
        "title": "A World Currency", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by jwr6: quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it. The buck has to stop somewhere. No see my question above and you may get an idea why I am blaming Bush. I read your quote. My guess is you're blaming Bush because blaming Clinton would look kind of silly, especially as Obama's White House is about 95% Clinton sycophants. And you're right, the buck DOES have to stop somewhere. Passing it back to Bush is no better than the Bush crowd blaming everything on Clinton. Obama is the President now. He gets to decide how much of our government should be funded by the Chinese now. The buck stops at his desk now.", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by jwr6: quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it. The buck has to stop somewhere. No see my question above and you may get an idea why I am blaming Bush.", 
        "reply": " I read your quote. My guess is you're blaming Bush because blaming Clinton would look kind of silly, especially as Obama's White House is about 95% Clinton sycophants. And you're right, the buck DOES have to stop somewhere. Passing it back to Bush is no better than the Bush crowd blaming everything on Clinton. Obama is the President now. He gets to decide how much of our government should be funded by the Chinese now. The buck stops at his desk now.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:32:00", 
        "title": "A World Currency", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Yes and that is why the president will raise taxes as soon as the recession ends. I would cut up the cards until we get our spending under control. Obama should pull that play out of Clinton's playbook. the point of the stimulus was to transfer our wealth into the hands of the elites. Are you pretending that everything is squared up now? We'll be paying for this for generations, hell, they'll just eliminate 3/4 of us, and the rest will serve them, it's not about money, but supreme, unchallenged power.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "Yes and that is why the president will raise taxes as soon as the recession ends. I would cut up the cards until we get our spending under control. Obama should pull that play out of Clinton's playbook.", 
        "reply": " the point of the stimulus was to transfer our wealth into the hands of the elites. Are you pretending that everything is squared up now? We'll be paying for this for generations, hell, they'll just eliminate 3/4 of us, and the rest will serve them, it's not about money, but supreme, unchallenged power.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:55:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You're getting as funny as the sailor!!! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090408, 
        "postID": 14, 
        "quote": "Originally posted by dmuhler:", 
        "reply": " You're getting as funny as the sailor!!! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:06:00", 
        "title": "A World Currency", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: I was talking about Bush, so the conspiracy stuff can wait for another thread. At what point does the transfer of wealth become a fact for you? Is it when katie couric says so?", 
        "intTime": 20090408, 
        "postID": 15, 
        "quote": "I was talking about Bush, so the conspiracy stuff can wait for another thread.", 
        "reply": " At what point does the transfer of wealth become a fact for you? Is it when katie couric says so?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:13:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies).", 
        "intTime": 20090408, 
        "postID": 16, 
        "quote": "Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama.", 
        "reply": " Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies).", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:21:00", 
        "title": "A World Currency", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies). So when the one world currency or a regional currency is introduced, do you back it? it will happen, that has been the plan for decades, all that was needed was the right crises.", 
        "intTime": 20090408, 
        "postID": 17, 
        "quote": "Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies).", 
        "reply": " So when the one world currency or a regional currency is introduced, do you back it? it will happen, that has been the plan for decades, all that was needed was the right crises.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:26:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point. It's like discussing the relative merits of unicorns and smurfs.", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "", 
        "reply": "What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point. It's like discussing the relative merits of unicorns and smurfs.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:30:00", 
        "title": "A World Currency", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point. yep, just as I figured, you're all for it. So, how do you justify laying down to the new world order? It's \"progression\" right? Modern man is smarter than our fore-fathers?", 
        "intTime": 20090408, 
        "postID": 19, 
        "quote": "What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point.", 
        "reply": " yep, just as I figured, you're all for it. So, how do you justify laying down to the new world order? It's \"progression\" right? Modern man is smarter than our fore-fathers?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 13:27:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Obama's misanthropic economic antics have already weakened the US dollar. The discussions of a \"world currency\" a sort of average value among the dollar, euro, pound, etc. is being pushed by the freedom-destroying collectivists of the one-world maypole dancers union. Betcha good ol' moneychanger and naturalized American Soros already has his (poorly regulated!) hedges placed to net a couple billion on the backs of hard-working Americans when the value of their dollars drops further, due to the currency collectivization. Whaddaya think?", 
        "intTime": 20090407, 
        "postID": 20, 
        "quote": "", 
        "reply": "Obama's misanthropic economic antics have already weakened the US dollar. The discussions of a \"world currency\" a sort of average value among the dollar, euro, pound, etc. is being pushed by the freedom-destroying collectivists of the one-world maypole dancers union. Betcha good ol' moneychanger and naturalized American Soros already has his (poorly regulated!) hedges placed to net a couple billion on the backs of hard-working Americans when the value of their dollars drops further, due to the currency collectivization. Whaddaya think?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 16:11:00", 
        "title": "A World Currency", 
        "userID": "RRR52"
    }, 
    {
        "content": "Yes, Bush's policies weakened the dollar and increased our debt by vast sums. He was absolutely horrendous for our economic state. But, if these last two months are any indication, I would have to say that Obama is going to make Bush's economic shortcomings look like a tiny drop in the bucket. If you can give an example to the contrary, I am all ears.", 
        "intTime": 20090407, 
        "postID": 21, 
        "quote": "", 
        "reply": "Yes, Bush's policies weakened the dollar and increased our debt by vast sums. He was absolutely horrendous for our economic state. But, if these last two months are any indication, I would have to say that Obama is going to make Bush's economic shortcomings look like a tiny drop in the bucket. If you can give an example to the contrary, I am all ears.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 18:06:00", 
        "title": "A World Currency", 
        "userID": "10Tenths"
    }, 
    {
        "content": "World currency....LOL... The world can't even agree on how to feed hungry children, yet some believe they can all come together and accept a global currency?? The only way the NWO will happen is if the world effectively ends....The US becomes a third world dictatorship(A real one clowns) and life just plain sucks... We are no where near that, not even imaginable.", 
        "intTime": 20090407, 
        "postID": 22, 
        "quote": "", 
        "reply": "World currency....LOL... The world can't even agree on how to feed hungry children, yet some believe they can all come together and accept a global currency?? The only way the NWO will happen is if the world effectively ends....The US becomes a third world dictatorship(A real one clowns) and life just plain sucks... We are no where near that, not even imaginable.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 18:21:00", 
        "title": "A World Currency", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. I agree that they do have a much better record on debt. My opinion on that is that government never, ever wants to stop expanding. And, it definitely doesn't want to get smaller. That is the basic flaw of government regardless of left or right ideologies. While Republicans like to cut taxes, they can never do so and keep a balanced check book due to this fact. Republican Congresses typically do spend far less (about half) than Democrats. But, their tax cuts far outweigh the slowdown in government growth. Democrat Congresses spend a lot of money and increase the size and scope of government. But, they work with the flow of the system. Instead of trying to slow down the growth, they create an equilibrium through the use of taxation. While this taxation doesn't always apply to everybody in the form of income (it usually goes disproportionately to the rich, much like Republican tax cuts), it does get everybody when Federal mandates roll down to the states who cannot keep up with current tide. A good example where we will see this in the near future (next 2-4 years) will be state unemployment. It is Federally mandated, state run (for the most part). The new mandates in accordance with the last stimulus bill will increase the size of UI programs on the state level. For two years that increase will be federally subsidized. But, in the future, employers will have to pay more taxes on UI to maintain the size of UI (remember, government never shrinks). This in turn will cause higher prices in service and goods. Or, in some cases, lower wages. Another good example of higher taxes on things other than income is inflation. Inflation is generally much higher in Democratically controlled Congresses due to the need to have more money in circulation to account for larger government. The general public is usually the last to get their hands on any new money, so while others higher up got to use the money while it was worth more, those of us in the general population get that money when it has depreciated in value. I would call that a tax. The economy will no doubt get back on its feet. But, the playing field has changed. We will be hamstringed with the cost of that stimulus. Artificial stimulus has never worked to fix the problem for the common people. It always is tilted more in the direction of helping special interests. And, it isn't a real market. It is the government trying to pick up the slack for the real market that doesn't want to spend. Look at the crash of 1920/1921 and look at what President Harding did. He did absolutely nothing to interfere with what the market wanted to do. Same goes for Reagan. They let the businesses fail and liquidate. Others stepped up to the plate to take the reins. They saw opportunity just as many smaller companies today would have saw great opportunities if the banks today failed. This stepping up to the plate fills the void and usually causes great growth as it did in both cases (1921 with the Roaring 20's and 1981 with the Reagan Revolution). Both of these points in time marked periods of some of the greatest growth in our history. And, as I have said, the thing that they both have in common is the allowing of failing companies to fail so that good companies can succeed. That is how a free market was designed and it does work. It is just that we instead listen to the people who are proven wrong the majority of the time.", 
        "intTime": 20090407, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with.", 
        "reply": " I agree that they do have a much better record on debt. My opinion on that is that government never, ever wants to stop expanding. And, it definitely doesn't want to get smaller. That is the basic flaw of government regardless of left or right ideologies. While Republicans like to cut taxes, they can never do so and keep a balanced check book due to this fact. Republican Congresses typically do spend far less (about half) than Democrats. But, their tax cuts far outweigh the slowdown in government growth. Democrat Congresses spend a lot of money and increase the size and scope of government. But, they work with the flow of the system. Instead of trying to slow down the growth, they create an equilibrium through the use of taxation. While this taxation doesn't always apply to everybody in the form of income (it usually goes disproportionately to the rich, much like Republican tax cuts), it does get everybody when Federal mandates roll down to the states who cannot keep up with current tide. A good example where we will see this in the near future (next 2-4 years) will be state unemployment. It is Federally mandated, state run (for the most part). The new mandates in accordance with the last stimulus bill will increase the size of UI programs on the state level. For two years that increase will be federally subsidized. But, in the future, employers will have to pay more taxes on UI to maintain the size of UI (remember, government never shrinks). This in turn will cause higher prices in service and goods. Or, in some cases, lower wages. Another good example of higher taxes on things other than income is inflation. Inflation is generally much higher in Democratically controlled Congresses due to the need to have more money in circulation to account for larger government. The general public is usually the last to get their hands on any new money, so while others higher up got to use the money while it was worth more, those of us in the general population get that money when it has depreciated in value. I would call that a tax. The economy will no doubt get back on its feet. But, the playing field has changed. We will be hamstringed with the cost of that stimulus. Artificial stimulus has never worked to fix the problem for the common people. It always is tilted more in the direction of helping special interests. And, it isn't a real market. It is the government trying to pick up the slack for the real market that doesn't want to spend. Look at the crash of 1920/1921 and look at what President Harding did. He did absolutely nothing to interfere with what the market wanted to do. Same goes for Reagan. They let the businesses fail and liquidate. Others stepped up to the plate to take the reins. They saw opportunity just as many smaller companies today would have saw great opportunities if the banks today failed. This stepping up to the plate fills the void and usually causes great growth as it did in both cases (1921 with the Roaring 20's and 1981 with the Reagan Revolution). Both of these points in time marked periods of some of the greatest growth in our history. And, as I have said, the thing that they both have in common is the allowing of failing companies to fail so that good companies can succeed. That is how a free market was designed and it does work. It is just that we instead listen to the people who are proven wrong the majority of the time.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 18:31:00", 
        "title": "A World Currency", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: My opinion on that is that government never, ever wants to stop expanding. You guys act as if the government is alive. Fact is government grows because people want the services provided. Oh and entitlements like the budget busting medicare grow regardless of who is in charge. Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough.", 
        "intTime": 20090407, 
        "postID": 24, 
        "quote": "Originally posted by dmuhler: quote: My opinion on that is that government never, ever wants to stop expanding. You guys act as if the government is alive. Fact is government grows because people want the services provided. Oh and entitlements like the budget busting medicare grow regardless of who is in charge.", 
        "reply": " Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-07 20:07:00", 
        "title": "A World Currency", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct?", 
        "intTime": 20090408, 
        "postID": 25, 
        "quote": "You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with.", 
        "reply": " This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:01:00", 
        "title": "A World Currency", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough. 10 is right, the flaw of gov't is that it wants to maintain the staus-quo, so therfore requires growth, to create its own ability to stay in power. And what makes the republicans \"hypocrites\" is that those that lead the party are actually liberals and medicare plan D is proof they are liberals. Americans trusted that since some were \"republicans\", that they were going to do republican things, well, those in power outsmarted those that vote. Never rely on lables or trust anyone seeking public trust.", 
        "intTime": 20090408, 
        "postID": 26, 
        "quote": "Are republicans born hypocrites? geez, sometimes I truly wonder... Medicare part D....cough...cough.", 
        "reply": " 10 is right, the flaw of gov't is that it wants to maintain the staus-quo, so therfore requires growth, to create its own ability to stay in power. And what makes the republicans \"hypocrites\" is that those that lead the party are actually liberals and medicare plan D is proof they are liberals. Americans trusted that since some were \"republicans\", that they were going to do republican things, well, those in power outsmarted those that vote. Never rely on lables or trust anyone seeking public trust.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:08:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct? If Obama called for the death of the first born...somehow, this would be a good thing!", 
        "intTime": 20090408, 
        "postID": 27, 
        "quote": "Originally posted by ACR26: quote: You could hardly blame Obama for the stimulus money. It is certainly worth the risk. Once the economy gets back on its feet, revenues will return and therefore bring down expected deficits. Further, the democrats have had a better record on debt....at least they do over the last 40 years or so. I will give Obama an opportunity to deal with the real issue (medicare) that will blow all records so if not dealt with. This sort of reads...\"Pres Bush does it = Bad, Pres Obama does it = good\" Is my opinion correct?", 
        "reply": " If Obama called for the death of the first born...somehow, this would be a good thing!", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:10:00", 
        "title": "A World Currency", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: I see you have finally seen the light. Interesting that the top republican leaders from congress voted for this stinker and the \"liberals\" voted against it. Seen the light? I'm a John Bircher, we never trusted any of them, and knew they have perverted history to cover their tracks. Your going to be shocked when you figure out what we already know.", 
        "intTime": 20090408, 
        "postID": 28, 
        "quote": "I see you have finally seen the light. Interesting that the top republican leaders from congress voted for this stinker and the \"liberals\" voted against it.", 
        "reply": " Seen the light? I'm a John Bircher, we never trusted any of them, and knew they have perverted history to cover their tracks. Your going to be shocked when you figure out what we already know.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 08:19:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it.", 
        "intTime": 20090408, 
        "postID": 29, 
        "quote": "Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama.", 
        "reply": " Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:02:00", 
        "title": "A World Currency", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: So the massive tax cuts to the rich were a good idea during war and natural calamity? What \"massive\" tax cut are you referring to? The drop from 39% to 36% for income tax? That's hardly \"massive\". Or are you referring to a drop in capital gains taxes? Oh, yeah, encouraging people to invest in businesses is just a terrible concept. We need to nip that s**t in the bud. Yeah, we need to teach those fatcats a lesson, and make them pay their \"fair\" share. Having the % of taxes paid by wealthy people steadily increasing while the tax burden on middle and low income payers steadily decreasing isn't \"fair\" enough. Let's soak 'em. Teach those rich ba****ds a lesson for saving money and investing or starting a small business or spending 8 years in school and getting a 6-figure job. We must stop the madness!", 
        "intTime": 20090408, 
        "postID": 30, 
        "quote": "Originally posted by dmuhler: So the massive tax cuts to the rich were a good idea during war and natural calamity?", 
        "reply": " What \"massive\" tax cut are you referring to? The drop from 39% to 36% for income tax? That's hardly \"massive\". Or are you referring to a drop in capital gains taxes? Oh, yeah, encouraging people to invest in businesses is just a terrible concept. We need to nip that s**t in the bud. Yeah, we need to teach those fatcats a lesson, and make them pay their \"fair\" share. Having the % of taxes paid by wealthy people steadily increasing while the tax burden on middle and low income payers steadily decreasing isn't \"fair\" enough. Let's soak 'em. Teach those rich ba****ds a lesson for saving money and investing or starting a small business or spending 8 years in school and getting a 6-figure job. We must stop the madness!", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:26:00", 
        "title": "A World Currency", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Originally posted by jwr6: quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it. The buck has to stop somewhere. No see my question above and you may get an idea why I am blaming Bush. I read your quote. My guess is you're blaming Bush because blaming Clinton would look kind of silly, especially as Obama's White House is about 95% Clinton sycophants. And you're right, the buck DOES have to stop somewhere. Passing it back to Bush is no better than the Bush crowd blaming everything on Clinton. Obama is the President now. He gets to decide how much of our government should be funded by the Chinese now. The buck stops at his desk now.", 
        "intTime": 20090408, 
        "postID": 31, 
        "quote": "Originally posted by dmuhler: quote: Originally posted by jwr6: quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, it's all Bush's or Obama's fault...borrowing money from China to run your government has nothing to do with it. The buck has to stop somewhere. No see my question above and you may get an idea why I am blaming Bush.", 
        "reply": " I read your quote. My guess is you're blaming Bush because blaming Clinton would look kind of silly, especially as Obama's White House is about 95% Clinton sycophants. And you're right, the buck DOES have to stop somewhere. Passing it back to Bush is no better than the Bush crowd blaming everything on Clinton. Obama is the President now. He gets to decide how much of our government should be funded by the Chinese now. The buck stops at his desk now.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:32:00", 
        "title": "A World Currency", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Yes and that is why the president will raise taxes as soon as the recession ends. I would cut up the cards until we get our spending under control. Obama should pull that play out of Clinton's playbook. the point of the stimulus was to transfer our wealth into the hands of the elites. Are you pretending that everything is squared up now? We'll be paying for this for generations, hell, they'll just eliminate 3/4 of us, and the rest will serve them, it's not about money, but supreme, unchallenged power.", 
        "intTime": 20090408, 
        "postID": 32, 
        "quote": "Yes and that is why the president will raise taxes as soon as the recession ends. I would cut up the cards until we get our spending under control. Obama should pull that play out of Clinton's playbook.", 
        "reply": " the point of the stimulus was to transfer our wealth into the hands of the elites. Are you pretending that everything is squared up now? We'll be paying for this for generations, hell, they'll just eliminate 3/4 of us, and the rest will serve them, it's not about money, but supreme, unchallenged power.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 10:55:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: You're getting as funny as the sailor!!! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "intTime": 20090408, 
        "postID": 33, 
        "quote": "Originally posted by dmuhler:", 
        "reply": " You're getting as funny as the sailor!!! \"Some people spend an entire lifetime wondering if they made a difference. The Marines dont have that problem.\" Pres. Reagan, 1985.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:06:00", 
        "title": "A World Currency", 
        "userID": "Drmwvr"
    }, 
    {
        "content": "quote: I was talking about Bush, so the conspiracy stuff can wait for another thread. At what point does the transfer of wealth become a fact for you? Is it when katie couric says so?", 
        "intTime": 20090408, 
        "postID": 34, 
        "quote": "I was talking about Bush, so the conspiracy stuff can wait for another thread.", 
        "reply": " At what point does the transfer of wealth become a fact for you? Is it when katie couric says so?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:13:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama. Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies).", 
        "intTime": 20090408, 
        "postID": 35, 
        "quote": "Originally posted by dmuhler: quote: Obama's misanthropic economic antics have already weakened the US dollar. If the dollar was weakened it was by the unsustainable policies of the Bush administration, not by the two months of Obama.", 
        "reply": " Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies).", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:21:00", 
        "title": "A World Currency", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies). So when the one world currency or a regional currency is introduced, do you back it? it will happen, that has been the plan for decades, all that was needed was the right crises.", 
        "intTime": 20090408, 
        "postID": 36, 
        "quote": "Yeah, not sure how someone could possibly argue that Obama weakened the dollar (while leaving out the effect of Bush's policies).", 
        "reply": " So when the one world currency or a regional currency is introduced, do you back it? it will happen, that has been the plan for decades, all that was needed was the right crises.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:26:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }, 
    {
        "content": "What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point. It's like discussing the relative merits of unicorns and smurfs.", 
        "intTime": 20090408, 
        "postID": 37, 
        "quote": "", 
        "reply": "What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point. It's like discussing the relative merits of unicorns and smurfs.", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 11:30:00", 
        "title": "A World Currency", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point. yep, just as I figured, you're all for it. So, how do you justify laying down to the new world order? It's \"progression\" right? Modern man is smarter than our fore-fathers?", 
        "intTime": 20090408, 
        "postID": 38, 
        "quote": "What? You'd need to have a strong world government first. I'm not getting into this discussion, there's no point.", 
        "reply": " yep, just as I figured, you're all for it. So, how do you justify laying down to the new world order? It's \"progression\" right? Modern man is smarter than our fore-fathers?", 
        "threadID": "409192893_3760001022001", 
        "time": "2009-04-08 13:27:00", 
        "title": "A World Currency", 
        "userID": "soscorpio"
    }
]