[
    {
        "content": "Poor guys were tortured with a caterpillar and slap in the face. The President Ties His Own Hands on Terror The point of interrogation is intelligence, not confession. By MICHAEL HAYDEN and MICHAEL B. MUKASEY 'http://online.wsj.com/article/SB123993446103128041.html' The Obama administration has declassified and released opinions of the Justice Department's Office of Legal Counsel (OLC) given in 2005 and earlier that analyze the legality of interrogation techniques authorized for use by the CIA. Those techniques were applied only when expressly permitted by the director, and are described in these opinions in detail, along with their limits and the safeguards applied to them. [Commentary] AP <edit> The release of these opinions was unnecessary as a legal matter, and is unsound as a matter of policy. Its effect will be to invite the kind of institutional timidity and fear of recrimination that weakened intelligence gathering in the past, and that we came sorely to regret on Sept. 11, 2001. Proponents of the release have argued that the techniques have been abandoned and thus there is no point in keeping them secret any longer; that they were in any event ineffective; that their disclosure was somehow legally compelled; and that they cost us more in the coin of world opinion than they were worth. None of these claims survives scrutiny. Soon after he was sworn in, President Barack Obama signed an executive order that suspended use of these techniques and confined not only the military but all U.S. agencies -- including the CIA -- to the interrogation limits set in the Army Field Manual. This suspension was accompanied by a commitment to further study the interrogation program, and government personnel were cautioned that they could no longer rely on earlier opinions of the OLC. Although evidence shows that the Army Field Manual, which is available online, is already used by al Qaeda for training purposes, it was certainly the president's right to suspend use of any technique. However, public disclosure of the OLC opinions, and thus of the techniques themselves, assures that terrorists are now aware of the absolute limit of what the U.S. government could do to extract information from them, and can supplement their training accordingly and thus diminish the effectiveness of these techniques as they have the ones in the Army Field Manual. Moreover, disclosure of the details of the program pre-empts the study of the president's task force and assures that the suspension imposed by the president's executive order is effectively permanent. There would be little point in the president authorizing measures whose nature and precise limits have already been disclosed in detail to those whose resolve we hope to overcome. This conflicts with the sworn promise of the current director of the CIA, Leon Panetta, who testified in aid of securing Senate confirmation that if he thought he needed additional authority to conduct interrogation to get necessary information, he would seek it from the president. By allowing this disclosure, President Obama has tied not only his own hands but also the hands of any future administration faced with the prospect of attack. Disclosure of the techniques is likely to be met by faux outrage, and is perfectly packaged for media consumption. It will also incur the utter contempt of our enemies. Somehow, it seems unlikely that the people who beheaded Nicholas Berg and Daniel Pearl, and have tortured and slain other American captives, are likely to be shamed into giving up violence by the news that the U.S. will no longer interrupt the sleep cycle of captured terrorists even to help elicit intelligence that could save the lives of its citizens. Which brings us to the next of the justifications for disclosing and thus abandoning these measures: that they don't work anyway, and that those who are subjected to them will simply make up information in order to end their ordeal. This ignorant view of how interrogations are conducted is belied by both experience and common sense. If coercive interrogation had been administered to obtain confessions, one might understand the argument. Khalid Sheikh Mohammed (KSM), who organized the Sept. 11, 2001 attacks, among others, and who has boasted of having beheaded Daniel Pearl, could eventually have felt pressed to provide a false confession. But confessions aren't the point. Intelligence is. Interrogation is conducted by using such obvious approaches as asking questions whose correct answers are already known and only when truthful information is provided proceeding to what may not be known. Moreover, intelligence can be verified, correlated and used to get information from other detainees, and has been; none of this information is used in isolation. The terrorist Abu Zubaydah (sometimes derided as a low-level operative of questionable reliability, but who was in fact close to KSM and other senior al Qaeda leaders) disclosed some information voluntarily. But he was coerced into disclosing information that led to the capture of Ramzi bin al Shibh, another of the planners of Sept. 11, who in turn disclosed information which -- when combined with what was learned from Abu Zubaydah -- helped lead to the capture of KSM and other senior terrorists, and the disruption of follow-on plots aimed at both Europe and the U.S. Details of these successes, and the methods used to obtain them, were disclosed repeatedly in more than 30 congressional briefings and hearings beginning in 2002, and open to all members of the Intelligence Committees of both Houses of Congress beginning in September 2006. Any protestation of ignorance of those details, particularly by members of those committees, is pretense. The techniques themselves were used selectively against only a small number of hard-core prisoners who successfully resisted other forms of interrogation, and then only with the explicit authorization of the director of the CIA. Of the thousands of unlawful combatants captured by the U.S., fewer than 100 were detained and questioned in the CIA program. Of those, fewer than one-third were subjected to any of the techniques discussed in these opinions. As already disclosed by Director Hayden, as late as 2006, even with the growing success of other intelligence tools, fully half of the government's knowledge about the structure and activities of al Qaeda came from those interrogations. Nor was there any legal reason compelling such disclosure. To be sure, the American Civil Liberties Union has sued under the Freedom of Information Act to obtain copies of these and other memoranda, but the government until now has successfully resisted such lawsuits. Even when the government disclosed that three members of al Qaeda had been subjected to waterboarding but that the technique was no longer part of the CIA interrogation program, the court sustained the government's argument that the precise details of how it was done, including limits and safeguards, could remain classified against the possibility that some future president may authorize its use. Therefore, notwithstanding the suggestion that disclosure was somehow legally compelled, there was no legal impediment to the Justice Department making the same argument even with respect to any techniques that remained in the CIA program until last January. There is something of the self-fulfilling prophecy in the claim that our interrogation of some unlawful combatants beyond the limits set in the Army Field Manual has disgraced us before the world. Such a claim often conflates interrogation with the sadism engaged in by some soldiers at Abu Ghraib, an incident that had nothing whatever to do with intelligence gathering. The limits of the Army Field Manual are entirely appropriate for young soldiers, for the conditions in which they operate, for the detainees they routinely question, and for the kinds of tactically relevant information they pursue. Those limits are not appropriate, however, for more experienced people in controlled circumstances with high-value detainees. Indeed, the Army Field Manual was created with awareness that there was an alternative protocol for high-value detainees. In addition, there were those who believed that the U.S. deserved what it got on Sept. 11, 2001. Such people, and many who purport to speak for world opinion, were resourceful both before and after the Sept. 11 attacks in crafting reasons to resent America's role as a superpower. Recall also that the first World Trade Center bombing in 1993, the attacks on our embassies in Kenya and Tanzania, the punctiliously correct trials of defendants in connection with those incidents, and the bombing of the USS Cole took place long before the advent of CIA interrogations, the invasion of Saddam Hussein's Iraq, or the many other purported grievances asserted over the past eight years. The effect of this disclosure on the morale and effectiveness of many in the intelligence community is not hard to predict. Those charged with the responsibility of gathering potentially lifesaving information from unwilling captives are now told essentially that any legal opinion they get as to the lawfulness of their activity is only as durable as political fashion permits. Even with a seemingly binding opinion in hand, which future CIA operations personnel would take the risk? There would be no wink, no nod, no handshake that would convince them that legal guidance is durable. Any president who wants to apply such techniques without such a binding and durable legal opinion had better be prepared to apply them himself. Beyond that, anyone in government who seeks an opinion from the OLC as to the propriety of any action, or who authors an opinion for the OLC, is on notice henceforth that such a request for advice, and the advice itself, is now more likely than before to be subject after the fact to public and partisan criticism. It is hard to see how that will promote candor either from those who should be encouraged to ask for advice before they act, or from those who must give it. In his book \"The Terror Presidency,\" Jack Goldsmith describes the phenomenon we are now experiencing, and its inevitable effect, referring to what he calls \"cycles of timidity and aggression\" that have weakened intelligence gathering in the past. Politicians pressure the intelligence community to push to the legal limit, and then cast accusations when aggressiveness goes out of style, thereby encouraging risk aversion, and then, as occurred in the wake of 9/11, criticizing the intelligence community for feckless timidity. He calls these cycles \"a terrible problem for our national security.\" Indeed they are, and the precipitous release of these OLC opinions simply makes the problem worse. <edit>", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "Poor guys were tortured with a caterpillar and slap in the face. The President Ties His Own Hands on Terror The point of interrogation is intelligence, not confession. By MICHAEL HAYDEN and MICHAEL B. MUKASEY 'http://online.wsj.com/article/SB123993446103128041.html' The Obama administration has declassified and released opinions of the Justice Department's Office of Legal Counsel (OLC) given in 2005 and earlier that analyze the legality of interrogation techniques authorized for use by the CIA. Those techniques were applied only when expressly permitted by the director, and are described in these opinions in detail, along with their limits and the safeguards applied to them. [Commentary] AP <edit> The release of these opinions was unnecessary as a legal matter, and is unsound as a matter of policy. Its effect will be to invite the kind of institutional timidity and fear of recrimination that weakened intelligence gathering in the past, and that we came sorely to regret on Sept. 11, 2001. Proponents of the release have argued that the techniques have been abandoned and thus there is no point in keeping them secret any longer; that they were in any event ineffective; that their disclosure was somehow legally compelled; and that they cost us more in the coin of world opinion than they were worth. None of these claims survives scrutiny. Soon after he was sworn in, President Barack Obama signed an executive order that suspended use of these techniques and confined not only the military but all U.S. agencies -- including the CIA -- to the interrogation limits set in the Army Field Manual. This suspension was accompanied by a commitment to further study the interrogation program, and government personnel were cautioned that they could no longer rely on earlier opinions of the OLC. Although evidence shows that the Army Field Manual, which is available online, is already used by al Qaeda for training purposes, it was certainly the president's right to suspend use of any technique. However, public disclosure of the OLC opinions, and thus of the techniques themselves, assures that terrorists are now aware of the absolute limit of what the U.S. government could do to extract information from them, and can supplement their training accordingly and thus diminish the effectiveness of these techniques as they have the ones in the Army Field Manual. Moreover, disclosure of the details of the program pre-empts the study of the president's task force and assures that the suspension imposed by the president's executive order is effectively permanent. There would be little point in the president authorizing measures whose nature and precise limits have already been disclosed in detail to those whose resolve we hope to overcome. This conflicts with the sworn promise of the current director of the CIA, Leon Panetta, who testified in aid of securing Senate confirmation that if he thought he needed additional authority to conduct interrogation to get necessary information, he would seek it from the president. By allowing this disclosure, President Obama has tied not only his own hands but also the hands of any future administration faced with the prospect of attack. Disclosure of the techniques is likely to be met by faux outrage, and is perfectly packaged for media consumption. It will also incur the utter contempt of our enemies. Somehow, it seems unlikely that the people who beheaded Nicholas Berg and Daniel Pearl, and have tortured and slain other American captives, are likely to be shamed into giving up violence by the news that the U.S. will no longer interrupt the sleep cycle of captured terrorists even to help elicit intelligence that could save the lives of its citizens. Which brings us to the next of the justifications for disclosing and thus abandoning these measures: that they don't work anyway, and that those who are subjected to them will simply make up information in order to end their ordeal. This ignorant view of how interrogations are conducted is belied by both experience and common sense. If coercive interrogation had been administered to obtain confessions, one might understand the argument. Khalid Sheikh Mohammed (KSM), who organized the Sept. 11, 2001 attacks, among others, and who has boasted of having beheaded Daniel Pearl, could eventually have felt pressed to provide a false confession. But confessions aren't the point. Intelligence is. Interrogation is conducted by using such obvious approaches as asking questions whose correct answers are already known and only when truthful information is provided proceeding to what may not be known. Moreover, intelligence can be verified, correlated and used to get information from other detainees, and has been; none of this information is used in isolation. The terrorist Abu Zubaydah (sometimes derided as a low-level operative of questionable reliability, but who was in fact close to KSM and other senior al Qaeda leaders) disclosed some information voluntarily. But he was coerced into disclosing information that led to the capture of Ramzi bin al Shibh, another of the planners of Sept. 11, who in turn disclosed information which -- when combined with what was learned from Abu Zubaydah -- helped lead to the capture of KSM and other senior terrorists, and the disruption of follow-on plots aimed at both Europe and the U.S. Details of these successes, and the methods used to obtain them, were disclosed repeatedly in more than 30 congressional briefings and hearings beginning in 2002, and open to all members of the Intelligence Committees of both Houses of Congress beginning in September 2006. Any protestation of ignorance of those details, particularly by members of those committees, is pretense. The techniques themselves were used selectively against only a small number of hard-core prisoners who successfully resisted other forms of interrogation, and then only with the explicit authorization of the director of the CIA. Of the thousands of unlawful combatants captured by the U.S., fewer than 100 were detained and questioned in the CIA program. Of those, fewer than one-third were subjected to any of the techniques discussed in these opinions. As already disclosed by Director Hayden, as late as 2006, even with the growing success of other intelligence tools, fully half of the government's knowledge about the structure and activities of al Qaeda came from those interrogations. Nor was there any legal reason compelling such disclosure. To be sure, the American Civil Liberties Union has sued under the Freedom of Information Act to obtain copies of these and other memoranda, but the government until now has successfully resisted such lawsuits. Even when the government disclosed that three members of al Qaeda had been subjected to waterboarding but that the technique was no longer part of the CIA interrogation program, the court sustained the government's argument that the precise details of how it was done, including limits and safeguards, could remain classified against the possibility that some future president may authorize its use. Therefore, notwithstanding the suggestion that disclosure was somehow legally compelled, there was no legal impediment to the Justice Department making the same argument even with respect to any techniques that remained in the CIA program until last January. There is something of the self-fulfilling prophecy in the claim that our interrogation of some unlawful combatants beyond the limits set in the Army Field Manual has disgraced us before the world. Such a claim often conflates interrogation with the sadism engaged in by some soldiers at Abu Ghraib, an incident that had nothing whatever to do with intelligence gathering. The limits of the Army Field Manual are entirely appropriate for young soldiers, for the conditions in which they operate, for the detainees they routinely question, and for the kinds of tactically relevant information they pursue. Those limits are not appropriate, however, for more experienced people in controlled circumstances with high-value detainees. Indeed, the Army Field Manual was created with awareness that there was an alternative protocol for high-value detainees. In addition, there were those who believed that the U.S. deserved what it got on Sept. 11, 2001. Such people, and many who purport to speak for world opinion, were resourceful both before and after the Sept. 11 attacks in crafting reasons to resent America's role as a superpower. Recall also that the first World Trade Center bombing in 1993, the attacks on our embassies in Kenya and Tanzania, the punctiliously correct trials of defendants in connection with those incidents, and the bombing of the USS Cole took place long before the advent of CIA interrogations, the invasion of Saddam Hussein's Iraq, or the many other purported grievances asserted over the past eight years. The effect of this disclosure on the morale and effectiveness of many in the intelligence community is not hard to predict. Those charged with the responsibility of gathering potentially lifesaving information from unwilling captives are now told essentially that any legal opinion they get as to the lawfulness of their activity is only as durable as political fashion permits. Even with a seemingly binding opinion in hand, which future CIA operations personnel would take the risk? There would be no wink, no nod, no handshake that would convince them that legal guidance is durable. Any president who wants to apply such techniques without such a binding and durable legal opinion had better be prepared to apply them himself. Beyond that, anyone in government who seeks an opinion from the OLC as to the propriety of any action, or who authors an opinion for the OLC, is on notice henceforth that such a request for advice, and the advice itself, is now more likely than before to be subject after the fact to public and partisan criticism. It is hard to see how that will promote candor either from those who should be encouraged to ask for advice before they act, or from those who must give it. In his book \"The Terror Presidency,\" Jack Goldsmith describes the phenomenon we are now experiencing, and its inevitable effect, referring to what he calls \"cycles of timidity and aggression\" that have weakened intelligence gathering in the past. Politicians pressure the intelligence community to push to the legal limit, and then cast accusations when aggressiveness goes out of style, thereby encouraging risk aversion, and then, as occurred in the wake of 9/11, criticizing the intelligence community for feckless timidity. He calls these cycles \"a terrible problem for our national security.\" Indeed they are, and the precipitous release of these OLC opinions simply makes the problem worse. <edit>", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 10:24:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "In other words...we are F'd. I remember a dem-congressman (as he was politicaly \"outraged\")saying something along the lines when presented with the argument what if nukes are involved that \"Well, we expect our agents to have the intellegence to know that in that case it would be ok and the government would back them.\" I read...we will hang your azzes if you are wrong. Just one more example of what you get when the admin is filled with individuals who are clueless. The Russians are probably jealous that this admin was 28 years too late", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "", 
        "reply": "In other words...we are F'd. I remember a dem-congressman (as he was politicaly \"outraged\")saying something along the lines when presented with the argument what if nukes are involved that \"Well, we expect our agents to have the intellegence to know that in that case it would be ok and the government would back them.\" I read...we will hang your azzes if you are wrong. Just one more example of what you get when the admin is filled with individuals who are clueless. The Russians are probably jealous that this admin was 28 years too late", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 13:57:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "ACR26"
    }, 
    {
        "content": "The Horror . . . The Horror . . . I can just imagine how reassured our CIA Operatives are now feeling when the Attorney General Eric Holder stated that his office would provide legal counsel to any Operative sued... Doubly reassuring that their names, of the CIA Operatives, are available so that legal action can be levied against them... WHAT A COUNTRY ! ! !", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "The Horror . . . The Horror . . . I can just imagine how reassured our CIA Operatives are now feeling when the Attorney General Eric Holder stated that his office would provide legal counsel to any Operative sued... Doubly reassuring that their names, of the CIA Operatives, are available so that legal action can be levied against them... WHAT A COUNTRY ! ! !", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 14:13:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "My Boy Scout initation was more severe. MY GOD! Abug might have been put on a TERRORIST! How will we EVER regain out international respect!", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "", 
        "reply": "My Boy Scout initation was more severe. MY GOD! Abug might have been put on a TERRORIST! How will we EVER regain out international respect!", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 15:29:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Maybe you should try adding pictures and popups gunny to help out the other side. Too many words for em I guess.", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "", 
        "reply": "Maybe you should try adding pictures and popups gunny to help out the other side. Too many words for em I guess.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 21:40:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. You don't find that alarming there, dm? I'm telling you, you really need to lay off the koolaid, bro... JMHO, I could be wrong...", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " You don't find that alarming there, dm? I'm telling you, you really need to lay off the koolaid, bro... JMHO, I could be wrong...", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 21:50:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. The losers are Americans. That would mean you too, Davey. You don't even want to think about what this will do to us all. I know you love him and you will always feel the need to block out reality in order to hold on to that feeling. It's sad really...because in the end, you will inevitably be forced to see the truth. Too bad, becuase knowing how stubborn you are, it will probably be too late.", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " The losers are Americans. That would mean you too, Davey. You don't even want to think about what this will do to us all. I know you love him and you will always feel the need to block out reality in order to hold on to that feeling. It's sad really...because in the end, you will inevitably be forced to see the truth. Too bad, becuase knowing how stubborn you are, it will probably be too late.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 22:20:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology", 
        "intTime": 20090418, 
        "postID": 8, 
        "quote": "", 
        "reply": "yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 15:28:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "liberal90"
    }, 
    {
        "content": "Maybe by not prosecuting the actual agents he's setting them up to testify against their bosses. They could easily be granted immunity when the time is ripe.", 
        "intTime": 20090418, 
        "postID": 9, 
        "quote": "", 
        "reply": "Maybe by not prosecuting the actual agents he's setting them up to testify against their bosses. They could easily be granted immunity when the time is ripe.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 16:09:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology You utterly fail to understand how this effects us. You utterly fail to understand our enemies, their mindsets, and the operating enviornment. Your ignorance places the lives of Americans on the line.", 
        "intTime": 20090418, 
        "postID": 10, 
        "quote": "Originally posted by liberal90: yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology", 
        "reply": " You utterly fail to understand how this effects us. You utterly fail to understand our enemies, their mindsets, and the operating enviornment. Your ignorance places the lives of Americans on the line.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 16:42:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "threerings"
    }, 
    {
        "content": "He has not tied hands, he has freed them to reach out to our allies and to once again ask for their help in ridding the world of Islamic terrorism and to be embraced as a trustworthy ally worthy of their admiration, something that was all but destroyed by the sophomoric stupidity of the last president. To undo the damage to our national reputation as a fair and law abiding nation, we must come clean and expose the utter idiocy of those in the previous administration who mistakenly believed that torture was a humane, fair, and law abiding thing to do. The United States does not torture, and should never condone torture nor tolerate those misguided idiots who do it in the name of our national security. It is abhorrent and despicable and provides us with no security at all but robs us of valuable allies.", 
        "intTime": 20090418, 
        "postID": 11, 
        "quote": "", 
        "reply": "He has not tied hands, he has freed them to reach out to our allies and to once again ask for their help in ridding the world of Islamic terrorism and to be embraced as a trustworthy ally worthy of their admiration, something that was all but destroyed by the sophomoric stupidity of the last president. To undo the damage to our national reputation as a fair and law abiding nation, we must come clean and expose the utter idiocy of those in the previous administration who mistakenly believed that torture was a humane, fair, and law abiding thing to do. The United States does not torture, and should never condone torture nor tolerate those misguided idiots who do it in the name of our national security. It is abhorrent and despicable and provides us with no security at all but robs us of valuable allies.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 16:56:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. Did you run and tell your favorite mod? Like your many screen names? Loser!", 
        "intTime": 20090418, 
        "postID": 12, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " Did you run and tell your favorite mod? Like your many screen names? Loser!", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 19:11:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "21210272"
    }, 
    {
        "content": "Bush 2 Obama 8 Thats all folks.", 
        "intTime": 20090418, 
        "postID": 13, 
        "quote": "", 
        "reply": "Bush 2 Obama 8 Thats all folks.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 19:16:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Duster6"
    }, 
    {
        "content": "Good thing no one at the CIA ever committed torture under the Bush Administration.. Slaps to the head? Big Sarge threw some knuckle head in a wall locker and locked his ass up for 6 hours... Caterpillars? Tell that to the Marines at Parris Island and all the parasites they have to deal with.. Waterboarding? Ever take a look at Navy Seals who finish their 50m underwater swim? Many of them pass out, they are in greater danger of dying than these scumbags who are just going throw simulated drowing...not actually drowning like the boys at Coronado... Loud noises? Small spaces? Hey....I saw it first hand, and it wasn't pretty but FUG THEM...I can't believe the stupidity of some, these are murderous terrorists who do not give a damn about themselves but ESPECIALLY YOU..", 
        "intTime": 20090418, 
        "postID": 14, 
        "quote": "", 
        "reply": "Good thing no one at the CIA ever committed torture under the Bush Administration.. Slaps to the head? Big Sarge threw some knuckle head in a wall locker and locked his ass up for 6 hours... Caterpillars? Tell that to the Marines at Parris Island and all the parasites they have to deal with.. Waterboarding? Ever take a look at Navy Seals who finish their 50m underwater swim? Many of them pass out, they are in greater danger of dying than these scumbags who are just going throw simulated drowing...not actually drowning like the boys at Coronado... Loud noises? Small spaces? Hey....I saw it first hand, and it wasn't pretty but FUG THEM...I can't believe the stupidity of some, these are murderous terrorists who do not give a damn about themselves but ESPECIALLY YOU..", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 19:42:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Why would you expect anything less from two people who may someday be called to account for their decisions? Violations of the Geneva Conventions (which are also US public law, as Congress ratified them) have no statute of limitations. If all those junior enlisted people can go to prison and have their lives ruined for what they did, why shouldn't the policymakers and their support staffs (especially their lawyers)? Consider all the years every single GI in the armed forces received LOAC training, which is based on the UCMJ and all four Geneva Conventions. They would have never done what they did if someone above them told them that doing so would have landed them in prison.", 
        "intTime": 20090419, 
        "postID": 15, 
        "quote": "", 
        "reply": "Why would you expect anything less from two people who may someday be called to account for their decisions? Violations of the Geneva Conventions (which are also US public law, as Congress ratified them) have no statute of limitations. If all those junior enlisted people can go to prison and have their lives ruined for what they did, why shouldn't the policymakers and their support staffs (especially their lawyers)? Consider all the years every single GI in the armed forces received LOAC training, which is based on the UCMJ and all four Geneva Conventions. They would have never done what they did if someone above them told them that doing so would have landed them in prison.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:08:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Why would it? And how do you define \"doing their job\"?", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "", 
        "reply": "Why would it? And how do you define \"doing their job\"?", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:18:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "The methods do seem tame, I probably went through worse in SERE school. However, the ramifications of perceived torture are far worse than the torture itself. The terrorists and insurgents are smart and will use any allegations of torture to sway the popular opinion against us, and recruit people to their side. Abu Ghraib was a huge recruiting tool for both Al Qaeda and the Mahdi Army. The mere perception that we use torture is a huge blow in COIN.", 
        "intTime": 20090419, 
        "postID": 17, 
        "quote": "", 
        "reply": "The methods do seem tame, I probably went through worse in SERE school. However, the ramifications of perceived torture are far worse than the torture itself. The terrorists and insurgents are smart and will use any allegations of torture to sway the popular opinion against us, and recruit people to their side. Abu Ghraib was a huge recruiting tool for both Al Qaeda and the Mahdi Army. The mere perception that we use torture is a huge blow in COIN.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:20:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely.", 
        "intTime": 20090419, 
        "postID": 18, 
        "quote": "", 
        "reply": "Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:23:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely. Pick up Eric Haneys \"Inside Delta Force\" a non-fiction novel, this is not Dick Marcinko. He was a founding member of the most elite unit in the US military. One of his war stories has do with covert US action in south america, a CIA section chief, a US Army Special Forces solider, Haney himself leading a local group of milita on a hunt to kill \"hostiles.\" Well as it turns out the hostiles were the Green Beret and his team, which Haney killed. He beat the crap out of the CIA guy who was playing both sides surely from orders high above them all... The business of securing America is dirty and messy, and has been going on for quite some time. Obama won't change a damn thing, this is just political crap to appease the glass jawed liberals..", 
        "intTime": 20090419, 
        "postID": 19, 
        "quote": "Originally posted by mcgreer: Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely.", 
        "reply": " Pick up Eric Haneys \"Inside Delta Force\" a non-fiction novel, this is not Dick Marcinko. He was a founding member of the most elite unit in the US military. One of his war stories has do with covert US action in south america, a CIA section chief, a US Army Special Forces solider, Haney himself leading a local group of milita on a hunt to kill \"hostiles.\" Well as it turns out the hostiles were the Green Beret and his team, which Haney killed. He beat the crap out of the CIA guy who was playing both sides surely from orders high above them all... The business of securing America is dirty and messy, and has been going on for quite some time. Obama won't change a damn thing, this is just political crap to appease the glass jawed liberals..", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 18:06:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "How so? Isn't torture against the law? Obama didn't write the memos, didn't sanction the acts. He merely allowed the release of the memos that contain the decisions to allow it. The only benefit behind withholding them is that certain individuals have been exposed for complicity. What's the difference between release of these memos and the former Vice President's admission that waterboarding, etc., was authorized?", 
        "intTime": 20090419, 
        "postID": 20, 
        "quote": "", 
        "reply": "How so? Isn't torture against the law? Obama didn't write the memos, didn't sanction the acts. He merely allowed the release of the memos that contain the decisions to allow it. The only benefit behind withholding them is that certain individuals have been exposed for complicity. What's the difference between release of these memos and the former Vice President's admission that waterboarding, etc., was authorized?", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 18:16:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Does the military really intend on having crumpets and high tea to get information from a combatant? Of course not, what a silly question and what a silly person you are....They will have ACLU lawyers present", 
        "intTime": 20090419, 
        "postID": 21, 
        "quote": "Originally posted by klassylady25: Does the military really intend on having crumpets and high tea to get information from a combatant?", 
        "reply": " Of course not, what a silly question and what a silly person you are....They will have ACLU lawyers present", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 20:29:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: My bad!! You're right! The liberal thing to do would be to carefully secure individuals who slice off heads and send suicidal idiots into crowded markets loaded with innocent women, mothers, children, and the elderly. Once secured, their court appointed lawyer will decider whether or not they have to answer any questions. Bail hearings will be held soon thereafter where the terrorists family will be flown in(At taxpayer expense) to vouch for the little darlings moral character...", 
        "intTime": 20090419, 
        "postID": 22, 
        "quote": "Originally posted by klassylady25: My bad!! You're right!", 
        "reply": " The liberal thing to do would be to carefully secure individuals who slice off heads and send suicidal idiots into crowded markets loaded with innocent women, mothers, children, and the elderly. Once secured, their court appointed lawyer will decider whether or not they have to answer any questions. Bail hearings will be held soon thereafter where the terrorists family will be flown in(At taxpayer expense) to vouch for the little darlings moral character...", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 20:53:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. Speaking of losers...... Bet he comes back under a different name.", 
        "intTime": 20090420, 
        "postID": 23, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " Speaking of losers...... Bet he comes back under a different name.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-20 06:45:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Perhaps the mods will be on the look out for the ISP account this time. ------------------------------- Did you happen to see the article where the delayed action of Obama could have cost the captain his life? Very interesting. Is that on a thread?", 
        "intTime": 20090420, 
        "postID": 24, 
        "quote": "Originally posted by klassylady25: Perhaps the mods will be on the look out for the ISP account this time. ------------------------------- Did you happen to see the article where the delayed action of Obama could have cost the captain his life? Very interesting.", 
        "reply": " Is that on a thread?", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-20 06:54:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Poor guys were tortured with a caterpillar and slap in the face. The President Ties His Own Hands on Terror The point of interrogation is intelligence, not confession. By MICHAEL HAYDEN and MICHAEL B. MUKASEY 'http://online.wsj.com/article/SB123993446103128041.html' The Obama administration has declassified and released opinions of the Justice Department's Office of Legal Counsel (OLC) given in 2005 and earlier that analyze the legality of interrogation techniques authorized for use by the CIA. Those techniques were applied only when expressly permitted by the director, and are described in these opinions in detail, along with their limits and the safeguards applied to them. [Commentary] AP <edit> The release of these opinions was unnecessary as a legal matter, and is unsound as a matter of policy. Its effect will be to invite the kind of institutional timidity and fear of recrimination that weakened intelligence gathering in the past, and that we came sorely to regret on Sept. 11, 2001. Proponents of the release have argued that the techniques have been abandoned and thus there is no point in keeping them secret any longer; that they were in any event ineffective; that their disclosure was somehow legally compelled; and that they cost us more in the coin of world opinion than they were worth. None of these claims survives scrutiny. Soon after he was sworn in, President Barack Obama signed an executive order that suspended use of these techniques and confined not only the military but all U.S. agencies -- including the CIA -- to the interrogation limits set in the Army Field Manual. This suspension was accompanied by a commitment to further study the interrogation program, and government personnel were cautioned that they could no longer rely on earlier opinions of the OLC. Although evidence shows that the Army Field Manual, which is available online, is already used by al Qaeda for training purposes, it was certainly the president's right to suspend use of any technique. However, public disclosure of the OLC opinions, and thus of the techniques themselves, assures that terrorists are now aware of the absolute limit of what the U.S. government could do to extract information from them, and can supplement their training accordingly and thus diminish the effectiveness of these techniques as they have the ones in the Army Field Manual. Moreover, disclosure of the details of the program pre-empts the study of the president's task force and assures that the suspension imposed by the president's executive order is effectively permanent. There would be little point in the president authorizing measures whose nature and precise limits have already been disclosed in detail to those whose resolve we hope to overcome. This conflicts with the sworn promise of the current director of the CIA, Leon Panetta, who testified in aid of securing Senate confirmation that if he thought he needed additional authority to conduct interrogation to get necessary information, he would seek it from the president. By allowing this disclosure, President Obama has tied not only his own hands but also the hands of any future administration faced with the prospect of attack. Disclosure of the techniques is likely to be met by faux outrage, and is perfectly packaged for media consumption. It will also incur the utter contempt of our enemies. Somehow, it seems unlikely that the people who beheaded Nicholas Berg and Daniel Pearl, and have tortured and slain other American captives, are likely to be shamed into giving up violence by the news that the U.S. will no longer interrupt the sleep cycle of captured terrorists even to help elicit intelligence that could save the lives of its citizens. Which brings us to the next of the justifications for disclosing and thus abandoning these measures: that they don't work anyway, and that those who are subjected to them will simply make up information in order to end their ordeal. This ignorant view of how interrogations are conducted is belied by both experience and common sense. If coercive interrogation had been administered to obtain confessions, one might understand the argument. Khalid Sheikh Mohammed (KSM), who organized the Sept. 11, 2001 attacks, among others, and who has boasted of having beheaded Daniel Pearl, could eventually have felt pressed to provide a false confession. But confessions aren't the point. Intelligence is. Interrogation is conducted by using such obvious approaches as asking questions whose correct answers are already known and only when truthful information is provided proceeding to what may not be known. Moreover, intelligence can be verified, correlated and used to get information from other detainees, and has been; none of this information is used in isolation. The terrorist Abu Zubaydah (sometimes derided as a low-level operative of questionable reliability, but who was in fact close to KSM and other senior al Qaeda leaders) disclosed some information voluntarily. But he was coerced into disclosing information that led to the capture of Ramzi bin al Shibh, another of the planners of Sept. 11, who in turn disclosed information which -- when combined with what was learned from Abu Zubaydah -- helped lead to the capture of KSM and other senior terrorists, and the disruption of follow-on plots aimed at both Europe and the U.S. Details of these successes, and the methods used to obtain them, were disclosed repeatedly in more than 30 congressional briefings and hearings beginning in 2002, and open to all members of the Intelligence Committees of both Houses of Congress beginning in September 2006. Any protestation of ignorance of those details, particularly by members of those committees, is pretense. The techniques themselves were used selectively against only a small number of hard-core prisoners who successfully resisted other forms of interrogation, and then only with the explicit authorization of the director of the CIA. Of the thousands of unlawful combatants captured by the U.S., fewer than 100 were detained and questioned in the CIA program. Of those, fewer than one-third were subjected to any of the techniques discussed in these opinions. As already disclosed by Director Hayden, as late as 2006, even with the growing success of other intelligence tools, fully half of the government's knowledge about the structure and activities of al Qaeda came from those interrogations. Nor was there any legal reason compelling such disclosure. To be sure, the American Civil Liberties Union has sued under the Freedom of Information Act to obtain copies of these and other memoranda, but the government until now has successfully resisted such lawsuits. Even when the government disclosed that three members of al Qaeda had been subjected to waterboarding but that the technique was no longer part of the CIA interrogation program, the court sustained the government's argument that the precise details of how it was done, including limits and safeguards, could remain classified against the possibility that some future president may authorize its use. Therefore, notwithstanding the suggestion that disclosure was somehow legally compelled, there was no legal impediment to the Justice Department making the same argument even with respect to any techniques that remained in the CIA program until last January. There is something of the self-fulfilling prophecy in the claim that our interrogation of some unlawful combatants beyond the limits set in the Army Field Manual has disgraced us before the world. Such a claim often conflates interrogation with the sadism engaged in by some soldiers at Abu Ghraib, an incident that had nothing whatever to do with intelligence gathering. The limits of the Army Field Manual are entirely appropriate for young soldiers, for the conditions in which they operate, for the detainees they routinely question, and for the kinds of tactically relevant information they pursue. Those limits are not appropriate, however, for more experienced people in controlled circumstances with high-value detainees. Indeed, the Army Field Manual was created with awareness that there was an alternative protocol for high-value detainees. In addition, there were those who believed that the U.S. deserved what it got on Sept. 11, 2001. Such people, and many who purport to speak for world opinion, were resourceful both before and after the Sept. 11 attacks in crafting reasons to resent America's role as a superpower. Recall also that the first World Trade Center bombing in 1993, the attacks on our embassies in Kenya and Tanzania, the punctiliously correct trials of defendants in connection with those incidents, and the bombing of the USS Cole took place long before the advent of CIA interrogations, the invasion of Saddam Hussein's Iraq, or the many other purported grievances asserted over the past eight years. The effect of this disclosure on the morale and effectiveness of many in the intelligence community is not hard to predict. Those charged with the responsibility of gathering potentially lifesaving information from unwilling captives are now told essentially that any legal opinion they get as to the lawfulness of their activity is only as durable as political fashion permits. Even with a seemingly binding opinion in hand, which future CIA operations personnel would take the risk? There would be no wink, no nod, no handshake that would convince them that legal guidance is durable. Any president who wants to apply such techniques without such a binding and durable legal opinion had better be prepared to apply them himself. Beyond that, anyone in government who seeks an opinion from the OLC as to the propriety of any action, or who authors an opinion for the OLC, is on notice henceforth that such a request for advice, and the advice itself, is now more likely than before to be subject after the fact to public and partisan criticism. It is hard to see how that will promote candor either from those who should be encouraged to ask for advice before they act, or from those who must give it. In his book \"The Terror Presidency,\" Jack Goldsmith describes the phenomenon we are now experiencing, and its inevitable effect, referring to what he calls \"cycles of timidity and aggression\" that have weakened intelligence gathering in the past. Politicians pressure the intelligence community to push to the legal limit, and then cast accusations when aggressiveness goes out of style, thereby encouraging risk aversion, and then, as occurred in the wake of 9/11, criticizing the intelligence community for feckless timidity. He calls these cycles \"a terrible problem for our national security.\" Indeed they are, and the precipitous release of these OLC opinions simply makes the problem worse. <edit>", 
        "intTime": 20090417, 
        "postID": 25, 
        "quote": "", 
        "reply": "Poor guys were tortured with a caterpillar and slap in the face. The President Ties His Own Hands on Terror The point of interrogation is intelligence, not confession. By MICHAEL HAYDEN and MICHAEL B. MUKASEY 'http://online.wsj.com/article/SB123993446103128041.html' The Obama administration has declassified and released opinions of the Justice Department's Office of Legal Counsel (OLC) given in 2005 and earlier that analyze the legality of interrogation techniques authorized for use by the CIA. Those techniques were applied only when expressly permitted by the director, and are described in these opinions in detail, along with their limits and the safeguards applied to them. [Commentary] AP <edit> The release of these opinions was unnecessary as a legal matter, and is unsound as a matter of policy. Its effect will be to invite the kind of institutional timidity and fear of recrimination that weakened intelligence gathering in the past, and that we came sorely to regret on Sept. 11, 2001. Proponents of the release have argued that the techniques have been abandoned and thus there is no point in keeping them secret any longer; that they were in any event ineffective; that their disclosure was somehow legally compelled; and that they cost us more in the coin of world opinion than they were worth. None of these claims survives scrutiny. Soon after he was sworn in, President Barack Obama signed an executive order that suspended use of these techniques and confined not only the military but all U.S. agencies -- including the CIA -- to the interrogation limits set in the Army Field Manual. This suspension was accompanied by a commitment to further study the interrogation program, and government personnel were cautioned that they could no longer rely on earlier opinions of the OLC. Although evidence shows that the Army Field Manual, which is available online, is already used by al Qaeda for training purposes, it was certainly the president's right to suspend use of any technique. However, public disclosure of the OLC opinions, and thus of the techniques themselves, assures that terrorists are now aware of the absolute limit of what the U.S. government could do to extract information from them, and can supplement their training accordingly and thus diminish the effectiveness of these techniques as they have the ones in the Army Field Manual. Moreover, disclosure of the details of the program pre-empts the study of the president's task force and assures that the suspension imposed by the president's executive order is effectively permanent. There would be little point in the president authorizing measures whose nature and precise limits have already been disclosed in detail to those whose resolve we hope to overcome. This conflicts with the sworn promise of the current director of the CIA, Leon Panetta, who testified in aid of securing Senate confirmation that if he thought he needed additional authority to conduct interrogation to get necessary information, he would seek it from the president. By allowing this disclosure, President Obama has tied not only his own hands but also the hands of any future administration faced with the prospect of attack. Disclosure of the techniques is likely to be met by faux outrage, and is perfectly packaged for media consumption. It will also incur the utter contempt of our enemies. Somehow, it seems unlikely that the people who beheaded Nicholas Berg and Daniel Pearl, and have tortured and slain other American captives, are likely to be shamed into giving up violence by the news that the U.S. will no longer interrupt the sleep cycle of captured terrorists even to help elicit intelligence that could save the lives of its citizens. Which brings us to the next of the justifications for disclosing and thus abandoning these measures: that they don't work anyway, and that those who are subjected to them will simply make up information in order to end their ordeal. This ignorant view of how interrogations are conducted is belied by both experience and common sense. If coercive interrogation had been administered to obtain confessions, one might understand the argument. Khalid Sheikh Mohammed (KSM), who organized the Sept. 11, 2001 attacks, among others, and who has boasted of having beheaded Daniel Pearl, could eventually have felt pressed to provide a false confession. But confessions aren't the point. Intelligence is. Interrogation is conducted by using such obvious approaches as asking questions whose correct answers are already known and only when truthful information is provided proceeding to what may not be known. Moreover, intelligence can be verified, correlated and used to get information from other detainees, and has been; none of this information is used in isolation. The terrorist Abu Zubaydah (sometimes derided as a low-level operative of questionable reliability, but who was in fact close to KSM and other senior al Qaeda leaders) disclosed some information voluntarily. But he was coerced into disclosing information that led to the capture of Ramzi bin al Shibh, another of the planners of Sept. 11, who in turn disclosed information which -- when combined with what was learned from Abu Zubaydah -- helped lead to the capture of KSM and other senior terrorists, and the disruption of follow-on plots aimed at both Europe and the U.S. Details of these successes, and the methods used to obtain them, were disclosed repeatedly in more than 30 congressional briefings and hearings beginning in 2002, and open to all members of the Intelligence Committees of both Houses of Congress beginning in September 2006. Any protestation of ignorance of those details, particularly by members of those committees, is pretense. The techniques themselves were used selectively against only a small number of hard-core prisoners who successfully resisted other forms of interrogation, and then only with the explicit authorization of the director of the CIA. Of the thousands of unlawful combatants captured by the U.S., fewer than 100 were detained and questioned in the CIA program. Of those, fewer than one-third were subjected to any of the techniques discussed in these opinions. As already disclosed by Director Hayden, as late as 2006, even with the growing success of other intelligence tools, fully half of the government's knowledge about the structure and activities of al Qaeda came from those interrogations. Nor was there any legal reason compelling such disclosure. To be sure, the American Civil Liberties Union has sued under the Freedom of Information Act to obtain copies of these and other memoranda, but the government until now has successfully resisted such lawsuits. Even when the government disclosed that three members of al Qaeda had been subjected to waterboarding but that the technique was no longer part of the CIA interrogation program, the court sustained the government's argument that the precise details of how it was done, including limits and safeguards, could remain classified against the possibility that some future president may authorize its use. Therefore, notwithstanding the suggestion that disclosure was somehow legally compelled, there was no legal impediment to the Justice Department making the same argument even with respect to any techniques that remained in the CIA program until last January. There is something of the self-fulfilling prophecy in the claim that our interrogation of some unlawful combatants beyond the limits set in the Army Field Manual has disgraced us before the world. Such a claim often conflates interrogation with the sadism engaged in by some soldiers at Abu Ghraib, an incident that had nothing whatever to do with intelligence gathering. The limits of the Army Field Manual are entirely appropriate for young soldiers, for the conditions in which they operate, for the detainees they routinely question, and for the kinds of tactically relevant information they pursue. Those limits are not appropriate, however, for more experienced people in controlled circumstances with high-value detainees. Indeed, the Army Field Manual was created with awareness that there was an alternative protocol for high-value detainees. In addition, there were those who believed that the U.S. deserved what it got on Sept. 11, 2001. Such people, and many who purport to speak for world opinion, were resourceful both before and after the Sept. 11 attacks in crafting reasons to resent America's role as a superpower. Recall also that the first World Trade Center bombing in 1993, the attacks on our embassies in Kenya and Tanzania, the punctiliously correct trials of defendants in connection with those incidents, and the bombing of the USS Cole took place long before the advent of CIA interrogations, the invasion of Saddam Hussein's Iraq, or the many other purported grievances asserted over the past eight years. The effect of this disclosure on the morale and effectiveness of many in the intelligence community is not hard to predict. Those charged with the responsibility of gathering potentially lifesaving information from unwilling captives are now told essentially that any legal opinion they get as to the lawfulness of their activity is only as durable as political fashion permits. Even with a seemingly binding opinion in hand, which future CIA operations personnel would take the risk? There would be no wink, no nod, no handshake that would convince them that legal guidance is durable. Any president who wants to apply such techniques without such a binding and durable legal opinion had better be prepared to apply them himself. Beyond that, anyone in government who seeks an opinion from the OLC as to the propriety of any action, or who authors an opinion for the OLC, is on notice henceforth that such a request for advice, and the advice itself, is now more likely than before to be subject after the fact to public and partisan criticism. It is hard to see how that will promote candor either from those who should be encouraged to ask for advice before they act, or from those who must give it. In his book \"The Terror Presidency,\" Jack Goldsmith describes the phenomenon we are now experiencing, and its inevitable effect, referring to what he calls \"cycles of timidity and aggression\" that have weakened intelligence gathering in the past. Politicians pressure the intelligence community to push to the legal limit, and then cast accusations when aggressiveness goes out of style, thereby encouraging risk aversion, and then, as occurred in the wake of 9/11, criticizing the intelligence community for feckless timidity. He calls these cycles \"a terrible problem for our national security.\" Indeed they are, and the precipitous release of these OLC opinions simply makes the problem worse. <edit>", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 10:24:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "In other words...we are F'd. I remember a dem-congressman (as he was politicaly \"outraged\")saying something along the lines when presented with the argument what if nukes are involved that \"Well, we expect our agents to have the intellegence to know that in that case it would be ok and the government would back them.\" I read...we will hang your azzes if you are wrong. Just one more example of what you get when the admin is filled with individuals who are clueless. The Russians are probably jealous that this admin was 28 years too late", 
        "intTime": 20090417, 
        "postID": 26, 
        "quote": "", 
        "reply": "In other words...we are F'd. I remember a dem-congressman (as he was politicaly \"outraged\")saying something along the lines when presented with the argument what if nukes are involved that \"Well, we expect our agents to have the intellegence to know that in that case it would be ok and the government would back them.\" I read...we will hang your azzes if you are wrong. Just one more example of what you get when the admin is filled with individuals who are clueless. The Russians are probably jealous that this admin was 28 years too late", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 13:57:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "ACR26"
    }, 
    {
        "content": "The Horror . . . The Horror . . . I can just imagine how reassured our CIA Operatives are now feeling when the Attorney General Eric Holder stated that his office would provide legal counsel to any Operative sued... Doubly reassuring that their names, of the CIA Operatives, are available so that legal action can be levied against them... WHAT A COUNTRY ! ! !", 
        "intTime": 20090417, 
        "postID": 27, 
        "quote": "", 
        "reply": "The Horror . . . The Horror . . . I can just imagine how reassured our CIA Operatives are now feeling when the Attorney General Eric Holder stated that his office would provide legal counsel to any Operative sued... Doubly reassuring that their names, of the CIA Operatives, are available so that legal action can be levied against them... WHAT A COUNTRY ! ! !", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 14:13:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "My Boy Scout initation was more severe. MY GOD! Abug might have been put on a TERRORIST! How will we EVER regain out international respect!", 
        "intTime": 20090417, 
        "postID": 28, 
        "quote": "", 
        "reply": "My Boy Scout initation was more severe. MY GOD! Abug might have been put on a TERRORIST! How will we EVER regain out international respect!", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 15:29:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Maybe you should try adding pictures and popups gunny to help out the other side. Too many words for em I guess.", 
        "intTime": 20090417, 
        "postID": 29, 
        "quote": "", 
        "reply": "Maybe you should try adding pictures and popups gunny to help out the other side. Too many words for em I guess.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 21:40:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. You don't find that alarming there, dm? I'm telling you, you really need to lay off the koolaid, bro... JMHO, I could be wrong...", 
        "intTime": 20090417, 
        "postID": 30, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " You don't find that alarming there, dm? I'm telling you, you really need to lay off the koolaid, bro... JMHO, I could be wrong...", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 21:50:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "MilitaryFanSupporter"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. The losers are Americans. That would mean you too, Davey. You don't even want to think about what this will do to us all. I know you love him and you will always feel the need to block out reality in order to hold on to that feeling. It's sad really...because in the end, you will inevitably be forced to see the truth. Too bad, becuase knowing how stubborn you are, it will probably be too late.", 
        "intTime": 20090417, 
        "postID": 31, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " The losers are Americans. That would mean you too, Davey. You don't even want to think about what this will do to us all. I know you love him and you will always feel the need to block out reality in order to hold on to that feeling. It's sad really...because in the end, you will inevitably be forced to see the truth. Too bad, becuase knowing how stubborn you are, it will probably be too late.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-17 22:20:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology", 
        "intTime": 20090418, 
        "postID": 32, 
        "quote": "", 
        "reply": "yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 15:28:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "liberal90"
    }, 
    {
        "content": "Maybe by not prosecuting the actual agents he's setting them up to testify against their bosses. They could easily be granted immunity when the time is ripe.", 
        "intTime": 20090418, 
        "postID": 33, 
        "quote": "", 
        "reply": "Maybe by not prosecuting the actual agents he's setting them up to testify against their bosses. They could easily be granted immunity when the time is ripe.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 16:09:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Thud357L"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology You utterly fail to understand how this effects us. You utterly fail to understand our enemies, their mindsets, and the operating enviornment. Your ignorance places the lives of Americans on the line.", 
        "intTime": 20090418, 
        "postID": 34, 
        "quote": "Originally posted by liberal90: yeah i'm sure that al qaeda will train its members to resist drowning they have acquired secret new gill technology", 
        "reply": " You utterly fail to understand how this effects us. You utterly fail to understand our enemies, their mindsets, and the operating enviornment. Your ignorance places the lives of Americans on the line.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 16:42:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "threerings"
    }, 
    {
        "content": "He has not tied hands, he has freed them to reach out to our allies and to once again ask for their help in ridding the world of Islamic terrorism and to be embraced as a trustworthy ally worthy of their admiration, something that was all but destroyed by the sophomoric stupidity of the last president. To undo the damage to our national reputation as a fair and law abiding nation, we must come clean and expose the utter idiocy of those in the previous administration who mistakenly believed that torture was a humane, fair, and law abiding thing to do. The United States does not torture, and should never condone torture nor tolerate those misguided idiots who do it in the name of our national security. It is abhorrent and despicable and provides us with no security at all but robs us of valuable allies.", 
        "intTime": 20090418, 
        "postID": 35, 
        "quote": "", 
        "reply": "He has not tied hands, he has freed them to reach out to our allies and to once again ask for their help in ridding the world of Islamic terrorism and to be embraced as a trustworthy ally worthy of their admiration, something that was all but destroyed by the sophomoric stupidity of the last president. To undo the damage to our national reputation as a fair and law abiding nation, we must come clean and expose the utter idiocy of those in the previous administration who mistakenly believed that torture was a humane, fair, and law abiding thing to do. The United States does not torture, and should never condone torture nor tolerate those misguided idiots who do it in the name of our national security. It is abhorrent and despicable and provides us with no security at all but robs us of valuable allies.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 16:56:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. Did you run and tell your favorite mod? Like your many screen names? Loser!", 
        "intTime": 20090418, 
        "postID": 36, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " Did you run and tell your favorite mod? Like your many screen names? Loser!", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 19:11:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "21210272"
    }, 
    {
        "content": "Bush 2 Obama 8 Thats all folks.", 
        "intTime": 20090418, 
        "postID": 37, 
        "quote": "", 
        "reply": "Bush 2 Obama 8 Thats all folks.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 19:16:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Duster6"
    }, 
    {
        "content": "Good thing no one at the CIA ever committed torture under the Bush Administration.. Slaps to the head? Big Sarge threw some knuckle head in a wall locker and locked his ass up for 6 hours... Caterpillars? Tell that to the Marines at Parris Island and all the parasites they have to deal with.. Waterboarding? Ever take a look at Navy Seals who finish their 50m underwater swim? Many of them pass out, they are in greater danger of dying than these scumbags who are just going throw simulated drowing...not actually drowning like the boys at Coronado... Loud noises? Small spaces? Hey....I saw it first hand, and it wasn't pretty but FUG THEM...I can't believe the stupidity of some, these are murderous terrorists who do not give a damn about themselves but ESPECIALLY YOU..", 
        "intTime": 20090418, 
        "postID": 38, 
        "quote": "", 
        "reply": "Good thing no one at the CIA ever committed torture under the Bush Administration.. Slaps to the head? Big Sarge threw some knuckle head in a wall locker and locked his ass up for 6 hours... Caterpillars? Tell that to the Marines at Parris Island and all the parasites they have to deal with.. Waterboarding? Ever take a look at Navy Seals who finish their 50m underwater swim? Many of them pass out, they are in greater danger of dying than these scumbags who are just going throw simulated drowing...not actually drowning like the boys at Coronado... Loud noises? Small spaces? Hey....I saw it first hand, and it wasn't pretty but FUG THEM...I can't believe the stupidity of some, these are murderous terrorists who do not give a damn about themselves but ESPECIALLY YOU..", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-18 19:42:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Why would you expect anything less from two people who may someday be called to account for their decisions? Violations of the Geneva Conventions (which are also US public law, as Congress ratified them) have no statute of limitations. If all those junior enlisted people can go to prison and have their lives ruined for what they did, why shouldn't the policymakers and their support staffs (especially their lawyers)? Consider all the years every single GI in the armed forces received LOAC training, which is based on the UCMJ and all four Geneva Conventions. They would have never done what they did if someone above them told them that doing so would have landed them in prison.", 
        "intTime": 20090419, 
        "postID": 39, 
        "quote": "", 
        "reply": "Why would you expect anything less from two people who may someday be called to account for their decisions? Violations of the Geneva Conventions (which are also US public law, as Congress ratified them) have no statute of limitations. If all those junior enlisted people can go to prison and have their lives ruined for what they did, why shouldn't the policymakers and their support staffs (especially their lawyers)? Consider all the years every single GI in the armed forces received LOAC training, which is based on the UCMJ and all four Geneva Conventions. They would have never done what they did if someone above them told them that doing so would have landed them in prison.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:08:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Why would it? And how do you define \"doing their job\"?", 
        "intTime": 20090419, 
        "postID": 40, 
        "quote": "", 
        "reply": "Why would it? And how do you define \"doing their job\"?", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:18:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "The methods do seem tame, I probably went through worse in SERE school. However, the ramifications of perceived torture are far worse than the torture itself. The terrorists and insurgents are smart and will use any allegations of torture to sway the popular opinion against us, and recruit people to their side. Abu Ghraib was a huge recruiting tool for both Al Qaeda and the Mahdi Army. The mere perception that we use torture is a huge blow in COIN.", 
        "intTime": 20090419, 
        "postID": 41, 
        "quote": "", 
        "reply": "The methods do seem tame, I probably went through worse in SERE school. However, the ramifications of perceived torture are far worse than the torture itself. The terrorists and insurgents are smart and will use any allegations of torture to sway the popular opinion against us, and recruit people to their side. Abu Ghraib was a huge recruiting tool for both Al Qaeda and the Mahdi Army. The mere perception that we use torture is a huge blow in COIN.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:20:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely.", 
        "intTime": 20090419, 
        "postID": 42, 
        "quote": "", 
        "reply": "Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 17:23:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely. Pick up Eric Haneys \"Inside Delta Force\" a non-fiction novel, this is not Dick Marcinko. He was a founding member of the most elite unit in the US military. One of his war stories has do with covert US action in south america, a CIA section chief, a US Army Special Forces solider, Haney himself leading a local group of milita on a hunt to kill \"hostiles.\" Well as it turns out the hostiles were the Green Beret and his team, which Haney killed. He beat the crap out of the CIA guy who was playing both sides surely from orders high above them all... The business of securing America is dirty and messy, and has been going on for quite some time. Obama won't change a damn thing, this is just political crap to appease the glass jawed liberals..", 
        "intTime": 20090419, 
        "postID": 43, 
        "quote": "Originally posted by mcgreer: Well, that cat was out of the bag long before these memos were released. To blame Obama is foolish. If people didn't want facts such as these revealed, perhaps they should have never engaged in the act. They knew the rules - yet expected to be able to act on their own accord without being called to account. That's almost pathological. And now we're all supposed to acquiesce to a very small number of people who should have known better, but chose to act otherwise? I don't think so. We have faced much more powerful threats than from a bunch of lowlife terrorists, but we never found it necessary to consider compromising our principles, because those principles are what define us to the world, and define who we are as Americans. You have no respect for American law and American principles - perhaps you should find another place which fits your ideas more closely.", 
        "reply": " Pick up Eric Haneys \"Inside Delta Force\" a non-fiction novel, this is not Dick Marcinko. He was a founding member of the most elite unit in the US military. One of his war stories has do with covert US action in south america, a CIA section chief, a US Army Special Forces solider, Haney himself leading a local group of milita on a hunt to kill \"hostiles.\" Well as it turns out the hostiles were the Green Beret and his team, which Haney killed. He beat the crap out of the CIA guy who was playing both sides surely from orders high above them all... The business of securing America is dirty and messy, and has been going on for quite some time. Obama won't change a damn thing, this is just political crap to appease the glass jawed liberals..", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 18:06:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "How so? Isn't torture against the law? Obama didn't write the memos, didn't sanction the acts. He merely allowed the release of the memos that contain the decisions to allow it. The only benefit behind withholding them is that certain individuals have been exposed for complicity. What's the difference between release of these memos and the former Vice President's admission that waterboarding, etc., was authorized?", 
        "intTime": 20090419, 
        "postID": 44, 
        "quote": "", 
        "reply": "How so? Isn't torture against the law? Obama didn't write the memos, didn't sanction the acts. He merely allowed the release of the memos that contain the decisions to allow it. The only benefit behind withholding them is that certain individuals have been exposed for complicity. What's the difference between release of these memos and the former Vice President's admission that waterboarding, etc., was authorized?", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 18:16:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Does the military really intend on having crumpets and high tea to get information from a combatant? Of course not, what a silly question and what a silly person you are....They will have ACLU lawyers present", 
        "intTime": 20090419, 
        "postID": 45, 
        "quote": "Originally posted by klassylady25: Does the military really intend on having crumpets and high tea to get information from a combatant?", 
        "reply": " Of course not, what a silly question and what a silly person you are....They will have ACLU lawyers present", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 20:29:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: My bad!! You're right! The liberal thing to do would be to carefully secure individuals who slice off heads and send suicidal idiots into crowded markets loaded with innocent women, mothers, children, and the elderly. Once secured, their court appointed lawyer will decider whether or not they have to answer any questions. Bail hearings will be held soon thereafter where the terrorists family will be flown in(At taxpayer expense) to vouch for the little darlings moral character...", 
        "intTime": 20090419, 
        "postID": 46, 
        "quote": "Originally posted by klassylady25: My bad!! You're right!", 
        "reply": " The liberal thing to do would be to carefully secure individuals who slice off heads and send suicidal idiots into crowded markets loaded with innocent women, mothers, children, and the elderly. Once secured, their court appointed lawyer will decider whether or not they have to answer any questions. Bail hearings will be held soon thereafter where the terrorists family will be flown in(At taxpayer expense) to vouch for the little darlings moral character...", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-19 20:53:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: Duplicate thread from sore losers. Speaking of losers...... Bet he comes back under a different name.", 
        "intTime": 20090420, 
        "postID": 47, 
        "quote": "Originally posted by dmuhler: Duplicate thread from sore losers.", 
        "reply": " Speaking of losers...... Bet he comes back under a different name.", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-20 06:45:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Perhaps the mods will be on the look out for the ISP account this time. ------------------------------- Did you happen to see the article where the delayed action of Obama could have cost the captain his life? Very interesting. Is that on a thread?", 
        "intTime": 20090420, 
        "postID": 48, 
        "quote": "Originally posted by klassylady25: Perhaps the mods will be on the look out for the ISP account this time. ------------------------------- Did you happen to see the article where the delayed action of Obama could have cost the captain his life? Very interesting.", 
        "reply": " Is that on a thread?", 
        "threadID": "409192893_5580020122001", 
        "time": "2009-04-20 06:54:00", 
        "title": "The President Ties His Own Hands on Terror", 
        "userID": "GunnyRet03"
    }
]