[
    {
        "content": "Karl Rove is planting the idea that Pelosi is “an accessory to a crime of torture” in an op-ed piece in the Wall Street Journal. >http://online.wsj.com/article/SB124226863721018193.html< If Rove is implicating Pelosi in the crime of torture, then the crime of torture had to be committed. That crime of torture would have been committed by the Bush Administration. In their zeal to go after Pelosi, the Republicans seem to be implicating the Bush Administration of wrong doing. Lying to the public is not a crime. Covering up a crime is. So what is she guilty of?", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "", 
        "reply": "Karl Rove is planting the idea that Pelosi is “an accessory to a crime of torture” in an op-ed piece in the Wall Street Journal. >http://online.wsj.com/article/SB124226863721018193.html< If Rove is implicating Pelosi in the crime of torture, then the crime of torture had to be committed. That crime of torture would have been committed by the Bush Administration. In their zeal to go after Pelosi, the Republicans seem to be implicating the Bush Administration of wrong doing. Lying to the public is not a crime. Covering up a crime is. So what is she guilty of?", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-16 09:25:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "xerello"
    }, 
    {
        "content": "Its a great political plan....If they want to get the \"Bushies\" like so many rabid liberals want to, they are going to have to take down extremists on the left like pelosi as well... In the middle of all this, President Obama is trying to reform medicare, design your new cars and trucks, buy you some new light bulbs...etc..etc The issue will finally die like it should have long ago......President Bush was given legal counsel and he made the best decision he could have...", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "", 
        "reply": "Its a great political plan....If they want to get the \"Bushies\" like so many rabid liberals want to, they are going to have to take down extremists on the left like pelosi as well... In the middle of all this, President Obama is trying to reform medicare, design your new cars and trucks, buy you some new light bulbs...etc..etc The issue will finally die like it should have long ago......President Bush was given legal counsel and he made the best decision he could have...", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-16 10:05:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "You are correct, it is a great political plan, and the Republicans are falling right into it. The Republicans are going after Pelosi would be exactly what President Obama would want. She is too far left and has got in the way of several Obama proposals. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be.", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "", 
        "reply": "You are correct, it is a great political plan, and the Republicans are falling right into it. The Republicans are going after Pelosi would be exactly what President Obama would want. She is too far left and has got in the way of several Obama proposals. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-16 10:25:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "xerello"
    }, 
    {
        "content": "Don't fret libs, Bela Pelosi isn't going anywhere. I'm just a little curious, though, why the democrats are taking so long to circle the wagons. \"The World's Finest\"", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "", 
        "reply": "Don't fret libs, Bela Pelosi isn't going anywhere. I'm just a little curious, though, why the democrats are taking so long to circle the wagons. \"The World's Finest\"", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-16 12:07:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I wonder which side Rove is on. Or if he has just totally lost it. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "I wonder which side Rove is on. Or if he has just totally lost it. \"Good is better than bad cause its nicer\" Mammy Yokum (as related by Al Capp)", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-16 18:10:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "JakobA_DK"
    }, 
    {
        "content": "DANG! And I had really high hopes. quote: Originally posted by Kegler300: Don't fret libs, Bela Pelosi isn't going anywhere. I'm just a little curious, though, why the democrats are taking so long to circle the wagons.", 
        "intTime": 20090516, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: Don't fret libs, Bela Pelosi isn't going anywhere. I'm just a little curious, though, why the democrats are taking so long to circle the wagons.", 
        "reply": "DANG! And I had really high hopes. ", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-16 20:00:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "This is the best assesment of the situation I have seen so far. The briefing sessions by the CIA were held for key congressional leaders beginning in the fall of 2002. They were non-controversial then because Democrats along with Republicans wanted to avoid looking soft on terrorists. With few exceptions, those who attended the meetings say the CIA was above-board about water-boarding. Those who maintain the agency wasn’t are very-very weak about it and are doing so likely to spare Pelosi disaster: Sen. Jay Rockefeller (D-WV) and ex-Sen. Bob Graham (D-Fla.) \"http://www.cdobs.com/archive/featured/pelosi-on-ropes-will-she-take-a-fall,22796\"", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "This is the best assesment of the situation I have seen so far. The briefing sessions by the CIA were held for key congressional leaders beginning in the fall of 2002. They were non-controversial then because Democrats along with Republicans wanted to avoid looking soft on terrorists. With few exceptions, those who attended the meetings say the CIA was above-board about water-boarding. Those who maintain the agency wasn’t are very-very weak about it and are doing so likely to spare Pelosi disaster: Sen. Jay Rockefeller (D-WV) and ex-Sen. Bob Graham (D-Fla.) \"http://www.cdobs.com/archive/featured/pelosi-on-ropes-will-she-take-a-fall,22796\"", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 01:14:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by xerello: Karl Rove is planting the idea that Pelosi is “an accessory to a crime of torture” in an op-ed piece in the Wall Street Journal. >http://online.wsj.com/article/SB124226863721018193.html< If Rove is implicating Pelosi in the crime of torture, then the crime of torture had to be committed. That crime of torture would have been committed by the Bush Administration. In their zeal to go after Pelosi, the Republicans seem to be implicating the Bush Administration of wrong doing. Lying to the public is not a crime. Covering up a crime is. So what is she guilty of? I'm telling you...they are having their \"You're damn right I ordered the Code Red\" moment... Damn we have a smart president...", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "Originally posted by xerello: Karl Rove is planting the idea that Pelosi is “an accessory to a crime of torture” in an op-ed piece in the Wall Street Journal. >http://online.wsj.com/article/SB124226863721018193.html< If Rove is implicating Pelosi in the crime of torture, then the crime of torture had to be committed. That crime of torture would have been committed by the Bush Administration. In their zeal to go after Pelosi, the Republicans seem to be implicating the Bush Administration of wrong doing. Lying to the public is not a crime. Covering up a crime is. So what is she guilty of?", 
        "reply": " I'm telling you...they are having their \"You're damn right I ordered the Code Red\" moment... Damn we have a smart president...", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 05:51:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by xerello: You are correct, it is a great political plan, and the Republicans are falling right into it. The Republicans are going after Pelosi would be exactly what President Obama would want. She is too far left and has got in the way of several Obama proposals. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be. That's pretty good. Pelosi has gotten in Obama's way a lot.", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "Originally posted by xerello: You are correct, it is a great political plan, and the Republicans are falling right into it. The Republicans are going after Pelosi would be exactly what President Obama would want. She is too far left and has got in the way of several Obama proposals. The Republicans (and many independence like me) may not like Pelosi, but if she is out and Steny Hoyer becomes Speaker, the Obama Administration will be able to move even more of its agenda though Congress. The Republicans are focusing on petty things like Pelosi lying to the American public and stirring up the base with fear tactics like “Obama is going to release terrorists into the United States and give them welfare” (which is a lie) because they have no real leadership. Meanwhile, President Obama is building a “new foundation” for the country and Republicans are clueless about how to be effective counterweights like they should be.", 
        "reply": " That's pretty good. Pelosi has gotten in Obama's way a lot.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 10:35:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Don't fret libs, Bela Pelosi isn't going anywhere. I'm just a little curious, though, why the democrats are taking so long to circle the wagons. Agreed. I tend to think xerello is right. Obama's handlers have an uneasy relationship with Pelosi. Another Speaker might be better for the obamanation's agenda.", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "Originally posted by Kegler300: Don't fret libs, Bela Pelosi isn't going anywhere. I'm just a little curious, though, why the democrats are taking so long to circle the wagons.", 
        "reply": " Agreed. I tend to think xerello is right. Obama's handlers have an uneasy relationship with Pelosi. Another Speaker might be better for the obamanation's agenda.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 13:29:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "RRR52"
    }, 
    {
        "content": "By Rove's own mouth he has indicted himself!", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "", 
        "reply": "By Rove's own mouth he has indicted himself!", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 15:05:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "Gotta admit Pelosi's viit to the ME to seek peace...helped a lot...Syria was never the same...or palestine...or Israel... Paved with good intentions...undoubtedly...", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "", 
        "reply": "Gotta admit Pelosi's viit to the ME to seek peace...helped a lot...Syria was never the same...or palestine...or Israel... Paved with good intentions...undoubtedly...", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 16:21:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "strobelvets"
    }, 
    {
        "content": "quote: Originally posted by dragonflyer04: By Rove's own mouth he has indicted himself! Rove should be in prison for so many other things...this is just one of many.", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "Originally posted by dragonflyer04: By Rove's own mouth he has indicted himself!", 
        "reply": " Rove should be in prison for so many other things...this is just one of many.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 16:34:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by dragonflyer04: By Rove's own mouth he has indicted himself! Rove should be in prison for so many other things...this is just one of many. What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others?", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by dragonflyer04: By Rove's own mouth he has indicted himself! Rove should be in prison for so many other things...this is just one of many.", 
        "reply": " What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others?", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 16:38:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agent, ignoring a subpoena and the US attorney firings to start with.", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others?", 
        "reply": " Outing a CIA agent, ignoring a subpoena and the US attorney firings to start with.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 20:21:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Would somebody please set fire to the whole Valery Plame bullcrap charge thing and shove it up the fundament of the next person to bring it up!!! That thing is the biggest load of bullcrap since F.D.R. took office!!! It was a REPORTER who outed her, NOT a White House \"operative\" and he WENT TO THE SPECIAL PROSECUTER AND TOLD HIM, BEFORE....BEFORE MIND YOU, THE \"INVESTIGATION\" EVER BEGAN HE HAD DONE SO!!!! Will you maroons wake up and smell the coffee and realise what is being done to YOU and US!!?? Sweet Suffering Lord Above!!!!!", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "", 
        "reply": "Would somebody please set fire to the whole Valery Plame bullcrap charge thing and shove it up the fundament of the next person to bring it up!!! That thing is the biggest load of bullcrap since F.D.R. took office!!! It was a REPORTER who outed her, NOT a White House \"operative\" and he WENT TO THE SPECIAL PROSECUTER AND TOLD HIM, BEFORE....BEFORE MIND YOU, THE \"INVESTIGATION\" EVER BEGAN HE HAD DONE SO!!!! Will you maroons wake up and smell the coffee and realise what is being done to YOU and US!!?? Sweet Suffering Lord Above!!!!!", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 21:41:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "tawodi"
    }, 
    {
        "content": "The Plume thing happened and Cheney and his boss were in charge!", 
        "intTime": 20090517, 
        "postID": 17, 
        "quote": "", 
        "reply": "The Plume thing happened and Cheney and his boss were in charge!", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-17 23:13:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Would somebody please set fire to the whole Valery Plame bullcrap charge thing and shove it up the fundament of the next person to bring it up!!! That thing is the biggest load of bullcrap since F.D.R. took office!!! It was a REPORTER who outed her, NOT a White House \"operative\" and he WENT TO THE SPECIAL PROSECUTER AND TOLD HIM, BEFORE....BEFORE MIND YOU, THE \"INVESTIGATION\" EVER BEGAN HE HAD DONE SO!!!! Will you maroons wake up and smell the coffee and realise what is being done to YOU and US!!?? Sweet Suffering Lord Above!!!!! Funny, that isn't where the actual investigation was leading...until it was derailed by too many Bush Administration {i.e. Scooter Libby} lies. Investigate, charge, prosecute.", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by tawodi: Would somebody please set fire to the whole Valery Plame bullcrap charge thing and shove it up the fundament of the next person to bring it up!!! That thing is the biggest load of bullcrap since F.D.R. took office!!! It was a REPORTER who outed her, NOT a White House \"operative\" and he WENT TO THE SPECIAL PROSECUTER AND TOLD HIM, BEFORE....BEFORE MIND YOU, THE \"INVESTIGATION\" EVER BEGAN HE HAD DONE SO!!!! Will you maroons wake up and smell the coffee and realise what is being done to YOU and US!!?? Sweet Suffering Lord Above!!!!!", 
        "reply": " Funny, that isn't where the actual investigation was leading...until it was derailed by too many Bush Administration {i.e. Scooter Libby} lies. Investigate, charge, prosecute.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 05:10:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agent, ignoring a subpoena and the US attorney firings to start with. I guess you didnt know that the asst sos did that and the sos-powell knew and didnt say anything.", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agent, ignoring a subpoena and the US attorney firings to start with.", 
        "reply": " I guess you didnt know that the asst sos did that and the sos-powell knew and didnt say anything.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 09:02:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agentAn \"agent\" that was already outed., ignoring a subpoenapoliticly motivated BS subpeona and the US attorney firings to start with.The perogative of an administration to do so(as seen by the previous admin & others)", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agentAn \"agent\" that was already outed., ignoring a subpoenapoliticly motivated BS subpeona and the US attorney firings to start with.The perogative of an administration to do so(as seen by the previous admin & others)", 
        "reply": "", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 10:32:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agentAn \"agent\" that was already outed., ignoring a subpoenapoliticly motivated BS subpeona and the US attorney firings to start with.The perogative of an administration to do so(as seen by the previous admin & others) By your logic Clinton was right to lie under oath, it was a politically potivated persecution.", 
        "intTime": 20090518, 
        "postID": 21, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agentAn \"agent\" that was already outed., ignoring a subpoenapoliticly motivated BS subpeona and the US attorney firings to start with.The perogative of an administration to do so(as seen by the previous admin & others)", 
        "reply": " By your logic Clinton was right to lie under oath, it was a politically potivated persecution.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 16:29:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "thorin001"
    }, 
    {
        "content": "So Karl Rove does admit it was torture then -- and we violated treaties we wrote and signed -- interesting --Savage", 
        "intTime": 20090518, 
        "postID": 22, 
        "quote": "", 
        "reply": "So Karl Rove does admit it was torture then -- and we violated treaties we wrote and signed -- interesting --Savage", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 16:52:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: So Karl Rove does admit it was torture then -- and we violated treaties we wrote and signed -- interesting --Savage I took it as though he was saying, if Nancy Pelosi is going to try and charge folks, that she would be guilty as well. I don't think he admitted it was torture. I don't agree though, I think waterboarding is a form of torture and I think we need a new doctrine to supercede the GC. The GC is not specific enough, therefore the Bush Admin were able to find a loophole. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090518, 
        "postID": 23, 
        "quote": "Originally posted by A_Savage: So Karl Rove does admit it was torture then -- and we violated treaties we wrote and signed -- interesting --Savage", 
        "reply": " I took it as though he was saying, if Nancy Pelosi is going to try and charge folks, that she would be guilty as well. I don't think he admitted it was torture. I don't agree though, I think waterboarding is a form of torture and I think we need a new doctrine to supercede the GC. The GC is not specific enough, therefore the Bush Admin were able to find a loophole. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 17:12:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its a great political plan....If they want to get the \"Bushies\" like so many rabid liberals want to, they are going to have to take down extremists on the left like pelosi as well... In the middle of all this, President Obama is trying to reform medicare, design your new cars and trucks, buy you some new light bulbs...etc..etc The issue will finally die like it should have long ago......President Bush was given legal counsel and he made the best decision he could have... The issue cant die now A crime has been committed and now President Obama is sworn to uphold the law and appoint a special prosecuter to investigate the facts. If he dosent,he leaves himself open to charges of violating his oath of office.", 
        "intTime": 20090518, 
        "postID": 24, 
        "quote": "Originally posted by Irwin_R_Schyster: Its a great political plan....If they want to get the \"Bushies\" like so many rabid liberals want to, they are going to have to take down extremists on the left like pelosi as well... In the middle of all this, President Obama is trying to reform medicare, design your new cars and trucks, buy you some new light bulbs...etc..etc The issue will finally die like it should have long ago......President Bush was given legal counsel and he made the best decision he could have...", 
        "reply": " The issue cant die now A crime has been committed and now President Obama is sworn to uphold the law and appoint a special prosecuter to investigate the facts. If he dosent,he leaves himself open to charges of violating his oath of office.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 21:47:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by xerello: Karl Rove is planting the idea that Pelosi is “an accessory to a crime of torture” in an op-ed piece in the Wall Street Journal. >http://online.wsj.com/article/SB124226863721018193.html< If Rove is implicating Pelosi in the crime of torture, then the crime of torture had to be committed. That crime of torture would have been committed by the Bush Administration. In their zeal to go after Pelosi, the Republicans seem to be implicating the Bush Administration of wrong doing. Lying to the public is not a crime. Covering up a crime is. So what is she guilty of? I'm telling you...they are having their \"You're damn right I ordered the Code Red\" moment... Damn we have a smart president... I think so.", 
        "intTime": 20090518, 
        "postID": 25, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by xerello: Karl Rove is planting the idea that Pelosi is “an accessory to a crime of torture” in an op-ed piece in the Wall Street Journal. >http://online.wsj.com/article/SB124226863721018193.html< If Rove is implicating Pelosi in the crime of torture, then the crime of torture had to be committed. That crime of torture would have been committed by the Bush Administration. In their zeal to go after Pelosi, the Republicans seem to be implicating the Bush Administration of wrong doing. Lying to the public is not a crime. Covering up a crime is. So what is she guilty of? I'm telling you...they are having their \"You're damn right I ordered the Code Red\" moment... Damn we have a smart president...", 
        "reply": " I think so.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 21:54:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "john2x"
    }, 
    {
        "content": "Listening to a Congressional breifing is not action taken to commit a crime...it is well documented though the annuals of history...she had no idea as to the actual happenings, policy or the approval of it unless she directly was involved with the commission of the actual crime... only the Bush Administration including (especially Rove) and Karl Rove was directly involved...", 
        "intTime": 20090518, 
        "postID": 26, 
        "quote": "", 
        "reply": "Listening to a Congressional breifing is not action taken to commit a crime...it is well documented though the annuals of history...she had no idea as to the actual happenings, policy or the approval of it unless she directly was involved with the commission of the actual crime... only the Bush Administration including (especially Rove) and Karl Rove was directly involved...", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-18 22:59:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by 67NOV: quote: Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agentAn \"agent\" that was already outed., ignoring a subpoenapoliticly motivated BS subpeona and the US attorney firings to start with.The perogative of an administration to do so(as seen by the previous admin & others) By your logic Clinton was right to lie under oath, it was a politically potivated persecution. Anything's legal till ya get caught.", 
        "intTime": 20090520, 
        "postID": 27, 
        "quote": "Originally posted by thorin001: quote: Originally posted by 67NOV: quote: Originally posted by SeaWitch1220: quote: Originally posted by JustanotherGI: What other things? And who should be with him, is it just limited to the past Admin, which all of you seem to be on the hunt for, or could we include some past Admin's which include Clinton, Panetta and others? Outing a CIA agentAn \"agent\" that was already outed., ignoring a subpoenapoliticly motivated BS subpeona and the US attorney firings to start with.The perogative of an administration to do so(as seen by the previous admin & others) By your logic Clinton was right to lie under oath, it was a politically potivated persecution.", 
        "reply": " Anything's legal till ya get caught.", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-20 13:49:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "67NOV"
    }, 
    {
        "content": "Hey Dems, ya getting tired of Pelosi smearing the good (cough, puke) Democratic name? hehe", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "", 
        "reply": "Hey Dems, ya getting tired of Pelosi smearing the good (cough, puke) Democratic name? hehe", 
        "threadID": "409192893_9460044322001", 
        "time": "2009-05-21 20:52:00", 
        "title": "Rove: Pelosi “an accessory to a crime of torture?”", 
        "userID": "fishnfanatic"
    }
]