[
    {
        "content": "Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/***", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/***", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 11:52:00", 
        "title": "HR875?", 
        "userID": "wrkn365"
    }, 
    {
        "content": "It's possible, Rosa Delauro is Connecticuts own Nancy Pelosi!", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "It's possible, Rosa Delauro is Connecticuts own Nancy Pelosi!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 12:21:00", 
        "title": "HR875?", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by wrkn365: Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/*** Depends, are you a ranch, or a vegetable farm? What they are doing is trying to fix the problems they precive with the prevention of contaminants in the food supply bacterial, viral or chemical,brought on by the salmonella scares but these have been with large farms both inside and outside of the country. Since your selling such a small amount, most likly it won't effect you.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Originally posted by wrkn365: Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/***", 
        "reply": " Depends, are you a ranch, or a vegetable farm? What they are doing is trying to fix the problems they precive with the prevention of contaminants in the food supply bacterial, viral or chemical,brought on by the salmonella scares but these have been with large farms both inside and outside of the country. Since your selling such a small amount, most likly it won't effect you.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 12:25:00", 
        "title": "HR875?", 
        "userID": "Tangler"
    }, 
    {
        "content": "Don't care for the \"most likely\" part of your reply since that still means it's probable. The article specifically mentions farmers markets. Go to the bill and check out the Category 3 food establishment and Food Production facility This message has been edited. Last edited by: transport1, Wed 18 March 2009 01:25 PM", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "Don't care for the \"most likely\" part of your reply since that still means it's probable. The article specifically mentions farmers markets. Go to the bill and check out the Category 3 food establishment and Food Production facility This message has been edited. Last edited by: transport1, Wed 18 March 2009 01:25 PM", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 12:33:00", 
        "title": "HR875?", 
        "userID": "transport1"
    }, 
    {
        "content": "This is how monopolies are built. The large growers can afford the requirements and most often put the costs into the price of the product. Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "This is how monopolies are built. The large growers can afford the requirements and most often put the costs into the price of the product. Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 13:52:00", 
        "title": "HR875?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Bump", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "", 
        "reply": "Bump", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 02:57:00", 
        "title": "HR875?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Will it apply to the new vegetable garden at the White House?", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "", 
        "reply": "Will it apply to the new vegetable garden at the White House?", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 04:15:00", 
        "title": "HR875?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: This is how monopolies are built. It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "Originally posted by soscorpio: This is how monopolies are built.", 
        "reply": " It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 05:48:00", 
        "title": "HR875?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Will it apply to the new vegetable garden at the White House? following the recent nominee's to the cabinet, if it does, she wouldn't pay them anyway.", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by adminnco1: Will it apply to the new vegetable garden at the White House?", 
        "reply": " following the recent nominee's to the cabinet, if it does, she wouldn't pay them anyway.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 06:06:00", 
        "title": "HR875?", 
        "userID": "blane"
    }, 
    {
        "content": "I have a small garden every year and I buy stuff at the local Farmer's Markets. I also buy all my crawfish from a local farm. I know what I am getting from these places and prefer the higher quality than offered by stores.", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "", 
        "reply": "I have a small garden every year and I buy stuff at the local Farmer's Markets. I also buy all my crawfish from a local farm. I know what I am getting from these places and prefer the higher quality than offered by stores.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 07:27:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I just read some of the bill, and it is scary IMHO. I will be contacting my congress critters and let them know that I am against it. By definitions, it includes those that grow their own food and the small farmers that sell at these markets.", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "", 
        "reply": "I just read some of the bill, and it is scary IMHO. I will be contacting my congress critters and let them know that I am against it. By definitions, it includes those that grow their own food and the small farmers that sell at these markets.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 08:00:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets?", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "", 
        "reply": "Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets?", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 08:14:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "BUMP.", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "", 
        "reply": "BUMP.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 21:51:00", 
        "title": "HR875?", 
        "userID": "Spot379th"
    }, 
    {
        "content": "Yes I have hear of the Bill and the lobbyist in it is Monsanto... it would kill all organic farming and home grown vegtables and Farmer's Markets. Call your Representatives and Senators to stop it in its tracks. Local growing without pesticides and certain fertilizers would be against the law if it is passed.", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "", 
        "reply": "Yes I have hear of the Bill and the lobbyist in it is Monsanto... it would kill all organic farming and home grown vegtables and Farmer's Markets. Call your Representatives and Senators to stop it in its tracks. Local growing without pesticides and certain fertilizers would be against the law if it is passed.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 22:14:00", 
        "title": "HR875?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets? It will never fly law or not for home use and just Imaginethem trying to stop families from having a small garden in thier yards for personal use. Try to cut down all the backyard fruit trees and fig trees. They well may shut down the smaller local farms which would be criminal but never the back yard gardens for personal fresh veg and fruits. Stopping the import of foreign produce I could see since there standards are not under our control. The long Island farmers who have been here since the beginning would suffer greatly as would the people who come from miles around to buy thier farm fresh fruits and veggies. What ever happened to caveat emptor Buyer beware? do we need more government telling us how to live free? I remember a while back some nitwit politician try to pass a law fo seatbelts on a motor cycle Can you imagine that?", 
        "intTime": 20090323, 
        "postID": 15, 
        "quote": "Originally posted by Woody_in_La: Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets?", 
        "reply": " It will never fly law or not for home use and just Imaginethem trying to stop families from having a small garden in thier yards for personal use. Try to cut down all the backyard fruit trees and fig trees. They well may shut down the smaller local farms which would be criminal but never the back yard gardens for personal fresh veg and fruits. Stopping the import of foreign produce I could see since there standards are not under our control. The long Island farmers who have been here since the beginning would suffer greatly as would the people who come from miles around to buy thier farm fresh fruits and veggies. What ever happened to caveat emptor Buyer beware? do we need more government telling us how to live free? I remember a while back some nitwit politician try to pass a law fo seatbelts on a motor cycle Can you imagine that?", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 22:22:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by soscorpio: This is how monopolies are built. It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat. bull crap the small companies that cheat will go out of business because they will not be bought from. word gets around my friend...i worked in restaurants too and bought from vendors and markets.", 
        "intTime": 20090323, 
        "postID": 16, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by soscorpio: This is how monopolies are built. It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat.", 
        "reply": " bull crap the small companies that cheat will go out of business because they will not be bought from. word gets around my friend...i worked in restaurants too and bought from vendors and markets.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 23:57:00", 
        "title": "HR875?", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\".", 
        "intTime": 20090324, 
        "postID": 17, 
        "quote": "", 
        "reply": "I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\".", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 01:32:00", 
        "title": "HR875?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\". It's the politics of fear and mass hysteria. Congress only responds to that. Ever notice how stories about someone being poisoned by food gets wide-spread and detailed play in the news? It's nothing new as food has probably killed about as many people over the centuries as any other cause, so why is it an issue now? Because someone, somewhere, has an agenda and they know fully well that if they can create a panic, government must respond. While y'all are right to be concerned about this pending legislation, are you also aware of the already existing laws which, when they become mandatory in 2010, will require you to number your cows and pigs individually and keep track of where they went? Poultry will have to have tracking numbers by lot. And, you'll be subject to government inspection of your records. Why? Fear of \"mad cow disease\" was the motivation behind that law. How many times, and in how many ways, will we let ourselves be driven with fear to support someone elses agenda? Automobile safety; smoking; health care; gun rights; political parties and now food. The list goes on and on and too many people fall for it every time.", 
        "intTime": 20090324, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\".", 
        "reply": " It's the politics of fear and mass hysteria. Congress only responds to that. Ever notice how stories about someone being poisoned by food gets wide-spread and detailed play in the news? It's nothing new as food has probably killed about as many people over the centuries as any other cause, so why is it an issue now? Because someone, somewhere, has an agenda and they know fully well that if they can create a panic, government must respond. While y'all are right to be concerned about this pending legislation, are you also aware of the already existing laws which, when they become mandatory in 2010, will require you to number your cows and pigs individually and keep track of where they went? Poultry will have to have tracking numbers by lot. And, you'll be subject to government inspection of your records. Why? Fear of \"mad cow disease\" was the motivation behind that law. How many times, and in how many ways, will we let ourselves be driven with fear to support someone elses agenda? Automobile safety; smoking; health care; gun rights; political parties and now food. The list goes on and on and too many people fall for it every time.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 03:54:00", 
        "title": "HR875?", 
        "userID": "stillkit"
    }, 
    {
        "content": "Duster6 Posted Tue 24 March 2009 01:32 AM I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\". Makes you wonder some times. Seems like part of a long term conditioning program minor change that dont even raise an eyebrow,to minor to even bother complaining about till people just become conditioned to accept anything goverment dictates without question. Too much government if you ask me. And its always for our own good. last week I told my daughter to buy some fertilizer and get an early start on her lawn in their new home. She went to buy it at a local place and was told he couldnt sell it till april due to new Fed controls concerning limiting chemical ground water contaminants. Can you imagine? What BS? Its all about control and subserviance. And BTW its working Subliminal suggestion and obediance. They may convince the pups but this old dog is to old to be trained.", 
        "intTime": 20090324, 
        "postID": 19, 
        "quote": "", 
        "reply": "Duster6 Posted Tue 24 March 2009 01:32 AM I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\". Makes you wonder some times. Seems like part of a long term conditioning program minor change that dont even raise an eyebrow,to minor to even bother complaining about till people just become conditioned to accept anything goverment dictates without question. Too much government if you ask me. And its always for our own good. last week I told my daughter to buy some fertilizer and get an early start on her lawn in their new home. She went to buy it at a local place and was told he couldnt sell it till april due to new Fed controls concerning limiting chemical ground water contaminants. Can you imagine? What BS? Its all about control and subserviance. And BTW its working Subliminal suggestion and obediance. They may convince the pups but this old dog is to old to be trained.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 10:01:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "Remember the lobbyist behind it is Monsanto a chemical company. It produces hybrid seeds, and chemicals.", 
        "intTime": 20090324, 
        "postID": 20, 
        "quote": "", 
        "reply": "Remember the lobbyist behind it is Monsanto a chemical company. It produces hybrid seeds, and chemicals.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 10:11:00", 
        "title": "HR875?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "BUMP", 
        "intTime": 20090324, 
        "postID": 21, 
        "quote": "", 
        "reply": "BUMP", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 15:01:00", 
        "title": "HR875?", 
        "userID": "transport1"
    }, 
    {
        "content": "A Great History Lesson For All Of Us An economics professor at Texas Tech said he had never failed a single student before but had, once, failed an entire class. The majority of the class had insisted that socialism was a better system as no one would be poor and no one would be rich, a great equalizer. The professor then said ok, we will have an experiment in this class on socialism. All grades would be averaged and everyone would receive the same grade so no one would fail and no one would receive an A. After the first test the grades were averaged and everyone got a B. The students who studied hard were upset and the students who studied little were happy. But, as the second test rolled around, the students who studied little had studied even less and the ones who studied hard decided they wanted a free ride too; so they studied little. The second Test average was a D! No one was happy. When the 3rd test rolled around the average was an F. The scores never increased as bickering, blame, name calling all resulted in hard feelings and no one would study for anyone else. All failed to their great surprise and the professor told them that socialism would ultimately fail because the harder to succeed the greater the reward but when a government takes all the reward away; no one will try or succeed.", 
        "intTime": 20090325, 
        "postID": 22, 
        "quote": "", 
        "reply": "A Great History Lesson For All Of Us An economics professor at Texas Tech said he had never failed a single student before but had, once, failed an entire class. The majority of the class had insisted that socialism was a better system as no one would be poor and no one would be rich, a great equalizer. The professor then said ok, we will have an experiment in this class on socialism. All grades would be averaged and everyone would receive the same grade so no one would fail and no one would receive an A. After the first test the grades were averaged and everyone got a B. The students who studied hard were upset and the students who studied little were happy. But, as the second test rolled around, the students who studied little had studied even less and the ones who studied hard decided they wanted a free ride too; so they studied little. The second Test average was a D! No one was happy. When the 3rd test rolled around the average was an F. The scores never increased as bickering, blame, name calling all resulted in hard feelings and no one would study for anyone else. All failed to their great surprise and the professor told them that socialism would ultimately fail because the harder to succeed the greater the reward but when a government takes all the reward away; no one will try or succeed.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:04:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "Had an arrogant SOB like that once. Droped the class, raked him over the coals in the student newspaper, recommended no one take his classes. The department had to stop announcing the name of the professors before the class started. I heard some changes were made. May be able to pull that crap on traditionl students but don't try it on someone who spent 4 years active.", 
        "intTime": 20090325, 
        "postID": 23, 
        "quote": "", 
        "reply": "Had an arrogant SOB like that once. Droped the class, raked him over the coals in the student newspaper, recommended no one take his classes. The department had to stop announcing the name of the professors before the class started. I heard some changes were made. May be able to pull that crap on traditionl students but don't try it on someone who spent 4 years active.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:14:00", 
        "title": "HR875?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: I also buy all my crawfish from a local farm. . OH!!!! MAN!!!! what I wouldn't give a mess of crawdad's for lunch today.", 
        "intTime": 20090325, 
        "postID": 24, 
        "quote": "Originally posted by Woody_in_La: I also buy all my crawfish from a local farm. .", 
        "reply": " OH!!!! MAN!!!! what I wouldn't give a mess of crawdad's for lunch today.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:31:00", 
        "title": "HR875?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "intTime": 20090325, 
        "postID": 25, 
        "quote": "", 
        "reply": "The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:38:00", 
        "title": "HR875?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands! OOOH, that's bad cliche work. A truism, for sure, but bad.", 
        "intTime": 20090325, 
        "postID": 26, 
        "quote": "Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "reply": " OOOH, that's bad cliche work. A truism, for sure, but bad.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 09:21:00", 
        "title": "HR875?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands! That sounds like some seriously kinky sheat!", 
        "intTime": 20090325, 
        "postID": 27, 
        "quote": "Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "reply": " That sounds like some seriously kinky sheat!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 10:16:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Bump!", 
        "intTime": 20090325, 
        "postID": 28, 
        "quote": "", 
        "reply": "Bump!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 17:15:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there!", 
        "intTime": 20090328, 
        "postID": 29, 
        "quote": "", 
        "reply": "I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-28 07:37:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there! I wouldnt worry about that woody. FK them and the limos they rode in on. They couldnt enforce any such law for the family garden and fruit trees no more than they could ban backyard barbeques.", 
        "intTime": 20090328, 
        "postID": 30, 
        "quote": "Originally posted by Woody_in_La: I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there!", 
        "reply": " I wouldnt worry about that woody. FK them and the limos they rode in on. They couldnt enforce any such law for the family garden and fruit trees no more than they could ban backyard barbeques.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-28 10:02:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/***", 
        "intTime": 20090318, 
        "postID": 31, 
        "quote": "", 
        "reply": "Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/***", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 11:52:00", 
        "title": "HR875?", 
        "userID": "wrkn365"
    }, 
    {
        "content": "It's possible, Rosa Delauro is Connecticuts own Nancy Pelosi!", 
        "intTime": 20090318, 
        "postID": 32, 
        "quote": "", 
        "reply": "It's possible, Rosa Delauro is Connecticuts own Nancy Pelosi!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 12:21:00", 
        "title": "HR875?", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by wrkn365: Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/*** Depends, are you a ranch, or a vegetable farm? What they are doing is trying to fix the problems they precive with the prevention of contaminants in the food supply bacterial, viral or chemical,brought on by the salmonella scares but these have been with large farms both inside and outside of the country. Since your selling such a small amount, most likly it won't effect you.", 
        "intTime": 20090318, 
        "postID": 33, 
        "quote": "Originally posted by wrkn365: Have any of you heard anything about this bill, HR 875. The Food Safety Modernization Act of 2009 I grow fruits and veggies, and also buy from local Farmers Markets. I just can't believe this bill would cover someone growing food in a garden for themselves, or even to sell at a Farmers Market. This is the article that I read. At the bottom of the article is a link to the bill itself. ***http://blog.friendseat.com/rosa-delauro-hates-small-farms1/***", 
        "reply": " Depends, are you a ranch, or a vegetable farm? What they are doing is trying to fix the problems they precive with the prevention of contaminants in the food supply bacterial, viral or chemical,brought on by the salmonella scares but these have been with large farms both inside and outside of the country. Since your selling such a small amount, most likly it won't effect you.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 12:25:00", 
        "title": "HR875?", 
        "userID": "Tangler"
    }, 
    {
        "content": "Don't care for the \"most likely\" part of your reply since that still means it's probable. The article specifically mentions farmers markets. Go to the bill and check out the Category 3 food establishment and Food Production facility This message has been edited. Last edited by: transport1, Wed 18 March 2009 01:25 PM", 
        "intTime": 20090318, 
        "postID": 34, 
        "quote": "", 
        "reply": "Don't care for the \"most likely\" part of your reply since that still means it's probable. The article specifically mentions farmers markets. Go to the bill and check out the Category 3 food establishment and Food Production facility This message has been edited. Last edited by: transport1, Wed 18 March 2009 01:25 PM", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 12:33:00", 
        "title": "HR875?", 
        "userID": "transport1"
    }, 
    {
        "content": "This is how monopolies are built. The large growers can afford the requirements and most often put the costs into the price of the product. Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce.", 
        "intTime": 20090318, 
        "postID": 35, 
        "quote": "", 
        "reply": "This is how monopolies are built. The large growers can afford the requirements and most often put the costs into the price of the product. Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-18 13:52:00", 
        "title": "HR875?", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Bump", 
        "intTime": 20090322, 
        "postID": 36, 
        "quote": "", 
        "reply": "Bump", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 02:57:00", 
        "title": "HR875?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Will it apply to the new vegetable garden at the White House?", 
        "intTime": 20090322, 
        "postID": 37, 
        "quote": "", 
        "reply": "Will it apply to the new vegetable garden at the White House?", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 04:15:00", 
        "title": "HR875?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: This is how monopolies are built. It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat.", 
        "intTime": 20090322, 
        "postID": 38, 
        "quote": "Originally posted by soscorpio: This is how monopolies are built.", 
        "reply": " It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 05:48:00", 
        "title": "HR875?", 
        "userID": "cosmicfish"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Will it apply to the new vegetable garden at the White House? following the recent nominee's to the cabinet, if it does, she wouldn't pay them anyway.", 
        "intTime": 20090322, 
        "postID": 39, 
        "quote": "Originally posted by adminnco1: Will it apply to the new vegetable garden at the White House?", 
        "reply": " following the recent nominee's to the cabinet, if it does, she wouldn't pay them anyway.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 06:06:00", 
        "title": "HR875?", 
        "userID": "blane"
    }, 
    {
        "content": "I have a small garden every year and I buy stuff at the local Farmer's Markets. I also buy all my crawfish from a local farm. I know what I am getting from these places and prefer the higher quality than offered by stores.", 
        "intTime": 20090322, 
        "postID": 40, 
        "quote": "", 
        "reply": "I have a small garden every year and I buy stuff at the local Farmer's Markets. I also buy all my crawfish from a local farm. I know what I am getting from these places and prefer the higher quality than offered by stores.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 07:27:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I just read some of the bill, and it is scary IMHO. I will be contacting my congress critters and let them know that I am against it. By definitions, it includes those that grow their own food and the small farmers that sell at these markets.", 
        "intTime": 20090322, 
        "postID": 41, 
        "quote": "", 
        "reply": "I just read some of the bill, and it is scary IMHO. I will be contacting my congress critters and let them know that I am against it. By definitions, it includes those that grow their own food and the small farmers that sell at these markets.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-22 08:00:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets?", 
        "intTime": 20090323, 
        "postID": 42, 
        "quote": "", 
        "reply": "Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets?", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 08:14:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "BUMP.", 
        "intTime": 20090323, 
        "postID": 43, 
        "quote": "", 
        "reply": "BUMP.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 21:51:00", 
        "title": "HR875?", 
        "userID": "Spot379th"
    }, 
    {
        "content": "Yes I have hear of the Bill and the lobbyist in it is Monsanto... it would kill all organic farming and home grown vegtables and Farmer's Markets. Call your Representatives and Senators to stop it in its tracks. Local growing without pesticides and certain fertilizers would be against the law if it is passed.", 
        "intTime": 20090323, 
        "postID": 44, 
        "quote": "", 
        "reply": "Yes I have hear of the Bill and the lobbyist in it is Monsanto... it would kill all organic farming and home grown vegtables and Farmer's Markets. Call your Representatives and Senators to stop it in its tracks. Local growing without pesticides and certain fertilizers would be against the law if it is passed.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 22:14:00", 
        "title": "HR875?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets? It will never fly law or not for home use and just Imaginethem trying to stop families from having a small garden in thier yards for personal use. Try to cut down all the backyard fruit trees and fig trees. They well may shut down the smaller local farms which would be criminal but never the back yard gardens for personal fresh veg and fruits. Stopping the import of foreign produce I could see since there standards are not under our control. The long Island farmers who have been here since the beginning would suffer greatly as would the people who come from miles around to buy thier farm fresh fruits and veggies. What ever happened to caveat emptor Buyer beware? do we need more government telling us how to live free? I remember a while back some nitwit politician try to pass a law fo seatbelts on a motor cycle Can you imagine that?", 
        "intTime": 20090323, 
        "postID": 45, 
        "quote": "Originally posted by Woody_in_La: Giving this a bump. I wonder how many realize just how dangerous this can be if the feds dictate if one can or can not have a garden or buy at farmers markets?", 
        "reply": " It will never fly law or not for home use and just Imaginethem trying to stop families from having a small garden in thier yards for personal use. Try to cut down all the backyard fruit trees and fig trees. They well may shut down the smaller local farms which would be criminal but never the back yard gardens for personal fresh veg and fruits. Stopping the import of foreign produce I could see since there standards are not under our control. The long Island farmers who have been here since the beginning would suffer greatly as would the people who come from miles around to buy thier farm fresh fruits and veggies. What ever happened to caveat emptor Buyer beware? do we need more government telling us how to live free? I remember a while back some nitwit politician try to pass a law fo seatbelts on a motor cycle Can you imagine that?", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 22:22:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by cosmicfish: quote: Originally posted by soscorpio: This is how monopolies are built. It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat. bull crap the small companies that cheat will go out of business because they will not be bought from. word gets around my friend...i worked in restaurants too and bought from vendors and markets.", 
        "intTime": 20090323, 
        "postID": 46, 
        "quote": "Originally posted by cosmicfish: quote: Originally posted by soscorpio: This is how monopolies are built. It certainly helps... quote: Originally posted by soscorpio: Small growers are the safer foods. when you know who grew your food and deal with them face-to-face, they will treat the deal on a personal level and provide the best produce. This is not necessarily true. The last restaurant I worked in made apoint of trying to buy from small local farms and vendors, will the remainder bought from one of the big restaurant supply companies. The big vendor was as consistent as clockwork - same quality, same schedule, every time. Not great, mind you, but consistent. The small vendors were all over the place - some were great quality and excellent service. Others tried to sell us substandard product, whenever they got around to delivering it. The bad ones stayed in business - other restaurants were not so diligent in inspecting their meat and produce, or else chose the lower price vendor to maximize their profits. My point is that small companies are quite varied, and even the bad ones (the ones who will happily sell you a case of rotting potatoes as good) can stay in business for decades if no one is calling on them on their quality. Since restaurants and individual buyers lack the ability to check certain things, professional inspections are at least occasionally necessary. The trick is that they cannot be so onerus that small companies cannot stay afloat.", 
        "reply": " bull crap the small companies that cheat will go out of business because they will not be bought from. word gets around my friend...i worked in restaurants too and bought from vendors and markets.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-23 23:57:00", 
        "title": "HR875?", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\".", 
        "intTime": 20090324, 
        "postID": 47, 
        "quote": "", 
        "reply": "I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\".", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 01:32:00", 
        "title": "HR875?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\". It's the politics of fear and mass hysteria. Congress only responds to that. Ever notice how stories about someone being poisoned by food gets wide-spread and detailed play in the news? It's nothing new as food has probably killed about as many people over the centuries as any other cause, so why is it an issue now? Because someone, somewhere, has an agenda and they know fully well that if they can create a panic, government must respond. While y'all are right to be concerned about this pending legislation, are you also aware of the already existing laws which, when they become mandatory in 2010, will require you to number your cows and pigs individually and keep track of where they went? Poultry will have to have tracking numbers by lot. And, you'll be subject to government inspection of your records. Why? Fear of \"mad cow disease\" was the motivation behind that law. How many times, and in how many ways, will we let ourselves be driven with fear to support someone elses agenda? Automobile safety; smoking; health care; gun rights; political parties and now food. The list goes on and on and too many people fall for it every time.", 
        "intTime": 20090324, 
        "postID": 48, 
        "quote": "Originally posted by Duster6: I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\".", 
        "reply": " It's the politics of fear and mass hysteria. Congress only responds to that. Ever notice how stories about someone being poisoned by food gets wide-spread and detailed play in the news? It's nothing new as food has probably killed about as many people over the centuries as any other cause, so why is it an issue now? Because someone, somewhere, has an agenda and they know fully well that if they can create a panic, government must respond. While y'all are right to be concerned about this pending legislation, are you also aware of the already existing laws which, when they become mandatory in 2010, will require you to number your cows and pigs individually and keep track of where they went? Poultry will have to have tracking numbers by lot. And, you'll be subject to government inspection of your records. Why? Fear of \"mad cow disease\" was the motivation behind that law. How many times, and in how many ways, will we let ourselves be driven with fear to support someone elses agenda? Automobile safety; smoking; health care; gun rights; political parties and now food. The list goes on and on and too many people fall for it every time.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 03:54:00", 
        "title": "HR875?", 
        "userID": "stillkit"
    }, 
    {
        "content": "Duster6 Posted Tue 24 March 2009 01:32 AM I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\". Makes you wonder some times. Seems like part of a long term conditioning program minor change that dont even raise an eyebrow,to minor to even bother complaining about till people just become conditioned to accept anything goverment dictates without question. Too much government if you ask me. And its always for our own good. last week I told my daughter to buy some fertilizer and get an early start on her lawn in their new home. She went to buy it at a local place and was told he couldnt sell it till april due to new Fed controls concerning limiting chemical ground water contaminants. Can you imagine? What BS? Its all about control and subserviance. And BTW its working Subliminal suggestion and obediance. They may convince the pups but this old dog is to old to be trained.", 
        "intTime": 20090324, 
        "postID": 49, 
        "quote": "", 
        "reply": "Duster6 Posted Tue 24 March 2009 01:32 AM I guess these politicians sit in their offices everyday and think,\" How can I screw the American public today\". Makes you wonder some times. Seems like part of a long term conditioning program minor change that dont even raise an eyebrow,to minor to even bother complaining about till people just become conditioned to accept anything goverment dictates without question. Too much government if you ask me. And its always for our own good. last week I told my daughter to buy some fertilizer and get an early start on her lawn in their new home. She went to buy it at a local place and was told he couldnt sell it till april due to new Fed controls concerning limiting chemical ground water contaminants. Can you imagine? What BS? Its all about control and subserviance. And BTW its working Subliminal suggestion and obediance. They may convince the pups but this old dog is to old to be trained.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 10:01:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "Remember the lobbyist behind it is Monsanto a chemical company. It produces hybrid seeds, and chemicals.", 
        "intTime": 20090324, 
        "postID": 50, 
        "quote": "", 
        "reply": "Remember the lobbyist behind it is Monsanto a chemical company. It produces hybrid seeds, and chemicals.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 10:11:00", 
        "title": "HR875?", 
        "userID": "dragonflyer04"
    }, 
    {
        "content": "BUMP", 
        "intTime": 20090324, 
        "postID": 51, 
        "quote": "", 
        "reply": "BUMP", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-24 15:01:00", 
        "title": "HR875?", 
        "userID": "transport1"
    }, 
    {
        "content": "A Great History Lesson For All Of Us An economics professor at Texas Tech said he had never failed a single student before but had, once, failed an entire class. The majority of the class had insisted that socialism was a better system as no one would be poor and no one would be rich, a great equalizer. The professor then said ok, we will have an experiment in this class on socialism. All grades would be averaged and everyone would receive the same grade so no one would fail and no one would receive an A. After the first test the grades were averaged and everyone got a B. The students who studied hard were upset and the students who studied little were happy. But, as the second test rolled around, the students who studied little had studied even less and the ones who studied hard decided they wanted a free ride too; so they studied little. The second Test average was a D! No one was happy. When the 3rd test rolled around the average was an F. The scores never increased as bickering, blame, name calling all resulted in hard feelings and no one would study for anyone else. All failed to their great surprise and the professor told them that socialism would ultimately fail because the harder to succeed the greater the reward but when a government takes all the reward away; no one will try or succeed.", 
        "intTime": 20090325, 
        "postID": 52, 
        "quote": "", 
        "reply": "A Great History Lesson For All Of Us An economics professor at Texas Tech said he had never failed a single student before but had, once, failed an entire class. The majority of the class had insisted that socialism was a better system as no one would be poor and no one would be rich, a great equalizer. The professor then said ok, we will have an experiment in this class on socialism. All grades would be averaged and everyone would receive the same grade so no one would fail and no one would receive an A. After the first test the grades were averaged and everyone got a B. The students who studied hard were upset and the students who studied little were happy. But, as the second test rolled around, the students who studied little had studied even less and the ones who studied hard decided they wanted a free ride too; so they studied little. The second Test average was a D! No one was happy. When the 3rd test rolled around the average was an F. The scores never increased as bickering, blame, name calling all resulted in hard feelings and no one would study for anyone else. All failed to their great surprise and the professor told them that socialism would ultimately fail because the harder to succeed the greater the reward but when a government takes all the reward away; no one will try or succeed.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:04:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }, 
    {
        "content": "Had an arrogant SOB like that once. Droped the class, raked him over the coals in the student newspaper, recommended no one take his classes. The department had to stop announcing the name of the professors before the class started. I heard some changes were made. May be able to pull that crap on traditionl students but don't try it on someone who spent 4 years active.", 
        "intTime": 20090325, 
        "postID": 53, 
        "quote": "", 
        "reply": "Had an arrogant SOB like that once. Droped the class, raked him over the coals in the student newspaper, recommended no one take his classes. The department had to stop announcing the name of the professors before the class started. I heard some changes were made. May be able to pull that crap on traditionl students but don't try it on someone who spent 4 years active.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:14:00", 
        "title": "HR875?", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: I also buy all my crawfish from a local farm. . OH!!!! MAN!!!! what I wouldn't give a mess of crawdad's for lunch today.", 
        "intTime": 20090325, 
        "postID": 54, 
        "quote": "Originally posted by Woody_in_La: I also buy all my crawfish from a local farm. .", 
        "reply": " OH!!!! MAN!!!! what I wouldn't give a mess of crawdad's for lunch today.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:31:00", 
        "title": "HR875?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "intTime": 20090325, 
        "postID": 55, 
        "quote": "", 
        "reply": "The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 08:38:00", 
        "title": "HR875?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands! OOOH, that's bad cliche work. A truism, for sure, but bad.", 
        "intTime": 20090325, 
        "postID": 56, 
        "quote": "Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "reply": " OOOH, that's bad cliche work. A truism, for sure, but bad.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 09:21:00", 
        "title": "HR875?", 
        "userID": "transport1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands! That sounds like some seriously kinky sheat!", 
        "intTime": 20090325, 
        "postID": 57, 
        "quote": "Originally posted by GunnyRet03: The only way they will get my 'home grown cucumber' is to pry it from my cold dead hands!", 
        "reply": " That sounds like some seriously kinky sheat!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 10:16:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Bump!", 
        "intTime": 20090325, 
        "postID": 58, 
        "quote": "", 
        "reply": "Bump!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-25 17:15:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there!", 
        "intTime": 20090328, 
        "postID": 59, 
        "quote": "", 
        "reply": "I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there!", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-28 07:37:00", 
        "title": "HR875?", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there! I wouldnt worry about that woody. FK them and the limos they rode in on. They couldnt enforce any such law for the family garden and fruit trees no more than they could ban backyard barbeques.", 
        "intTime": 20090328, 
        "postID": 60, 
        "quote": "Originally posted by Woody_in_La: I've been thinking.... I wonder if this will be my last year to legally have a personal garden or shop the farmers markets? I was looking at the small tractors and tillers at Home Depot and thought that they will be nothing more than un-needed junk if this law is passed and pushed to it's potential limits. I guess I would have to move to Mexico with all the others who would want to continue having their own gardens. Canada is out of the question because it is too damn cold up there!", 
        "reply": " I wouldnt worry about that woody. FK them and the limos they rode in on. They couldnt enforce any such law for the family garden and fruit trees no more than they could ban backyard barbeques.", 
        "threadID": "409192893_8930022812001", 
        "time": "2009-03-28 10:02:00", 
        "title": "HR875?", 
        "userID": "john2x"
    }
]