[
    {
        "content": "last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million.", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-18 06:41:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "Extremely interesting! Bump", 
        "intTime": 20090322, 
        "postID": 2, 
        "quote": "", 
        "reply": "Extremely interesting! Bump", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 02:58:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\".", 
        "intTime": 20090322, 
        "postID": 3, 
        "quote": "", 
        "reply": "how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\".", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 03:39:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\". Because that is not whats going here. We have small bank, that TURNED A PROFIT last year of 87,000. 87K isn't much compared to the banks operating revenue. And the FED comes down and tells them to make more loans? You agree with the FED? Insanity. I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are buying votes by giving tax money to people who wont or cant pay the money back..and the \"country club members\" the silly morons who pay their bills and work for a living are getting hosed for what? Being responsible?", 
        "intTime": 20090322, 
        "postID": 4, 
        "quote": "Originally posted by karlhungusjr: how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\".", 
        "reply": " Because that is not whats going here. We have small bank, that TURNED A PROFIT last year of 87,000. 87K isn't much compared to the banks operating revenue. And the FED comes down and tells them to make more loans? You agree with the FED? Insanity. I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are buying votes by giving tax money to people who wont or cant pay the money back..and the \"country club members\" the silly morons who pay their bills and work for a living are getting hosed for what? Being responsible?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 04:07:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Because that is not whats going here. Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals.", 
        "intTime": 20090322, 
        "postID": 5, 
        "quote": "Because that is not whats going here.", 
        "reply": " Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 04:19:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "One needs to read carefully ... and note what the criteria for the evaluation was ... quote: Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act.", 
        "reply": "One needs to read carefully ... and note what the criteria for the evaluation was ...  Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 05:17:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Because that is not whats going here. Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals. The bank is making loans it feels are profitable. In a culture where banks are bleeding money, this one bank is turning a profit.. And the FED steps in and trys to force it to make loans.. The FED does not have to force it to make GOOD loans.. The math escapes you.", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "Originally posted by karlhungusjr: quote: Because that is not whats going here. Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals.", 
        "reply": " The bank is making loans it feels are profitable. In a culture where banks are bleeding money, this one bank is turning a profit.. And the FED steps in and trys to force it to make loans.. The FED does not have to force it to make GOOD loans.. The math escapes you.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 07:53:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: And the FED steps in and trys to force it to make loans.. you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "And the FED steps in and trys to force it to make loans..", 
        "reply": " you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 08:19:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: And the FED steps in and trys to force it to make loans.. you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans. You understand that the FED's reaction is not that they are NOT lending now?", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by karlhungusjr: quote: And the FED steps in and trys to force it to make loans.. you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans.", 
        "reply": " You understand that the FED's reaction is not that they are NOT lending now?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 08:39:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Yet your first assumption is that they are forcing them to make bad loans. What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "Yet your first assumption is that they are forcing them to make bad loans.", 
        "reply": " What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 09:31:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: You understand that the FED's reaction is not that they are NOT lending now? english please. what is that supposed to mean?", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "You understand that the FED's reaction is not that they are NOT lending now?", 
        "reply": " english please. what is that supposed to mean?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 10:05:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about. I'm fully aware of what the Community Reinvestment Act is. I'm also fully awar that banks were pushing sub prime mortages and they were pushing those loans to people who they knew wouldn't qualify for a standard mortage. And they did it not because they were coerced. they did it becuase they only had to sell of the loan to the next guy and they still made a nice profit. The Community Reinvestment Act is an excuse. you may as well blame hang nail for a severed leg.", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "reply": " I'm fully aware of what the Community Reinvestment Act is. I'm also fully awar that banks were pushing sub prime mortages and they were pushing those loans to people who they knew wouldn't qualify for a standard mortage. And they did it not because they were coerced. they did it becuase they only had to sell of the loan to the next guy and they still made a nice profit. The Community Reinvestment Act is an excuse. you may as well blame hang nail for a severed leg.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 10:10:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: The Community Reinvestment Act is an excuse. Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "The Community Reinvestment Act is an excuse.", 
        "reply": " Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 10:24:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself. everything in moderation. They are not being critized by the FDIC for not giving out sub prime loans for people who cant afford the. they are being critized by the FDIC for(as far as the info points to. but i fully admit i could be wrong) not giving out loans to people who COULD make the payments but may not have absolutly perfect credit. but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\"", 
        "intTime": 20090322, 
        "postID": 14, 
        "quote": "Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "reply": " everything in moderation. They are not being critized by the FDIC for not giving out sub prime loans for people who cant afford the. they are being critized by the FDIC for(as far as the info points to. but i fully admit i could be wrong) not giving out loans to people who COULD make the payments but may not have absolutly perfect credit. but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\"", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 13:15:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\" <sigh> Which brings me back to my initial comment ... quote: Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "intTime": 20090322, 
        "postID": 15, 
        "quote": "but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\"", 
        "reply": " <sigh> Which brings me back to my initial comment ... quote: Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 14:09:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by threerings: last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million. Hey spinmeister. Where's the part about the FDIC pushing loans to people that to people that can't afford them? I must have missed that sentence.......or you're talking out your azz. Honesty is not your strongest suit is it?", 
        "intTime": 20090322, 
        "postID": 16, 
        "quote": "Originally posted by threerings: last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million.", 
        "reply": " Hey spinmeister. Where's the part about the FDIC pushing loans to people that to people that can't afford them? I must have missed that sentence.......or you're talking out your azz. Honesty is not your strongest suit is it?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 15:01:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Yet your first assumption is that they are forcing them to make bad loans. What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about. Horsesh it. Where's your credible evidence to support that pile of bile? Here's a tip. Get a clue.", 
        "intTime": 20090322, 
        "postID": 17, 
        "quote": "Originally posted by I_M_Qwerty: quote: Yet your first assumption is that they are forcing them to make bad loans. What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "reply": " Horsesh it. Where's your credible evidence to support that pile of bile? Here's a tip. Get a clue.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 15:03:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: The Community Reinvestment Act is an excuse. Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself. This bank is following the rules like most Credit Unions and only making loans to people with a credible loan to debt ratio so people who want to borrow a set dollar amount can actually afford that set dollar amount. Its the way all responsible banks used to make loans. And yes, to answer the question by another poster, lower income usually means a lower loan amount at higher interest and a riskier repayment record. that's called reality.", 
        "intTime": 20090322, 
        "postID": 18, 
        "quote": "Originally posted by I_M_Qwerty: quote: The Community Reinvestment Act is an excuse. Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "reply": " This bank is following the rules like most Credit Unions and only making loans to people with a credible loan to debt ratio so people who want to borrow a set dollar amount can actually afford that set dollar amount. Its the way all responsible banks used to make loans. And yes, to answer the question by another poster, lower income usually means a lower loan amount at higher interest and a riskier repayment record. that's called reality.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 15:44:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: lower income usually means a lower loan amount at higher interest and a riskier repayment record. Roll Eyes that's called reality. If you had one fact it would lonely. Low income does not equal subprime. Reading comprehension and basic writing skills still a problem for you? I never mention anything about \"subprime\" anything. Lower incomes USUALLY means a lower loan amount (cause they can't affored more)at a higher interest rate and a risker repayment record (because they are at a higher rate of loan defaults). Was that simple enough for you to understand? I tried to use small words so you wouldn't get confused.", 
        "intTime": 20090322, 
        "postID": 19, 
        "quote": "Originally posted by dmuhler: quote: lower income usually means a lower loan amount at higher interest and a riskier repayment record. Roll Eyes that's called reality. If you had one fact it would lonely. Low income does not equal subprime.", 
        "reply": " Reading comprehension and basic writing skills still a problem for you? I never mention anything about \"subprime\" anything. Lower incomes USUALLY means a lower loan amount (cause they can't affored more)at a higher interest rate and a risker repayment record (because they are at a higher rate of loan defaults). Was that simple enough for you to understand? I tried to use small words so you wouldn't get confused.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:26:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: at a higher interest rate and a risker repayment record Just wrong on so many levels. Interest rates are determined by credit score not income. Being low income does not mean that they have low credit scores. Ah, liberalism at its best, duck the point and obfuscate. A person's income (what they earn) minus the debts(what they owe) is their income to debt ratio (what you earn minus what you owe equals what is left to spend). That determines how much they can borrow from a bank, mortgage company, etc. While interest rates are somewhat determined by a credit score (unless the person can 'buy down' the interest rate), the bank/lending place won't lend more than a person can repay (usually using a 45% debt to income ratio). I bought a house and acreage last year so this is pretty fresh in my mind. Being low income means you don't have much money to spend or repay a loan.", 
        "intTime": 20090322, 
        "postID": 20, 
        "quote": "Originally posted by dmuhler: quote: at a higher interest rate and a risker repayment record Just wrong on so many levels. Interest rates are determined by credit score not income. Being low income does not mean that they have low credit scores.", 
        "reply": " Ah, liberalism at its best, duck the point and obfuscate. A person's income (what they earn) minus the debts(what they owe) is their income to debt ratio (what you earn minus what you owe equals what is left to spend). That determines how much they can borrow from a bank, mortgage company, etc. While interest rates are somewhat determined by a credit score (unless the person can 'buy down' the interest rate), the bank/lending place won't lend more than a person can repay (usually using a 45% debt to income ratio). I bought a house and acreage last year so this is pretty fresh in my mind. Being low income means you don't have much money to spend or repay a loan.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:42:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Interest rates are determined by credit score not income. Certainly a key factor ... but there are others ... among them, ability to buy points and the size of the downpayment.", 
        "intTime": 20090322, 
        "postID": 21, 
        "quote": "Interest rates are determined by credit score not income.", 
        "reply": " Certainly a key factor ... but there are others ... among them, ability to buy points and the size of the downpayment.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:44:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: What you described is redlining. Clearly illegal in the mortgage business. Clearly you have no idea what you're talking about. It is good banking/lending practice to follow the set formula of taking what a person makes, how much they currently owe, seeing how much 'disposable' income they have and using the debt to income ratio in deciding if they are a good lending risk or not. It was going against those sound lending practices that caused the current housing debacle.", 
        "intTime": 20090322, 
        "postID": 22, 
        "quote": "Originally posted by dmuhler: What you described is redlining. Clearly illegal in the mortgage business.", 
        "reply": " Clearly you have no idea what you're talking about. It is good banking/lending practice to follow the set formula of taking what a person makes, how much they currently owe, seeing how much 'disposable' income they have and using the debt to income ratio in deciding if they are a good lending risk or not. It was going against those sound lending practices that caused the current housing debacle.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:52:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million.", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "", 
        "reply": "last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-18 06:41:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "Extremely interesting! Bump", 
        "intTime": 20090322, 
        "postID": 24, 
        "quote": "", 
        "reply": "Extremely interesting! Bump", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 02:58:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\".", 
        "intTime": 20090322, 
        "postID": 25, 
        "quote": "", 
        "reply": "how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\".", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 03:39:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\". Because that is not whats going here. We have small bank, that TURNED A PROFIT last year of 87,000. 87K isn't much compared to the banks operating revenue. And the FED comes down and tells them to make more loans? You agree with the FED? Insanity. I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are buying votes by giving tax money to people who wont or cant pay the money back..and the \"country club members\" the silly morons who pay their bills and work for a living are getting hosed for what? Being responsible?", 
        "intTime": 20090322, 
        "postID": 26, 
        "quote": "Originally posted by karlhungusjr: how do you get \"pushing loans to those who cannot afford them\" from “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,”? why not just make the headline \"FDIC forces bank to not just loan to country club member\".", 
        "reply": " Because that is not whats going here. We have small bank, that TURNED A PROFIT last year of 87,000. 87K isn't much compared to the banks operating revenue. And the FED comes down and tells them to make more loans? You agree with the FED? Insanity. I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are buying votes by giving tax money to people who wont or cant pay the money back..and the \"country club members\" the silly morons who pay their bills and work for a living are getting hosed for what? Being responsible?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 04:07:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Because that is not whats going here. Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals.", 
        "intTime": 20090322, 
        "postID": 27, 
        "quote": "Because that is not whats going here.", 
        "reply": " Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 04:19:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "One needs to read carefully ... and note what the criteria for the evaluation was ... quote: Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "intTime": 20090322, 
        "postID": 28, 
        "quote": "Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act.", 
        "reply": "One needs to read carefully ... and note what the criteria for the evaluation was ...  Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 05:17:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Because that is not whats going here. Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals. The bank is making loans it feels are profitable. In a culture where banks are bleeding money, this one bank is turning a profit.. And the FED steps in and trys to force it to make loans.. The FED does not have to force it to make GOOD loans.. The math escapes you.", 
        "intTime": 20090322, 
        "postID": 29, 
        "quote": "Originally posted by karlhungusjr: quote: Because that is not whats going here. Whats going on here is that the feds think the bank isn't making enough loans. Whats NOT going on here is the feds wanting them to make bad loans to people who won't pay it back. quote: You agree with the FED? Insanity. I said no such thing. Learn to read what is actually wrote. Not what you want someone to say. quote: I love how you equate country club members with people who pay their bills. Cause you're right. That is whats going on here. Liberals are... And with a sonic boom the point goes right over your head. My point was that you pulled the \"they want them to give bad loans!\" was pulled from out your backside since nothing you quoted or said supported your conclusion. And I was pointing out that the exact opposite conclusion could be reached in the same way. but feel free to finish your 2 minutes of hate against the evil liberals.", 
        "reply": " The bank is making loans it feels are profitable. In a culture where banks are bleeding money, this one bank is turning a profit.. And the FED steps in and trys to force it to make loans.. The FED does not have to force it to make GOOD loans.. The math escapes you.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 07:53:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: And the FED steps in and trys to force it to make loans.. you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans.", 
        "intTime": 20090322, 
        "postID": 30, 
        "quote": "And the FED steps in and trys to force it to make loans..", 
        "reply": " you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 08:19:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: And the FED steps in and trys to force it to make loans.. you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans. You understand that the FED's reaction is not that they are NOT lending now?", 
        "intTime": 20090322, 
        "postID": 31, 
        "quote": "Originally posted by karlhungusjr: quote: And the FED steps in and trys to force it to make loans.. you do understand that a major factor in the current crisis is that many banks aren't lending don't you? quote: The FED does not have to force it to make GOOD loans.. yet your first assumption is that they are forcing them to make bad loans.", 
        "reply": " You understand that the FED's reaction is not that they are NOT lending now?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 08:39:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Yet your first assumption is that they are forcing them to make bad loans. What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "intTime": 20090322, 
        "postID": 32, 
        "quote": "Yet your first assumption is that they are forcing them to make bad loans.", 
        "reply": " What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 09:31:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: You understand that the FED's reaction is not that they are NOT lending now? english please. what is that supposed to mean?", 
        "intTime": 20090322, 
        "postID": 33, 
        "quote": "You understand that the FED's reaction is not that they are NOT lending now?", 
        "reply": " english please. what is that supposed to mean?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 10:05:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about. I'm fully aware of what the Community Reinvestment Act is. I'm also fully awar that banks were pushing sub prime mortages and they were pushing those loans to people who they knew wouldn't qualify for a standard mortage. And they did it not because they were coerced. they did it becuase they only had to sell of the loan to the next guy and they still made a nice profit. The Community Reinvestment Act is an excuse. you may as well blame hang nail for a severed leg.", 
        "intTime": 20090322, 
        "postID": 34, 
        "quote": "higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "reply": " I'm fully aware of what the Community Reinvestment Act is. I'm also fully awar that banks were pushing sub prime mortages and they were pushing those loans to people who they knew wouldn't qualify for a standard mortage. And they did it not because they were coerced. they did it becuase they only had to sell of the loan to the next guy and they still made a nice profit. The Community Reinvestment Act is an excuse. you may as well blame hang nail for a severed leg.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 10:10:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: The Community Reinvestment Act is an excuse. Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "intTime": 20090322, 
        "postID": 35, 
        "quote": "The Community Reinvestment Act is an excuse.", 
        "reply": " Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 10:24:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself. everything in moderation. They are not being critized by the FDIC for not giving out sub prime loans for people who cant afford the. they are being critized by the FDIC for(as far as the info points to. but i fully admit i could be wrong) not giving out loans to people who COULD make the payments but may not have absolutly perfect credit. but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\"", 
        "intTime": 20090322, 
        "postID": 36, 
        "quote": "Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "reply": " everything in moderation. They are not being critized by the FDIC for not giving out sub prime loans for people who cant afford the. they are being critized by the FDIC for(as far as the info points to. but i fully admit i could be wrong) not giving out loans to people who COULD make the payments but may not have absolutly perfect credit. but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\"", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 13:15:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\" <sigh> Which brings me back to my initial comment ... quote: Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "intTime": 20090322, 
        "postID": 37, 
        "quote": "but no matter how you cut it, it's not \" FDIC still pushing loans to those who cannot afford them..\"", 
        "reply": " <sigh> Which brings me back to my initial comment ... quote: Though the thread title may be a little off, it isn't off by much ... the OP is generally on target ... the Community Reinvestment Act was passed after intense lobbying by community activists ... and seeks to increase extension of credit in low income (higher risk) neighborhoods.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 14:09:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by threerings: last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million. Hey spinmeister. Where's the part about the FDIC pushing loans to people that to people that can't afford them? I must have missed that sentence.......or you're talking out your azz. Honesty is not your strongest suit is it?", 
        "intTime": 20090322, 
        "postID": 38, 
        "quote": "Originally posted by threerings: last time I checked..dem controlled both the house and senate..and the white house, yes? +++http://boston.bizjournals.com/boston/stories/2009/03/16/story3.html?b=1237176000^1793570&page=1 Joseph A. Petrucelli is one of the most cautious bankers in America. In fact, Petrucelli is so cautious that the Federal Deposit Insurance Corp. recently criticized his bank for not lending enough. The FDIC’s negative review of East Bridgewater Savings Bank’s loan volume is an anomaly in today’s current banking scene as lenders reel from their role in offering too many cruddy mortgage products to borrowers with weak credit. Still, the FDIC slapped East Bridgewater Savings with a rare “needs to improve” rating after evaluating the bank under the Community Reinvestment Act. From late 2003 through mid-2008, East Bridgewater Savings averaged 28 cents in loans for every dollar in deposit. The average loan-to-deposit ratio among similar size savings banks is more than 90 percent, FDIC data show. “There are no apparent financial or legal impediments that would limit the bank’s ability to help meet the credit needs of its assessment area,” the FDIC said in its CRA evaluation. FDIC examiners also faulted East Bridgewater for not advertising and marketing its loan products enough. The bank, which does not have a Web site, offers fixed-rate mortgages. But Petrucelli and his bank occupy the other end of the spectrum in an industry that lost $26.2 billion in the fourth quarter. Even the FDIC’s own deposit insurance fund is in bad need of a boost after paying for an upswing in bank failures. And then there’s East Bridgewater Savings. Bad or delinquent loans? Zero. Foreclosures? None. Money set aside in 2008 for anticipated loan losses? Nothing. “We’re paranoid about credit quality,” Petrucelli said. The 62-year-old chief executive has run the bank since 1992. The negative CRA rating, he said, caught him by surprise. The bank received “satisfactory” CRA ratings from the FDIC in 2003 and from the Massachusetts Division of Banks in early 2006. East Bridgewater Savings ended 2008 with $135 million in assets and deposits of $84 million. The bank even squeaked out a profit of $87,000. And its Tier 1 risk-based capital ratio was 31.6 percent, or more than three times higher than many community banks in Massachusetts. But in the eyes of regulators, East Bridgewater Savings looks stingy. Its net loans and leases equaled 21 percent of assets. That compared with 72 percent among 385 savings banks across the country with assets between $100 million and $300 million.", 
        "reply": " Hey spinmeister. Where's the part about the FDIC pushing loans to people that to people that can't afford them? I must have missed that sentence.......or you're talking out your azz. Honesty is not your strongest suit is it?", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 15:01:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Yet your first assumption is that they are forcing them to make bad loans. What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about. Horsesh it. Where's your credible evidence to support that pile of bile? Here's a tip. Get a clue.", 
        "intTime": 20090322, 
        "postID": 39, 
        "quote": "Originally posted by I_M_Qwerty: quote: Yet your first assumption is that they are forcing them to make bad loans. What they are attempting to do is coerce the bank into making more higher risk loans in poor neighborhoods. That's what the Community Reinvestment Act that helped get us into our current economic mess is all about.", 
        "reply": " Horsesh it. Where's your credible evidence to support that pile of bile? Here's a tip. Get a clue.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 15:03:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "WepsFP"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: The Community Reinvestment Act is an excuse. Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself. This bank is following the rules like most Credit Unions and only making loans to people with a credible loan to debt ratio so people who want to borrow a set dollar amount can actually afford that set dollar amount. Its the way all responsible banks used to make loans. And yes, to answer the question by another poster, lower income usually means a lower loan amount at higher interest and a riskier repayment record. that's called reality.", 
        "intTime": 20090322, 
        "postID": 40, 
        "quote": "Originally posted by I_M_Qwerty: quote: The Community Reinvestment Act is an excuse. Yep ... and the bank under discussion didn't go down that road ... and is now being criticized by the FDIC for it. Fortunately there is little the FDIC can do about it. The bank's balance sheet speaks for itself.", 
        "reply": " This bank is following the rules like most Credit Unions and only making loans to people with a credible loan to debt ratio so people who want to borrow a set dollar amount can actually afford that set dollar amount. Its the way all responsible banks used to make loans. And yes, to answer the question by another poster, lower income usually means a lower loan amount at higher interest and a riskier repayment record. that's called reality.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 15:44:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: lower income usually means a lower loan amount at higher interest and a riskier repayment record. Roll Eyes that's called reality. If you had one fact it would lonely. Low income does not equal subprime. Reading comprehension and basic writing skills still a problem for you? I never mention anything about \"subprime\" anything. Lower incomes USUALLY means a lower loan amount (cause they can't affored more)at a higher interest rate and a risker repayment record (because they are at a higher rate of loan defaults). Was that simple enough for you to understand? I tried to use small words so you wouldn't get confused.", 
        "intTime": 20090322, 
        "postID": 41, 
        "quote": "Originally posted by dmuhler: quote: lower income usually means a lower loan amount at higher interest and a riskier repayment record. Roll Eyes that's called reality. If you had one fact it would lonely. Low income does not equal subprime.", 
        "reply": " Reading comprehension and basic writing skills still a problem for you? I never mention anything about \"subprime\" anything. Lower incomes USUALLY means a lower loan amount (cause they can't affored more)at a higher interest rate and a risker repayment record (because they are at a higher rate of loan defaults). Was that simple enough for you to understand? I tried to use small words so you wouldn't get confused.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:26:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: quote: at a higher interest rate and a risker repayment record Just wrong on so many levels. Interest rates are determined by credit score not income. Being low income does not mean that they have low credit scores. Ah, liberalism at its best, duck the point and obfuscate. A person's income (what they earn) minus the debts(what they owe) is their income to debt ratio (what you earn minus what you owe equals what is left to spend). That determines how much they can borrow from a bank, mortgage company, etc. While interest rates are somewhat determined by a credit score (unless the person can 'buy down' the interest rate), the bank/lending place won't lend more than a person can repay (usually using a 45% debt to income ratio). I bought a house and acreage last year so this is pretty fresh in my mind. Being low income means you don't have much money to spend or repay a loan.", 
        "intTime": 20090322, 
        "postID": 42, 
        "quote": "Originally posted by dmuhler: quote: at a higher interest rate and a risker repayment record Just wrong on so many levels. Interest rates are determined by credit score not income. Being low income does not mean that they have low credit scores.", 
        "reply": " Ah, liberalism at its best, duck the point and obfuscate. A person's income (what they earn) minus the debts(what they owe) is their income to debt ratio (what you earn minus what you owe equals what is left to spend). That determines how much they can borrow from a bank, mortgage company, etc. While interest rates are somewhat determined by a credit score (unless the person can 'buy down' the interest rate), the bank/lending place won't lend more than a person can repay (usually using a 45% debt to income ratio). I bought a house and acreage last year so this is pretty fresh in my mind. Being low income means you don't have much money to spend or repay a loan.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:42:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }, 
    {
        "content": "quote: Interest rates are determined by credit score not income. Certainly a key factor ... but there are others ... among them, ability to buy points and the size of the downpayment.", 
        "intTime": 20090322, 
        "postID": 43, 
        "quote": "Interest rates are determined by credit score not income.", 
        "reply": " Certainly a key factor ... but there are others ... among them, ability to buy points and the size of the downpayment.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:44:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by dmuhler: What you described is redlining. Clearly illegal in the mortgage business. Clearly you have no idea what you're talking about. It is good banking/lending practice to follow the set formula of taking what a person makes, how much they currently owe, seeing how much 'disposable' income they have and using the debt to income ratio in deciding if they are a good lending risk or not. It was going against those sound lending practices that caused the current housing debacle.", 
        "intTime": 20090322, 
        "postID": 44, 
        "quote": "Originally posted by dmuhler: What you described is redlining. Clearly illegal in the mortgage business.", 
        "reply": " Clearly you have no idea what you're talking about. It is good banking/lending practice to follow the set formula of taking what a person makes, how much they currently owe, seeing how much 'disposable' income they have and using the debt to income ratio in deciding if they are a good lending risk or not. It was going against those sound lending practices that caused the current housing debacle.", 
        "threadID": "409192893_8250091812001", 
        "time": "2009-03-22 16:52:00", 
        "title": "FDIC still pushing loans to those who cannot afford them..", 
        "userID": "Mom2APAJ"
    }
]