[
    {
        "content": "Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 03:28:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? creationists, why are they allowed?", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "", 
        "reply": "robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? creationists, why are they allowed?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 03:55:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? xxxxxxxxx, why are they allowed? what mostly they are not, mostly they get caught and punished. mostly, but not because of lack of desire to catch them, sometimes they walk and if you do not like god that is your problem", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "Originally posted by karlhungusjr: robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? xxxxxxxxx, why are they allowed?", 
        "reply": " what mostly they are not, mostly they get caught and punished. mostly, but not because of lack of desire to catch them, sometimes they walk and if you do not like god that is your problem", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 04:21:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: mostly they get caught and punished. mostly they don't. That's why we've had a \"war on drugs\" and crime for a long long time now. whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "intTime": 20090414, 
        "postID": 4, 
        "quote": "mostly they get caught and punished.", 
        "reply": " mostly they don't. That's why we've had a \"war on drugs\" and crime for a long long time now. whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 04:40:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: is it profitable enough to risk your life ove up to now no somalia lives lost up to now", 
        "intTime": 20090414, 
        "postID": 5, 
        "quote": "is it profitable enough to risk your life ove", 
        "reply": " up to now no somalia lives lost up to now", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:08:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "intTime": 20090414, 
        "postID": 6, 
        "quote": "Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "reply": " They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:35:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "intTime": 20090414, 
        "postID": 7, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "reply": " right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:49:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right?? That's not true! They are \"borrowing\" them, and will give them back when they are done!", 
        "intTime": 20090414, 
        "postID": 8, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "reply": " That's not true! They are \"borrowing\" them, and will give them back when they are done!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:53:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "No blood for cargo!", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "", 
        "reply": "No blood for cargo!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:54:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "\"I lift my light to the golden door.\" And if they keep this chit up, I'm gonna light their azzes up with this lamp and laugh my own azz off, while they run around trying to put out the fire before their hair goes up with it!!!!!", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "", 
        "reply": "\"I lift my light to the golden door.\" And if they keep this chit up, I'm gonna light their azzes up with this lamp and laugh my own azz off, while they run around trying to put out the fire before their hair goes up with it!!!!!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 06:28:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: No blood for cargo! John Frum will bring more!!", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by bill_kananen: No blood for cargo!", 
        "reply": " John Frum will bring more!!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 07:09:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "quote: whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk. You are exactly right...it is currently worth the risk. So the solution is to not make the prospect of piracy worth the risk. How do we do this? Simply arm the merchant ships with trained crewmembers who will blow the begezzers out of any sorry little boat that comes roaring full of armed men. No navies needed, no SEALS, no ransoms...after a few dozen (or more) dead pirates wash up on the shore of their homeland, this site should end amke others think twice before learning all the words to: \"Yo Ho Yo Ho a pirates life for me!\"", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "reply": " You are exactly right...it is currently worth the risk. So the solution is to not make the prospect of piracy worth the risk. How do we do this? Simply arm the merchant ships with trained crewmembers who will blow the begezzers out of any sorry little boat that comes roaring full of armed men. No navies needed, no SEALS, no ransoms...after a few dozen (or more) dead pirates wash up on the shore of their homeland, this site should end amke others think twice before learning all the words to: \"Yo Ho Yo Ho a pirates life for me!\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 07:44:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "beatleh60"
    }, 
    {
        "content": "Piracy is as old as seagoing cargo. The issue isn't confined to Somolia, it's active in Polonesia, Micronesia, the Carribean and several other areas around the world. Wherever there is seagoing cargo and sympathetic port for disposing of the cargo, you'll have the problem. If the Somalis are more emboldened than others, it is because they KNOW the West will not intervene on the ground, since the last time they did, it failed miserably. Fighting piracy on the high seas is a poor method - akin to swatting flies instead of simply burying the rotting carcass they're coming from. The real 'solution' would be to impose a blockade on the Somali ports or capture them outright. An expensive and prohibitive measure, therefore we're stuck fighting them in a less than ideal manner. Sullivan013", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "", 
        "reply": "Piracy is as old as seagoing cargo. The issue isn't confined to Somolia, it's active in Polonesia, Micronesia, the Carribean and several other areas around the world. Wherever there is seagoing cargo and sympathetic port for disposing of the cargo, you'll have the problem. If the Somalis are more emboldened than others, it is because they KNOW the West will not intervene on the ground, since the last time they did, it failed miserably. Fighting piracy on the high seas is a poor method - akin to swatting flies instead of simply burying the rotting carcass they're coming from. The real 'solution' would be to impose a blockade on the Somali ports or capture them outright. An expensive and prohibitive measure, therefore we're stuck fighting them in a less than ideal manner. Sullivan013", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:01:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "sullivan013"
    }, 
    {
        "content": "First, the shipping companies and their insurers enable the piracy. Second, arming merchants is frowned upon by insurers, who see the loss of a couple million bucks preferable to a major fire on board a ship, causing the loss of ship and cargo (not to mention wrongful death suits of some sort, somewhere) Third, have you seen the size of the area we're talking about? The water off the coast of Somalia is freaking HUGE! This isn't like stopping piracy in the Chesapeake Bay. It's more like stopping piracy in the North Atlantic Ocean. Fourth, there is no effective government in Somalia. It is lawless. The fight against the Barbary pirates was a demi-war against nation states. The fight against the current Somali pirates is much more similar to a fight against terrorists, where the enemy is not clearly defined, and melts easily into a native population where positioning intelligence assets can be challenging. Give it some time. It is not so cut and dried as some of you seem to think it is. This is a pretty complicated problem with no simple solution. The only long term solution is a fully functioning government in the region around the horn, but that will take a lot of time, as well as money that we don't seem to have. How many of you would freak out and shriek bloody murder if we sent aid to Somalia in the intersts of furthering economic development so privacy is no longer a valued option?", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "", 
        "reply": "First, the shipping companies and their insurers enable the piracy. Second, arming merchants is frowned upon by insurers, who see the loss of a couple million bucks preferable to a major fire on board a ship, causing the loss of ship and cargo (not to mention wrongful death suits of some sort, somewhere) Third, have you seen the size of the area we're talking about? The water off the coast of Somalia is freaking HUGE! This isn't like stopping piracy in the Chesapeake Bay. It's more like stopping piracy in the North Atlantic Ocean. Fourth, there is no effective government in Somalia. It is lawless. The fight against the Barbary pirates was a demi-war against nation states. The fight against the current Somali pirates is much more similar to a fight against terrorists, where the enemy is not clearly defined, and melts easily into a native population where positioning intelligence assets can be challenging. Give it some time. It is not so cut and dried as some of you seem to think it is. This is a pretty complicated problem with no simple solution. The only long term solution is a fully functioning government in the region around the horn, but that will take a lot of time, as well as money that we don't seem to have. How many of you would freak out and shriek bloody murder if we sent aid to Somalia in the intersts of furthering economic development so privacy is no longer a valued option?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:17:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "NO BLOOD FOR CARGO! Barry is making secret agreements with the shipping companies and the insurance companies. Just wait and see. There will be military actions so the shipping companies can make huge profits and the insurance companies can save a lot of money. Don't forget the insurance companies don't have to pay off if there is an act of war involved. Why do innocent people have to die for cargo?", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "", 
        "reply": "NO BLOOD FOR CARGO! Barry is making secret agreements with the shipping companies and the insurance companies. Just wait and see. There will be military actions so the shipping companies can make huge profits and the insurance companies can save a lot of money. Don't forget the insurance companies don't have to pay off if there is an act of war involved. Why do innocent people have to die for cargo?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:34:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "", 
        "reply": "I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:51:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "anoldnotboldrecondo"
    }, 
    {
        "content": "quote: Originally posted by anoldnotboldrecondo: I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea. hey, this is not WWII there will not be armed merchantmen in convoy, no crew served weapons on liberty ships, this aint gonna happen. most of the 'sailors' dont even speak a common language, the latest ship taken was greek with philipine crew, ya think the philipinos are gonna shoot at somalias, hell they would shoot each other this nonsense about arming merchant shipping is not going to happen have to blockade the whole country, many of these small boats launched from the beach. heck the surf in gulf is like the 'surf in chesapeak bay' there aint any forget armed crewmen now some f-18s taking out the mother ships, and taking out skinny somalias is another thing, heck the north blockaded the whole coast of the southeast usa in civil war with sailing vessels", 
        "intTime": 20090414, 
        "postID": 17, 
        "quote": "Originally posted by anoldnotboldrecondo: I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "reply": " hey, this is not WWII there will not be armed merchantmen in convoy, no crew served weapons on liberty ships, this aint gonna happen. most of the 'sailors' dont even speak a common language, the latest ship taken was greek with philipine crew, ya think the philipinos are gonna shoot at somalias, hell they would shoot each other this nonsense about arming merchant shipping is not going to happen have to blockade the whole country, many of these small boats launched from the beach. heck the surf in gulf is like the 'surf in chesapeak bay' there aint any forget armed crewmen now some f-18s taking out the mother ships, and taking out skinny somalias is another thing, heck the north blockaded the whole coast of the southeast usa in civil war with sailing vessels", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 09:01:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "It seems silly to accuse officials of \"secret\" conspiracies. If it were so secret, we wouldn't be able to accuse them of it. It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. \"See? These folks are so good that they cover their tracks...but I know what they're up to!\"", 
        "intTime": 20090414, 
        "postID": 18, 
        "quote": "", 
        "reply": "It seems silly to accuse officials of \"secret\" conspiracies. If it were so secret, we wouldn't be able to accuse them of it. It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. \"See? These folks are so good that they cover their tracks...but I know what they're up to!\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 11:34:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "These Pirates originally started out as coast gaurds, legal and all.. They were their to stop forieghn vessels from taking their fish. Then it morphed into piracy. Very lucrative for them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "", 
        "reply": "These Pirates originally started out as coast gaurds, legal and all.. They were their to stop forieghn vessels from taking their fish. Then it morphed into piracy. Very lucrative for them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 12:38:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. NO BLOOD FOR CARGO! Innocent Somalis don't need to die for cargo.", 
        "intTime": 20090414, 
        "postID": 20, 
        "quote": "Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself.", 
        "reply": " I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. NO BLOOD FOR CARGO! Innocent Somalis don't need to die for cargo.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 12:49:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. What's funny is that I agree with that statement, and voted for Senator McCain. That doesn't really reduce my skepticism about dark dealings in the shadows, though. Do you really think the administrators in the Democrat party are efficient enough to keep that a secret? They couldn't even cover up a blow job.", 
        "intTime": 20090414, 
        "postID": 21, 
        "quote": "Originally posted by bill_kananen: quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough.", 
        "reply": " What's funny is that I agree with that statement, and voted for Senator McCain. That doesn't really reduce my skepticism about dark dealings in the shadows, though. Do you really think the administrators in the Democrat party are efficient enough to keep that a secret? They couldn't even cover up a blow job.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:07:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "intTime": 20090414, 
        "postID": 22, 
        "quote": "blow job.", 
        "reply": " JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY Who would you rather face, the American People, or Hillary Clinton?", 
        "intTime": 20090414, 
        "postID": 23, 
        "quote": "Originally posted by Ira1945: quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "reply": " Who would you rather face, the American People, or Hillary Clinton?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "intTime": 20090414, 
        "postID": 24, 
        "quote": "", 
        "reply": "Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 03:28:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? creationists, why are they allowed?", 
        "intTime": 20090414, 
        "postID": 25, 
        "quote": "", 
        "reply": "robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? creationists, why are they allowed?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 03:55:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? xxxxxxxxx, why are they allowed? what mostly they are not, mostly they get caught and punished. mostly, but not because of lack of desire to catch them, sometimes they walk and if you do not like god that is your problem", 
        "intTime": 20090414, 
        "postID": 26, 
        "quote": "Originally posted by karlhungusjr: robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? xxxxxxxxx, why are they allowed?", 
        "reply": " what mostly they are not, mostly they get caught and punished. mostly, but not because of lack of desire to catch them, sometimes they walk and if you do not like god that is your problem", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 04:21:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: mostly they get caught and punished. mostly they don't. That's why we've had a \"war on drugs\" and crime for a long long time now. whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "intTime": 20090414, 
        "postID": 27, 
        "quote": "mostly they get caught and punished.", 
        "reply": " mostly they don't. That's why we've had a \"war on drugs\" and crime for a long long time now. whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 04:40:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: is it profitable enough to risk your life ove up to now no somalia lives lost up to now", 
        "intTime": 20090414, 
        "postID": 28, 
        "quote": "is it profitable enough to risk your life ove", 
        "reply": " up to now no somalia lives lost up to now", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:08:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "intTime": 20090414, 
        "postID": 29, 
        "quote": "Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "reply": " They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:35:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "intTime": 20090414, 
        "postID": 30, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "reply": " right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:49:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right?? That's not true! They are \"borrowing\" them, and will give them back when they are done!", 
        "intTime": 20090414, 
        "postID": 31, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "reply": " That's not true! They are \"borrowing\" them, and will give them back when they are done!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:53:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "No blood for cargo!", 
        "intTime": 20090414, 
        "postID": 32, 
        "quote": "", 
        "reply": "No blood for cargo!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:54:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "\"I lift my light to the golden door.\" And if they keep this chit up, I'm gonna light their azzes up with this lamp and laugh my own azz off, while they run around trying to put out the fire before their hair goes up with it!!!!!", 
        "intTime": 20090414, 
        "postID": 33, 
        "quote": "", 
        "reply": "\"I lift my light to the golden door.\" And if they keep this chit up, I'm gonna light their azzes up with this lamp and laugh my own azz off, while they run around trying to put out the fire before their hair goes up with it!!!!!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 06:28:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: No blood for cargo! John Frum will bring more!!", 
        "intTime": 20090414, 
        "postID": 34, 
        "quote": "Originally posted by bill_kananen: No blood for cargo!", 
        "reply": " John Frum will bring more!!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 07:09:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "quote: whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk. You are exactly right...it is currently worth the risk. So the solution is to not make the prospect of piracy worth the risk. How do we do this? Simply arm the merchant ships with trained crewmembers who will blow the begezzers out of any sorry little boat that comes roaring full of armed men. No navies needed, no SEALS, no ransoms...after a few dozen (or more) dead pirates wash up on the shore of their homeland, this site should end amke others think twice before learning all the words to: \"Yo Ho Yo Ho a pirates life for me!\"", 
        "intTime": 20090414, 
        "postID": 35, 
        "quote": "whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "reply": " You are exactly right...it is currently worth the risk. So the solution is to not make the prospect of piracy worth the risk. How do we do this? Simply arm the merchant ships with trained crewmembers who will blow the begezzers out of any sorry little boat that comes roaring full of armed men. No navies needed, no SEALS, no ransoms...after a few dozen (or more) dead pirates wash up on the shore of their homeland, this site should end amke others think twice before learning all the words to: \"Yo Ho Yo Ho a pirates life for me!\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 07:44:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "beatleh60"
    }, 
    {
        "content": "Piracy is as old as seagoing cargo. The issue isn't confined to Somolia, it's active in Polonesia, Micronesia, the Carribean and several other areas around the world. Wherever there is seagoing cargo and sympathetic port for disposing of the cargo, you'll have the problem. If the Somalis are more emboldened than others, it is because they KNOW the West will not intervene on the ground, since the last time they did, it failed miserably. Fighting piracy on the high seas is a poor method - akin to swatting flies instead of simply burying the rotting carcass they're coming from. The real 'solution' would be to impose a blockade on the Somali ports or capture them outright. An expensive and prohibitive measure, therefore we're stuck fighting them in a less than ideal manner. Sullivan013", 
        "intTime": 20090414, 
        "postID": 36, 
        "quote": "", 
        "reply": "Piracy is as old as seagoing cargo. The issue isn't confined to Somolia, it's active in Polonesia, Micronesia, the Carribean and several other areas around the world. Wherever there is seagoing cargo and sympathetic port for disposing of the cargo, you'll have the problem. If the Somalis are more emboldened than others, it is because they KNOW the West will not intervene on the ground, since the last time they did, it failed miserably. Fighting piracy on the high seas is a poor method - akin to swatting flies instead of simply burying the rotting carcass they're coming from. The real 'solution' would be to impose a blockade on the Somali ports or capture them outright. An expensive and prohibitive measure, therefore we're stuck fighting them in a less than ideal manner. Sullivan013", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:01:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "sullivan013"
    }, 
    {
        "content": "First, the shipping companies and their insurers enable the piracy. Second, arming merchants is frowned upon by insurers, who see the loss of a couple million bucks preferable to a major fire on board a ship, causing the loss of ship and cargo (not to mention wrongful death suits of some sort, somewhere) Third, have you seen the size of the area we're talking about? The water off the coast of Somalia is freaking HUGE! This isn't like stopping piracy in the Chesapeake Bay. It's more like stopping piracy in the North Atlantic Ocean. Fourth, there is no effective government in Somalia. It is lawless. The fight against the Barbary pirates was a demi-war against nation states. The fight against the current Somali pirates is much more similar to a fight against terrorists, where the enemy is not clearly defined, and melts easily into a native population where positioning intelligence assets can be challenging. Give it some time. It is not so cut and dried as some of you seem to think it is. This is a pretty complicated problem with no simple solution. The only long term solution is a fully functioning government in the region around the horn, but that will take a lot of time, as well as money that we don't seem to have. How many of you would freak out and shriek bloody murder if we sent aid to Somalia in the intersts of furthering economic development so privacy is no longer a valued option?", 
        "intTime": 20090414, 
        "postID": 37, 
        "quote": "", 
        "reply": "First, the shipping companies and their insurers enable the piracy. Second, arming merchants is frowned upon by insurers, who see the loss of a couple million bucks preferable to a major fire on board a ship, causing the loss of ship and cargo (not to mention wrongful death suits of some sort, somewhere) Third, have you seen the size of the area we're talking about? The water off the coast of Somalia is freaking HUGE! This isn't like stopping piracy in the Chesapeake Bay. It's more like stopping piracy in the North Atlantic Ocean. Fourth, there is no effective government in Somalia. It is lawless. The fight against the Barbary pirates was a demi-war against nation states. The fight against the current Somali pirates is much more similar to a fight against terrorists, where the enemy is not clearly defined, and melts easily into a native population where positioning intelligence assets can be challenging. Give it some time. It is not so cut and dried as some of you seem to think it is. This is a pretty complicated problem with no simple solution. The only long term solution is a fully functioning government in the region around the horn, but that will take a lot of time, as well as money that we don't seem to have. How many of you would freak out and shriek bloody murder if we sent aid to Somalia in the intersts of furthering economic development so privacy is no longer a valued option?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:17:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "NO BLOOD FOR CARGO! Barry is making secret agreements with the shipping companies and the insurance companies. Just wait and see. There will be military actions so the shipping companies can make huge profits and the insurance companies can save a lot of money. Don't forget the insurance companies don't have to pay off if there is an act of war involved. Why do innocent people have to die for cargo?", 
        "intTime": 20090414, 
        "postID": 38, 
        "quote": "", 
        "reply": "NO BLOOD FOR CARGO! Barry is making secret agreements with the shipping companies and the insurance companies. Just wait and see. There will be military actions so the shipping companies can make huge profits and the insurance companies can save a lot of money. Don't forget the insurance companies don't have to pay off if there is an act of war involved. Why do innocent people have to die for cargo?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:34:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "intTime": 20090414, 
        "postID": 39, 
        "quote": "", 
        "reply": "I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:51:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "anoldnotboldrecondo"
    }, 
    {
        "content": "quote: Originally posted by anoldnotboldrecondo: I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea. hey, this is not WWII there will not be armed merchantmen in convoy, no crew served weapons on liberty ships, this aint gonna happen. most of the 'sailors' dont even speak a common language, the latest ship taken was greek with philipine crew, ya think the philipinos are gonna shoot at somalias, hell they would shoot each other this nonsense about arming merchant shipping is not going to happen have to blockade the whole country, many of these small boats launched from the beach. heck the surf in gulf is like the 'surf in chesapeak bay' there aint any forget armed crewmen now some f-18s taking out the mother ships, and taking out skinny somalias is another thing, heck the north blockaded the whole coast of the southeast usa in civil war with sailing vessels", 
        "intTime": 20090414, 
        "postID": 40, 
        "quote": "Originally posted by anoldnotboldrecondo: I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "reply": " hey, this is not WWII there will not be armed merchantmen in convoy, no crew served weapons on liberty ships, this aint gonna happen. most of the 'sailors' dont even speak a common language, the latest ship taken was greek with philipine crew, ya think the philipinos are gonna shoot at somalias, hell they would shoot each other this nonsense about arming merchant shipping is not going to happen have to blockade the whole country, many of these small boats launched from the beach. heck the surf in gulf is like the 'surf in chesapeak bay' there aint any forget armed crewmen now some f-18s taking out the mother ships, and taking out skinny somalias is another thing, heck the north blockaded the whole coast of the southeast usa in civil war with sailing vessels", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 09:01:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "It seems silly to accuse officials of \"secret\" conspiracies. If it were so secret, we wouldn't be able to accuse them of it. It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. \"See? These folks are so good that they cover their tracks...but I know what they're up to!\"", 
        "intTime": 20090414, 
        "postID": 41, 
        "quote": "", 
        "reply": "It seems silly to accuse officials of \"secret\" conspiracies. If it were so secret, we wouldn't be able to accuse them of it. It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. \"See? These folks are so good that they cover their tracks...but I know what they're up to!\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 11:34:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "These Pirates originally started out as coast gaurds, legal and all.. They were their to stop forieghn vessels from taking their fish. Then it morphed into piracy. Very lucrative for them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090414, 
        "postID": 42, 
        "quote": "", 
        "reply": "These Pirates originally started out as coast gaurds, legal and all.. They were their to stop forieghn vessels from taking their fish. Then it morphed into piracy. Very lucrative for them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 12:38:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. NO BLOOD FOR CARGO! Innocent Somalis don't need to die for cargo.", 
        "intTime": 20090414, 
        "postID": 43, 
        "quote": "Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself.", 
        "reply": " I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. NO BLOOD FOR CARGO! Innocent Somalis don't need to die for cargo.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 12:49:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. What's funny is that I agree with that statement, and voted for Senator McCain. That doesn't really reduce my skepticism about dark dealings in the shadows, though. Do you really think the administrators in the Democrat party are efficient enough to keep that a secret? They couldn't even cover up a blow job.", 
        "intTime": 20090414, 
        "postID": 44, 
        "quote": "Originally posted by bill_kananen: quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough.", 
        "reply": " What's funny is that I agree with that statement, and voted for Senator McCain. That doesn't really reduce my skepticism about dark dealings in the shadows, though. Do you really think the administrators in the Democrat party are efficient enough to keep that a secret? They couldn't even cover up a blow job.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:07:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "intTime": 20090414, 
        "postID": 45, 
        "quote": "blow job.", 
        "reply": " JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY Who would you rather face, the American People, or Hillary Clinton?", 
        "intTime": 20090414, 
        "postID": 46, 
        "quote": "Originally posted by Ira1945: quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "reply": " Who would you rather face, the American People, or Hillary Clinton?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "intTime": 20090414, 
        "postID": 47, 
        "quote": "", 
        "reply": "Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 03:28:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? creationists, why are they allowed?", 
        "intTime": 20090414, 
        "postID": 48, 
        "quote": "", 
        "reply": "robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? creationists, why are they allowed?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 03:55:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? xxxxxxxxx, why are they allowed? what mostly they are not, mostly they get caught and punished. mostly, but not because of lack of desire to catch them, sometimes they walk and if you do not like god that is your problem", 
        "intTime": 20090414, 
        "postID": 49, 
        "quote": "Originally posted by karlhungusjr: robbers, why are they allowed? rapists, why are they allowed? murderers, why are they allowed? AIG execs, why are they allowed? xxxxxxxxx, why are they allowed?", 
        "reply": " what mostly they are not, mostly they get caught and punished. mostly, but not because of lack of desire to catch them, sometimes they walk and if you do not like god that is your problem", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 04:21:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: mostly they get caught and punished. mostly they don't. That's why we've had a \"war on drugs\" and crime for a long long time now. whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "intTime": 20090414, 
        "postID": 50, 
        "quote": "mostly they get caught and punished.", 
        "reply": " mostly they don't. That's why we've had a \"war on drugs\" and crime for a long long time now. whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 04:40:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: is it profitable enough to risk your life ove up to now no somalia lives lost up to now", 
        "intTime": 20090414, 
        "postID": 51, 
        "quote": "is it profitable enough to risk your life ove", 
        "reply": " up to now no somalia lives lost up to now", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:08:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "intTime": 20090414, 
        "postID": 52, 
        "quote": "Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up?", 
        "reply": " They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:35:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "intTime": 20090414, 
        "postID": 53, 
        "quote": "Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\"", 
        "reply": " right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:49:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right?? That's not true! They are \"borrowing\" them, and will give them back when they are done!", 
        "intTime": 20090414, 
        "postID": 54, 
        "quote": "Originally posted by Ira1945: quote: Originally posted by EspritDeCorps: quote: Originally posted by Ira1945: Ye Gods and Little Fishes, this is 2009, not 1804 A bunch of thugs in a country that is pure pandimonia at best. The world can not isolate this turd country, can not say enough is enough. a bunch of terrorist pirates (Blackbeard and Morgan would be rolling in laughter at these yahoos) rule a million sq miles of ocean? Cost of doing business? Whats the deal or is it going to be like every other chit detail USA will have to clean it up? They have Constitutional rights! Life, Liberty, and the Pursuit of Booty! These people are no different that the poor people unjustly locked up in Gitmo. They have a Constitutional right to a fair trial in US court. If you feel their trade is unexceptable then we should educate them and give them a decent place to live and access to good paying jobs. \"Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore. Send these, the homeless, tempest-tossed, to me: I lift my lamp beside the golden door.\" right now, Somalia four**** world zero they took two egyptian fishing vessels they took a british flagged tug they took a greek freighter all in last few hours fug the world right??", 
        "reply": " That's not true! They are \"borrowing\" them, and will give them back when they are done!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:53:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "No blood for cargo!", 
        "intTime": 20090414, 
        "postID": 55, 
        "quote": "", 
        "reply": "No blood for cargo!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 05:54:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "\"I lift my light to the golden door.\" And if they keep this chit up, I'm gonna light their azzes up with this lamp and laugh my own azz off, while they run around trying to put out the fire before their hair goes up with it!!!!!", 
        "intTime": 20090414, 
        "postID": 56, 
        "quote": "", 
        "reply": "\"I lift my light to the golden door.\" And if they keep this chit up, I'm gonna light their azzes up with this lamp and laugh my own azz off, while they run around trying to put out the fire before their hair goes up with it!!!!!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 06:28:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: No blood for cargo! John Frum will bring more!!", 
        "intTime": 20090414, 
        "postID": 57, 
        "quote": "Originally posted by bill_kananen: No blood for cargo!", 
        "reply": " John Frum will bring more!!", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 07:09:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "quote: whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk. You are exactly right...it is currently worth the risk. So the solution is to not make the prospect of piracy worth the risk. How do we do this? Simply arm the merchant ships with trained crewmembers who will blow the begezzers out of any sorry little boat that comes roaring full of armed men. No navies needed, no SEALS, no ransoms...after a few dozen (or more) dead pirates wash up on the shore of their homeland, this site should end amke others think twice before learning all the words to: \"Yo Ho Yo Ho a pirates life for me!\"", 
        "intTime": 20090414, 
        "postID": 58, 
        "quote": "whether its drugs or robbery or piracy, it's not a question of us \"allowing\" it. It a question of \"is it profitable enough to risk your life over\". And right now for many in Somalia the answer is yes. it's profitable enough to take the risk.", 
        "reply": " You are exactly right...it is currently worth the risk. So the solution is to not make the prospect of piracy worth the risk. How do we do this? Simply arm the merchant ships with trained crewmembers who will blow the begezzers out of any sorry little boat that comes roaring full of armed men. No navies needed, no SEALS, no ransoms...after a few dozen (or more) dead pirates wash up on the shore of their homeland, this site should end amke others think twice before learning all the words to: \"Yo Ho Yo Ho a pirates life for me!\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 07:44:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "beatleh60"
    }, 
    {
        "content": "Piracy is as old as seagoing cargo. The issue isn't confined to Somolia, it's active in Polonesia, Micronesia, the Carribean and several other areas around the world. Wherever there is seagoing cargo and sympathetic port for disposing of the cargo, you'll have the problem. If the Somalis are more emboldened than others, it is because they KNOW the West will not intervene on the ground, since the last time they did, it failed miserably. Fighting piracy on the high seas is a poor method - akin to swatting flies instead of simply burying the rotting carcass they're coming from. The real 'solution' would be to impose a blockade on the Somali ports or capture them outright. An expensive and prohibitive measure, therefore we're stuck fighting them in a less than ideal manner. Sullivan013", 
        "intTime": 20090414, 
        "postID": 59, 
        "quote": "", 
        "reply": "Piracy is as old as seagoing cargo. The issue isn't confined to Somolia, it's active in Polonesia, Micronesia, the Carribean and several other areas around the world. Wherever there is seagoing cargo and sympathetic port for disposing of the cargo, you'll have the problem. If the Somalis are more emboldened than others, it is because they KNOW the West will not intervene on the ground, since the last time they did, it failed miserably. Fighting piracy on the high seas is a poor method - akin to swatting flies instead of simply burying the rotting carcass they're coming from. The real 'solution' would be to impose a blockade on the Somali ports or capture them outright. An expensive and prohibitive measure, therefore we're stuck fighting them in a less than ideal manner. Sullivan013", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:01:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "sullivan013"
    }, 
    {
        "content": "First, the shipping companies and their insurers enable the piracy. Second, arming merchants is frowned upon by insurers, who see the loss of a couple million bucks preferable to a major fire on board a ship, causing the loss of ship and cargo (not to mention wrongful death suits of some sort, somewhere) Third, have you seen the size of the area we're talking about? The water off the coast of Somalia is freaking HUGE! This isn't like stopping piracy in the Chesapeake Bay. It's more like stopping piracy in the North Atlantic Ocean. Fourth, there is no effective government in Somalia. It is lawless. The fight against the Barbary pirates was a demi-war against nation states. The fight against the current Somali pirates is much more similar to a fight against terrorists, where the enemy is not clearly defined, and melts easily into a native population where positioning intelligence assets can be challenging. Give it some time. It is not so cut and dried as some of you seem to think it is. This is a pretty complicated problem with no simple solution. The only long term solution is a fully functioning government in the region around the horn, but that will take a lot of time, as well as money that we don't seem to have. How many of you would freak out and shriek bloody murder if we sent aid to Somalia in the intersts of furthering economic development so privacy is no longer a valued option?", 
        "intTime": 20090414, 
        "postID": 60, 
        "quote": "", 
        "reply": "First, the shipping companies and their insurers enable the piracy. Second, arming merchants is frowned upon by insurers, who see the loss of a couple million bucks preferable to a major fire on board a ship, causing the loss of ship and cargo (not to mention wrongful death suits of some sort, somewhere) Third, have you seen the size of the area we're talking about? The water off the coast of Somalia is freaking HUGE! This isn't like stopping piracy in the Chesapeake Bay. It's more like stopping piracy in the North Atlantic Ocean. Fourth, there is no effective government in Somalia. It is lawless. The fight against the Barbary pirates was a demi-war against nation states. The fight against the current Somali pirates is much more similar to a fight against terrorists, where the enemy is not clearly defined, and melts easily into a native population where positioning intelligence assets can be challenging. Give it some time. It is not so cut and dried as some of you seem to think it is. This is a pretty complicated problem with no simple solution. The only long term solution is a fully functioning government in the region around the horn, but that will take a lot of time, as well as money that we don't seem to have. How many of you would freak out and shriek bloody murder if we sent aid to Somalia in the intersts of furthering economic development so privacy is no longer a valued option?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:17:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "NO BLOOD FOR CARGO! Barry is making secret agreements with the shipping companies and the insurance companies. Just wait and see. There will be military actions so the shipping companies can make huge profits and the insurance companies can save a lot of money. Don't forget the insurance companies don't have to pay off if there is an act of war involved. Why do innocent people have to die for cargo?", 
        "intTime": 20090414, 
        "postID": 61, 
        "quote": "", 
        "reply": "NO BLOOD FOR CARGO! Barry is making secret agreements with the shipping companies and the insurance companies. Just wait and see. There will be military actions so the shipping companies can make huge profits and the insurance companies can save a lot of money. Don't forget the insurance companies don't have to pay off if there is an act of war involved. Why do innocent people have to die for cargo?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:34:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "intTime": 20090414, 
        "postID": 62, 
        "quote": "", 
        "reply": "I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 08:51:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "anoldnotboldrecondo"
    }, 
    {
        "content": "quote: Originally posted by anoldnotboldrecondo: I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea. hey, this is not WWII there will not be armed merchantmen in convoy, no crew served weapons on liberty ships, this aint gonna happen. most of the 'sailors' dont even speak a common language, the latest ship taken was greek with philipine crew, ya think the philipinos are gonna shoot at somalias, hell they would shoot each other this nonsense about arming merchant shipping is not going to happen have to blockade the whole country, many of these small boats launched from the beach. heck the surf in gulf is like the 'surf in chesapeak bay' there aint any forget armed crewmen now some f-18s taking out the mother ships, and taking out skinny somalias is another thing, heck the north blockaded the whole coast of the southeast usa in civil war with sailing vessels", 
        "intTime": 20090414, 
        "postID": 63, 
        "quote": "Originally posted by anoldnotboldrecondo: I wonder how many warships it would take to blockade Somalia? Every navy in the world that has shipping in this area could pitch in. If they would that is. Only ports where large vessels could be sent out to sea would need to be watched. The pirates use small motor boats for the actual hijacking. Anything large enough to carry men and motor boats could be stopped, searched for weapons or put on the bottom if it resisted. There are a lot of very serious problems for the world to deal with but stone age Somalia should not be one of them at sea.", 
        "reply": " hey, this is not WWII there will not be armed merchantmen in convoy, no crew served weapons on liberty ships, this aint gonna happen. most of the 'sailors' dont even speak a common language, the latest ship taken was greek with philipine crew, ya think the philipinos are gonna shoot at somalias, hell they would shoot each other this nonsense about arming merchant shipping is not going to happen have to blockade the whole country, many of these small boats launched from the beach. heck the surf in gulf is like the 'surf in chesapeak bay' there aint any forget armed crewmen now some f-18s taking out the mother ships, and taking out skinny somalias is another thing, heck the north blockaded the whole coast of the southeast usa in civil war with sailing vessels", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 09:01:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "It seems silly to accuse officials of \"secret\" conspiracies. If it were so secret, we wouldn't be able to accuse them of it. It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. \"See? These folks are so good that they cover their tracks...but I know what they're up to!\"", 
        "intTime": 20090414, 
        "postID": 64, 
        "quote": "", 
        "reply": "It seems silly to accuse officials of \"secret\" conspiracies. If it were so secret, we wouldn't be able to accuse them of it. It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. \"See? These folks are so good that they cover their tracks...but I know what they're up to!\"", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 11:34:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "These Pirates originally started out as coast gaurds, legal and all.. They were their to stop forieghn vessels from taking their fish. Then it morphed into piracy. Very lucrative for them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090414, 
        "postID": 65, 
        "quote": "", 
        "reply": "These Pirates originally started out as coast gaurds, legal and all.. They were their to stop forieghn vessels from taking their fish. Then it morphed into piracy. Very lucrative for them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 12:38:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. NO BLOOD FOR CARGO! Innocent Somalis don't need to die for cargo.", 
        "intTime": 20090414, 
        "postID": 66, 
        "quote": "Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself.", 
        "reply": " I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. NO BLOOD FOR CARGO! Innocent Somalis don't need to die for cargo.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 12:49:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough. What's funny is that I agree with that statement, and voted for Senator McCain. That doesn't really reduce my skepticism about dark dealings in the shadows, though. Do you really think the administrators in the Democrat party are efficient enough to keep that a secret? They couldn't even cover up a blow job.", 
        "intTime": 20090414, 
        "postID": 67, 
        "quote": "Originally posted by bill_kananen: quote: Bleah: It's just a convenient way to explain away lack of evidence. In the mind of such folks, lack of evidence becomes a perverse evidence in and of itself. I see, it's kinda' like HOPE and CHANGE. Since no one knows what that means it becomes an entity all in itself. Lack of any meaning is meaning enough.", 
        "reply": " What's funny is that I agree with that statement, and voted for Senator McCain. That doesn't really reduce my skepticism about dark dealings in the shadows, though. Do you really think the administrators in the Democrat party are efficient enough to keep that a secret? They couldn't even cover up a blow job.", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:07:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "intTime": 20090414, 
        "postID": 68, 
        "quote": "blow job.", 
        "reply": " JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY Who would you rather face, the American People, or Hillary Clinton?", 
        "intTime": 20090414, 
        "postID": 69, 
        "quote": "Originally posted by Ira1945: quote: blow job. JUST THINK OF ALL THE HOO HAW THAT COULD HAVE BEEN AVOIDED IF THE MAN SIMPLY WOULD HAVE SAID 'YEAH SHE GAVE ME ONE, SO WHAT' THEN ALL HE WOULD HAVE HAD TO FACE WAS HILLARY", 
        "reply": " Who would you rather face, the American People, or Hillary Clinton?", 
        "threadID": "409192893_6590056022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "SOMALIA PIRATES,  WHY ARE THEY ALLOWED??", 
        "userID": "Bleah"
    }
]