[
    {
        "content": "It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration...", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 14:49:00", 
        "title": "America is a fraud...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration... IRS. You just highlighted the very idea of the Tax Party's main msg. We the People own the government, not the other way around. This has nothing to do with WHO is in office so much as are they doing the will of the people or catering to a party or special interest group. Republicans and Democrats are BOTH guilty of it. EXECELLENT POST IRS!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "Originally posted by Irwin_R_Schyster: It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration...", 
        "reply": " IRS. You just highlighted the very idea of the Tax Party's main msg. We the People own the government, not the other way around. This has nothing to do with WHO is in office so much as are they doing the will of the people or catering to a party or special interest group. Republicans and Democrats are BOTH guilty of it. EXECELLENT POST IRS!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 14:56:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:04:00", 
        "title": "America is a fraud...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I disagree with the title of the thread, but I agree with the rest. It's TIME we TOOK back this country from the STATUS QOU polticians!", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "", 
        "reply": "I disagree with the title of the thread, but I agree with the rest. It's TIME we TOOK back this country from the STATUS QOU polticians!", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:05:00", 
        "title": "America is a fraud...", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix. A lot of the folks I spoke with at the Tea Party were and still are Obama supporters. They just don't agree with the crazy spending. The growth in government. A lot of them truly though President Obama would govern from the center, not so far left as he has been doing. At this point I don't see anything better in the republican party. Some of them spoke at the rallies but to me they were just trying to get points for their political careers. The normal Joe speaking held more wieght with me. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "reply": " A lot of the folks I spoke with at the Tea Party were and still are Obama supporters. They just don't agree with the crazy spending. The growth in government. A lot of them truly though President Obama would govern from the center, not so far left as he has been doing. At this point I don't see anything better in the republican party. Some of them spoke at the rallies but to me they were just trying to get points for their political careers. The normal Joe speaking held more wieght with me. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:08:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "---http://www.dailymotion.com/video/x3c3qc_anti-pasti_music", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "", 
        "reply": "---http://www.dailymotion.com/video/x3c3qc_anti-pasti_music", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:11:00", 
        "title": "America is a fraud...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "I don't see anything better in the republican party", 
        "reply": " sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:13:00", 
        "title": "America is a fraud...", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties Hopefully enough of them come up for election in 2010 that we can truly iniated the change that is GOOD for the country and not one particular group of people. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "reply": " Hopefully enough of them come up for election in 2010 that we can truly iniated the change that is GOOD for the country and not one particular group of people. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:25:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial.", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:30:00", 
        "title": "America is a fraud...", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial. I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial.", 
        "reply": " I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:04:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. no one has ever grown up in this America... we are doing stuff we have never done before...", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in.", 
        "reply": " no one has ever grown up in this America... we are doing stuff we have never done before...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:06:00", 
        "title": "America is a fraud...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. no one has ever grown up in this America... we are doing stuff we have never done before... Hence the Title of the Thread Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "Originally posted by outlaws93: quote: the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. no one has ever grown up in this America... we are doing stuff we have never done before...", 
        "reply": " Hence the Title of the Thread Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:08:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial. I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop..", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "Originally posted by L0A1: quote: Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial. I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in.", 
        "reply": " Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop..", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:09:00", 
        "title": "America is a fraud...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "[QUOTE]Originally posted by L0A1: We the People own the government, not the other way around. Oh, how qickly this has been forgotten. We got to busy getting caught up in the fact in that \"our guy\" won, we forgot who we were. Both parties are to blame here folks, They have successfully turned us against each other, and are sitting in Washington superiorly happy in the fact that we have little to do with these situations going on. WE voted for them, which they feel gives them free reign with our wishes.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by L0A1: We the People own the government, not the other way around. Oh, how qickly this has been forgotten. We got to busy getting caught up in the fact in that \"our guy\" won, we forgot who we were. Both parties are to blame here folks, They have successfully turned us against each other, and are sitting in Washington superiorly happy in the fact that we have little to do with these situations going on. WE voted for them, which they feel gives them free reign with our wishes.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:19:00", 
        "title": "America is a fraud...", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Agree with everything. It honestly seems that people are starting to realize what's really going on. Between the economy, war, and the outrageous scandal's finally people are standing up.", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "", 
        "reply": "Agree with everything. It honestly seems that people are starting to realize what's really going on. Between the economy, war, and the outrageous scandal's finally people are standing up.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:01:00", 
        "title": "America is a fraud...", 
        "userID": "Grimbo"
    }, 
    {
        "content": "I think Lamb of God said it best... The fiends have gagged a generation of pacified fools Bound by our greed a nation enslaved as corporate tools. Arise and RAZE the legacy of their lies To realize that this in itself is an ascension Towards the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. A shot gun blast into the face of deceit You'll get your just reward. We'll not rest until the purge is complete You will reap what you've sown. My redemption lies in your demise. In such a world as this does one dare to think for himself? The paradox of power and peace will destroy itself To know the truth and live in fear of no man. To realize that this in itself is an ascension Toward the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. My redemption, redemption lies in your demise. Rejoice, the age of the fall has begun. We'll dance as the palaces burn.", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "", 
        "reply": "I think Lamb of God said it best... The fiends have gagged a generation of pacified fools Bound by our greed a nation enslaved as corporate tools. Arise and RAZE the legacy of their lies To realize that this in itself is an ascension Towards the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. A shot gun blast into the face of deceit You'll get your just reward. We'll not rest until the purge is complete You will reap what you've sown. My redemption lies in your demise. In such a world as this does one dare to think for himself? The paradox of power and peace will destroy itself To know the truth and live in fear of no man. To realize that this in itself is an ascension Toward the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. My redemption, redemption lies in your demise. Rejoice, the age of the fall has begun. We'll dance as the palaces burn.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:06:00", 
        "title": "America is a fraud...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "The two liberal radio hosts i respect the most, both said this week that they are questioning their support of Obama.", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "", 
        "reply": "The two liberal radio hosts i respect the most, both said this week that they are questioning their support of Obama.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:24:00", 
        "title": "America is a fraud...", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Snipped... Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop.. If you want to stretch it a tad further... This is NOT the same America it once was when I enlisted 40 years ago! The same for those who served before my time, in a matter of speaking! Supposedly, gradual changes of our livelihood and style change for the better as time goes by... But...", 
        "intTime": 20090416, 
        "postID": 18, 
        "quote": "Originally posted by Irwin_R_Schyster: Snipped... Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop..", 
        "reply": " If you want to stretch it a tad further... This is NOT the same America it once was when I enlisted 40 years ago! The same for those who served before my time, in a matter of speaking! Supposedly, gradual changes of our livelihood and style change for the better as time goes by... But...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:29:00", 
        "title": "America is a fraud...", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc Yeah, that freedom of the press is a real drag. Too bad we don't have an \"official\" paper like Pravda.", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc", 
        "reply": " Yeah, that freedom of the press is a real drag. Too bad we don't have an \"official\" paper like Pravda.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 00:27:00", 
        "title": "America is a fraud...", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Ron Paul would have blown the cover off washington.", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "", 
        "reply": "Ron Paul would have blown the cover off washington.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:01:00", 
        "title": "America is a fraud...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix. Did that surprise you? I'm not trying to be flippant or denigrate your vote. (Hell, I'm happy you voted, so many pukes, don't), but did you not see through his act, or were you holding out a belief he would be different, or what? He flipped flopped so much even during his campaign, you could see where he was going. And the far left, has always been apologists for the USA to the rest of the world. It's like they're not comfortable in their own skin. Just my .02", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "reply": " Did that surprise you? I'm not trying to be flippant or denigrate your vote. (Hell, I'm happy you voted, so many pukes, don't), but did you not see through his act, or were you holding out a belief he would be different, or what? He flipped flopped so much even during his campaign, you could see where he was going. And the far left, has always been apologists for the USA to the rest of the world. It's like they're not comfortable in their own skin. Just my .02", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:02:00", 
        "title": "America is a fraud...", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties I think a good start, would be to bar lawyers from holding public office. I eman really, it's liek 99% of politicains hold law degrees. Do they look at stuff differently or what? We need to elect Drs, cops, firemen, nurses, engineers, people who have held real jobs and produced tangible results. Lawyers seem to get sucked into the power system for some reason.", 
        "intTime": 20090417, 
        "postID": 22, 
        "quote": "Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "reply": " I think a good start, would be to bar lawyers from holding public office. I eman really, it's liek 99% of politicains hold law degrees. Do they look at stuff differently or what? We need to elect Drs, cops, firemen, nurses, engineers, people who have held real jobs and produced tangible results. Lawyers seem to get sucked into the power system for some reason.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:05:00", 
        "title": "America is a fraud...", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees?", 
        "intTime": 20090417, 
        "postID": 23, 
        "quote": "it's liek 99% of politicains hold law degrees.", 
        "reply": " you think it's bad to have the people who write our laws to hold law degrees?", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:10:00", 
        "title": "America is a fraud...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees? So..., I interpret your post as saying that everything that is currently going on is just \"fine and dandy\" as far as you're concerned... A \"LAW DEGREE\" is not solely needed...", 
        "intTime": 20090417, 
        "postID": 24, 
        "quote": "Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees?", 
        "reply": " So..., I interpret your post as saying that everything that is currently going on is just \"fine and dandy\" as far as you're concerned... A \"LAW DEGREE\" is not solely needed...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 07:52:00", 
        "title": "America is a fraud...", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees? Yes, especially, when most of them haven't even been lawyers. Just because you hold a law degree doesn't give you some special sway over making laws. Making laws should be about common sense, somethign sorely lacking in our political parties(both of them). I'm not saying some lawyers are and have been good voices of teh people. But why don't we try and get more people who have actually ran companies, fixed thigns, understand how teh real world works a little better, then some atty who thinks life is some poli-sci paper.", 
        "intTime": 20090417, 
        "postID": 25, 
        "quote": "Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees?", 
        "reply": " Yes, especially, when most of them haven't even been lawyers. Just because you hold a law degree doesn't give you some special sway over making laws. Making laws should be about common sense, somethign sorely lacking in our political parties(both of them). I'm not saying some lawyers are and have been good voices of teh people. But why don't we try and get more people who have actually ran companies, fixed thigns, understand how teh real world works a little better, then some atty who thinks life is some poli-sci paper.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 09:08:00", 
        "title": "America is a fraud...", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Ron Paul would have blown the cover off washington. I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President?", 
        "intTime": 20090417, 
        "postID": 26, 
        "quote": "Originally posted by soscorpio: Ron Paul would have blown the cover off washington.", 
        "reply": " I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President?", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 09:28:00", 
        "title": "America is a fraud...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by soscorpio: Ron Paul would have blown the cover off washington. I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President? And now you know what the TEA PARTY'S were truly about. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 27, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by soscorpio: Ron Paul would have blown the cover off washington. I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President?", 
        "reply": " And now you know what the TEA PARTY'S were truly about. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 09:56:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "The price of our democratic republic is that bad laws and policies sometimes get enacted. Witness the Fugitive Slave Act, Prohibition, and the policy of 'Separate but Equal'. The saving virtue of our system is that any such law can be overturned, however long and painful that process might be - 13th and 14th Amendments, Brown vs. the Board of Education, etc. Some people here decry change and wish for 'the good ol' days' without realizing that those days are gone and our current days are what we make of them. Some people decry our government, as if they had no say in the matter and lack the means and wherewithal of contacting their representatives directly to speak their mind. Don't cry about your congressional representatives' actions and voting record if you've never contacted them to tell them how you wish them to vote. You have that ability and opportunity. It's not, 'you get what you pay for', it is 'you get what you tolerate'. That's your lot as a citizen. Want change? Make it. Sullivan013", 
        "intTime": 20090417, 
        "postID": 28, 
        "quote": "", 
        "reply": "The price of our democratic republic is that bad laws and policies sometimes get enacted. Witness the Fugitive Slave Act, Prohibition, and the policy of 'Separate but Equal'. The saving virtue of our system is that any such law can be overturned, however long and painful that process might be - 13th and 14th Amendments, Brown vs. the Board of Education, etc. Some people here decry change and wish for 'the good ol' days' without realizing that those days are gone and our current days are what we make of them. Some people decry our government, as if they had no say in the matter and lack the means and wherewithal of contacting their representatives directly to speak their mind. Don't cry about your congressional representatives' actions and voting record if you've never contacted them to tell them how you wish them to vote. You have that ability and opportunity. It's not, 'you get what you pay for', it is 'you get what you tolerate'. That's your lot as a citizen. Want change? Make it. Sullivan013", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 10:00:00", 
        "title": "America is a fraud...", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Well said Sullivan013! It is a frustrating beast this Republic!", 
        "intTime": 20090418, 
        "postID": 29, 
        "quote": "", 
        "reply": "Well said Sullivan013! It is a frustrating beast this Republic!", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-18 23:21:00", 
        "title": "America is a fraud...", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration...", 
        "intTime": 20090416, 
        "postID": 30, 
        "quote": "", 
        "reply": "It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 14:49:00", 
        "title": "America is a fraud...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration... IRS. You just highlighted the very idea of the Tax Party's main msg. We the People own the government, not the other way around. This has nothing to do with WHO is in office so much as are they doing the will of the people or catering to a party or special interest group. Republicans and Democrats are BOTH guilty of it. EXECELLENT POST IRS!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "Originally posted by Irwin_R_Schyster: It is clear now more than ever that what we believe America to be is just not true. There is no freedom when our financial system enslaves the masses, there is no independence when government insists on doing everything for us, there is no freedom of speech when the mainstream media overtly takes sides. The election of President Obama was historic, i'm sure he's a great man, he's in great shape, he's phenomenal, he is \"The Game\"...but its time to get past that and see that he is just another symbol of the status quo. I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc They are all under the control of just 5 corporate entities, what does that tell you??? I was in a very combat oriented unit, and one of me dear friends became a tree hugging liberal ******, but I still love em. Either way, even he can see the BS going on with this administration...", 
        "reply": " IRS. You just highlighted the very idea of the Tax Party's main msg. We the People own the government, not the other way around. This has nothing to do with WHO is in office so much as are they doing the will of the people or catering to a party or special interest group. Republicans and Democrats are BOTH guilty of it. EXECELLENT POST IRS!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 14:56:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "", 
        "reply": "I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:04:00", 
        "title": "America is a fraud...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I disagree with the title of the thread, but I agree with the rest. It's TIME we TOOK back this country from the STATUS QOU polticians!", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "", 
        "reply": "I disagree with the title of the thread, but I agree with the rest. It's TIME we TOOK back this country from the STATUS QOU polticians!", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:05:00", 
        "title": "America is a fraud...", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix. A lot of the folks I spoke with at the Tea Party were and still are Obama supporters. They just don't agree with the crazy spending. The growth in government. A lot of them truly though President Obama would govern from the center, not so far left as he has been doing. At this point I don't see anything better in the republican party. Some of them spoke at the rallies but to me they were just trying to get points for their political careers. The normal Joe speaking held more wieght with me. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "reply": " A lot of the folks I spoke with at the Tea Party were and still are Obama supporters. They just don't agree with the crazy spending. The growth in government. A lot of them truly though President Obama would govern from the center, not so far left as he has been doing. At this point I don't see anything better in the republican party. Some of them spoke at the rallies but to me they were just trying to get points for their political careers. The normal Joe speaking held more wieght with me. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:08:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "---http://www.dailymotion.com/video/x3c3qc_anti-pasti_music", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "", 
        "reply": "---http://www.dailymotion.com/video/x3c3qc_anti-pasti_music", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:11:00", 
        "title": "America is a fraud...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "I don't see anything better in the republican party", 
        "reply": " sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:13:00", 
        "title": "America is a fraud...", 
        "userID": "Ira1945"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties Hopefully enough of them come up for election in 2010 that we can truly iniated the change that is GOOD for the country and not one particular group of people. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 37, 
        "quote": "Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "reply": " Hopefully enough of them come up for election in 2010 that we can truly iniated the change that is GOOD for the country and not one particular group of people. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:25:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial.", 
        "intTime": 20090416, 
        "postID": 38, 
        "quote": "", 
        "reply": "We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 15:30:00", 
        "title": "America is a fraud...", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial. I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 39, 
        "quote": "Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial.", 
        "reply": " I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:04:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. no one has ever grown up in this America... we are doing stuff we have never done before...", 
        "intTime": 20090416, 
        "postID": 40, 
        "quote": "the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in.", 
        "reply": " no one has ever grown up in this America... we are doing stuff we have never done before...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:06:00", 
        "title": "America is a fraud...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. no one has ever grown up in this America... we are doing stuff we have never done before... Hence the Title of the Thread Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090416, 
        "postID": 41, 
        "quote": "Originally posted by outlaws93: quote: the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. no one has ever grown up in this America... we are doing stuff we have never done before...", 
        "reply": " Hence the Title of the Thread Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:08:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial. I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in. Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop..", 
        "intTime": 20090416, 
        "postID": 42, 
        "quote": "Originally posted by L0A1: quote: Originally posted by ELLIOTT1980: We are America, we're not Frauds . . . Its the hammerheads that lied their way to Washington only to become professional liars!!! WE THE PEOPLE must hold those hammerheads accountable, every one of them, party immaterial. I am pretty sure that is what the OP is saying. the Title is harsh, but right now, with the leadership we have (both sides) this is NOT the AMERICA I grew up in.", 
        "reply": " Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop..", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:09:00", 
        "title": "America is a fraud...", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "[QUOTE]Originally posted by L0A1: We the People own the government, not the other way around. Oh, how qickly this has been forgotten. We got to busy getting caught up in the fact in that \"our guy\" won, we forgot who we were. Both parties are to blame here folks, They have successfully turned us against each other, and are sitting in Washington superiorly happy in the fact that we have little to do with these situations going on. WE voted for them, which they feel gives them free reign with our wishes.", 
        "intTime": 20090416, 
        "postID": 43, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by L0A1: We the People own the government, not the other way around. Oh, how qickly this has been forgotten. We got to busy getting caught up in the fact in that \"our guy\" won, we forgot who we were. Both parties are to blame here folks, They have successfully turned us against each other, and are sitting in Washington superiorly happy in the fact that we have little to do with these situations going on. WE voted for them, which they feel gives them free reign with our wishes.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 16:19:00", 
        "title": "America is a fraud...", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "Agree with everything. It honestly seems that people are starting to realize what's really going on. Between the economy, war, and the outrageous scandal's finally people are standing up.", 
        "intTime": 20090416, 
        "postID": 44, 
        "quote": "", 
        "reply": "Agree with everything. It honestly seems that people are starting to realize what's really going on. Between the economy, war, and the outrageous scandal's finally people are standing up.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:01:00", 
        "title": "America is a fraud...", 
        "userID": "Grimbo"
    }, 
    {
        "content": "I think Lamb of God said it best... The fiends have gagged a generation of pacified fools Bound by our greed a nation enslaved as corporate tools. Arise and RAZE the legacy of their lies To realize that this in itself is an ascension Towards the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. A shot gun blast into the face of deceit You'll get your just reward. We'll not rest until the purge is complete You will reap what you've sown. My redemption lies in your demise. In such a world as this does one dare to think for himself? The paradox of power and peace will destroy itself To know the truth and live in fear of no man. To realize that this in itself is an ascension Toward the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. My redemption, redemption lies in your demise. Rejoice, the age of the fall has begun. We'll dance as the palaces burn.", 
        "intTime": 20090416, 
        "postID": 45, 
        "quote": "", 
        "reply": "I think Lamb of God said it best... The fiends have gagged a generation of pacified fools Bound by our greed a nation enslaved as corporate tools. Arise and RAZE the legacy of their lies To realize that this in itself is an ascension Towards the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. A shot gun blast into the face of deceit You'll get your just reward. We'll not rest until the purge is complete You will reap what you've sown. My redemption lies in your demise. In such a world as this does one dare to think for himself? The paradox of power and peace will destroy itself To know the truth and live in fear of no man. To realize that this in itself is an ascension Toward the day we revolt. Watch the seeds you've cast away take hold War will be born. Rejoice, the age of the fall has begun We'll dance as the palaces burn. My redemption, redemption lies in your demise. Rejoice, the age of the fall has begun. We'll dance as the palaces burn.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:06:00", 
        "title": "America is a fraud...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "The two liberal radio hosts i respect the most, both said this week that they are questioning their support of Obama.", 
        "intTime": 20090416, 
        "postID": 46, 
        "quote": "", 
        "reply": "The two liberal radio hosts i respect the most, both said this week that they are questioning their support of Obama.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:24:00", 
        "title": "America is a fraud...", 
        "userID": "threerings"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Snipped... Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop.. If you want to stretch it a tad further... This is NOT the same America it once was when I enlisted 40 years ago! The same for those who served before my time, in a matter of speaking! Supposedly, gradual changes of our livelihood and style change for the better as time goes by... But...", 
        "intTime": 20090416, 
        "postID": 47, 
        "quote": "Originally posted by Irwin_R_Schyster: Snipped... Roger that....hell, this isn't the same America it was back in 2003 when I enlisted in the Army. I think the guys enlisting right now are the cream of the crop..", 
        "reply": " If you want to stretch it a tad further... This is NOT the same America it once was when I enlisted 40 years ago! The same for those who served before my time, in a matter of speaking! Supposedly, gradual changes of our livelihood and style change for the better as time goes by... But...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-16 17:29:00", 
        "title": "America is a fraud...", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc Yeah, that freedom of the press is a real drag. Too bad we don't have an \"official\" paper like Pravda.", 
        "intTime": 20090417, 
        "postID": 48, 
        "quote": "I'm sick of watching the Media take sides. Its not just that rag MSNBC, its also Fox News, the New York Times/Post, CNN...etc", 
        "reply": " Yeah, that freedom of the press is a real drag. Too bad we don't have an \"official\" paper like Pravda.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 00:27:00", 
        "title": "America is a fraud...", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Ron Paul would have blown the cover off washington.", 
        "intTime": 20090417, 
        "postID": 49, 
        "quote": "", 
        "reply": "Ron Paul would have blown the cover off washington.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:01:00", 
        "title": "America is a fraud...", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix. Did that surprise you? I'm not trying to be flippant or denigrate your vote. (Hell, I'm happy you voted, so many pukes, don't), but did you not see through his act, or were you holding out a belief he would be different, or what? He flipped flopped so much even during his campaign, you could see where he was going. And the far left, has always been apologists for the USA to the rest of the world. It's like they're not comfortable in their own skin. Just my .02", 
        "intTime": 20090417, 
        "postID": 50, 
        "quote": "Originally posted by Irwin_R_Schyster: I voted for President Obama, we just needed a different outlook I thought, but boy is that turning out to be a questionable decision. I'm getting pretty tired of the national cheerleader going abroad and breathlessly apologize for so-called transgressions and arrogance. It really is true, liberals just don't see the enemies of America for what they are: Tireless, determined, and anxious to do us harm....From South America, to Europe, to Asia and the Middle East... Now? I feel we have to include some of our people in that mix.", 
        "reply": " Did that surprise you? I'm not trying to be flippant or denigrate your vote. (Hell, I'm happy you voted, so many pukes, don't), but did you not see through his act, or were you holding out a belief he would be different, or what? He flipped flopped so much even during his campaign, you could see where he was going. And the far left, has always been apologists for the USA to the rest of the world. It's like they're not comfortable in their own skin. Just my .02", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:02:00", 
        "title": "America is a fraud...", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties I think a good start, would be to bar lawyers from holding public office. I eman really, it's liek 99% of politicains hold law degrees. Do they look at stuff differently or what? We need to elect Drs, cops, firemen, nurses, engineers, people who have held real jobs and produced tangible results. Lawyers seem to get sucked into the power system for some reason.", 
        "intTime": 20090417, 
        "postID": 51, 
        "quote": "Originally posted by Ira1945: quote: I don't see anything better in the republican party sad but so true, yet there are highlights in both parties we need to get away from the old school party deal, not necessarily a third party, but a 3rd way to look at things, and pick the best out of both parties", 
        "reply": " I think a good start, would be to bar lawyers from holding public office. I eman really, it's liek 99% of politicains hold law degrees. Do they look at stuff differently or what? We need to elect Drs, cops, firemen, nurses, engineers, people who have held real jobs and produced tangible results. Lawyers seem to get sucked into the power system for some reason.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:05:00", 
        "title": "America is a fraud...", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees?", 
        "intTime": 20090417, 
        "postID": 52, 
        "quote": "it's liek 99% of politicains hold law degrees.", 
        "reply": " you think it's bad to have the people who write our laws to hold law degrees?", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 06:10:00", 
        "title": "America is a fraud...", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees? So..., I interpret your post as saying that everything that is currently going on is just \"fine and dandy\" as far as you're concerned... A \"LAW DEGREE\" is not solely needed...", 
        "intTime": 20090417, 
        "postID": 53, 
        "quote": "Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees?", 
        "reply": " So..., I interpret your post as saying that everything that is currently going on is just \"fine and dandy\" as far as you're concerned... A \"LAW DEGREE\" is not solely needed...", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 07:52:00", 
        "title": "America is a fraud...", 
        "userID": "ELLIOTT1980"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees? Yes, especially, when most of them haven't even been lawyers. Just because you hold a law degree doesn't give you some special sway over making laws. Making laws should be about common sense, somethign sorely lacking in our political parties(both of them). I'm not saying some lawyers are and have been good voices of teh people. But why don't we try and get more people who have actually ran companies, fixed thigns, understand how teh real world works a little better, then some atty who thinks life is some poli-sci paper.", 
        "intTime": 20090417, 
        "postID": 54, 
        "quote": "Originally posted by karlhungusjr: quote: it's liek 99% of politicains hold law degrees. you think it's bad to have the people who write our laws to hold law degrees?", 
        "reply": " Yes, especially, when most of them haven't even been lawyers. Just because you hold a law degree doesn't give you some special sway over making laws. Making laws should be about common sense, somethign sorely lacking in our political parties(both of them). I'm not saying some lawyers are and have been good voices of teh people. But why don't we try and get more people who have actually ran companies, fixed thigns, understand how teh real world works a little better, then some atty who thinks life is some poli-sci paper.", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 09:08:00", 
        "title": "America is a fraud...", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: Ron Paul would have blown the cover off washington. I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President?", 
        "intTime": 20090417, 
        "postID": 55, 
        "quote": "Originally posted by soscorpio: Ron Paul would have blown the cover off washington.", 
        "reply": " I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President?", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 09:28:00", 
        "title": "America is a fraud...", 
        "userID": "Killswitch_Engage"
    }, 
    {
        "content": "quote: Originally posted by Killswitch_Engage: quote: Originally posted by soscorpio: Ron Paul would have blown the cover off washington. I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President? And now you know what the TEA PARTY'S were truly about. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 56, 
        "quote": "Originally posted by Killswitch_Engage: quote: Originally posted by soscorpio: Ron Paul would have blown the cover off washington. I wish I could believe that. And if he was on the ticket I would have voted for him just to test the theory. I thought Obama was the type to do that too and now I just feel like he's another one of the real power elite's front men, like Bush was, and like every President tracing back to JFK, who I think was killed because he could not be controlled like that. Who controls the President?", 
        "reply": " And now you know what the TEA PARTY'S were truly about. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 09:56:00", 
        "title": "America is a fraud...", 
        "userID": "L0A1"
    }, 
    {
        "content": "The price of our democratic republic is that bad laws and policies sometimes get enacted. Witness the Fugitive Slave Act, Prohibition, and the policy of 'Separate but Equal'. The saving virtue of our system is that any such law can be overturned, however long and painful that process might be - 13th and 14th Amendments, Brown vs. the Board of Education, etc. Some people here decry change and wish for 'the good ol' days' without realizing that those days are gone and our current days are what we make of them. Some people decry our government, as if they had no say in the matter and lack the means and wherewithal of contacting their representatives directly to speak their mind. Don't cry about your congressional representatives' actions and voting record if you've never contacted them to tell them how you wish them to vote. You have that ability and opportunity. It's not, 'you get what you pay for', it is 'you get what you tolerate'. That's your lot as a citizen. Want change? Make it. Sullivan013", 
        "intTime": 20090417, 
        "postID": 57, 
        "quote": "", 
        "reply": "The price of our democratic republic is that bad laws and policies sometimes get enacted. Witness the Fugitive Slave Act, Prohibition, and the policy of 'Separate but Equal'. The saving virtue of our system is that any such law can be overturned, however long and painful that process might be - 13th and 14th Amendments, Brown vs. the Board of Education, etc. Some people here decry change and wish for 'the good ol' days' without realizing that those days are gone and our current days are what we make of them. Some people decry our government, as if they had no say in the matter and lack the means and wherewithal of contacting their representatives directly to speak their mind. Don't cry about your congressional representatives' actions and voting record if you've never contacted them to tell them how you wish them to vote. You have that ability and opportunity. It's not, 'you get what you pay for', it is 'you get what you tolerate'. That's your lot as a citizen. Want change? Make it. Sullivan013", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-17 10:00:00", 
        "title": "America is a fraud...", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Well said Sullivan013! It is a frustrating beast this Republic!", 
        "intTime": 20090418, 
        "postID": 58, 
        "quote": "", 
        "reply": "Well said Sullivan013! It is a frustrating beast this Republic!", 
        "threadID": "409192893_9720059022001", 
        "time": "2009-04-18 23:21:00", 
        "title": "America is a fraud...", 
        "userID": "TomGustafson"
    }
]