[
    {
        "content": "April 1st, 2009 House Republicans roll out alternative budget Posted: 11:53 AM ET WASHINGTON (CNN) — House Republican leaders unveiled their alternative to the proposed Democratic budget Wednesday, calling for $4.8 trillion less in overall spending over the next decade — in part through a five-year freeze in most non-defense discretionary spending. The GOP budget would repeal the entire $787 billion economic stimulus package except for an extension of unemployment insurance benefits. It also would roll back a recently passed 8 percent spending boost in the budget for the remainder of the current fiscal year. Overall, it calls for $3.6 trillion less in borrowing over the next 10 years. “The president’s budget exploits the current economic crisis to justify trillions in new spending, taxes, and debt,” Wisconsin Rep. Paul Ryan, the ranking Republican on the House Budget Committee, said in a written statement. Democrats were quick to criticize the GOP proposal as little more than a way to help the wealthiest Americans at the expense of the rest of the country. This has to be an April Fools joke, right?", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "April 1st, 2009 House Republicans roll out alternative budget Posted: 11:53 AM ET WASHINGTON (CNN) — House Republican leaders unveiled their alternative to the proposed Democratic budget Wednesday, calling for $4.8 trillion less in overall spending over the next decade — in part through a five-year freeze in most non-defense discretionary spending. The GOP budget would repeal the entire $787 billion economic stimulus package except for an extension of unemployment insurance benefits. It also would roll back a recently passed 8 percent spending boost in the budget for the remainder of the current fiscal year. Overall, it calls for $3.6 trillion less in borrowing over the next 10 years. “The president’s budget exploits the current economic crisis to justify trillions in new spending, taxes, and debt,” Wisconsin Rep. Paul Ryan, the ranking Republican on the House Budget Committee, said in a written statement. Democrats were quick to criticize the GOP proposal as little more than a way to help the wealthiest Americans at the expense of the rest of the country. This has to be an April Fools joke, right?", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 09:14:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 09:26:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps...", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen.", 
        "reply": " Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps...", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 10:10:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Tangler"
    }, 
    {
        "content": "Yeah I heard it went from 17 pages, to 22 pages!!", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "", 
        "reply": "Yeah I heard it went from 17 pages, to 22 pages!!", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 10:12:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "samh32"
    }, 
    {
        "content": "The lib/socialist party is for making everyone equally poor so everyone can bend over and grab their bootstraps. Everyone except the lib/socialist elite that is.", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "", 
        "reply": "The lib/socialist party is for making everyone equally poor so everyone can bend over and grab their bootstraps. Everyone except the lib/socialist elite that is.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 10:13:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: The lib/socialist party is for making everyone equally poor so everyone can bend over and grab their bootstraps. Everyone except the lib/socialist elite that is. Nice opine-ing there Bill, can you provide evidences that \"the elite\" is working to make everone poor and can you prove that \"the lib/socialist party is for making everyone equally poor \"", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by bill_kananen: The lib/socialist party is for making everyone equally poor so everyone can bend over and grab their bootstraps. Everyone except the lib/socialist elite that is.", 
        "reply": " Nice opine-ing there Bill, can you provide evidences that \"the elite\" is working to make everone poor and can you prove that \"the lib/socialist party is for making everyone equally poor \"", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 10:24:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Tangler"
    }, 
    {
        "content": "Prove it, just look at the national debt. We will have to pay for that. Then look at the Obama Admin tax returns, the unintentional errors that are overlooked. For a prime example look at Charles Rangel (D NY). That should be enough proof.", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "", 
        "reply": "Prove it, just look at the national debt. We will have to pay for that. Then look at the Obama Admin tax returns, the unintentional errors that are overlooked. For a prime example look at Charles Rangel (D NY). That should be enough proof.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 10:34:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps... Keep eating that popcorn and ignore what is going on. Last time I heard, it was many on the left (only a select few on the right) coming up with these scams of cap and trade, carbon taxes, and the GWPRA. Instead of \"everyone else bending over to grab their bootstraps\", many need to first pull their heads out of their booties and realize the scams that many want to impose. Oh but everything is rosy on the left. They are all for the lower and middle class. They don't want any more of our money. Everything will be alright, we'll just think of cap and trade, GWPRA, and carbon taxes as....just another fee.....or completely ignore it, and make it like it doesn't exist. If Obama says that cap and trade is great...and...oh wait, he plans for an even broader system, i guess all is well and good in your book. Tax cuts for 95% of Americans? You believe that nonsense? I applaud the Democrats and Republicans who are standing up against these scams.", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps...", 
        "reply": " Keep eating that popcorn and ignore what is going on. Last time I heard, it was many on the left (only a select few on the right) coming up with these scams of cap and trade, carbon taxes, and the GWPRA. Instead of \"everyone else bending over to grab their bootstraps\", many need to first pull their heads out of their booties and realize the scams that many want to impose. Oh but everything is rosy on the left. They are all for the lower and middle class. They don't want any more of our money. Everything will be alright, we'll just think of cap and trade, GWPRA, and carbon taxes as....just another fee.....or completely ignore it, and make it like it doesn't exist. If Obama says that cap and trade is great...and...oh wait, he plans for an even broader system, i guess all is well and good in your book. Tax cuts for 95% of Americans? You believe that nonsense? I applaud the Democrats and Republicans who are standing up against these scams.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 10:35:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Prove it, just look at the national debt. We will have to pay for that. Then look at the Obama Admin tax returns, the unintentional errors that are overlooked. For a prime example look at Charles Rangel (D NY). That should be enough proof. Ok the national debt, brought on by the borrow and spend group call the republican congress, who also removed the regulations that let people create the housing bubble and the wonderful subprime loans ... Yep we have to pay it off,but right now the economy in a hole and 8 years of tax cuts haven't seemed to help it. So the \"new\" president is trying a new tack to kick start the economy. Using to old saw of \"you have to spend money to make money\" the pres. is trying to make jobs and get banks to start lending again. You do know that term \"unintentional errors\" means you aren't doing it intentional? Right? As for Charles Rangel (D NY)I'm sure we can list (a looong list ) of both Republican and Demacrates who have had \"problems\" with taxs.", 
        "intTime": 20090401, 
        "postID": 9, 
        "quote": "Originally posted by bill_kananen: Prove it, just look at the national debt. We will have to pay for that. Then look at the Obama Admin tax returns, the unintentional errors that are overlooked. For a prime example look at Charles Rangel (D NY). That should be enough proof.", 
        "reply": " Ok the national debt, brought on by the borrow and spend group call the republican congress, who also removed the regulations that let people create the housing bubble and the wonderful subprime loans ... Yep we have to pay it off,but right now the economy in a hole and 8 years of tax cuts haven't seemed to help it. So the \"new\" president is trying a new tack to kick start the economy. Using to old saw of \"you have to spend money to make money\" the pres. is trying to make jobs and get banks to start lending again. You do know that term \"unintentional errors\" means you aren't doing it intentional? Right? As for Charles Rangel (D NY)I'm sure we can list (a looong list ) of both Republican and Demacrates who have had \"problems\" with taxs.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 11:36:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: Originally posted by Boilerman_01: quote: Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps... Keep eating that popcorn and ignore what is going on. Last time I heard, it was many on the left (only a select few on the right) coming up with these scams of cap and trade, carbon taxes, and the GWPRA. Funny, I'm on the left and I haven't hear that many and most of them are yelping because their ox is getting \"gored\". Instead of \"everyone else bending over to grab their bootstraps\", many need to first pull their heads out of their booties and realize the scams that many want to impose. ?Scams? and you of course know this because you have your own brand of evidences that proves what? Oh but everything is rosy on the left. They are all for the lower and middle class. They don't want any more of our money. Everything will be alright, we'll just think of cap and trade, GWPRA, and carbon taxes as....just another fee.....or completely ignore it, and make it like it doesn't exist. If Obama says that cap and trade is great...and...oh wait, he plans for an even broader system, i guess all is well and good in your book. Tax cuts for 95% of Americans? You believe that nonsense? Yep, just as much as you don't... I applaud the Democrats and Republicans who are standing up against these scams. And I applaud the Democrats and Republicans who are standing for these laws to help wean us off of foreign oil and help us stop damaging the planet, make more jobs and help us get out of where the old republican congress put us.", 
        "intTime": 20090401, 
        "postID": 10, 
        "quote": "Originally posted by Boilerman_01: quote: Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps... Keep eating that popcorn and ignore what is going on. Last time I heard, it was many on the left (only a select few on the right) coming up with these scams of cap and trade, carbon taxes, and the GWPRA. Funny, I'm on the left and I haven't hear that many and most of them are yelping because their ox is getting \"gored\". Instead of \"everyone else bending over to grab their bootstraps\", many need to first pull their heads out of their booties and realize the scams that many want to impose. ?Scams? and you of course know this because you have your own brand of evidences that proves what? Oh but everything is rosy on the left. They are all for the lower and middle class. They don't want any more of our money. Everything will be alright, we'll just think of cap and trade, GWPRA, and carbon taxes as....just another fee.....or completely ignore it, and make it like it doesn't exist. If Obama says that cap and trade is great...and...oh wait, he plans for an even broader system, i guess all is well and good in your book. Tax cuts for 95% of Americans? You believe that nonsense? Yep, just as much as you don't... I applaud the Democrats and Republicans who are standing up against these scams.", 
        "reply": " And I applaud the Democrats and Republicans who are standing for these laws to help wean us off of foreign oil and help us stop damaging the planet, make more jobs and help us get out of where the old republican congress put us.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 12:04:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Tangler"
    }, 
    {
        "content": "quote: dmuhler: Oh come on Bill, you know full well that the con\\fascist elite will do equally as good. That's why neither should have total control of the government. But we can't do anything about that until 2012. Enjoy your stimulus and budget debt.", 
        "intTime": 20090401, 
        "postID": 11, 
        "quote": "dmuhler: Oh come on Bill, you know full well that the con\\fascist elite will do equally as good.", 
        "reply": " That's why neither should have total control of the government. But we can't do anything about that until 2012. Enjoy your stimulus and budget debt.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 13:36:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps... Normal position for you, right?? Except for the one where you are on your knees looking up.", 
        "intTime": 20090401, 
        "postID": 12, 
        "quote": "Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps...", 
        "reply": " Normal position for you, right?? Except for the one where you are on your knees looking up.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 13:52:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "transport1"
    }, 
    {
        "content": "Hopefully enough seats to bring some balance. The special election for Gillibrand's house seat (Hillary's replacement) ended in a difference of only 25 votes. The absentee ballots will decide that seat. The people aren't hurting enough yet. More pain to come.", 
        "intTime": 20090401, 
        "postID": 13, 
        "quote": "", 
        "reply": "Hopefully enough seats to bring some balance. The special election for Gillibrand's house seat (Hillary's replacement) ended in a difference of only 25 votes. The absentee ballots will decide that seat. The people aren't hurting enough yet. More pain to come.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 18:55:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "quote: Originally posted by Tangler: quote: Originally posted by Boilerman_01: quote: Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps... Keep eating that popcorn and ignore what is going on. Last time I heard, it was many on the left (only a select few on the right) coming up with these scams of cap and trade, carbon taxes, and the GWPRA. Funny, I'm on the left and I haven't hear that many and most of them are yelping because their ox is getting \"gored\". Instead of \"everyone else bending over to grab their bootstraps\", many need to first pull their heads out of their booties and realize the scams that many want to impose. ?Scams? and you of course know this because you have your own brand of evidences that proves what? Oh but everything is rosy on the left. They are all for the lower and middle class. They don't want any more of our money. Everything will be alright, we'll just think of cap and trade, GWPRA, and carbon taxes as....just another fee.....or completely ignore it, and make it like it doesn't exist. If Obama says that cap and trade is great...and...oh wait, he plans for an even broader system, i guess all is well and good in your book. Tax cuts for 95% of Americans? You believe that nonsense? Yep, just as much as you don't... I applaud the Democrats and Republicans who are standing up against these scams. And I applaud the Democrats and Republicans who are standing for these laws to help wean us off of foreign oil and help us stop damaging the planet, make more jobs and help us get out of where the old republican congress put us. I don't even know where to begin. Make more jobs....do you mean create more jobs? Maybe you should re read your post to yourself. You would see it makes no sense. Then, maybe you can do some research. If you did research, you would know that over 80% of Democrats have been opposed to further drilling and exploration, while over 90% of Republicans have been in favor. So tell me how they are going to wean us off foreign oil, and create more jobs all while standing in the way of progress. We shouldn't have to beg OPEC for anything. Campaign about further drilling and exploration to get votes, but do the opposite. Yup, just words, just inaction, and just more broken promises. I will say this again. The free market has done more for the environment than the IPCC, Al Gore, the UN, the alarmists and so on. Proven fact. Cap and trade, a bogus new market that makes oil futures look like child's play, will do nothing to better the environment. Nor will carbon taxes and the other scams they are trying to come up with. Seems you need the government to do your research, and tell you what is good for you. I guess you rely on the alarmists, Al Gore and the IPCC to better the environment, instead of the free market. The free market has concrete results, unlike that of your friends. It's amazing that people in this country oppose further drilling and exploration here. All while relying on other countries, who have been experiencing substantial growth in revenues and Real GDP, as well as job creation. The US is greedy, and doesn't deserve to create more jobs, and more wealth here. Let overseas keep their wealth, jobs and prosperity. Not for the US though . Keep dreaming about the 95% tax cuts. They will be heavily offset by cap and trade, and carbon taxes. Maybe you can break free of the bubble and step into reality. There are members on both sides to share the blame. I have already posted my criticism about the Bush admin, as well as others. Something you seem to be unable to do with your own party.", 
        "intTime": 20090401, 
        "postID": 14, 
        "quote": "Originally posted by Tangler: quote: Originally posted by Boilerman_01: quote: Originally posted by Tangler: quote: Originally posted by L0A1: Nope, not an April fools joke. We all kn ow what the outcome would be anyway. The Republican alternative seems like a much better bill. Since the Dems won, it won't happen. Yep, the \"Do Nothing Republican Party\" is for keeping the wealthy happy and everone else can bend over and grab their bootstraps... Keep eating that popcorn and ignore what is going on. Last time I heard, it was many on the left (only a select few on the right) coming up with these scams of cap and trade, carbon taxes, and the GWPRA. Funny, I'm on the left and I haven't hear that many and most of them are yelping because their ox is getting \"gored\". Instead of \"everyone else bending over to grab their bootstraps\", many need to first pull their heads out of their booties and realize the scams that many want to impose. ?Scams? and you of course know this because you have your own brand of evidences that proves what? Oh but everything is rosy on the left. They are all for the lower and middle class. They don't want any more of our money. Everything will be alright, we'll just think of cap and trade, GWPRA, and carbon taxes as....just another fee.....or completely ignore it, and make it like it doesn't exist. If Obama says that cap and trade is great...and...oh wait, he plans for an even broader system, i guess all is well and good in your book. Tax cuts for 95% of Americans? You believe that nonsense? Yep, just as much as you don't... I applaud the Democrats and Republicans who are standing up against these scams. And I applaud the Democrats and Republicans who are standing for these laws to help wean us off of foreign oil and help us stop damaging the planet, make more jobs and help us get out of where the old republican congress put us.", 
        "reply": " I don't even know where to begin. Make more jobs....do you mean create more jobs? Maybe you should re read your post to yourself. You would see it makes no sense. Then, maybe you can do some research. If you did research, you would know that over 80% of Democrats have been opposed to further drilling and exploration, while over 90% of Republicans have been in favor. So tell me how they are going to wean us off foreign oil, and create more jobs all while standing in the way of progress. We shouldn't have to beg OPEC for anything. Campaign about further drilling and exploration to get votes, but do the opposite. Yup, just words, just inaction, and just more broken promises. I will say this again. The free market has done more for the environment than the IPCC, Al Gore, the UN, the alarmists and so on. Proven fact. Cap and trade, a bogus new market that makes oil futures look like child's play, will do nothing to better the environment. Nor will carbon taxes and the other scams they are trying to come up with. Seems you need the government to do your research, and tell you what is good for you. I guess you rely on the alarmists, Al Gore and the IPCC to better the environment, instead of the free market. The free market has concrete results, unlike that of your friends. It's amazing that people in this country oppose further drilling and exploration here. All while relying on other countries, who have been experiencing substantial growth in revenues and Real GDP, as well as job creation. The US is greedy, and doesn't deserve to create more jobs, and more wealth here. Let overseas keep their wealth, jobs and prosperity. Not for the US though . Keep dreaming about the 95% tax cuts. They will be heavily offset by cap and trade, and carbon taxes. Maybe you can break free of the bubble and step into reality. There are members on both sides to share the blame. I have already posted my criticism about the Bush admin, as well as others. Something you seem to be unable to do with your own party.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 19:55:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "quote: Originally posted by bill_kananen: Hopefully enough seats to bring some balance. The special election for Gillibrand's house seat (Hillary's replacement) ended in a difference of only 25 votes. The absentee ballots will decide that seat. The people aren't hurting enough yet. More pain to come. Only 25 votes and in a district that has 70,000 more Republicans than Democrats, even if the Repub wins, it will look like a lose. The Repubs better hope that the absentee ballots run at least 2-1 in favor of the GOP guy. If Murphy wins, it will be a clear sign, IMHO, that the G(rand) O(obstructionist) P(arty) really is in a world of hurt. quote: \"Considering there are 70,000 more Republicans than Democrats, it'd be pretty sad,\" Coughlin, an anti-abortion independent, said with a laugh. \"That wouldn't be a good omen for the future.\" The district includes parts of 10 upstate counties. Sen. Chuck Schumer once said the district - which borders Connecticut, Massachusetts and Vermont - is in some ways \"more like Montana than New York City.\" >>>http://www.nydailynews.com/news/2009/03/29/2009-03-29_run_for_gillibrands_old_house_seat_a_lit-1.html", 
        "intTime": 20090401, 
        "postID": 15, 
        "quote": "Originally posted by bill_kananen: Hopefully enough seats to bring some balance. The special election for Gillibrand's house seat (Hillary's replacement) ended in a difference of only 25 votes. The absentee ballots will decide that seat. The people aren't hurting enough yet. More pain to come.", 
        "reply": " Only 25 votes and in a district that has 70,000 more Republicans than Democrats, even if the Repub wins, it will look like a lose. The Repubs better hope that the absentee ballots run at least 2-1 in favor of the GOP guy. If Murphy wins, it will be a clear sign, IMHO, that the G(rand) O(obstructionist) P(arty) really is in a world of hurt. quote: \"Considering there are 70,000 more Republicans than Democrats, it'd be pretty sad,\" Coughlin, an anti-abortion independent, said with a laugh. \"That wouldn't be a good omen for the future.\" The district includes parts of 10 upstate counties. Sen. Chuck Schumer once said the district - which borders Connecticut, Massachusetts and Vermont - is in some ways \"more like Montana than New York City.\" >>>http://www.nydailynews.com/news/2009/03/29/2009-03-29_run_for_gillibrands_old_house_seat_a_lit-1.html", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-01 20:53:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm all for the Dems trashing the Constitution, rolling back personal freedoms, and breaking the back of this nation's economy....we deserve what we get! As we aspire to become a third world nation, we need the Dems to lead the way!", 
        "intTime": 20090403, 
        "postID": 16, 
        "quote": "", 
        "reply": "I'm all for the Dems trashing the Constitution, rolling back personal freedoms, and breaking the back of this nation's economy....we deserve what we get! As we aspire to become a third world nation, we need the Dems to lead the way!", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-03 14:03:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "EspritDeCorps"
    }, 
    {
        "content": "quote: dmuhler: Won't you feel silly if things get better? Nope! If things get better, no one will care. If things get worse, the lib/socialists are in charge. BTW, the economy was doing great until the lib/socialists took over congress.", 
        "intTime": 20090403, 
        "postID": 17, 
        "quote": "dmuhler: Won't you feel silly if things get better?", 
        "reply": " Nope! If things get better, no one will care. If things get worse, the lib/socialists are in charge. BTW, the economy was doing great until the lib/socialists took over congress.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-03 14:43:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "NYGOP 4/3/09 The race to decide the next representative for the 20th Congressional District proved to be a nail-biter but the numbers look good for Republicans. As the machines are being re-canvassed, Republican candidate Jim Tedisco has thus far picked up 77 votes since the March 31st Special Election and is now leading opponent Scott Murphy by 12 votes. With over 700 more Republican absentee ballots than Democrats, we will take this seat back from the Democrats who won this seat just four short months ago by more than 70,000 votes. As a result of New York Republican State Committee Chairman Joe Mondello's petition, all absentee ballots have been impounded to help protect the integrity of this election, ensure that every legitimate vote is counted and avoid some of the confusion that we have seen in previous elections.", 
        "intTime": 20090404, 
        "postID": 18, 
        "quote": "", 
        "reply": "NYGOP 4/3/09 The race to decide the next representative for the 20th Congressional District proved to be a nail-biter but the numbers look good for Republicans. As the machines are being re-canvassed, Republican candidate Jim Tedisco has thus far picked up 77 votes since the March 31st Special Election and is now leading opponent Scott Murphy by 12 votes. With over 700 more Republican absentee ballots than Democrats, we will take this seat back from the Democrats who won this seat just four short months ago by more than 70,000 votes. As a result of New York Republican State Committee Chairman Joe Mondello's petition, all absentee ballots have been impounded to help protect the integrity of this election, ensure that every legitimate vote is counted and avoid some of the confusion that we have seen in previous elections.", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-04 12:08:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "bill_kananen"
    }, 
    {
        "content": "Ahhhhhhh... But Coleman is cooked Can't wait for the 010 GOP azz whupping again", 
        "intTime": 20090404, 
        "postID": 19, 
        "quote": "", 
        "reply": "Ahhhhhhh... But Coleman is cooked Can't wait for the 010 GOP azz whupping again", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-04 13:24:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "scottrj50"
    }, 
    {
        "content": "quote: Originally posted by scottrj50: Ahhhhhhh... But Coleman is cooked Can't wait for the 010 GOP azz whupping again Mount Rainier will erupt before that ever happens again...so your safe. \"The World's Finest\"", 
        "intTime": 20090404, 
        "postID": 20, 
        "quote": "Originally posted by scottrj50: Ahhhhhhh... But Coleman is cooked Can't wait for the 010 GOP azz whupping again", 
        "reply": " Mount Rainier will erupt before that ever happens again...so your safe. \"The World's Finest\"", 
        "threadID": "409192893_1900045912001", 
        "time": "2009-04-04 13:46:00", 
        "title": "Party of \"NO\" has a new budget proposal.", 
        "userID": "Kegler300"
    }
]