[
    {
        "content": "The United States is looking like a deer caught in the headlights in the face of an oncoming Taliban assault in Afghanistan. Now for the first time controlling large swaths of territory on the outskirts of Kabul, Taliban leaders make no bones about their belief that the tide can turn in their favor this year. Troops are on the way, but troops alone work in the Taliban's favor, and they know it. With more troops and more fighting will come countless more civilian casualties. With more civilian casualties will come a hardening of sentiments against the US. Leading to more Taliban recruiting. It's the formula this insurgency counts on, and we are being far too obliging. The dirty little secret is that the vast majority of young men who join the Taliban do so because it pays $8 a day, plus food and clothing, and it's the only job in town. You might not like the work, but that's who's hiring. The Taliban is still roundly reviled as memories of its brutal rule are fresh. But with a 40% unemployment rate, there are few choices. 19-year-old Jaan Agha from Nawa district told the brave reporters at the Institute of War and Peace Reporting (IWPR). that he had to join the Taleban or watch his family starve. This is the story of most of the men who join the Taliban. quote: \"I couldn’t find a job anywhere,” he said. “So I had to join the Taleban. They give me money for my family expenditures. If I left the Taleban, what else could I do?” “I am not educated, so it’s hard to find a job, although a lot of educated people are also unemployed nowadays,” he said. IWPR states: quote: In the southern province of Helmand, the drug industry and the Taleban seem to be the only career choices currently on offer to young men. Even US commanders understand the problem, with a startling level of sympathy for the plight of Afghan men who are shooting at our troops. Col. Tom Collins, the top Pentagon spokesman in Afghanistan, told PBS: quote: \"There is a low percentage of the total Taliban force who we would call ideologically driven. We refer to them as Tier 1 people who believe their ideology, that what they're doing is right. The vast majority of Taliban fighters are essentially economically disadvantaged young men.\" And no less an expert in the war, former Commander of US Forces in Afghanistan General Karl Eikenberry told Congress in 2007: quote: \"Much of the enemy force is drawn from the ranks of unemployed men looking for wages to support their families.\" The problem is that major turns in foreign policy move slowly, and, with the snows melting in the mountain passes, the Taliban is gearing up for the fight right now. Tick tick tick. What is needed is a leap in imagination and creativity in the quest to head off a terribly bloody and intractable quagmire. US troops have noticed that Afghan fighters are far more tenacious than their Iraqi insurgent counterparts. Where a typical firefight in Iraq might last a half-hour, firefights in Afghanistan can go on for days. It's looking bad, but it's not too late. An emergency works program which puts the relatively good wage of $10 per day into the hands of thousands of Afghan men immediately could bleed the steam from the insurgency. This is considered good money in these parts, and hungry unemployed Afghans will do just about anything for it. Is it dangerous to work on an Afghan road crew? Yes. But guess what? The alternative, Taliban work, is pretty dangerous too, and that's not stopping Afghan men from joining in droves just to collect the $8 a day. Ever been strafed by a C-130? A bullet in every square foot of ground for a mile square, in about 30 seconds, like a fire hose. And it's not stopping Afghan men from collecting their eight bucks. The 17,000 troop surge should be focused not on chasing Taliban around the countryside, which is how civilians are killed and the war is lost, but on protecting work crews. Afghanistan is a country where fully 3/4 of the population has no access to safe drinking water, contributing to an appalling infant mortality rate of one-out-of-four dead before the age of five, from preventable disease, and a mother dying in childbirth every 30 minutes in Kabul alone, the highest maternal mortality rate in the world. If you are getting the picture that all talk of a reconstruction in Afghanistan has been greatly exaggerated, you are right. There has been no reconstruction. The money went to foreign contractors like Kellogg-Root-Brown and the Louis Berger Group, who took a forty percent profit before subcontracting projects to other foreign contractors, who then took their 10 or 15 percent profit, on down the line until what reached Afghans was a trickle. The talking point has been that corruption rules in this country, so you can't send these people money. But the $100 bribe here and $1000 for a police job there is just the Afghan way of doing things, and it still supports families. Moreover, it is pente ante compared to how the big boys do it, the Western contractors, whose billions often never even leave the country of origin but gets transferred straight from one American bank account to another. The basis of any Third World infrastructure program which helps the populace is rural pipeline; pipes for clean water, pipes for electric cable, for sewage systems. Kabul still has a system of open trenches for sewage, and on a hot day the stench is unbearable. Pipes require thousands upon thousands of miles of trenches into and out of rural areas, where the need is greatest. No matter when you get around to laying those pipes, you will always need those trenches. Here is the opportunity to put Afghan men to work at something other than shooting at us. An emergency works program to stop the momentum of a Taliban takeover could be rapidly accomplished by surveyors marking out the trenchlines across the country, importing hundreds of thousands of picks and shovels, and saying \"dig.\" You collect your ten bucks a day at the end of every day, with the military's Provincial Reconstruction Teams to monitor and manage the money. Imagine that. American soldiers handing out money instead of air strikes. We like these guys! It could work. The exposure of foreign engineers who need to be on-site to build bridges and more complex infrastructure is minimized until the country is more stable. Afghan men are used to a much higher risk level in their \"work.\" Moreover, the model is sustainable, because Afghans are geniuses at turning a few months of good wages into what economists call the \"informal economy.\" You buy a taxi, help your brother buy a vending stand, or start hauling your neighbors' produce to market in your brand new donkey cart. Afghanistan will not join the modern world overnight, but it can enter an era of appropriate technology sustainability. IWPR reports that: quote: Joining the Taleban gave Mahmud a chance to save up enough money to start his own small business. Nowadays, he buys goods in the provincial capital Lashkar Gah and sells them in the districts at weekly “mila” or markets. “Now that I have work, I am not with the Taleban any more.” The cost of an emergency works program, at $10 a day, for a million Afghan workers, which is a significant dent in the unemployment, would be well under $3 billion, which is the cost of the present military occupation for about a month, or what we spend in Iraq in about a week. Read that again. A week. It's not something we can't afford to do. It's something we can't afford NOT to try to. Mr. Taliban smiles as he reads this, supremely confidant in Americans' absolute inability to think beyond bullets and bombs. FORWARD THIS TO PRESIDENT OBAMA \"\"http://www.whitehouse.gov/contact/ FORWARD THIS TO YOUR CONGRESS MEMBER \"\"http://www.visi.com/juan/congress/ Question: What is the solution to Afghanistan? Choices: Jobs Development  ", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "\"I couldn’t find a job anywhere,” he said. “So I had to join the Taleban. They give me money for my family expenditures. If I left the Taleban, what else could I do?” “I am not educated, so it’s hard to find a job, although a lot of educated people are also unemployed nowadays,” he said.", 
        "reply": "The United States is looking like a deer caught in the headlights in the face of an oncoming Taliban assault in Afghanistan. Now for the first time controlling large swaths of territory on the outskirts of Kabul, Taliban leaders make no bones about their belief that the tide can turn in their favor this year. Troops are on the way, but troops alone work in the Taliban's favor, and they know it. With more troops and more fighting will come countless more civilian casualties. With more civilian casualties will come a hardening of sentiments against the US. Leading to more Taliban recruiting. It's the formula this insurgency counts on, and we are being far too obliging. The dirty little secret is that the vast majority of young men who join the Taliban do so because it pays $8 a day, plus food and clothing, and it's the only job in town. You might not like the work, but that's who's hiring. The Taliban is still roundly reviled as memories of its brutal rule are fresh. But with a 40% unemployment rate, there are few choices. 19-year-old Jaan Agha from Nawa district told the brave reporters at the Institute of War and Peace Reporting (IWPR). that he had to join the Taleban or watch his family starve. This is the story of most of the men who join the Taliban.  IWPR states: quote: In the southern province of Helmand, the drug industry and the Taleban seem to be the only career choices currently on offer to young men. Even US commanders understand the problem, with a startling level of sympathy for the plight of Afghan men who are shooting at our troops. Col. Tom Collins, the top Pentagon spokesman in Afghanistan, told PBS: quote: \"There is a low percentage of the total Taliban force who we would call ideologically driven. We refer to them as Tier 1 people who believe their ideology, that what they're doing is right. The vast majority of Taliban fighters are essentially economically disadvantaged young men.\" And no less an expert in the war, former Commander of US Forces in Afghanistan General Karl Eikenberry told Congress in 2007: quote: \"Much of the enemy force is drawn from the ranks of unemployed men looking for wages to support their families.\" The problem is that major turns in foreign policy move slowly, and, with the snows melting in the mountain passes, the Taliban is gearing up for the fight right now. Tick tick tick. What is needed is a leap in imagination and creativity in the quest to head off a terribly bloody and intractable quagmire. US troops have noticed that Afghan fighters are far more tenacious than their Iraqi insurgent counterparts. Where a typical firefight in Iraq might last a half-hour, firefights in Afghanistan can go on for days. It's looking bad, but it's not too late. An emergency works program which puts the relatively good wage of $10 per day into the hands of thousands of Afghan men immediately could bleed the steam from the insurgency. This is considered good money in these parts, and hungry unemployed Afghans will do just about anything for it. Is it dangerous to work on an Afghan road crew? Yes. But guess what? The alternative, Taliban work, is pretty dangerous too, and that's not stopping Afghan men from joining in droves just to collect the $8 a day. Ever been strafed by a C-130? A bullet in every square foot of ground for a mile square, in about 30 seconds, like a fire hose. And it's not stopping Afghan men from collecting their eight bucks. The 17,000 troop surge should be focused not on chasing Taliban around the countryside, which is how civilians are killed and the war is lost, but on protecting work crews. Afghanistan is a country where fully 3/4 of the population has no access to safe drinking water, contributing to an appalling infant mortality rate of one-out-of-four dead before the age of five, from preventable disease, and a mother dying in childbirth every 30 minutes in Kabul alone, the highest maternal mortality rate in the world. If you are getting the picture that all talk of a reconstruction in Afghanistan has been greatly exaggerated, you are right. There has been no reconstruction. The money went to foreign contractors like Kellogg-Root-Brown and the Louis Berger Group, who took a forty percent profit before subcontracting projects to other foreign contractors, who then took their 10 or 15 percent profit, on down the line until what reached Afghans was a trickle. The talking point has been that corruption rules in this country, so you can't send these people money. But the $100 bribe here and $1000 for a police job there is just the Afghan way of doing things, and it still supports families. Moreover, it is pente ante compared to how the big boys do it, the Western contractors, whose billions often never even leave the country of origin but gets transferred straight from one American bank account to another. The basis of any Third World infrastructure program which helps the populace is rural pipeline; pipes for clean water, pipes for electric cable, for sewage systems. Kabul still has a system of open trenches for sewage, and on a hot day the stench is unbearable. Pipes require thousands upon thousands of miles of trenches into and out of rural areas, where the need is greatest. No matter when you get around to laying those pipes, you will always need those trenches. Here is the opportunity to put Afghan men to work at something other than shooting at us. An emergency works program to stop the momentum of a Taliban takeover could be rapidly accomplished by surveyors marking out the trenchlines across the country, importing hundreds of thousands of picks and shovels, and saying \"dig.\" You collect your ten bucks a day at the end of every day, with the military's Provincial Reconstruction Teams to monitor and manage the money. Imagine that. American soldiers handing out money instead of air strikes. We like these guys! It could work. The exposure of foreign engineers who need to be on-site to build bridges and more complex infrastructure is minimized until the country is more stable. Afghan men are used to a much higher risk level in their \"work.\" Moreover, the model is sustainable, because Afghans are geniuses at turning a few months of good wages into what economists call the \"informal economy.\" You buy a taxi, help your brother buy a vending stand, or start hauling your neighbors' produce to market in your brand new donkey cart. Afghanistan will not join the modern world overnight, but it can enter an era of appropriate technology sustainability. IWPR reports that: quote: Joining the Taleban gave Mahmud a chance to save up enough money to start his own small business. Nowadays, he buys goods in the provincial capital Lashkar Gah and sells them in the districts at weekly “mila” or markets. “Now that I have work, I am not with the Taleban any more.” The cost of an emergency works program, at $10 a day, for a million Afghan workers, which is a significant dent in the unemployment, would be well under $3 billion, which is the cost of the present military occupation for about a month, or what we spend in Iraq in about a week. Read that again. A week. It's not something we can't afford to do. It's something we can't afford NOT to try to. Mr. Taliban smiles as he reads this, supremely confidant in Americans' absolute inability to think beyond bullets and bombs. FORWARD THIS TO PRESIDENT OBAMA \"\"http://www.whitehouse.gov/contact/ FORWARD THIS TO YOUR CONGRESS MEMBER \"\"http://www.visi.com/juan/congress/ Question: What is the solution to Afghanistan? Choices: Jobs Development  ", 
        "threadID": "409192893_5970055712001", 
        "time": "2009-03-11 13:08:00", 
        "title": "A Real Solution for Afghanistan Will Save Soldier's Lives", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "Obviously you haven't been paying attention. Our military commanders are way ahead of you. They have already analyzed the support re: Taliban and will take appropriate measures. The aim is not to kill all the Taliban and conquer A-stan but to neutralize support by offering viable alternatives. The troops are needed for security.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "Obviously you haven't been paying attention. Our military commanders are way ahead of you. They have already analyzed the support re: Taliban and will take appropriate measures. The aim is not to kill all the Taliban and conquer A-stan but to neutralize support by offering viable alternatives. The troops are needed for security.", 
        "threadID": "409192893_5970055712001", 
        "time": "2009-03-11 13:23:00", 
        "title": "A Real Solution for Afghanistan Will Save Soldier's Lives", 
        "userID": "Thud357L"
    }, 
    {
        "content": "WichitaKid, We got us a couple of smart guys that already started thinking down these lines in Iraq. And it worked. It won't be as easy in Afghanistan, as this article points out, them are SERIOUS fighters. Also, Iraq had a history already as a developed functioning state. Afghanistan never made it that far, due to intermittent warfare for most of its history. But, if Afghans are given an alternative means of income, if they are supplied with clean water and basic medical care for their families, it can't hurt any. Also, more troops do not equal more civilian casualties. Infantry guys on the ground can more accurately tell enemy from neutral than can any but the smartest airborne assets.", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "", 
        "reply": "WichitaKid, We got us a couple of smart guys that already started thinking down these lines in Iraq. And it worked. It won't be as easy in Afghanistan, as this article points out, them are SERIOUS fighters. Also, Iraq had a history already as a developed functioning state. Afghanistan never made it that far, due to intermittent warfare for most of its history. But, if Afghans are given an alternative means of income, if they are supplied with clean water and basic medical care for their families, it can't hurt any. Also, more troops do not equal more civilian casualties. Infantry guys on the ground can more accurately tell enemy from neutral than can any but the smartest airborne assets.", 
        "threadID": "409192893_5970055712001", 
        "time": "2009-03-12 17:14:00", 
        "title": "A Real Solution for Afghanistan Will Save Soldier's Lives", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: WichitaKid, Also, more troops do not equal more civilian casualties. Infantry guys on the ground can more accurately tell enemy from neutral than can any but the smartest airborne assets. This is true, ground forces are best at minimizing civilian casualties. The problem is when you are surrounded and outnumbered the airstrikes are called in, then it's a different story. Especially when they hide in civilian compounds deliberately.", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "Originally posted by Ruanne: WichitaKid, Also, more troops do not equal more civilian casualties. Infantry guys on the ground can more accurately tell enemy from neutral than can any but the smartest airborne assets.", 
        "reply": " This is true, ground forces are best at minimizing civilian casualties. The problem is when you are surrounded and outnumbered the airstrikes are called in, then it's a different story. Especially when they hide in civilian compounds deliberately.", 
        "threadID": "409192893_5970055712001", 
        "time": "2009-03-13 15:18:00", 
        "title": "A Real Solution for Afghanistan Will Save Soldier's Lives", 
        "userID": "WitchitaKid"
    }, 
    {
        "content": "There was a better window of opportunity to develop Afghanistan not long after the Taliban were driven away. The State Department didn't send the personnel it would take because security was a concern. Outside investment and development didn't occur because security was a concern. These two endeavors are still necessary, but security has deteriorated. At what point will security and development come together in a sincere effort to improve Afghanistan?", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "", 
        "reply": "There was a better window of opportunity to develop Afghanistan not long after the Taliban were driven away. The State Department didn't send the personnel it would take because security was a concern. Outside investment and development didn't occur because security was a concern. These two endeavors are still necessary, but security has deteriorated. At what point will security and development come together in a sincere effort to improve Afghanistan?", 
        "threadID": "409192893_5970055712001", 
        "time": "2009-03-13 16:00:00", 
        "title": "A Real Solution for Afghanistan Will Save Soldier's Lives", 
        "userID": "catahoulagill"
    }
]