[
    {
        "content": "quote: The North Atlantic Alliance held its sixtieth anniversary summit last week at Strasburg-Kehl, amid growing doubts about its mission, its geographic scope, and the threats it should be called upon to counter. The NATO leaders adopted a Declaration on Alliance Security and launched a process to develop a new Strategic Concept, a document that will define NATO’s longer-term role in the new security environment of the 21st century. Where is NATO heading after these sixty years? Will its geographic boundaries be finally defined? Will the Russia-NATO Council evolve into a viable decision making body? Is Russia a possible future member of NATO? Some NATO leaders made conflicting statements during the summit. A few of them raise eyebrows as a possible indication of realism growing in the post-George Bush era. German Chancellor Angela Merkel stated a week before the summit that the alliance’s geographic borders need to be clearly defined, a less-than-subtle hint that the enlargement process, a thorn in the relationship with Russia, has probably run its course and should be allowed to die a natural death. This is all too important because there has been a large degree of uncertainty with regard to the idea floated by many in the United States to make NATO into a global alliance of democracies, by opening membership to non-European democracies like Australia, New Zealand, South Korea, Japan, India, and others. Two of the most prominent advocates of this idea now serve in the Barack Obama administration – Phil Gordon, assistant secretary of state for Europe, and Ivo Daalder, the new U.S. ambassador to NATO. But president Obama has poured some cold water onto this approach by saying that NATO can’t do everything everywhere. Although the summit’s declaration reaffirms the commitment to keeping NATO's door open to new members, it is quite likely that this round’s enlargement to Albania and Croatia – the process long in the pipeline – will be the last one for the foreseeable future. Ukraine's or Georgia’s membership prospects have not even been discussed at the summit, while the French defense minister bluntly stated that this issue could not be considered without Russia. Russia, it seems, has been an invisible presence at the summit, as the alliance decided to resume operations of the Russia-NATO Council that has been in a coma after the August war with Georgia. U.S. President Barack Obama stated that NATO should take Russia’s legitimate interests into account, and while not necessarily agreeing with Russia on everything, it should seek to forge common ground with Russia wherever feasible. Polish Defense Minister Radek Sikorsky, no particular friend of Russia, even wrote in a major Western daily that NATO should seriously consider offering membership to Russia. The summit declaration refers to Russia as a strategic partner, and says that a NATO Russia partnership is a “strategic element in fostering security in the Euro Atlantic area.” NATO leaders declared that Russia is of particular importance to NATO as a partner and neighbor, and that NATO and Russia share common security interests, such as the stabilization of Afghanistan, arms control, disarmament and the non-proliferation of weapons of mass destruction. Where is NATO heading after these sixty years? Will its geographic boundaries be finally defined, as Merkel suggested, or will the proponents of NATO as a global “concert of democracies” be able to turn the alliance into a mini version of the United Nations? Will the enlargement process ever end? What is the new Strategic Concept likely to say on the nature and scope of threats the Alliance will be called upon to counter? How will the relationship with Russia evolve under the Obama administration stewardship? Will the Russia-NATO Council evolve into a viable decision making body, on issues where Russia’s and NATO’s interests overlap? Is Russia a possible future member of NATO? (....) If interested, you can also read responses by: -Ethan S. Burger, Adjunct Professor, Georgetown University Law Center, Washington, DC -Professor Stephen Blank, the U.S. Army War College, Carlyle Barracks, PA -Vice Admiral Ulrich Weisser (ret.), Former Chief of the Planning Staff in the German Defense Ministry, Bonn, Germany -Vladimir Belaeff, President, Global Society Institute, Inc., United States -James George Jatras, Deputy Director, American Institute in Ukraine, Director, American Council for Kosovo -Nicholas Sluchevsky, President, the PaS Group, United States +http://www.russiaprofile.org/page.php?pageid=Experts'%20Panel&articleid=a1239457893 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "The North Atlantic Alliance held its sixtieth anniversary summit last week at Strasburg-Kehl, amid growing doubts about its mission, its geographic scope, and the threats it should be called upon to counter. The NATO leaders adopted a Declaration on Alliance Security and launched a process to develop a new Strategic Concept, a document that will define NATO’s longer-term role in the new security environment of the 21st century. Where is NATO heading after these sixty years? Will its geographic boundaries be finally defined? Will the Russia-NATO Council evolve into a viable decision making body? Is Russia a possible future member of NATO? Some NATO leaders made conflicting statements during the summit. A few of them raise eyebrows as a possible indication of realism growing in the post-George Bush era. German Chancellor Angela Merkel stated a week before the summit that the alliance’s geographic borders need to be clearly defined, a less-than-subtle hint that the enlargement process, a thorn in the relationship with Russia, has probably run its course and should be allowed to die a natural death. This is all too important because there has been a large degree of uncertainty with regard to the idea floated by many in the United States to make NATO into a global alliance of democracies, by opening membership to non-European democracies like Australia, New Zealand, South Korea, Japan, India, and others. Two of the most prominent advocates of this idea now serve in the Barack Obama administration – Phil Gordon, assistant secretary of state for Europe, and Ivo Daalder, the new U.S. ambassador to NATO. But president Obama has poured some cold water onto this approach by saying that NATO can’t do everything everywhere. Although the summit’s declaration reaffirms the commitment to keeping NATO's door open to new members, it is quite likely that this round’s enlargement to Albania and Croatia – the process long in the pipeline – will be the last one for the foreseeable future. Ukraine's or Georgia’s membership prospects have not even been discussed at the summit, while the French defense minister bluntly stated that this issue could not be considered without Russia. Russia, it seems, has been an invisible presence at the summit, as the alliance decided to resume operations of the Russia-NATO Council that has been in a coma after the August war with Georgia. U.S. President Barack Obama stated that NATO should take Russia’s legitimate interests into account, and while not necessarily agreeing with Russia on everything, it should seek to forge common ground with Russia wherever feasible. Polish Defense Minister Radek Sikorsky, no particular friend of Russia, even wrote in a major Western daily that NATO should seriously consider offering membership to Russia. The summit declaration refers to Russia as a strategic partner, and says that a NATO Russia partnership is a “strategic element in fostering security in the Euro Atlantic area.” NATO leaders declared that Russia is of particular importance to NATO as a partner and neighbor, and that NATO and Russia share common security interests, such as the stabilization of Afghanistan, arms control, disarmament and the non-proliferation of weapons of mass destruction. Where is NATO heading after these sixty years? Will its geographic boundaries be finally defined, as Merkel suggested, or will the proponents of NATO as a global “concert of democracies” be able to turn the alliance into a mini version of the United Nations? Will the enlargement process ever end? What is the new Strategic Concept likely to say on the nature and scope of threats the Alliance will be called upon to counter? How will the relationship with Russia evolve under the Obama administration stewardship? Will the Russia-NATO Council evolve into a viable decision making body, on issues where Russia’s and NATO’s interests overlap? Is Russia a possible future member of NATO? (....)", 
        "reply": " If interested, you can also read responses by: -Ethan S. Burger, Adjunct Professor, Georgetown University Law Center, Washington, DC -Professor Stephen Blank, the U.S. Army War College, Carlyle Barracks, PA -Vice Admiral Ulrich Weisser (ret.), Former Chief of the Planning Staff in the German Defense Ministry, Bonn, Germany -Vladimir Belaeff, President, Global Society Institute, Inc., United States -James George Jatras, Deputy Director, American Institute in Ukraine, Director, American Council for Kosovo -Nicholas Sluchevsky, President, the PaS Group, United States +http://www.russiaprofile.org/page.php?pageid=Experts'%20Panel&articleid=a1239457893 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "409192893_7350043122001", 
        "time": "2009-04-21 05:30:00", 
        "title": "NATO at Sixty", 
        "userID": "NSNN"
    }, 
    {
        "content": "The way this one-sided partnership has been going. We should opt out of it. Europe feels they can decide for and defend themselves?.....have at it!", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "The way this one-sided partnership has been going. We should opt out of it. Europe feels they can decide for and defend themselves?.....have at it!", 
        "threadID": "409192893_7350043122001", 
        "time": "2009-04-21 07:05:00", 
        "title": "NATO at Sixty", 
        "userID": "_cash_"
    }
]