[
    {
        "content": "If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\"", 
        "intTime": 20090331, 
        "postID": 1, 
        "quote": "", 
        "reply": "If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\"", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-03-31 22:05:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 16:58:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. Exactly as I see it and the counter info was the major part of the conspiracy since the plan was formulated years ago and vaulted away for fifty years. Operation Mongoose. The counter information was carefully considered for every possible scienerio and expanation to questions and accusations that would be asked. It only proves to me the control they have over the media and people. And its scary. We have signed our own death warrants by allowing it to fade away.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "reply": " Exactly as I see it and the counter info was the major part of the conspiracy since the plan was formulated years ago and vaulted away for fifty years. Operation Mongoose. The counter information was carefully considered for every possible scienerio and expanation to questions and accusations that would be asked. It only proves to me the control they have over the media and people. And its scary. We have signed our own death warrants by allowing it to fade away.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 20:54:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. Are you trying to say that the people who made that POS movie Peral Harbor had advanced knowledge of 9-11? Because that's what it sounds like. And could you PLEASE provide some sort of evidence that FDR had advanced knowledge of the attack.", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools.", 
        "reply": " Are you trying to say that the people who made that POS movie Peral Harbor had advanced knowledge of 9-11? Because that's what it sounds like. And could you PLEASE provide some sort of evidence that FDR had advanced knowledge of the attack.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:02:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower?", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "reply": " So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:16:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by F14engtech: quote: Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower? Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by F14engtech: quote: Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower?", 
        "reply": " Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:27:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick. Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough.", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick.", 
        "reply": " Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:46:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by F14engtech: quote: Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick. Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough. No one has to tell you that you can read it for yourself in the Northwoods documents. The fact was they tried it in the first attack under the clinton administration and it wasnt large enough to sell a war so they switched to plan B and still if bush didnt lie to congress get WPA then expand on it, it wouldnt have been passed. Who the THEY were Remains the mystery.", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "Originally posted by F14engtech: quote: Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick. Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough.", 
        "reply": " No one has to tell you that you can read it for yourself in the Northwoods documents. The fact was they tried it in the first attack under the clinton administration and it wasnt large enough to sell a war so they switched to plan B and still if bush didnt lie to congress get WPA then expand on it, it wouldnt have been passed. Who the THEY were Remains the mystery.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 23:17:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s.", 
        "intTime": 20090406, 
        "postID": 9, 
        "quote": "", 
        "reply": "The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-06 13:39:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s. What history books have you been reading? The USS Ward fired on and SUNK a Japanese midget sub. It did not CAPTURE the sub. In addition the USS Ward did send a report back to Pearl Harbor and it was recieved. The mistake the skipper made was stating only that he attacked a submarine. He failed to mention that he had actually sunk one. Prior to the attack destoyers on patrol around Oahu had made all kinds of reports about attacking subs. What they actually did was kill a lot of fish. So the report got thrown in the pile. It was not until after the attack did they recognize the signifigance of the Ward report. Why don't you try reading At Dawn We Slept and throw away whatever books you have been reading about the subject. This message has been edited. Last edited by: F14engtech, Tue 07 April 2009 09:34 AM", 
        "intTime": 20090407, 
        "postID": 10, 
        "quote": "Originally posted by StaffSgtGraham: The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s.", 
        "reply": " What history books have you been reading? The USS Ward fired on and SUNK a Japanese midget sub. It did not CAPTURE the sub. In addition the USS Ward did send a report back to Pearl Harbor and it was recieved. The mistake the skipper made was stating only that he attacked a submarine. He failed to mention that he had actually sunk one. Prior to the attack destoyers on patrol around Oahu had made all kinds of reports about attacking subs. What they actually did was kill a lot of fish. So the report got thrown in the pile. It was not until after the attack did they recognize the signifigance of the Ward report. Why don't you try reading At Dawn We Slept and throw away whatever books you have been reading about the subject. This message has been edited. Last edited by: F14engtech, Tue 07 April 2009 09:34 AM", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-07 09:17:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "intTime": 20090407, 
        "postID": 11, 
        "quote": "", 
        "reply": "So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-07 21:46:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach? do you know what a \"replica\" is?", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "reply": " do you know what a \"replica\" is?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 01:41:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "my mistake. The one in texas is real. It was the HA. 19. It was run aground at pearl harbor. The one sunk by the USS Ward is still underwater off the coast.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "", 
        "reply": "my mistake. The one in texas is real. It was the HA. 19. It was run aground at pearl harbor. The one sunk by the USS Ward is still underwater off the coast.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 01:53:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I stand corrected. When I visited the museum was before they were fully in operation(Sep04?) and I was only allowed about 20min. inside. I took a pic of the sub, touched it and ASSumed it was the one seen by 3 ships before being sunk by the Ward. That was over half-an-hour before the Japanese attack. Indeed I wrote a short essay in 2002 comparing 9/11 to PH and stated \"the U.S. fired the first shot of WW2 when it sunk a jap mini-submarine\". I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" Before PH 88% of the public opposed going to war with Europe. FDR pulled a Woodrow Wilson and claimed he didn't want to send \"our boys\" over there when running for re-election. Most wars can be traced to a set-up provocation like Hitler's attack on Poland and the Lusitania hauling armaments in its hull. I believe the OKC bombing was also a set-up because in previous months the FBI was frustratedn stemming the tide of the militia-movement. The bombing, McVeigh, Nichols & the FBI-plant provacatuer known as John Doe#2 made \"militia\" a bad word. However I digress. This thread concerns 9/11 and I read a few days after that attack the U.S. Intelligence office in the WTC was vacant on 9/11 due to a convenient conference out west somewhere. As you can imagine I have serious doubts about the Waco cover-up and Ruby Ridge also. In the movie Pearl Harbor it was realistic pretty much throughout especially the part about all those nurses showing up before the attack. FDR had warned officials in the Red Cross about \"mass casualties\" within weeks. Also coincidently the entire National Guard was on Active Duty for training at the time too.", 
        "intTime": 20090408, 
        "postID": 14, 
        "quote": "", 
        "reply": "I stand corrected. When I visited the museum was before they were fully in operation(Sep04?) and I was only allowed about 20min. inside. I took a pic of the sub, touched it and ASSumed it was the one seen by 3 ships before being sunk by the Ward. That was over half-an-hour before the Japanese attack. Indeed I wrote a short essay in 2002 comparing 9/11 to PH and stated \"the U.S. fired the first shot of WW2 when it sunk a jap mini-submarine\". I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" Before PH 88% of the public opposed going to war with Europe. FDR pulled a Woodrow Wilson and claimed he didn't want to send \"our boys\" over there when running for re-election. Most wars can be traced to a set-up provocation like Hitler's attack on Poland and the Lusitania hauling armaments in its hull. I believe the OKC bombing was also a set-up because in previous months the FBI was frustratedn stemming the tide of the militia-movement. The bombing, McVeigh, Nichols & the FBI-plant provacatuer known as John Doe#2 made \"militia\" a bad word. However I digress. This thread concerns 9/11 and I read a few days after that attack the U.S. Intelligence office in the WTC was vacant on 9/11 due to a convenient conference out west somewhere. As you can imagine I have serious doubts about the Waco cover-up and Ruby Ridge also. In the movie Pearl Harbor it was realistic pretty much throughout especially the part about all those nurses showing up before the attack. FDR had warned officials in the Red Cross about \"mass casualties\" within weeks. Also coincidently the entire National Guard was on Active Duty for training at the time too.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 06:53:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach? The one you are refering to was recovered AFTER the attack. And it's not the one sunk by the USS Ward. That submarine is sitting in about 2000ft of water.", 
        "intTime": 20090408, 
        "postID": 15, 
        "quote": "Originally posted by StaffSgtGraham: So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "reply": " The one you are refering to was recovered AFTER the attack. And it's not the one sunk by the USS Ward. That submarine is sitting in about 2000ft of water.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 07:57:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake.", 
        "intTime": 20090408, 
        "postID": 16, 
        "quote": "", 
        "reply": "I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 08:07:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake. Only one of the midget crewman was captured. ANother one of the subs was recovered and used as fill. A third one was recovered in 1960 and returned to Japan.", 
        "intTime": 20090408, 
        "postID": 17, 
        "quote": "Originally posted by StaffSgtGraham: I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake.", 
        "reply": " Only one of the midget crewman was captured. ANother one of the subs was recovered and used as fill. A third one was recovered in 1960 and returned to Japan.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 10:14:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" . That's what is commonly called hearsay. And who exactly is this person, does he have a name? Here's a review of Day of Deceit. *^&%www.usncva.org/books/book-10.html*&%", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "Originally posted by StaffSgtGraham: I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" .", 
        "reply": " That's what is commonly called hearsay. And who exactly is this person, does he have a name? Here's a review of Day of Deceit. *^&%www.usncva.org/books/book-10.html*&%", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 10:27:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "Kind of reminds me of that movie Red October where the Ord Tech was going to \"fire\" the torpedo, but then was stopped by the NSA Officer and was told that he DID fire it by the agent. I can see the watch looking at the radar, sending it back to HQ, then an agent telling the OOD \"you do not see a fleet of Japanese bombers, it is a squadron of our B-17s coming in from the states. But then again, I am sure years later that OOD or whoever was on watch that night would have spilled the beans. Either way, something is just not right about that whole thing. This was 1 HOUR before the attack began. \"Just after 7 a.m., Elliott saw \"something completely out of the ordinary\" on the screen, a huge blip, due north, 137 miles out. The information was called in to headquarters, and the operators were told it was a flight of B-17 Flying Fortresses due in from California.\" What time did they sink the Japanese sub and what time was the radar message sent to HG?", 
        "intTime": 20090411, 
        "postID": 19, 
        "quote": "", 
        "reply": "Kind of reminds me of that movie Red October where the Ord Tech was going to \"fire\" the torpedo, but then was stopped by the NSA Officer and was told that he DID fire it by the agent. I can see the watch looking at the radar, sending it back to HQ, then an agent telling the OOD \"you do not see a fleet of Japanese bombers, it is a squadron of our B-17s coming in from the states. But then again, I am sure years later that OOD or whoever was on watch that night would have spilled the beans. Either way, something is just not right about that whole thing. This was 1 HOUR before the attack began. \"Just after 7 a.m., Elliott saw \"something completely out of the ordinary\" on the screen, a huge blip, due north, 137 miles out. The information was called in to headquarters, and the operators were told it was a flight of B-17 Flying Fortresses due in from California.\" What time did they sink the Japanese sub and what time was the radar message sent to HG?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 08:31:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by john2x: If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\" No way. It takes DAYS to rig a building to be brought down in an orderly fashion using explosives. However internal stresses in many of the right points can produce the same effect. Look how the twins came down? Who would have thought that would have happened? It almost looks like a control demolition as well. But this sounds quite reasonable to me: \"As the North Tower collapsed on September 11, 2001, debris hit 7 World Trade Center, causing heavy damage to the south face of the building.[3] The bottom portion of the building's south face was heavily damaged by debris, including damage to the southwest corner from the 8th to 18th floors, a large vertical gash on the center-bottom extending at least ten floors, and other damage as high as the 18th floor.[3] The building was equipped with a sprinkler system, but had many single-point vulnerabilities for failure: the sprinkler system required manual initiation of the electrical fire pumps, rather than being a fully automatic system; the floor-level controls had a single connection to the sprinkler water riser; and the sprinkler system required some power for the fire pump to deliver water. Also, water pressure was low, with little or no water to feed sprinklers.[27][28] After the North Tower collapsed, some firefighters entered 7 World Trade Center to search the building. They attempted to extinguish small pockets of fire, but low water pressure hindered their efforts.[29] A massive fire burned into the afternoon on the 11th and 12th floors of 7 World Trade Center, the flames visible on the east side of the building.[30][31] During the afternoon, fire was also seen on floors 6–10, 13–14, 19–22, and 29–30.[3] In particular, the fires on floors 7 through 9 and 11 through 13 continued to burn out of control during the afternoon.[32] At approximately 2:00 p.m., firefighters noticed a bulge in the southwest corner of 7 World Trade Center between the 10th and 13th floors, a sign that the building was unstable and might collapse.[33] During the afternoon, firefighters also heard creaking sounds coming from the building.[34] Around 3:30 pm FDNY Chief Daniel Nigro decided to halt rescue operations, surface removal, and searches along the surface of the debris near 7 World Trade Center and evacuate the area due to concerns for the safety of personnel.[33][35] At 5:20 p.m. EDT on September 11, 2001, 7 World Trade Center collapsed. There were no casualties associated with the collapse.\"", 
        "intTime": 20090411, 
        "postID": 20, 
        "quote": "Originally posted by john2x: If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\"", 
        "reply": " No way. It takes DAYS to rig a building to be brought down in an orderly fashion using explosives. However internal stresses in many of the right points can produce the same effect. Look how the twins came down? Who would have thought that would have happened? It almost looks like a control demolition as well. But this sounds quite reasonable to me: \"As the North Tower collapsed on September 11, 2001, debris hit 7 World Trade Center, causing heavy damage to the south face of the building.[3] The bottom portion of the building's south face was heavily damaged by debris, including damage to the southwest corner from the 8th to 18th floors, a large vertical gash on the center-bottom extending at least ten floors, and other damage as high as the 18th floor.[3] The building was equipped with a sprinkler system, but had many single-point vulnerabilities for failure: the sprinkler system required manual initiation of the electrical fire pumps, rather than being a fully automatic system; the floor-level controls had a single connection to the sprinkler water riser; and the sprinkler system required some power for the fire pump to deliver water. Also, water pressure was low, with little or no water to feed sprinklers.[27][28] After the North Tower collapsed, some firefighters entered 7 World Trade Center to search the building. They attempted to extinguish small pockets of fire, but low water pressure hindered their efforts.[29] A massive fire burned into the afternoon on the 11th and 12th floors of 7 World Trade Center, the flames visible on the east side of the building.[30][31] During the afternoon, fire was also seen on floors 6–10, 13–14, 19–22, and 29–30.[3] In particular, the fires on floors 7 through 9 and 11 through 13 continued to burn out of control during the afternoon.[32] At approximately 2:00 p.m., firefighters noticed a bulge in the southwest corner of 7 World Trade Center between the 10th and 13th floors, a sign that the building was unstable and might collapse.[33] During the afternoon, firefighters also heard creaking sounds coming from the building.[34] Around 3:30 pm FDNY Chief Daniel Nigro decided to halt rescue operations, surface removal, and searches along the surface of the debris near 7 World Trade Center and evacuate the area due to concerns for the safety of personnel.[33][35] At 5:20 p.m. EDT on September 11, 2001, 7 World Trade Center collapsed. There were no casualties associated with the collapse.\"", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 08:53:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "But then again this just came out a couple of days ago... \"A team of scientists claim to have unearthed startling data from dust and debris gathered in the days and weeks after the World Trade Center towers collapsed on Sept. 11, 2001.\" \"In a study published by the Open Chemical Physics Journal — a peer-reviewed, scientific publication — Steven E. Jones and Niels Harrit level a stark allegation: that within the dust and rubble of the World Trade Center towers lays evidence of “a highly engineered explosive,” contrary to all federal studies of the collapses.\" \"http://www.infowars.com/study-claims-highly-engineered-explosive-found-in-wtc-rubble/\" I opt to believe the Wiki story.", 
        "intTime": 20090411, 
        "postID": 21, 
        "quote": "", 
        "reply": "But then again this just came out a couple of days ago... \"A team of scientists claim to have unearthed startling data from dust and debris gathered in the days and weeks after the World Trade Center towers collapsed on Sept. 11, 2001.\" \"In a study published by the Open Chemical Physics Journal — a peer-reviewed, scientific publication — Steven E. Jones and Niels Harrit level a stark allegation: that within the dust and rubble of the World Trade Center towers lays evidence of “a highly engineered explosive,” contrary to all federal studies of the collapses.\" \"http://www.infowars.com/study-claims-highly-engineered-explosive-found-in-wtc-rubble/\" I opt to believe the Wiki story.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 09:06:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Graham I have been studying this stuff for a long time and your sources are suspect big guy!! Some one already corrected you about the sub the U.S.S. Ward sank, and you have made note of it. There is a documentary that was made and the sub has been found in 1100 feet of water off the harbor entrance at Pearl. Now the first shots of the war were not fried by us at Pearl Harbor....They were fired many times during convoy operations in the North Atlantic as we depth charged several German submarines to keep them down so convoys could escape. From 1940 onward till the declaration of war by germany on us in Dec. 1941. In fact we attacked and depth charged, from the U.S.S. Greeley a german submarine for over three hours once and finally the U boat fired on the Greeley and this incident almost propelled us into the war much earlier than 12 8 41!! Hitler knew all too well the results of our entering the first world war and gave orders many times to NOT fire on U.S. vessels during the convoy runs from 1940 to the official beginning of the war. The skipper of the sub that fired on the Greelay was relieved and later after the entry by us into the conflict openly, was given a new command and a medal for his actions!! Probably as near to an open apology that Hitler ever got!! If you want conspiricies this, incident was all that L.B.J. wished the ginned up \"Gulf of Tonkin incident\" was, that got us finally heavily involved in Viet Nam in 1964, which incident by the way, was completwely false!!! The skipper of one of the ships involved was amost relieved for writing a memo to that effect which was quickly squashed!! T", 
        "intTime": 20090411, 
        "postID": 22, 
        "quote": "", 
        "reply": "Graham I have been studying this stuff for a long time and your sources are suspect big guy!! Some one already corrected you about the sub the U.S.S. Ward sank, and you have made note of it. There is a documentary that was made and the sub has been found in 1100 feet of water off the harbor entrance at Pearl. Now the first shots of the war were not fried by us at Pearl Harbor....They were fired many times during convoy operations in the North Atlantic as we depth charged several German submarines to keep them down so convoys could escape. From 1940 onward till the declaration of war by germany on us in Dec. 1941. In fact we attacked and depth charged, from the U.S.S. Greeley a german submarine for over three hours once and finally the U boat fired on the Greeley and this incident almost propelled us into the war much earlier than 12 8 41!! Hitler knew all too well the results of our entering the first world war and gave orders many times to NOT fire on U.S. vessels during the convoy runs from 1940 to the official beginning of the war. The skipper of the sub that fired on the Greelay was relieved and later after the entry by us into the conflict openly, was given a new command and a medal for his actions!! Probably as near to an open apology that Hitler ever got!! If you want conspiricies this, incident was all that L.B.J. wished the ginned up \"Gulf of Tonkin incident\" was, that got us finally heavily involved in Viet Nam in 1964, which incident by the way, was completwely false!!! The skipper of one of the ships involved was amost relieved for writing a memo to that effect which was quickly squashed!! T", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 09:06:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "tawodi"
    }, 
    {
        "content": "Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "intTime": 20090411, 
        "postID": 23, 
        "quote": "", 
        "reply": "Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 17:04:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents. For the entire commentary the below snippet originates from, go to the below (cold) link! http://www.winstonchurchill.org/i4a/pages/index.cfm?pageid=40#OPIUM quote: On the anniversary of Pearl Harbor, the History Channel, whose programs vary between solid history and opium for the people, ran a BBC-produced documentary claiming that Franklin Roosevelt knew all about the surprise attack and allowed it to happen to get the United States into the war. The program, as Arthur Balfour might have said, contained much that is trite and much that it true, but what was true was trite, and what was not trite was not true. That \"Betrayal at Pearl Harbor\" should not be taken seriously is manifestly evident. Examples of why it shouldn't begin with its interview of Robert Ogg, which approaches dishonesty. The producers fail to inform the audience that Mr. Ogg is the infamous \"Seaman Z\" immortalized by John Toland, an early conspiracy theorist who wrote that Pearl Harbor was plotted by FDR. \"Seaman Z,\" whose story has had a nasty habit of changing over the years, claimed he heard \"q u e e r signals\" which could have been the missing Japanese aircraft carriers. But he could only have been hearing the carriers if the carriers were broadcasting. The Japanese themselves claim their fleet (Kido Butai) never sent a single message......{snip}..... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090412, 
        "postID": 24, 
        "quote": "Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "reply": " For the entire commentary the below snippet originates from, go to the below (cold) link! http://www.winstonchurchill.org/i4a/pages/index.cfm?pageid=40#OPIUM quote: On the anniversary of Pearl Harbor, the History Channel, whose programs vary between solid history and opium for the people, ran a BBC-produced documentary claiming that Franklin Roosevelt knew all about the surprise attack and allowed it to happen to get the United States into the war. The program, as Arthur Balfour might have said, contained much that is trite and much that it true, but what was true was trite, and what was not trite was not true. That \"Betrayal at Pearl Harbor\" should not be taken seriously is manifestly evident. Examples of why it shouldn't begin with its interview of Robert Ogg, which approaches dishonesty. The producers fail to inform the audience that Mr. Ogg is the infamous \"Seaman Z\" immortalized by John Toland, an early conspiracy theorist who wrote that Pearl Harbor was plotted by FDR. \"Seaman Z,\" whose story has had a nasty habit of changing over the years, claimed he heard \"q u e e r signals\" which could have been the missing Japanese aircraft carriers. But he could only have been hearing the carriers if the carriers were broadcasting. The Japanese themselves claim their fleet (Kido Butai) never sent a single message......{snip}..... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-12 06:52:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41. A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\"", 
        "intTime": 20090412, 
        "postID": 25, 
        "quote": "", 
        "reply": "Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41. A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\"", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-12 12:14:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents. You make all these statemnts but none are backed up by any facts. Supposedly Cordell Hull called a journalist and said Pearl Harbor was going to be attacked 12/7/41. Now why would he call a journalist of all people, freind or not. Or supposedly a freind. In a court of law you know what's this is called? Hearsay. Did you notice something about that headline JAPANESE MAY STRIKE OVER WEEKEND? It did not mention Pearl Harbor now did it? Don't you think that if MR. Lieb was given information that Pearl Harbor was going to be attacked they would have included that in the headline? You state its been proven that Churchill knew of the attack. Proven by WHO?", 
        "intTime": 20090413, 
        "postID": 26, 
        "quote": "Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "reply": " You make all these statemnts but none are backed up by any facts. Supposedly Cordell Hull called a journalist and said Pearl Harbor was going to be attacked 12/7/41. Now why would he call a journalist of all people, freind or not. Or supposedly a freind. In a court of law you know what's this is called? Hearsay. Did you notice something about that headline JAPANESE MAY STRIKE OVER WEEKEND? It did not mention Pearl Harbor now did it? Don't you think that if MR. Lieb was given information that Pearl Harbor was going to be attacked they would have included that in the headline? You state its been proven that Churchill knew of the attack. Proven by WHO?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 08:34:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41. Kimmell had ships patroling in the North Pacific? There's a reason the Japanese choose the route they did. There's very little shiping traffic or partols due to the extreme weather. And which two or three ships are you talking about? The carriers were abnormally out to sea? If you were trying to spare your carriers would you send the Enterprise to Wake Island which is west of Oahu and closer to Japanese held teritory. Or send the Lexington to Midway Island in the general direction of Kido Butai? Here's a historical fact that people like you seem to forget. The Enterprise was supposed to be inport that morning. However she was delayed by a storm. If not for that storm the Enterprise would have been at the bottom of Pearl.", 
        "intTime": 20090413, 
        "postID": 27, 
        "quote": "Originally posted by StaffSgtGraham: Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41.", 
        "reply": " Kimmell had ships patroling in the North Pacific? There's a reason the Japanese choose the route they did. There's very little shiping traffic or partols due to the extreme weather. And which two or three ships are you talking about? The carriers were abnormally out to sea? If you were trying to spare your carriers would you send the Enterprise to Wake Island which is west of Oahu and closer to Japanese held teritory. Or send the Lexington to Midway Island in the general direction of Kido Butai? Here's a historical fact that people like you seem to forget. The Enterprise was supposed to be inport that morning. However she was delayed by a storm. If not for that storm the Enterprise would have been at the bottom of Pearl.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 09:07:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\" Most of the US Navy, Army and Army Air Corps was obsolete in 1941. So it's not like the forces on Pearl Harbor were getting the rejects. The P-38 had just entered service and the P-47 and P-51 had yet to. On the Navy's side the Essex class carriers had just begun construction. The Navies two most modern battleships the North Carolina and Washington were just finsishing up their shakedown cruises when the attack happened. Billy Mitchell in the Navies eyes had proven that he could sink an old, staionary, undefended German battleship. The Navy added armor to the Arizona's deck to be able to withstand GP bombs of the day. Unfortanetly the USN did not anticipate the IJN modifying 16in armor piercing sheels to be droped from aircraft. Its a bad comparision the whole Japan/Germany and Afghanistan/Iraq thing. Technically we went to war with Japan first. It's not like the fighting with Japan became some sort of neglected backwater like Afghanistan. The fighting in the Pacific was just as brutal as in Europe. Also, Germany declared war on us. Iraq did not. Gemany and Japan were part of the Tripartite Pact. Iraq and Afghanistan had no such agreement.", 
        "intTime": 20090413, 
        "postID": 28, 
        "quote": "Originally posted by StaffSgtGraham: A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\"", 
        "reply": " Most of the US Navy, Army and Army Air Corps was obsolete in 1941. So it's not like the forces on Pearl Harbor were getting the rejects. The P-38 had just entered service and the P-47 and P-51 had yet to. On the Navy's side the Essex class carriers had just begun construction. The Navies two most modern battleships the North Carolina and Washington were just finsishing up their shakedown cruises when the attack happened. Billy Mitchell in the Navies eyes had proven that he could sink an old, staionary, undefended German battleship. The Navy added armor to the Arizona's deck to be able to withstand GP bombs of the day. Unfortanetly the USN did not anticipate the IJN modifying 16in armor piercing sheels to be droped from aircraft. Its a bad comparision the whole Japan/Germany and Afghanistan/Iraq thing. Technically we went to war with Japan first. It's not like the fighting with Japan became some sort of neglected backwater like Afghanistan. The fighting in the Pacific was just as brutal as in Europe. Also, Germany declared war on us. Iraq did not. Gemany and Japan were part of the Tripartite Pact. Iraq and Afghanistan had no such agreement.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 09:35:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic.", 
        "intTime": 20090413, 
        "postID": 29, 
        "quote": "", 
        "reply": "F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 12:59:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic. WIth a lot of conspiracy theories they might sound good but once you scratch the surface they don't hold up very well. The carriers at Pearl harbor is an example. Sounds sinister that they were both out at sea. Except for the fact that the Enterprise would have been in port that morning were not for a storm. And sending the Lexington in the general direction of the Japanese fleet does not sound like a good idea.", 
        "intTime": 20090415, 
        "postID": 30, 
        "quote": "Originally posted by StaffSgtGraham: F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic.", 
        "reply": " WIth a lot of conspiracy theories they might sound good but once you scratch the surface they don't hold up very well. The carriers at Pearl harbor is an example. Sounds sinister that they were both out at sea. Except for the fact that the Enterprise would have been in port that morning were not for a storm. And sending the Lexington in the general direction of the Japanese fleet does not sound like a good idea.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-15 09:38:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\"", 
        "intTime": 20090331, 
        "postID": 31, 
        "quote": "", 
        "reply": "If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\"", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-03-31 22:05:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "intTime": 20090401, 
        "postID": 32, 
        "quote": "", 
        "reply": "I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 16:58:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. Exactly as I see it and the counter info was the major part of the conspiracy since the plan was formulated years ago and vaulted away for fifty years. Operation Mongoose. The counter information was carefully considered for every possible scienerio and expanation to questions and accusations that would be asked. It only proves to me the control they have over the media and people. And its scary. We have signed our own death warrants by allowing it to fade away.", 
        "intTime": 20090401, 
        "postID": 33, 
        "quote": "Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. I was a recruiter before 9-11 and could not make mission. After 9-11 the phone would not stop ringing from those who wanted to do their part. The timing of the movie was very coincidental as was my unit changing from Artillery to Infantry on 01September2001. Almost like it was getting readfy for Iraq. Our BN actually inherited the To&E of the NY unit which was deactivated in the vicinity of the WTC. Then after 9-11 the NY organization was prevented from fading away. I knew the CO of the very unit in charge of ground zero and he told me that on his way to work he was stuck in traffic on a bridge able to see the burning WTC and the second crash. He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "reply": " Exactly as I see it and the counter info was the major part of the conspiracy since the plan was formulated years ago and vaulted away for fifty years. Operation Mongoose. The counter information was carefully considered for every possible scienerio and expanation to questions and accusations that would be asked. It only proves to me the control they have over the media and people. And its scary. We have signed our own death warrants by allowing it to fade away.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 20:54:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools. Are you trying to say that the people who made that POS movie Peral Harbor had advanced knowledge of 9-11? Because that's what it sounds like. And could you PLEASE provide some sort of evidence that FDR had advanced knowledge of the attack.", 
        "intTime": 20090401, 
        "postID": 34, 
        "quote": "Originally posted by StaffSgtGraham: I don't doubt advance knowledge of 9-11 by the president and other key high-officials. The 2001 blockbuster movie about Pearl Harbor with a #1 hitsong by Faith Hill was seen by millions of people by the time the WTC was attacked. The screenplay writer was fully aware of the liklihood FDR had advance knowledge of PH but left it out of the movie stating \"I want it to be a feel-good movie.\" Well it worked. Previous to and during WW2 these were called \"Rah-rah movies\" and were used as recruiting tools.", 
        "reply": " Are you trying to say that the people who made that POS movie Peral Harbor had advanced knowledge of 9-11? Because that's what it sounds like. And could you PLEASE provide some sort of evidence that FDR had advanced knowledge of the attack.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:02:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower?", 
        "intTime": 20090401, 
        "postID": 35, 
        "quote": "Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount.", 
        "reply": " So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:16:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by F14engtech: quote: Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower? Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick.", 
        "intTime": 20090401, 
        "postID": 36, 
        "quote": "Originally posted by F14engtech: quote: Originally posted by StaffSgtGraham: He said there were people in the WTC calling the local radio station on their phones and hear could hear announcements over the PA in the WTC saying \"Do NOT evacuate this is an isolated incident\". This was needed to up the deathtoll so Americans would be more willing to go to war. Initially the deathtoll of the WTC was predicted at over 6,000 but ended up at less than half that amount. So I guess around 1400 people dying in the North Tower, 183 at the Pentagon and those on flight 93 would not have been enough. Are you going to try and tell us that the American people would have been hesitant were it not for the casulties in the south tower?", 
        "reply": " Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:27:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick. Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough.", 
        "intTime": 20090401, 
        "postID": 37, 
        "quote": "Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick.", 
        "reply": " Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 22:46:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by F14engtech: quote: Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick. Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough. No one has to tell you that you can read it for yourself in the Northwoods documents. The fact was they tried it in the first attack under the clinton administration and it wasnt large enough to sell a war so they switched to plan B and still if bush didnt lie to congress get WPA then expand on it, it wouldnt have been passed. Who the THEY were Remains the mystery.", 
        "intTime": 20090401, 
        "postID": 38, 
        "quote": "Originally posted by F14engtech: quote: Originally posted by john2x: [ Look at the vieo clip with the reporters standing around an empty 20 ft hole said to be where flt 93 crashed and commenting on it. Its live footage. And yes the toll was meant to be high since the first bombing of the WTC basement truck explosion killing many and causing major damage didnt do the trick. Are you trying to say that the 92 attack was staged? If you are let me remind you that Bill Clinton was president at the time. Or are you going to say that he's cohoots with GWB? I would really like for someone to try and tell me you needed the extra casulties in the South Tower to get the Ameircan people riled up enough.", 
        "reply": " No one has to tell you that you can read it for yourself in the Northwoods documents. The fact was they tried it in the first attack under the clinton administration and it wasnt large enough to sell a war so they switched to plan B and still if bush didnt lie to congress get WPA then expand on it, it wouldnt have been passed. Who the THEY were Remains the mystery.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-01 23:17:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "john2x"
    }, 
    {
        "content": "The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s.", 
        "intTime": 20090406, 
        "postID": 39, 
        "quote": "", 
        "reply": "The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-06 13:39:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s. What history books have you been reading? The USS Ward fired on and SUNK a Japanese midget sub. It did not CAPTURE the sub. In addition the USS Ward did send a report back to Pearl Harbor and it was recieved. The mistake the skipper made was stating only that he attacked a submarine. He failed to mention that he had actually sunk one. Prior to the attack destoyers on patrol around Oahu had made all kinds of reports about attacking subs. What they actually did was kill a lot of fish. So the report got thrown in the pile. It was not until after the attack did they recognize the signifigance of the Ward report. Why don't you try reading At Dawn We Slept and throw away whatever books you have been reading about the subject. This message has been edited. Last edited by: F14engtech, Tue 07 April 2009 09:34 AM", 
        "intTime": 20090407, 
        "postID": 40, 
        "quote": "Originally posted by StaffSgtGraham: The U.S. actually fired the first shot before the Pearl Harbor attack when a Jap mini-sub was captured outside Oahu. Darnedest coincidence though they couldn't sound the alarm as their radio was apparently jammed. Too bad the word couldn't have gotten back to Pearl so we'd have been more ready. I saw that Japanese sub on display at a museum in Texas near san Antonio. Amazingly at least some of the bombs dropped on PH were actually American-made. We blockaded steel shipments to Japan but were sending them our \"expired\" bombs as scrapmetal. One did not explode and was recovered in the 1970s. Codell Hull was quoted by a close friend as saying in late November 1941 that \"The Japanese are going to attack Pearl Harbor on December seventh\". I believe FDR knew too. The volcanic hills on Oahu are full of tunnels, pillboxes, living quarters and storerooms which were used before WW2 to defend against Japanese attack by ship. There was already a concern of the Japanese attacking Pearl Harbor BEFORE World War One. I have been in those pillboxes & storage areas which I found by accident in 1973 on Diamondhead. I searched for years of any public record of them but found nothing until an article in \"Field Artillery\" magazine in the 1990s.", 
        "reply": " What history books have you been reading? The USS Ward fired on and SUNK a Japanese midget sub. It did not CAPTURE the sub. In addition the USS Ward did send a report back to Pearl Harbor and it was recieved. The mistake the skipper made was stating only that he attacked a submarine. He failed to mention that he had actually sunk one. Prior to the attack destoyers on patrol around Oahu had made all kinds of reports about attacking subs. What they actually did was kill a lot of fish. So the report got thrown in the pile. It was not until after the attack did they recognize the signifigance of the Ward report. Why don't you try reading At Dawn We Slept and throw away whatever books you have been reading about the subject. This message has been edited. Last edited by: F14engtech, Tue 07 April 2009 09:34 AM", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-07 09:17:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "intTime": 20090407, 
        "postID": 41, 
        "quote": "", 
        "reply": "So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-07 21:46:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach? do you know what a \"replica\" is?", 
        "intTime": 20090408, 
        "postID": 42, 
        "quote": "So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "reply": " do you know what a \"replica\" is?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 01:41:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "my mistake. The one in texas is real. It was the HA. 19. It was run aground at pearl harbor. The one sunk by the USS Ward is still underwater off the coast.", 
        "intTime": 20090408, 
        "postID": 43, 
        "quote": "", 
        "reply": "my mistake. The one in texas is real. It was the HA. 19. It was run aground at pearl harbor. The one sunk by the USS Ward is still underwater off the coast.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 01:53:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I stand corrected. When I visited the museum was before they were fully in operation(Sep04?) and I was only allowed about 20min. inside. I took a pic of the sub, touched it and ASSumed it was the one seen by 3 ships before being sunk by the Ward. That was over half-an-hour before the Japanese attack. Indeed I wrote a short essay in 2002 comparing 9/11 to PH and stated \"the U.S. fired the first shot of WW2 when it sunk a jap mini-submarine\". I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" Before PH 88% of the public opposed going to war with Europe. FDR pulled a Woodrow Wilson and claimed he didn't want to send \"our boys\" over there when running for re-election. Most wars can be traced to a set-up provocation like Hitler's attack on Poland and the Lusitania hauling armaments in its hull. I believe the OKC bombing was also a set-up because in previous months the FBI was frustratedn stemming the tide of the militia-movement. The bombing, McVeigh, Nichols & the FBI-plant provacatuer known as John Doe#2 made \"militia\" a bad word. However I digress. This thread concerns 9/11 and I read a few days after that attack the U.S. Intelligence office in the WTC was vacant on 9/11 due to a convenient conference out west somewhere. As you can imagine I have serious doubts about the Waco cover-up and Ruby Ridge also. In the movie Pearl Harbor it was realistic pretty much throughout especially the part about all those nurses showing up before the attack. FDR had warned officials in the Red Cross about \"mass casualties\" within weeks. Also coincidently the entire National Guard was on Active Duty for training at the time too.", 
        "intTime": 20090408, 
        "postID": 44, 
        "quote": "", 
        "reply": "I stand corrected. When I visited the museum was before they were fully in operation(Sep04?) and I was only allowed about 20min. inside. I took a pic of the sub, touched it and ASSumed it was the one seen by 3 ships before being sunk by the Ward. That was over half-an-hour before the Japanese attack. Indeed I wrote a short essay in 2002 comparing 9/11 to PH and stated \"the U.S. fired the first shot of WW2 when it sunk a jap mini-submarine\". I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" Before PH 88% of the public opposed going to war with Europe. FDR pulled a Woodrow Wilson and claimed he didn't want to send \"our boys\" over there when running for re-election. Most wars can be traced to a set-up provocation like Hitler's attack on Poland and the Lusitania hauling armaments in its hull. I believe the OKC bombing was also a set-up because in previous months the FBI was frustratedn stemming the tide of the militia-movement. The bombing, McVeigh, Nichols & the FBI-plant provacatuer known as John Doe#2 made \"militia\" a bad word. However I digress. This thread concerns 9/11 and I read a few days after that attack the U.S. Intelligence office in the WTC was vacant on 9/11 due to a convenient conference out west somewhere. As you can imagine I have serious doubts about the Waco cover-up and Ruby Ridge also. In the movie Pearl Harbor it was realistic pretty much throughout especially the part about all those nurses showing up before the attack. FDR had warned officials in the Red Cross about \"mass casualties\" within weeks. Also coincidently the entire National Guard was on Active Duty for training at the time too.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 06:53:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach? The one you are refering to was recovered AFTER the attack. And it's not the one sunk by the USS Ward. That submarine is sitting in about 2000ft of water.", 
        "intTime": 20090408, 
        "postID": 45, 
        "quote": "Originally posted by StaffSgtGraham: So then you think the Jap minisub in the Texas museum is a fake or was there another sub captured when it washed up on the beach?", 
        "reply": " The one you are refering to was recovered AFTER the attack. And it's not the one sunk by the USS Ward. That submarine is sitting in about 2000ft of water.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 07:57:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake.", 
        "intTime": 20090408, 
        "postID": 46, 
        "quote": "", 
        "reply": "I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 08:07:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake. Only one of the midget crewman was captured. ANother one of the subs was recovered and used as fill. A third one was recovered in 1960 and returned to Japan.", 
        "intTime": 20090408, 
        "postID": 47, 
        "quote": "Originally posted by StaffSgtGraham: I think there were three others but don't think any of those were ever recovered and the only survivors were those on the washed-up sub who became POWs before war was even declared. I saw a photo of FDR's rough-draft for his \"Yesterday...\" Day of Infamy speech and he had first dated it 07Dec41 which probably really was an innocent mistake.", 
        "reply": " Only one of the midget crewman was captured. ANother one of the subs was recovered and used as fill. A third one was recovered in 1960 and returned to Japan.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 10:14:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" . That's what is commonly called hearsay. And who exactly is this person, does he have a name? Here's a review of Day of Deceit. *^&%www.usncva.org/books/book-10.html*&%", 
        "intTime": 20090408, 
        "postID": 48, 
        "quote": "Originally posted by StaffSgtGraham: I also agree that At Dawn We Slept is considered the bible on PH but like the great Smedley Butler I believe \"war is a racket\" and always look for the investigative reports like \"Day of Deceit: The Truth about FDR and Pearl Harbor\" and I recently saw a videotaped interview with a man who was a friend of Cordell Hull who told him \"the Japanese will attack on December seventh.\" .", 
        "reply": " That's what is commonly called hearsay. And who exactly is this person, does he have a name? Here's a review of Day of Deceit. *^&%www.usncva.org/books/book-10.html*&%", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-08 10:27:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "Kind of reminds me of that movie Red October where the Ord Tech was going to \"fire\" the torpedo, but then was stopped by the NSA Officer and was told that he DID fire it by the agent. I can see the watch looking at the radar, sending it back to HQ, then an agent telling the OOD \"you do not see a fleet of Japanese bombers, it is a squadron of our B-17s coming in from the states. But then again, I am sure years later that OOD or whoever was on watch that night would have spilled the beans. Either way, something is just not right about that whole thing. This was 1 HOUR before the attack began. \"Just after 7 a.m., Elliott saw \"something completely out of the ordinary\" on the screen, a huge blip, due north, 137 miles out. The information was called in to headquarters, and the operators were told it was a flight of B-17 Flying Fortresses due in from California.\" What time did they sink the Japanese sub and what time was the radar message sent to HG?", 
        "intTime": 20090411, 
        "postID": 49, 
        "quote": "", 
        "reply": "Kind of reminds me of that movie Red October where the Ord Tech was going to \"fire\" the torpedo, but then was stopped by the NSA Officer and was told that he DID fire it by the agent. I can see the watch looking at the radar, sending it back to HQ, then an agent telling the OOD \"you do not see a fleet of Japanese bombers, it is a squadron of our B-17s coming in from the states. But then again, I am sure years later that OOD or whoever was on watch that night would have spilled the beans. Either way, something is just not right about that whole thing. This was 1 HOUR before the attack began. \"Just after 7 a.m., Elliott saw \"something completely out of the ordinary\" on the screen, a huge blip, due north, 137 miles out. The information was called in to headquarters, and the operators were told it was a flight of B-17 Flying Fortresses due in from California.\" What time did they sink the Japanese sub and what time was the radar message sent to HG?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 08:31:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by john2x: If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\" No way. It takes DAYS to rig a building to be brought down in an orderly fashion using explosives. However internal stresses in many of the right points can produce the same effect. Look how the twins came down? Who would have thought that would have happened? It almost looks like a control demolition as well. But this sounds quite reasonable to me: \"As the North Tower collapsed on September 11, 2001, debris hit 7 World Trade Center, causing heavy damage to the south face of the building.[3] The bottom portion of the building's south face was heavily damaged by debris, including damage to the southwest corner from the 8th to 18th floors, a large vertical gash on the center-bottom extending at least ten floors, and other damage as high as the 18th floor.[3] The building was equipped with a sprinkler system, but had many single-point vulnerabilities for failure: the sprinkler system required manual initiation of the electrical fire pumps, rather than being a fully automatic system; the floor-level controls had a single connection to the sprinkler water riser; and the sprinkler system required some power for the fire pump to deliver water. Also, water pressure was low, with little or no water to feed sprinklers.[27][28] After the North Tower collapsed, some firefighters entered 7 World Trade Center to search the building. They attempted to extinguish small pockets of fire, but low water pressure hindered their efforts.[29] A massive fire burned into the afternoon on the 11th and 12th floors of 7 World Trade Center, the flames visible on the east side of the building.[30][31] During the afternoon, fire was also seen on floors 6–10, 13–14, 19–22, and 29–30.[3] In particular, the fires on floors 7 through 9 and 11 through 13 continued to burn out of control during the afternoon.[32] At approximately 2:00 p.m., firefighters noticed a bulge in the southwest corner of 7 World Trade Center between the 10th and 13th floors, a sign that the building was unstable and might collapse.[33] During the afternoon, firefighters also heard creaking sounds coming from the building.[34] Around 3:30 pm FDNY Chief Daniel Nigro decided to halt rescue operations, surface removal, and searches along the surface of the debris near 7 World Trade Center and evacuate the area due to concerns for the safety of personnel.[33][35] At 5:20 p.m. EDT on September 11, 2001, 7 World Trade Center collapsed. There were no casualties associated with the collapse.\"", 
        "intTime": 20090411, 
        "postID": 50, 
        "quote": "Originally posted by john2x: If after reading through these reports and watching these video clips and interviews,If you still feel there should be no full scale investigation, and bush should not be held accountable, Im afraid your beyond redemption or a counter info shill. \"http://westvirginiaholler.blogspot.com/2009/03/demolition-of-union-carbide-building.html\"", 
        "reply": " No way. It takes DAYS to rig a building to be brought down in an orderly fashion using explosives. However internal stresses in many of the right points can produce the same effect. Look how the twins came down? Who would have thought that would have happened? It almost looks like a control demolition as well. But this sounds quite reasonable to me: \"As the North Tower collapsed on September 11, 2001, debris hit 7 World Trade Center, causing heavy damage to the south face of the building.[3] The bottom portion of the building's south face was heavily damaged by debris, including damage to the southwest corner from the 8th to 18th floors, a large vertical gash on the center-bottom extending at least ten floors, and other damage as high as the 18th floor.[3] The building was equipped with a sprinkler system, but had many single-point vulnerabilities for failure: the sprinkler system required manual initiation of the electrical fire pumps, rather than being a fully automatic system; the floor-level controls had a single connection to the sprinkler water riser; and the sprinkler system required some power for the fire pump to deliver water. Also, water pressure was low, with little or no water to feed sprinklers.[27][28] After the North Tower collapsed, some firefighters entered 7 World Trade Center to search the building. They attempted to extinguish small pockets of fire, but low water pressure hindered their efforts.[29] A massive fire burned into the afternoon on the 11th and 12th floors of 7 World Trade Center, the flames visible on the east side of the building.[30][31] During the afternoon, fire was also seen on floors 6–10, 13–14, 19–22, and 29–30.[3] In particular, the fires on floors 7 through 9 and 11 through 13 continued to burn out of control during the afternoon.[32] At approximately 2:00 p.m., firefighters noticed a bulge in the southwest corner of 7 World Trade Center between the 10th and 13th floors, a sign that the building was unstable and might collapse.[33] During the afternoon, firefighters also heard creaking sounds coming from the building.[34] Around 3:30 pm FDNY Chief Daniel Nigro decided to halt rescue operations, surface removal, and searches along the surface of the debris near 7 World Trade Center and evacuate the area due to concerns for the safety of personnel.[33][35] At 5:20 p.m. EDT on September 11, 2001, 7 World Trade Center collapsed. There were no casualties associated with the collapse.\"", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 08:53:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "But then again this just came out a couple of days ago... \"A team of scientists claim to have unearthed startling data from dust and debris gathered in the days and weeks after the World Trade Center towers collapsed on Sept. 11, 2001.\" \"In a study published by the Open Chemical Physics Journal — a peer-reviewed, scientific publication — Steven E. Jones and Niels Harrit level a stark allegation: that within the dust and rubble of the World Trade Center towers lays evidence of “a highly engineered explosive,” contrary to all federal studies of the collapses.\" \"http://www.infowars.com/study-claims-highly-engineered-explosive-found-in-wtc-rubble/\" I opt to believe the Wiki story.", 
        "intTime": 20090411, 
        "postID": 51, 
        "quote": "", 
        "reply": "But then again this just came out a couple of days ago... \"A team of scientists claim to have unearthed startling data from dust and debris gathered in the days and weeks after the World Trade Center towers collapsed on Sept. 11, 2001.\" \"In a study published by the Open Chemical Physics Journal — a peer-reviewed, scientific publication — Steven E. Jones and Niels Harrit level a stark allegation: that within the dust and rubble of the World Trade Center towers lays evidence of “a highly engineered explosive,” contrary to all federal studies of the collapses.\" \"http://www.infowars.com/study-claims-highly-engineered-explosive-found-in-wtc-rubble/\" I opt to believe the Wiki story.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 09:06:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Graham I have been studying this stuff for a long time and your sources are suspect big guy!! Some one already corrected you about the sub the U.S.S. Ward sank, and you have made note of it. There is a documentary that was made and the sub has been found in 1100 feet of water off the harbor entrance at Pearl. Now the first shots of the war were not fried by us at Pearl Harbor....They were fired many times during convoy operations in the North Atlantic as we depth charged several German submarines to keep them down so convoys could escape. From 1940 onward till the declaration of war by germany on us in Dec. 1941. In fact we attacked and depth charged, from the U.S.S. Greeley a german submarine for over three hours once and finally the U boat fired on the Greeley and this incident almost propelled us into the war much earlier than 12 8 41!! Hitler knew all too well the results of our entering the first world war and gave orders many times to NOT fire on U.S. vessels during the convoy runs from 1940 to the official beginning of the war. The skipper of the sub that fired on the Greelay was relieved and later after the entry by us into the conflict openly, was given a new command and a medal for his actions!! Probably as near to an open apology that Hitler ever got!! If you want conspiricies this, incident was all that L.B.J. wished the ginned up \"Gulf of Tonkin incident\" was, that got us finally heavily involved in Viet Nam in 1964, which incident by the way, was completwely false!!! The skipper of one of the ships involved was amost relieved for writing a memo to that effect which was quickly squashed!! T", 
        "intTime": 20090411, 
        "postID": 52, 
        "quote": "", 
        "reply": "Graham I have been studying this stuff for a long time and your sources are suspect big guy!! Some one already corrected you about the sub the U.S.S. Ward sank, and you have made note of it. There is a documentary that was made and the sub has been found in 1100 feet of water off the harbor entrance at Pearl. Now the first shots of the war were not fried by us at Pearl Harbor....They were fired many times during convoy operations in the North Atlantic as we depth charged several German submarines to keep them down so convoys could escape. From 1940 onward till the declaration of war by germany on us in Dec. 1941. In fact we attacked and depth charged, from the U.S.S. Greeley a german submarine for over three hours once and finally the U boat fired on the Greeley and this incident almost propelled us into the war much earlier than 12 8 41!! Hitler knew all too well the results of our entering the first world war and gave orders many times to NOT fire on U.S. vessels during the convoy runs from 1940 to the official beginning of the war. The skipper of the sub that fired on the Greelay was relieved and later after the entry by us into the conflict openly, was given a new command and a medal for his actions!! Probably as near to an open apology that Hitler ever got!! If you want conspiricies this, incident was all that L.B.J. wished the ginned up \"Gulf of Tonkin incident\" was, that got us finally heavily involved in Viet Nam in 1964, which incident by the way, was completwely false!!! The skipper of one of the ships involved was amost relieved for writing a memo to that effect which was quickly squashed!! T", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 09:06:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "tawodi"
    }, 
    {
        "content": "Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "intTime": 20090411, 
        "postID": 53, 
        "quote": "", 
        "reply": "Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-11 17:04:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents. For the entire commentary the below snippet originates from, go to the below (cold) link! http://www.winstonchurchill.org/i4a/pages/index.cfm?pageid=40#OPIUM quote: On the anniversary of Pearl Harbor, the History Channel, whose programs vary between solid history and opium for the people, ran a BBC-produced documentary claiming that Franklin Roosevelt knew all about the surprise attack and allowed it to happen to get the United States into the war. The program, as Arthur Balfour might have said, contained much that is trite and much that it true, but what was true was trite, and what was not trite was not true. That \"Betrayal at Pearl Harbor\" should not be taken seriously is manifestly evident. Examples of why it shouldn't begin with its interview of Robert Ogg, which approaches dishonesty. The producers fail to inform the audience that Mr. Ogg is the infamous \"Seaman Z\" immortalized by John Toland, an early conspiracy theorist who wrote that Pearl Harbor was plotted by FDR. \"Seaman Z,\" whose story has had a nasty habit of changing over the years, claimed he heard \"q u e e r signals\" which could have been the missing Japanese aircraft carriers. But he could only have been hearing the carriers if the carriers were broadcasting. The Japanese themselves claim their fleet (Kido Butai) never sent a single message......{snip}..... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090412, 
        "postID": 54, 
        "quote": "Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "reply": " For the entire commentary the below snippet originates from, go to the below (cold) link! http://www.winstonchurchill.org/i4a/pages/index.cfm?pageid=40#OPIUM quote: On the anniversary of Pearl Harbor, the History Channel, whose programs vary between solid history and opium for the people, ran a BBC-produced documentary claiming that Franklin Roosevelt knew all about the surprise attack and allowed it to happen to get the United States into the war. The program, as Arthur Balfour might have said, contained much that is trite and much that it true, but what was true was trite, and what was not trite was not true. That \"Betrayal at Pearl Harbor\" should not be taken seriously is manifestly evident. Examples of why it shouldn't begin with its interview of Robert Ogg, which approaches dishonesty. The producers fail to inform the audience that Mr. Ogg is the infamous \"Seaman Z\" immortalized by John Toland, an early conspiracy theorist who wrote that Pearl Harbor was plotted by FDR. \"Seaman Z,\" whose story has had a nasty habit of changing over the years, claimed he heard \"q u e e r signals\" which could have been the missing Japanese aircraft carriers. But he could only have been hearing the carriers if the carriers were broadcasting. The Japanese themselves claim their fleet (Kido Butai) never sent a single message......{snip}..... It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-12 06:52:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41. A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\"", 
        "intTime": 20090412, 
        "postID": 55, 
        "quote": "", 
        "reply": "Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41. A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\"", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-12 12:14:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents. You make all these statemnts but none are backed up by any facts. Supposedly Cordell Hull called a journalist and said Pearl Harbor was going to be attacked 12/7/41. Now why would he call a journalist of all people, freind or not. Or supposedly a freind. In a court of law you know what's this is called? Hearsay. Did you notice something about that headline JAPANESE MAY STRIKE OVER WEEKEND? It did not mention Pearl Harbor now did it? Don't you think that if MR. Lieb was given information that Pearl Harbor was going to be attacked they would have included that in the headline? You state its been proven that Churchill knew of the attack. Proven by WHO?", 
        "intTime": 20090413, 
        "postID": 56, 
        "quote": "Originally posted by StaffSgtGraham: Approx. 0930 Saturday 29Nov41 Sec'y-of-State Hull phoned his friend, journalist Joe Lieb, to meet ASAP. Hull then showed Lieb a transcript and stated emphatically \"The Japanese are going to attack Pearl Harbor on December seventh.\" Lieb immediately released this info to United Press International. The UP only put the word out on the foreign wire and it was printed in the Honolulu Advertiser with a bold headline at the very top of the front page \"JAPANESE MAY STRIKE OVER WEEKEND\". It was proven Churchill had prior knowledge of the PH attack so Cordell Hull must have gotten the word from British intel. The preponderance of the evidence shows FDR was culpable but there is still no smoking-gun. The fact FDR didn't live to see the end of HIS war is small consolation. Liebs filmed interview and a photo of the Advertiser headline can be seen in the video \"Betrayal at Pearl Harbor\" which has been available at the PX. Nixon had less to do with the Watergate break-in than FDR had with the deaths of thousands. Yet Nixon resigned in disgrace while FDR is considered by many(not me) to have been one of our greatest presidents.", 
        "reply": " You make all these statemnts but none are backed up by any facts. Supposedly Cordell Hull called a journalist and said Pearl Harbor was going to be attacked 12/7/41. Now why would he call a journalist of all people, freind or not. Or supposedly a freind. In a court of law you know what's this is called? Hearsay. Did you notice something about that headline JAPANESE MAY STRIKE OVER WEEKEND? It did not mention Pearl Harbor now did it? Don't you think that if MR. Lieb was given information that Pearl Harbor was going to be attacked they would have included that in the headline? You state its been proven that Churchill knew of the attack. Proven by WHO?", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 08:34:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41. Kimmell had ships patroling in the North Pacific? There's a reason the Japanese choose the route they did. There's very little shiping traffic or partols due to the extreme weather. And which two or three ships are you talking about? The carriers were abnormally out to sea? If you were trying to spare your carriers would you send the Enterprise to Wake Island which is west of Oahu and closer to Japanese held teritory. Or send the Lexington to Midway Island in the general direction of Kido Butai? Here's a historical fact that people like you seem to forget. The Enterprise was supposed to be inport that morning. However she was delayed by a storm. If not for that storm the Enterprise would have been at the bottom of Pearl.", 
        "intTime": 20090413, 
        "postID": 57, 
        "quote": "Originally posted by StaffSgtGraham: Perhaps you can explain about \"the vacant sea\" in 1941 where Kimmel had ships patrolling the ocean north of Hawaii but FDR furiously ordered him to bring the entire fleet except 2 or 3 newer ships which were sent to the Atlantic near England? Also all the aircraft carriers were abnormally out to sea on 7Dec41.", 
        "reply": " Kimmell had ships patroling in the North Pacific? There's a reason the Japanese choose the route they did. There's very little shiping traffic or partols due to the extreme weather. And which two or three ships are you talking about? The carriers were abnormally out to sea? If you were trying to spare your carriers would you send the Enterprise to Wake Island which is west of Oahu and closer to Japanese held teritory. Or send the Lexington to Midway Island in the general direction of Kido Butai? Here's a historical fact that people like you seem to forget. The Enterprise was supposed to be inport that morning. However she was delayed by a storm. If not for that storm the Enterprise would have been at the bottom of Pearl.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 09:07:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\" Most of the US Navy, Army and Army Air Corps was obsolete in 1941. So it's not like the forces on Pearl Harbor were getting the rejects. The P-38 had just entered service and the P-47 and P-51 had yet to. On the Navy's side the Essex class carriers had just begun construction. The Navies two most modern battleships the North Carolina and Washington were just finsishing up their shakedown cruises when the attack happened. Billy Mitchell in the Navies eyes had proven that he could sink an old, staionary, undefended German battleship. The Navy added armor to the Arizona's deck to be able to withstand GP bombs of the day. Unfortanetly the USN did not anticipate the IJN modifying 16in armor piercing sheels to be droped from aircraft. Its a bad comparision the whole Japan/Germany and Afghanistan/Iraq thing. Technically we went to war with Japan first. It's not like the fighting with Japan became some sort of neglected backwater like Afghanistan. The fighting in the Pacific was just as brutal as in Europe. Also, Germany declared war on us. Iraq did not. Gemany and Japan were part of the Tripartite Pact. Iraq and Afghanistan had no such agreement.", 
        "intTime": 20090413, 
        "postID": 58, 
        "quote": "Originally posted by StaffSgtGraham: A lot of the aircraft & ships were borderline obsolete in PH. The Arizona was over a few decades old and Billy Mitchell had already proven it could be sunk by an airplane. FDR goaded Japan into attacking the US entirely so he could get the public to back going to war. The Japs attacked so we first went to war with Germany. Kinda' like when we went to Iraq instead of Afghanistan after 9/11. There has hardly been a war that hasn't been a set-up. In the words of FDR \"Nothing happens in politics by accident.\"", 
        "reply": " Most of the US Navy, Army and Army Air Corps was obsolete in 1941. So it's not like the forces on Pearl Harbor were getting the rejects. The P-38 had just entered service and the P-47 and P-51 had yet to. On the Navy's side the Essex class carriers had just begun construction. The Navies two most modern battleships the North Carolina and Washington were just finsishing up their shakedown cruises when the attack happened. Billy Mitchell in the Navies eyes had proven that he could sink an old, staionary, undefended German battleship. The Navy added armor to the Arizona's deck to be able to withstand GP bombs of the day. Unfortanetly the USN did not anticipate the IJN modifying 16in armor piercing sheels to be droped from aircraft. Its a bad comparision the whole Japan/Germany and Afghanistan/Iraq thing. Technically we went to war with Japan first. It's not like the fighting with Japan became some sort of neglected backwater like Afghanistan. The fighting in the Pacific was just as brutal as in Europe. Also, Germany declared war on us. Iraq did not. Gemany and Japan were part of the Tripartite Pact. Iraq and Afghanistan had no such agreement.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 09:35:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }, 
    {
        "content": "F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic.", 
        "intTime": 20090413, 
        "postID": 59, 
        "quote": "", 
        "reply": "F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-13 12:59:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic. WIth a lot of conspiracy theories they might sound good but once you scratch the surface they don't hold up very well. The carriers at Pearl harbor is an example. Sounds sinister that they were both out at sea. Except for the fact that the Enterprise would have been in port that morning were not for a storm. And sending the Lexington in the general direction of the Japanese fleet does not sound like a good idea.", 
        "intTime": 20090415, 
        "postID": 60, 
        "quote": "Originally posted by StaffSgtGraham: F15engtech-You made some good points. Us tinfoil-hat types concentrate on the factors which back-up our theories and tend to ignore some of the facts. I have always thought the Japanese were much more brutal than the Germans and that we were less brutal than the Germans. Seems like the victors get to write the history. From my studies it seems that even the Bataan Death March pales in brutality to the FFL prisoners after Dien Bien Phu. Now I've really digressed from the thread topic.", 
        "reply": " WIth a lot of conspiracy theories they might sound good but once you scratch the surface they don't hold up very well. The carriers at Pearl harbor is an example. Sounds sinister that they were both out at sea. Except for the fact that the Enterprise would have been in port that morning were not for a storm. And sending the Lexington in the general direction of the Japanese fleet does not sound like a good idea.", 
        "threadID": "4960045241001_8670094912001", 
        "time": "2009-04-15 09:38:00", 
        "title": "For thoes who believe there shouldnt be an Investigation", 
        "userID": "F14engtech"
    }
]