[
    {
        "content": "I read with interest the report on the officer in Iraq bringing up allegations of Obama not being a legitmate citizen for the purpose of the office of US President. I would like to see verification of his citizenship as well. I do not believe that we have had a serving President that was born on foreign soil. While immigration laws allow US citizens abroad to register the birth of their children in foreign lands and thereby confer US citizenship, I am confident that the US constitution is clear that the office of President be occupied by an individual born as a citizen within the borders of the United States. I personally do not believe that Obama was the right man for the job, I also believe that those who voted for him blindly without understanding his anti-american philosophies ought to be ashamed of themselves and are not deserving of the citizen ship that I and other veterans have given their time and lives for. Right now our constitution is under attack not only by Obama but by the left leaning liberals he has lined his cabinet with. When I joined the Navy in 1974 I took an oath not to protect the Commander In Chief but the Constitution of the United States against all enemies domestic and foreign. The officer who has spoken out about Mr Obmama's question of legitimacy is in my opinion acting on his vow;Or has it now become an offense under the UCMJ to protect our country from those that would do it harm? Did we as veterans give of ourselves to our country so that others could have the opportunity from within to destroy it? Well misguided Americans who hated President Bush at any cost for doing his job have seen to it that we will be paying a heavier cost for freedom in the future. These folks for whatever reason while saying that they are patriotic actually hate our country and work for it's destruction. Senator Reid for instance made remarks to the press that would have had him locked up during President Lincoln's term. Mr Reid violated his oath of office and has not been held accountable for his treason yet we will hold an officer in the Army in comtempt for stating that he believes the current President is not a legitimate citizen for the purposes of the office? In my view the Nation could have elected a more qualified , more conservative Black President.", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "I read with interest the report on the officer in Iraq bringing up allegations of Obama not being a legitmate citizen for the purpose of the office of US President. I would like to see verification of his citizenship as well. I do not believe that we have had a serving President that was born on foreign soil. While immigration laws allow US citizens abroad to register the birth of their children in foreign lands and thereby confer US citizenship, I am confident that the US constitution is clear that the office of President be occupied by an individual born as a citizen within the borders of the United States. I personally do not believe that Obama was the right man for the job, I also believe that those who voted for him blindly without understanding his anti-american philosophies ought to be ashamed of themselves and are not deserving of the citizen ship that I and other veterans have given their time and lives for. Right now our constitution is under attack not only by Obama but by the left leaning liberals he has lined his cabinet with. When I joined the Navy in 1974 I took an oath not to protect the Commander In Chief but the Constitution of the United States against all enemies domestic and foreign. The officer who has spoken out about Mr Obmama's question of legitimacy is in my opinion acting on his vow;Or has it now become an offense under the UCMJ to protect our country from those that would do it harm? Did we as veterans give of ourselves to our country so that others could have the opportunity from within to destroy it? Well misguided Americans who hated President Bush at any cost for doing his job have seen to it that we will be paying a heavier cost for freedom in the future. These folks for whatever reason while saying that they are patriotic actually hate our country and work for it's destruction. Senator Reid for instance made remarks to the press that would have had him locked up during President Lincoln's term. Mr Reid violated his oath of office and has not been held accountable for his treason yet we will hold an officer in the Army in comtempt for stating that he believes the current President is not a legitimate citizen for the purposes of the office? In my view the Nation could have elected a more qualified , more conservative Black President.", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 13:11:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "EBOHLING57"
    }, 
    {
        "content": "Please....not another one.....", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "Please....not another one.....", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 13:13:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "Knele"
    }, 
    {
        "content": "No I like these, please keep them coming.", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "", 
        "reply": "No I like these, please keep them coming.", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 13:36:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "shuman14"
    }, 
    {
        "content": "If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible? This is our country too, myself, and millions of other people besides the birthers elected Obama. quote: Originally posted by EBOHLING57: I read with interest the report on the officer in Iraq bringing up allegations of Obama not being a legitmate citizen for the purpose of the office of US President. I would like to see verification of his citizenship as well. I do not believe that we have had a serving President that was born on foreign soil. While immigration laws allow US citizens abroad to register the birth of their children in foreign lands and thereby confer US citizenship, I am confident that the US constitution is clear that the office of President be occupied by an individual born as a citizen within the borders of the United States. I personally do not believe that Obama was the right man for the job, I also believe that those who voted for him blindly without understanding his anti-american philosophies ought to be ashamed of themselves and are not deserving of the citizen ship that I and other veterans have given their time and lives for. Right now our constitution is under attack not only by Obama but by the left leaning liberals he has lined his cabinet with. When I joined the Navy in 1974 I took an oath not to protect the Commander In Chief but the Constitution of the United States against all enemies domestic and foreign. The officer who has spoken out about Mr Obmama's question of legitimacy is in my opinion acting on his vow;Or has it now become an offense under the UCMJ to protect our country from those that would do it harm? Did we as veterans give of ourselves to our country so that others could have the opportunity from within to destroy it? Well misguided Americans who hated President Bush at any cost for doing his job have seen to it that we will be paying a heavier cost for freedom in the future. These folks for whatever reason while saying that they are patriotic actually hate our country and work for it's destruction. Senator Reid for instance made remarks to the press that would have had him locked up during President Lincoln's term. Mr Reid violated his oath of office and has not been held accountable for his treason yet we will hold an officer in the Army in comtempt for stating that he believes the current President is not a legitimate citizen for the purposes of the office? In my view the Nation could have elected a more qualified , more conservative Black President.", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "Originally posted by EBOHLING57: I read with interest the report on the officer in Iraq bringing up allegations of Obama not being a legitmate citizen for the purpose of the office of US President. I would like to see verification of his citizenship as well. I do not believe that we have had a serving President that was born on foreign soil. While immigration laws allow US citizens abroad to register the birth of their children in foreign lands and thereby confer US citizenship, I am confident that the US constitution is clear that the office of President be occupied by an individual born as a citizen within the borders of the United States. I personally do not believe that Obama was the right man for the job, I also believe that those who voted for him blindly without understanding his anti-american philosophies ought to be ashamed of themselves and are not deserving of the citizen ship that I and other veterans have given their time and lives for. Right now our constitution is under attack not only by Obama but by the left leaning liberals he has lined his cabinet with. When I joined the Navy in 1974 I took an oath not to protect the Commander In Chief but the Constitution of the United States against all enemies domestic and foreign. The officer who has spoken out about Mr Obmama's question of legitimacy is in my opinion acting on his vow;Or has it now become an offense under the UCMJ to protect our country from those that would do it harm? Did we as veterans give of ourselves to our country so that others could have the opportunity from within to destroy it? Well misguided Americans who hated President Bush at any cost for doing his job have seen to it that we will be paying a heavier cost for freedom in the future. These folks for whatever reason while saying that they are patriotic actually hate our country and work for it's destruction. Senator Reid for instance made remarks to the press that would have had him locked up during President Lincoln's term. Mr Reid violated his oath of office and has not been held accountable for his treason yet we will hold an officer in the Army in comtempt for stating that he believes the current President is not a legitimate citizen for the purposes of the office? In my view the Nation could have elected a more qualified , more conservative Black President.", 
        "reply": "If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible? This is our country too, myself, and millions of other people besides the birthers elected Obama. ", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 14:05:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Originally posted by cybercafe: If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible?] That's not the job of a president anyway, it's called Logistics, money for logistics comes from Congress. If slick Willy Clinton can take time out for a congressional hearing about the subject of sex in the oval office, the \"Messiah\" can come forth and produce proof of his citizenship even without going to court, if he doesn't have anything to hide. Hell, he can send one of his appointed gophers to retrieve it, along with a federal marshall of course, where ever it is hidden away.", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "Originally posted by cybercafe: If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible?]", 
        "reply": " That's not the job of a president anyway, it's called Logistics, money for logistics comes from Congress. If slick Willy Clinton can take time out for a congressional hearing about the subject of sex in the oval office, the \"Messiah\" can come forth and produce proof of his citizenship even without going to court, if he doesn't have anything to hide. Hell, he can send one of his appointed gophers to retrieve it, along with a federal marshall of course, where ever it is hidden away.", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 14:20:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by cybercafe: If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible?] That's not the job of a president anyway, it's called Logistics, money for logistics comes from Congress. If slick Willy Clinton can take time out for a congressional hearing about the subject of sex in the oval office, the \"Messiah\" can come forth and produce proof of his citizenship even without going to court, if he doesn't have anything to hide. Hell, he can send one of his appointed gophers to retrieve it, along with a federal marshall of course, where ever it is hidden away. You are aware that Mr. McCain never produced his \"vault\" copy of his birth certificate? Shocking that we even let him run for the office. Dave", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by cybercafe: If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible?] That's not the job of a president anyway, it's called Logistics, money for logistics comes from Congress. If slick Willy Clinton can take time out for a congressional hearing about the subject of sex in the oval office, the \"Messiah\" can come forth and produce proof of his citizenship even without going to court, if he doesn't have anything to hide. Hell, he can send one of his appointed gophers to retrieve it, along with a federal marshall of course, where ever it is hidden away.", 
        "reply": " You are aware that Mr. McCain never produced his \"vault\" copy of his birth certificate? Shocking that we even let him run for the office. Dave", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 14:26:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "Grachus"
    }, 
    {
        "content": "ONCE AGAIN, NO NEWS ARTICLE!... THIS IS \"IN THE NEWS\", POST AN ARTICLE FROM A NEWS SORCE, P-L-E-A-S-E OR TAKE IT TO POINT/COUNTER POINT OR CONSPIRACY THEORIES... SHEEZ!... Respectfully, SUNLINER81", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "", 
        "reply": "ONCE AGAIN, NO NEWS ARTICLE!... THIS IS \"IN THE NEWS\", POST AN ARTICLE FROM A NEWS SORCE, P-L-E-A-S-E OR TAKE IT TO POINT/COUNTER POINT OR CONSPIRACY THEORIES... SHEEZ!... Respectfully, SUNLINER81", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 14:34:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Tin Foil area just so they can try and not post more of these we will keep it running Thread moved. Mainedawg Moderator", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "", 
        "reply": "Tin Foil area just so they can try and not post more of these we will keep it running Thread moved. Mainedawg Moderator", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 14:39:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Just to shed some light on the subject of citizenship. My wife is a US citizen. How did she gain it? By birth in Conus? No. She became a naturalised citizen. It is a degree of citizenship that does not confer all of the priviledge of someone born in Conus. My daughter is a US citizen. Did she gain it by birth in Conus? No. She was reported as an American birth abroad and documentation had to be produced to consular officials that I was actually there with my wife at conception. She is also considered a dual national a citizen of the country she was born in. Once again not all aspects of citizenship are conferred upon her. Is she allowed to vote? Yes when she becomes of age. Can she run for public office yes though she is limited by State and National Constitutional guidelines. She is not by definition eligible to run for President. Though the Terminator was elected as the Governator of Cali-fornia he cannot hold the office of President. Come on folks we learned this in basic civics back in the 60's . Folk's in Saipan,Guam, Puerto Rico, US Virgin Island's and American Samoa are considered US citizens, however they are not confered the same level of status as someone born and raised in Conus. The Citizens have to apply for a Visa to come to Conus. These folks elect a delegate to represent their interests in Washington but they do not have a vote nor do they pay US income tax. Their delegates must lobby members of Congress to sponsor legislation to provide for their interests.", 
        "intTime": 20090305, 
        "postID": 9, 
        "quote": "", 
        "reply": "Just to shed some light on the subject of citizenship. My wife is a US citizen. How did she gain it? By birth in Conus? No. She became a naturalised citizen. It is a degree of citizenship that does not confer all of the priviledge of someone born in Conus. My daughter is a US citizen. Did she gain it by birth in Conus? No. She was reported as an American birth abroad and documentation had to be produced to consular officials that I was actually there with my wife at conception. She is also considered a dual national a citizen of the country she was born in. Once again not all aspects of citizenship are conferred upon her. Is she allowed to vote? Yes when she becomes of age. Can she run for public office yes though she is limited by State and National Constitutional guidelines. She is not by definition eligible to run for President. Though the Terminator was elected as the Governator of Cali-fornia he cannot hold the office of President. Come on folks we learned this in basic civics back in the 60's . Folk's in Saipan,Guam, Puerto Rico, US Virgin Island's and American Samoa are considered US citizens, however they are not confered the same level of status as someone born and raised in Conus. The Citizens have to apply for a Visa to come to Conus. These folks elect a delegate to represent their interests in Washington but they do not have a vote nor do they pay US income tax. Their delegates must lobby members of Congress to sponsor legislation to provide for their interests.", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 15:43:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "EBOHLING57"
    }, 
    {
        "content": "I don't understand why that officer who is want to prove is the Commander in Chief is a citizen. Why isn't he court martial for being a traitor, disrespect, disobeying a lawful order. Whoever the lawyer that he have needs to be court martial alone side of him. We are officers. We don't make the law. We enforce it!", 
        "intTime": 20090305, 
        "postID": 10, 
        "quote": "", 
        "reply": "I don't understand why that officer who is want to prove is the Commander in Chief is a citizen. Why isn't he court martial for being a traitor, disrespect, disobeying a lawful order. Whoever the lawyer that he have needs to be court martial alone side of him. We are officers. We don't make the law. We enforce it!", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 16:33:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "6726614"
    }, 
    {
        "content": "As a former service member, it is understandable, to question the chain command. That is in order to protect yourself from being charged with the same crimes as your higher chain command will be inevitably charged with. As to either if it is true or not, that he had made these allegations, I would hope that the military will help any service member, regardless of rank, give a benefit of a doubt as to his mental stability and any other health problems that would lead one to not be stable, such as, but not limited to, Brain Injuries, PTSD, and give him the benefits that he has earned (usually the way it works, is the military doesn't have qualified experienced and trained professionals to diagnose correctly as to which Mental Health problems that are hidden). Good luck everyone, on their own beliefs, and remember this is a country that gives every person the Right to Freedom of speech. Why should it matter if a person is in the military or not? Even service members have rights as well, we are just not told about them and they are limited.", 
        "intTime": 20090305, 
        "postID": 11, 
        "quote": "", 
        "reply": "As a former service member, it is understandable, to question the chain command. That is in order to protect yourself from being charged with the same crimes as your higher chain command will be inevitably charged with. As to either if it is true or not, that he had made these allegations, I would hope that the military will help any service member, regardless of rank, give a benefit of a doubt as to his mental stability and any other health problems that would lead one to not be stable, such as, but not limited to, Brain Injuries, PTSD, and give him the benefits that he has earned (usually the way it works, is the military doesn't have qualified experienced and trained professionals to diagnose correctly as to which Mental Health problems that are hidden). Good luck everyone, on their own beliefs, and remember this is a country that gives every person the Right to Freedom of speech. Why should it matter if a person is in the military or not? Even service members have rights as well, we are just not told about them and they are limited.", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 17:30:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "20527982"
    }, 
    {
        "content": "quote: Originally posted by 6726614: I don't understand why that officer who is want to prove is the Commander in Chief is a citizen. Why isn't he court martial for being a traitor, disrespect, disobeying a lawful order. Whoever the lawyer that he have needs to be court martial alone side of him. We are officers. We don't make the law. We enforce it! The lawyer is a civilian. Now I have read what the officer said. He does not believe that Obama has the requisite citizenship requirement to hold the highest elected office in the land. Now he took an oath to defend the constitution of the United States. If he believes that Mr Obama is suspect on this as well as others I would say he is not only doing his duty to vet Mr Obama where others did not wish to but that he is serving honorably. I have served the with The Navy as an active duty enlistee and as a Civmar now if you serve as a professional military person you know that who ever sit's in the White House has an effect on your career. Now with the exception of FDR and JFK, perhaps LBJ. Democrat Presidents have made some very stupid choices when it comes to financing and supporting the defense department. Carter served as a Nuclear Power officer aboard submarines. While he was President he put a hault to the Nuclear Carrier program, he ruined our relations with Taipei which lost the Navy a good liberty port. He also gave up the Panama Canal zone which has caused of serious security concerns. Clinton had us canabalising for spare parts. Now we have this fellow in there and already he has been saying some rather stupid things that will cause the military community harm.", 
        "intTime": 20090305, 
        "postID": 12, 
        "quote": "Originally posted by 6726614: I don't understand why that officer who is want to prove is the Commander in Chief is a citizen. Why isn't he court martial for being a traitor, disrespect, disobeying a lawful order. Whoever the lawyer that he have needs to be court martial alone side of him. We are officers. We don't make the law. We enforce it!", 
        "reply": " The lawyer is a civilian. Now I have read what the officer said. He does not believe that Obama has the requisite citizenship requirement to hold the highest elected office in the land. Now he took an oath to defend the constitution of the United States. If he believes that Mr Obama is suspect on this as well as others I would say he is not only doing his duty to vet Mr Obama where others did not wish to but that he is serving honorably. I have served the with The Navy as an active duty enlistee and as a Civmar now if you serve as a professional military person you know that who ever sit's in the White House has an effect on your career. Now with the exception of FDR and JFK, perhaps LBJ. Democrat Presidents have made some very stupid choices when it comes to financing and supporting the defense department. Carter served as a Nuclear Power officer aboard submarines. While he was President he put a hault to the Nuclear Carrier program, he ruined our relations with Taipei which lost the Navy a good liberty port. He also gave up the Panama Canal zone which has caused of serious security concerns. Clinton had us canabalising for spare parts. Now we have this fellow in there and already he has been saying some rather stupid things that will cause the military community harm.", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 18:49:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "EBOHLING57"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by cybercafe: If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible?] That's not the job of a president anyway, it's called Logistics, money for logistics comes from Congress. If slick Willy Clinton can take time out for a congressional hearing about the subject of sex in the oval office, the \"Messiah\" can come forth and produce proof of his citizenship even without going to court, if he doesn't have anything to hide. Hell, he can send one of his appointed gophers to retrieve it, along with a federal marshall of course, where ever it is hidden away. You are aware that Mr. McCain never produced his \"vault\" copy of his birth certificate? Shocking that we even let him run for the office. Dave Good Point Dave. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "intTime": 20090305, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by cybercafe: If you are on active military duty in Iraq, and if your unit is awaiting desperately needed equipment, do you want your commander in chief tied up in the lawsuit so that he cannot fully concentrate his attention thinking about ways to give you as much of that equipment in the fastest time possible?] That's not the job of a president anyway, it's called Logistics, money for logistics comes from Congress. If slick Willy Clinton can take time out for a congressional hearing about the subject of sex in the oval office, the \"Messiah\" can come forth and produce proof of his citizenship even without going to court, if he doesn't have anything to hide. Hell, he can send one of his appointed gophers to retrieve it, along with a federal marshall of course, where ever it is hidden away. You are aware that Mr. McCain never produced his \"vault\" copy of his birth certificate? Shocking that we even let him run for the office. Dave", 
        "reply": " Good Point Dave. No one starts a war--or rather, no one in his senses ought to do so--without first being clear in his mind what he intends to achieve by that war and how he intends to conduct it. Carl von Clausewitz", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-05 22:15:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "ProgMod"
    }, 
    {
        "content": "TRACKING HOAXES Don't Spread That Hoax This message has been edited. Last edited by: mainedawg, Fri 06 March 2009 01:08 PM", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "", 
        "reply": "TRACKING HOAXES Don't Spread That Hoax This message has been edited. Last edited by: mainedawg, Fri 06 March 2009 01:08 PM", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-06 09:23:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "JonUPS"
    }, 
    {
        "content": "[QUOTE]Originally posted by JonUPS: TRACKING HOAXES Don't Spread That Hoax: What Hoax? I am commenting on a news piece that I did in fact see on the Military.Com site. In reality the hoax is in and like it or not many of us who stand for conservative principles are stuck with a far more dangerous man in the Whitehouse than what you believed George Bush was. Have you heard the words coming out of his mouth? These are not the words of someone who has the best interest of the Nation at heart. I still stand and say that the average Democrat does not like our system of Government and wants to see it destroyed. Now the fool want's to tax you to finance some rediculous notion of combatting so called Global Warming, now there is a hoax for you. What remains is as always when there is a bonafide fact put forward that can be proved such as 2=2 there will be a fool on the left that cannot stand that it says 2 and will fight to re-educate everyone that will believe that is not 2 but 1. These are the folks that say that they love the United States but want to deny it's founding heritage and make the constitution say something that it does not. They do not want a morally upright society so they work to destroy it and if congress does not help they take it before the Ninth Circus Court of Appeals. Sir you may not understand this and you may have fallen in love with Mr Obama's looks or articulation but the fact remains that he is cut from the same cloth as the individuals I just wrote about. The left worked very hard to confront President Bush on everything. President Bush was not perfect. Like his father he thought that he could actually work with Democrats. Letting Ted Kennedy write that infamous education bill was one of the biggest mistakes of his administration. So now that we have an unqualified President In Mr.Obama it's ok just because the left loves him? If there is in the slightest possibility that Mr Obama does not meet the proper citizenship requirements for the purpose of the office then he and those supporting him need to be called on it. Bear this in mind we fought the cold war to fight the very ideals that Mr Obama is now espousing and I for one am getting sick and darn tired of seeing my country being attacked from within. This message has been edited. Last edited by: mainedawg, Fri 06 March 2009 01:09 PM", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "", 
        "reply": "[QUOTE]Originally posted by JonUPS: TRACKING HOAXES Don't Spread That Hoax: What Hoax? I am commenting on a news piece that I did in fact see on the Military.Com site. In reality the hoax is in and like it or not many of us who stand for conservative principles are stuck with a far more dangerous man in the Whitehouse than what you believed George Bush was. Have you heard the words coming out of his mouth? These are not the words of someone who has the best interest of the Nation at heart. I still stand and say that the average Democrat does not like our system of Government and wants to see it destroyed. Now the fool want's to tax you to finance some rediculous notion of combatting so called Global Warming, now there is a hoax for you. What remains is as always when there is a bonafide fact put forward that can be proved such as 2=2 there will be a fool on the left that cannot stand that it says 2 and will fight to re-educate everyone that will believe that is not 2 but 1. These are the folks that say that they love the United States but want to deny it's founding heritage and make the constitution say something that it does not. They do not want a morally upright society so they work to destroy it and if congress does not help they take it before the Ninth Circus Court of Appeals. Sir you may not understand this and you may have fallen in love with Mr Obama's looks or articulation but the fact remains that he is cut from the same cloth as the individuals I just wrote about. The left worked very hard to confront President Bush on everything. President Bush was not perfect. Like his father he thought that he could actually work with Democrats. Letting Ted Kennedy write that infamous education bill was one of the biggest mistakes of his administration. So now that we have an unqualified President In Mr.Obama it's ok just because the left loves him? If there is in the slightest possibility that Mr Obama does not meet the proper citizenship requirements for the purpose of the office then he and those supporting him need to be called on it. Bear this in mind we fought the cold war to fight the very ideals that Mr Obama is now espousing and I for one am getting sick and darn tired of seeing my country being attacked from within. This message has been edited. Last edited by: mainedawg, Fri 06 March 2009 01:09 PM", 
        "threadID": "4960045241001_7220020712001", 
        "time": "2009-03-06 10:13:00", 
        "title": "The Legitimacy of Obama's Citizenship", 
        "userID": "EBOHLING57"
    }
]