[
    {
        "content": "Yes I've heard of it. On one of my DD214s it says \"Soldier was activated for Operation Garden Plot\". (L.A. Riots 1992) It is the military's general plan for civil disturbance. The \"concentration camps\" that many have witnessed being built on military bases are in fact model FOBs for training troops deploying to Iraq and Afghanistan.", 
        "intTime": 20090301, 
        "postID": 4, 
        "quote": "", 
        "reply": "Yes I've heard of it. On one of my DD214s it says \"Soldier was activated for Operation Garden Plot\". (L.A. Riots 1992) It is the military's general plan for civil disturbance. The \"concentration camps\" that many have witnessed being built on military bases are in fact model FOBs for training troops deploying to Iraq and Afghanistan.", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-01 04:34:00", 
        "title": "Operation Garden Plot", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "It was started in the 70's. We had a thread on it some time back. I was a member of the team during 1972 to 1979. Nothing new.", 
        "intTime": 20090301, 
        "postID": 5, 
        "quote": "", 
        "reply": "It was started in the 70's. We had a thread on it some time back. I was a member of the team during 1972 to 1979. Nothing new.", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-01 06:31:00", 
        "title": "Operation Garden Plot", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I was a member of the team during 1972 to 1979. I knew it!!! If you count the cadence of the walking German Shepard in your posts it translates to Morse Code. I'm working to unlock the key now.", 
        "intTime": 20090301, 
        "postID": 6, 
        "quote": "Originally posted by mainedawg: I was a member of the team during 1972 to 1979.", 
        "reply": " I knew it!!! If you count the cadence of the walking German Shepard in your posts it translates to Morse Code. I'm working to unlock the key now.", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-01 10:28:00", 
        "title": "Operation Garden Plot", 
        "userID": "ErichG2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Has anyone else heard of this plan? I just heard about it today. \"http://www.uhuh.com/control/garden.htm\" aka \"Department of Defense Civil Disturbance Plan 55-2\" \"Annex A, section B of Operation Garden Plot defines tax protesters, militia groups, religious cults, and general anti-government dissenters as Disruptive Elements. This calls for the deadly force to be used against any extremist or dissident perpetrating any and all forms of civil disorder.\" \"In the Event of a Total Economic Collapse. It can be implemented to the phase necessary to restore order. It has several phases to it, during one phase the Government takes control of all property for the good of the people, if our Government is unable to get control during a total Economic Crisis then even our Military falls under control of the UNITED NATIONS, This law was passed in 1933 and has been added to several times since. If necessary the UN can bring in troops from China, Russia etc to restore order.\" I am not sure how this fits into your post. The League of Nations was established at the end of WW-I. The United Nations was established at the end of WW-II in 1945. Handing any powers over to the UN would have to come after 1945. Regardless of what happens in a time of civil unrest...would anyone from any side formed in our country allow troops from other countries into our borders?", 
        "intTime": 20090316, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: Has anyone else heard of this plan? I just heard about it today. \"http://www.uhuh.com/control/garden.htm\" aka \"Department of Defense Civil Disturbance Plan 55-2\" \"Annex A, section B of Operation Garden Plot defines tax protesters, militia groups, religious cults, and general anti-government dissenters as Disruptive Elements. This calls for the deadly force to be used against any extremist or dissident perpetrating any and all forms of civil disorder.\" \"In the Event of a Total Economic Collapse. It can be implemented to the phase necessary to restore order. It has several phases to it, during one phase the Government takes control of all property for the good of the people, if our Government is unable to get control during a total Economic Crisis then even our Military falls under control of the UNITED NATIONS, This law was passed in 1933 and has been added to several times since. If necessary the UN can bring in troops from China, Russia etc to restore order.\"", 
        "reply": " I am not sure how this fits into your post. The League of Nations was established at the end of WW-I. The United Nations was established at the end of WW-II in 1945. Handing any powers over to the UN would have to come after 1945. Regardless of what happens in a time of civil unrest...would anyone from any side formed in our country allow troops from other countries into our borders?", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-16 12:14:00", 
        "title": "Operation Garden Plot", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: quote: Originally posted by mainedawg: I was a member of the team during 1972 to 1979. I knew it!!! If you count the cadence of the walking German Shepard in your posts it translates to Morse Code. I'm working to unlock the key now. You will be ..... with, no I won't say it. The Army way. MD", 
        "intTime": 20090316, 
        "postID": 8, 
        "quote": "Originally posted by ErichG2: quote: Originally posted by mainedawg: I was a member of the team during 1972 to 1979. I knew it!!! If you count the cadence of the walking German Shepard in your posts it translates to Morse Code. I'm working to unlock the key now.", 
        "reply": " You will be ..... with, no I won't say it. The Army way. MD", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-16 12:42:00", 
        "title": "Operation Garden Plot", 
        "userID": "mainedawg"
    }, 
    {
        "content": "WHY the MODERN GUILLOTINES Uncovered at FORT LEWIS WASHINGTON-Army Insider reveals all for NWO agenda By Pamela Schuffert (American Holocaust Coming Blogspot) STAFF SERGEANT/ARMY RANGER/SPEC OPS MAN FROM FORT LEWIS WASHINGTON THAT I JUST MET WHILE TRAVELING FROM MONTANA TO NORTH CAROLINA REVEALS: 'THE GUILLOTINES ARE REAL AND I WAS GOING TO TRAIN MY MEN IN MY PLATOON TO USE THEM NEXT WEEK IN HIGHLY CLASSIFIED OPERATIONS AT FORT LEWIS...UNTIL YOU TOLD ME 'THEY WILL BE USED ON YOUR FELLOW AMERICANS UNDER COMING MARTIAL LAW!'' NOW he and the men who he told about my reporting, on HOW the guillotines will be used against their fellow Americans, ARE BEING ROUNDED UP AND HUNTED DOWN LIKE DOGS.. Humvees and helicopters surrounging their homes...military pay and all access to bank accounts and credit cards being cut off...and NOW HE IS ON THE RUN! All because they found out the truth about MARTIAL LAW and the guillotines FROM ME and have agreed among themselves to NEVER GO ALONG WITH THIS TERRIBLE NWO AGENDA! -Pamela Schuffert reporting live from NORTH CAROLINA I was riding on a bus from BUTTE MONTANA to North Carolina, when I met a young man all dressed up in full and impressive ARMY RANGER uniform. He carried his 445 mag gun and many knives and several phones and military backpack and other equipment. He told me he was a STAFF SERGEANT from FORT LEWIS! Fort Lewis is where many MODERN GUILLOTINES have been stored for a long time, for use in martial law. I teased him at first and told him I knew all about the MODERN GUILLOTINES in Fort Lewis. HE WAS SHOCKED! He said, 'HOW DID YOU KNOW...THIS IS HIGHLY CLASSIFIED INFORMATION!' He then admitted he was a Christian. I told him that the US MILITARY WAS NOT TELLING THE YOUNG MEN LIKE HIM, but these guillotines will be used on AMERICANS AND CHRISTIANS in the future udner martial law, to behead all NWO resisters. The longer he listened, the angrier he got. Using a few choice expletives, he said, 'THEY NEVER TOLD US THIS WOULD BE USED ON AMERICANS UNDER MARTIAL LAW...to get RID of all CHRISTIANS and NWO RESISTERS! We THOUGHT they would be used in IRAQ or something!' He then asked me to tell him more and more. He even filmed me. Finally, so angry at how they were being deceived and brainwashed, he told me, 'I WILL NEVER go along with this NWO agenda! I am A CHRISTIAN! I will contact my men in my platoon (64) and those I can trust who are Christians, I will tell them the TRUTH. I was supposed to go to Fort Hood for more SPECIAL OPS training next week, and THEN RETURN TO TRAIN MY MEN IN HOW TO OPERATE THESE GUILLOTINES! There is a special underground training center where the guillotines are...we are not allowed to bring in any cameras. cell phones, etc, because of HIGH SECURITY AND SILENCE regarding these guillotines.They are 6 and a half feet high, with hand restraints and a place for a person's head as they stand. We were going to use dummies for practice...BUT NOW I AM REFUSING THIS ASSIGNMENT and I will contact the men under me who I can trust...who will NOT go along with this NWO agenda and will come out instead with HUMVEES, WEAPONS and everything we can get our hands on to fight this NWO agenda!' We parted in Indianapolis...I wondered about the outcome. I was soon to find out! I called him the next day. He told me he talked to his sister and family and they were shocked...they were all military...they told him, 'HOW DID YOU KNOW ABOUT THIS NWO MARTIAL LAW AGENDA...IT IS ALL HIGHLY CLASSIFIED!' When he told them about ME (I had given him a copy of my AIRMAN MAGAZINE in it with my famous USAF father's cartoon in it..he was quite amazed and impressed) he told me his USAF aunt would submit my name to USAF intelligence computers to see where I stood in the sight of the USAF. He told me, 'She said you are RED FLAGGED (subject to arrest and interrogation) and are classified by the USAF as A THREAT TO NATIONAL SECURITY!' (ME???A THREAT TO NATIONAL SECURITY??? ALL for telling AMERICA THE TRUTH about coming MARTIAL LAW!) This ARMY RANGER had told me that IF HE HAD BEEN ON THE SIDE OF THE NWO AGENDA, he was authorized as an ARMY RANGER with highest security clearance and much special ops training to MARCH ME OUTSIDE THE BUS AND SHOOT TO KILL for knowing this classified info...OR he could have called the nearest military base and had vehicles come to arrest me immiediately and take me away for interrogation and termination. THAT IS HOW CLASSIFIED MY INSIDE INVESTIGATING AND INFO REALLY IS! And YESTERDAY when I called him, he had even MORE shocking information for me. 'I AM ON THE RUN NOW...they are trying to pick me up...and my USAF sister too! OUR PAY AND MILITARY SERVICE AND BANK ACCOUNTS HAVE ALL BEEN CLOSED OFF...we cannot access anything now! THEY ARE NOW ARRESTING HALF THE MEN IN MY PLATOON...men I talked to who agreed that THEY WOULD NEVER GO ALONG WITH A NWO MARTIAL LAW AGENDA...all THEIR pay and service and bank accounts have been cut off from them now too....military helicopters and humvees are surrounding their homes..they are being watched and picked up one by one...one man in my platoon defended himself when they broke into his home, SHOOTING FIVE MILITARY SOLDERS TRYING TO TAKE HIM in the process ( some were killed) before they were able to arrest him! We are on the run now, my sister and I...they are after us too.....' I am actively now on the phone with Staff Sergeant Donnie. His aunt who ran my name through USAF computers is now being questioned by USAF authorities. I am SURE they are angry with ME right now as well! They may be searching for me at this time as well....with this military scandal breaking and ME in the middle of it! GET THIS WORD OUT TO EVERYONE! These brave military men are paying the highest price to say THEY WILL NEVER GO ALONG WITH THIS NWO MILITARY AGENDA to kill innocent Americans and to destroy our Constitution and our freedoms and people of faith and character in our nation. PRAY for Staff Sergeant DONNIE BOYSEL and his sister NOW and for the men they are now hunting down like dogs...to be interogated and KILLED! PRAY ALSO FOR ME! I may be picked up soon for my role in this military scandal. PRAY FOR THE MERCY OF JESUS to preserve me through all this! FORWARD THIS BREAKING NEWS TO EVERYONE ON YOUR EMAIL LIST! And NOW YOU KNOW....the GUILLOTINES ARE REAL! (Revelation 20:4) He told me they ARE EVERYWHERE...in FORT HOOD, FORT BRAGG, FORT LEWIS..in ALL the US MILITARY BASES including GERMANY where he was stationed... (yes Europeans will be beheaded for their faith as well in the NEW WORLD ORDER!) PASS THIS ON AND PRAY FOR ME, FOR DONNIE AND HIS CHRISTIAN MEN THEY ARE HUNTING DOWN FROM FORT LEWIS! -Pamela Schuffert reporting LIVE from across the nation \"It is now TIME for the Christians of USA/CANADA to PREPARE for the COMING CRISIS. It will NOT be without PERSECUTION, TESTING and BLOODSHED. I dare say, in fact, that it is TIME for the Christians of North America to PREPARE FOR MARTYRDOM for their faith. END TIME BIBLE PROPHECY is about to unfold in this nation as NEVER BEFORE...and I can prove it!\" - ~Pamela Schuffert, Noted author, investigative journalist, lecturer, radio/television,and Christian evangelist", 
        "intTime": 20090316, 
        "postID": 9, 
        "quote": "", 
        "reply": "WHY the MODERN GUILLOTINES Uncovered at FORT LEWIS WASHINGTON-Army Insider reveals all for NWO agenda By Pamela Schuffert (American Holocaust Coming Blogspot) STAFF SERGEANT/ARMY RANGER/SPEC OPS MAN FROM FORT LEWIS WASHINGTON THAT I JUST MET WHILE TRAVELING FROM MONTANA TO NORTH CAROLINA REVEALS: 'THE GUILLOTINES ARE REAL AND I WAS GOING TO TRAIN MY MEN IN MY PLATOON TO USE THEM NEXT WEEK IN HIGHLY CLASSIFIED OPERATIONS AT FORT LEWIS...UNTIL YOU TOLD ME 'THEY WILL BE USED ON YOUR FELLOW AMERICANS UNDER COMING MARTIAL LAW!'' NOW he and the men who he told about my reporting, on HOW the guillotines will be used against their fellow Americans, ARE BEING ROUNDED UP AND HUNTED DOWN LIKE DOGS.. Humvees and helicopters surrounging their homes...military pay and all access to bank accounts and credit cards being cut off...and NOW HE IS ON THE RUN! All because they found out the truth about MARTIAL LAW and the guillotines FROM ME and have agreed among themselves to NEVER GO ALONG WITH THIS TERRIBLE NWO AGENDA! -Pamela Schuffert reporting live from NORTH CAROLINA I was riding on a bus from BUTTE MONTANA to North Carolina, when I met a young man all dressed up in full and impressive ARMY RANGER uniform. He carried his 445 mag gun and many knives and several phones and military backpack and other equipment. He told me he was a STAFF SERGEANT from FORT LEWIS! Fort Lewis is where many MODERN GUILLOTINES have been stored for a long time, for use in martial law. I teased him at first and told him I knew all about the MODERN GUILLOTINES in Fort Lewis. HE WAS SHOCKED! He said, 'HOW DID YOU KNOW...THIS IS HIGHLY CLASSIFIED INFORMATION!' He then admitted he was a Christian. I told him that the US MILITARY WAS NOT TELLING THE YOUNG MEN LIKE HIM, but these guillotines will be used on AMERICANS AND CHRISTIANS in the future udner martial law, to behead all NWO resisters. The longer he listened, the angrier he got. Using a few choice expletives, he said, 'THEY NEVER TOLD US THIS WOULD BE USED ON AMERICANS UNDER MARTIAL LAW...to get RID of all CHRISTIANS and NWO RESISTERS! We THOUGHT they would be used in IRAQ or something!' He then asked me to tell him more and more. He even filmed me. Finally, so angry at how they were being deceived and brainwashed, he told me, 'I WILL NEVER go along with this NWO agenda! I am A CHRISTIAN! I will contact my men in my platoon (64) and those I can trust who are Christians, I will tell them the TRUTH. I was supposed to go to Fort Hood for more SPECIAL OPS training next week, and THEN RETURN TO TRAIN MY MEN IN HOW TO OPERATE THESE GUILLOTINES! There is a special underground training center where the guillotines are...we are not allowed to bring in any cameras. cell phones, etc, because of HIGH SECURITY AND SILENCE regarding these guillotines.They are 6 and a half feet high, with hand restraints and a place for a person's head as they stand. We were going to use dummies for practice...BUT NOW I AM REFUSING THIS ASSIGNMENT and I will contact the men under me who I can trust...who will NOT go along with this NWO agenda and will come out instead with HUMVEES, WEAPONS and everything we can get our hands on to fight this NWO agenda!' We parted in Indianapolis...I wondered about the outcome. I was soon to find out! I called him the next day. He told me he talked to his sister and family and they were shocked...they were all military...they told him, 'HOW DID YOU KNOW ABOUT THIS NWO MARTIAL LAW AGENDA...IT IS ALL HIGHLY CLASSIFIED!' When he told them about ME (I had given him a copy of my AIRMAN MAGAZINE in it with my famous USAF father's cartoon in it..he was quite amazed and impressed) he told me his USAF aunt would submit my name to USAF intelligence computers to see where I stood in the sight of the USAF. He told me, 'She said you are RED FLAGGED (subject to arrest and interrogation) and are classified by the USAF as A THREAT TO NATIONAL SECURITY!' (ME???A THREAT TO NATIONAL SECURITY??? ALL for telling AMERICA THE TRUTH about coming MARTIAL LAW!) This ARMY RANGER had told me that IF HE HAD BEEN ON THE SIDE OF THE NWO AGENDA, he was authorized as an ARMY RANGER with highest security clearance and much special ops training to MARCH ME OUTSIDE THE BUS AND SHOOT TO KILL for knowing this classified info...OR he could have called the nearest military base and had vehicles come to arrest me immiediately and take me away for interrogation and termination. THAT IS HOW CLASSIFIED MY INSIDE INVESTIGATING AND INFO REALLY IS! And YESTERDAY when I called him, he had even MORE shocking information for me. 'I AM ON THE RUN NOW...they are trying to pick me up...and my USAF sister too! OUR PAY AND MILITARY SERVICE AND BANK ACCOUNTS HAVE ALL BEEN CLOSED OFF...we cannot access anything now! THEY ARE NOW ARRESTING HALF THE MEN IN MY PLATOON...men I talked to who agreed that THEY WOULD NEVER GO ALONG WITH A NWO MARTIAL LAW AGENDA...all THEIR pay and service and bank accounts have been cut off from them now too....military helicopters and humvees are surrounding their homes..they are being watched and picked up one by one...one man in my platoon defended himself when they broke into his home, SHOOTING FIVE MILITARY SOLDERS TRYING TO TAKE HIM in the process ( some were killed) before they were able to arrest him! We are on the run now, my sister and I...they are after us too.....' I am actively now on the phone with Staff Sergeant Donnie. His aunt who ran my name through USAF computers is now being questioned by USAF authorities. I am SURE they are angry with ME right now as well! They may be searching for me at this time as well....with this military scandal breaking and ME in the middle of it! GET THIS WORD OUT TO EVERYONE! These brave military men are paying the highest price to say THEY WILL NEVER GO ALONG WITH THIS NWO MILITARY AGENDA to kill innocent Americans and to destroy our Constitution and our freedoms and people of faith and character in our nation. PRAY for Staff Sergeant DONNIE BOYSEL and his sister NOW and for the men they are now hunting down like dogs...to be interogated and KILLED! PRAY ALSO FOR ME! I may be picked up soon for my role in this military scandal. PRAY FOR THE MERCY OF JESUS to preserve me through all this! FORWARD THIS BREAKING NEWS TO EVERYONE ON YOUR EMAIL LIST! And NOW YOU KNOW....the GUILLOTINES ARE REAL! (Revelation 20:4) He told me they ARE EVERYWHERE...in FORT HOOD, FORT BRAGG, FORT LEWIS..in ALL the US MILITARY BASES including GERMANY where he was stationed... (yes Europeans will be beheaded for their faith as well in the NEW WORLD ORDER!) PASS THIS ON AND PRAY FOR ME, FOR DONNIE AND HIS CHRISTIAN MEN THEY ARE HUNTING DOWN FROM FORT LEWIS! -Pamela Schuffert reporting LIVE from across the nation \"It is now TIME for the Christians of USA/CANADA to PREPARE for the COMING CRISIS. It will NOT be without PERSECUTION, TESTING and BLOODSHED. I dare say, in fact, that it is TIME for the Christians of North America to PREPARE FOR MARTYRDOM for their faith. END TIME BIBLE PROPHECY is about to unfold in this nation as NEVER BEFORE...and I can prove it!\" - ~Pamela Schuffert, Noted author, investigative journalist, lecturer, radio/television,and Christian evangelist", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-16 22:07:00", 
        "title": "Operation Garden Plot", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "CORRECTION on gun type carried: Donnie carried a 45 mag gun, as personal one and not Army issued.Typo in original report-Pamela", 
        "intTime": 20090316, 
        "postID": 10, 
        "quote": "", 
        "reply": "CORRECTION on gun type carried: Donnie carried a 45 mag gun, as personal one and not Army issued.Typo in original report-Pamela", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-16 22:08:00", 
        "title": "Operation Garden Plot", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "Can I come out from under neath my bed now? Is the coast clear? Whew that was a close one.", 
        "intTime": 20090317, 
        "postID": 11, 
        "quote": "", 
        "reply": "Can I come out from under neath my bed now? Is the coast clear? Whew that was a close one.", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-17 12:19:00", 
        "title": "Operation Garden Plot", 
        "userID": "dman1948"
    }, 
    {
        "content": "As far as foreign troops in America goes Mexican Troops were allowed into Texas after Katrina to \"help maintain order at Katrina refugee camp at San Antonio\". Caused quite a little stir here when reports of Mexican convoys began to surface,but it was hushed up quite effectively.", 
        "intTime": 20090322, 
        "postID": 12, 
        "quote": "", 
        "reply": "As far as foreign troops in America goes Mexican Troops were allowed into Texas after Katrina to \"help maintain order at Katrina refugee camp at San Antonio\". Caused quite a little stir here when reports of Mexican convoys began to surface,but it was hushed up quite effectively.", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-22 17:00:00", 
        "title": "Operation Garden Plot", 
        "userID": "brazospete"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: quote: Originally posted by mainedawg: I was a member of the team during 1972 to 1979. I knew it!!! If you count the cadence of the walking German Shepard in your posts it translates to Morse Code. I'm working to unlock the key now. What about the woman headbanger above it, thrashing head and bouncy fun things. i think the dog and woman are working together...", 
        "intTime": 20090322, 
        "postID": 13, 
        "quote": "Originally posted by ErichG2: quote: Originally posted by mainedawg: I was a member of the team during 1972 to 1979. I knew it!!! If you count the cadence of the walking German Shepard in your posts it translates to Morse Code. I'm working to unlock the key now.", 
        "reply": " What about the woman headbanger above it, thrashing head and bouncy fun things. i think the dog and woman are working together...", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-22 18:02:00", 
        "title": "Operation Garden Plot", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: ~Pamela Schuffert, Noted author, investigative journalist, lecturer, radio/television,and Christian evangelist Wow! And all this time I thought \"Pam\" was just another troll. Silly me!", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "~Pamela Schuffert, Noted author, investigative journalist, lecturer, radio/television,and Christian evangelist", 
        "reply": " Wow! And all this time I thought \"Pam\" was just another troll. Silly me!", 
        "threadID": "4960045241001_2710053212001", 
        "time": "2009-03-23 00:26:00", 
        "title": "Operation Garden Plot", 
        "userID": "scooter_mech"
    }
]