[
    {
        "content": "UN/FEMA Prisoner Boxcars With Shackles, Guillotines, And the NWO AGENDA for \"AMERIKA\"NO LONGER Considered \"URBAN LEGEND\" The FEMA Boxcars Are Now CONFIRMED REALITY -by Pamela Schuffert, providing investigative journalism with a Christian perspective Since 1996, I have been consistently traveling, investigating, documenting and reporting that there are thousands of prisoner boxcars with shackles, manufactured out of Portland, OR, by GUNDERSON STEEL FABRICATION (plus other separate boxcar manufacturing companies/operations located nationwide.) Through numerous contacts, including CIA/Naval Intel and other sources, ithas been confirmed personally to me that there are numerous covert\"FEMA/HOMELAND SECURITY concentration camps\" located across America, Canada and Alaska for the hour of martial law and the seizure of this nation for the New World Order. Many of these camps are actual termination facilities, some equipped withgassing/crematory facilities. Some of these facilities are also incorporated into the military's DUMB's (deep underground military facilities.)From sources inside the CIA, it was revealed to me that these numerous camps have been established to detain and ultimately terminate what they consistently referred to as \"the resisters of the New World Order.\" (Michael Maholy, 20 years CIA/Naval Intelligence;confirmed independently by Elaine, former CIA assassin/NWO agenda planner.) \"Oh, all of us in the intelligence community know about the concentration camps and their purposes...we ALL know that they are to TERMINATE THE RESISTERS OF THE NEW WORLD ORDER UNDER MARTIAL LAW.\"(CIA/ONI Michael Maholy.) But what IS a resister of the New World Order? The definition our \"friendly\" US government has applied will surprise you! A \"NWO resister\" includes: -A Christian (firm Bible believer) -A Constitutionalist-A Patriot -A gun owner who refuse to relinquish 2nd Amendment rights -Anyone who adheres to the concepts of maintaining our national sovereignty,the Constitution and rejects the concept of United Nations world government control in it's place is labeled by the government as a \"resister of the New World Order.\" -Those radio broadcasters, lecturers, authors, and pastors who publicly come against the New World Order. Have you ever listened to alternate news radio broadcasts exposing the NWO? They are all telling America the truth about the New World Order and it's dark agenda for America via the UN/martial law agenda. And every independent reporter, including myself, knows that they are irrevocably marked for persecution under the NWO/martial law agenda our nation is now entering into. People like them are the more open and obvious examples of \"resisters of the NWO.\" Even now, listed silently in classified government/military/intelligence community computers are the names of millions of fellow American Patriots ALREADY PROFILED as \"resisters of the NWO.\" Such people have been marked for priority arrest, transport to these modern concentration camps (under FEMA or military jurisdiction,) interrogation in some cases, and ultimately termination for many. Interrogation? \"Are you a member of the militia? Who is your leader? Where are your secret cells located? How many secret weapons caches do you have?\"Or, \"Who is your Pastor? Where are your food supplies hidden? How manybelong to your prayer group?\" Etc. The CIA and the military have been secretly perfecting both mind control drugs and torture techniques designed to force compliance or to be used in interrogation sessions. I have been personally informed by former CIA planners of the NWO agenda under martial law that those arrested can anticipate \"...brutal rape, torture and death once they are arrested and taken to the camps!\" I know the credibility of these sources and I do not make these statements lightly. The people whom I have interviewed on this subject have been part of the \"inner planning\" of the coming New World order takeover for years.They know of what they speak. As one former CIA admitted, \"I even helped design the blueprints for some of these camps. And although NOW I greatly regret my role, the camps stand to this day and will be activated under martial law.\" It was then that this source paused, looked intently into my eyes and revealed,\"...I tell you, it will be brutal rape, torture and death once they are arrested and taken to the camps...\" One person who worked with military planners for NWO takeover admitted to me during an interview, \"We NWO satanists sat around discussing how long we could prolong the lives of arrested Christians under torture until they finally expired. We came up with 11-13 days.\" This source exposing the NWO agenda, CISCO WHEELER, has written several books on this subject, including CIA/mlitary torture/mind control drugs testing and their victims, and whose father was a military participant in all this. Particularly hated by the NWO agenda are Christians who, for Bible-based reasons, will refuse to participate in their Luciferic based NWO.Former Satanists/Illuminati, who are the backbone of the NWO, have admitted this to me repeatedly. And this is the reason why Christians will be considered a major target for arrest and removal as NWO takeover progresses in America. How many times must I emphasize this to wake up the churches in America??? I have interviewed victim-survivors of the CIA/military torture practice sessions in facilities such as China Lake Naval Ordnance Research facility. Neither infants nor children were spared the horrors of such brutal testing...testing that left many of them either dead or scarred for life. Those \"resisters of the NWO\" who are not speedily terminated at the many gassing/cremating or microwaving facilities across America, Canada andAlaska may instead be diverted to facilities such as those located in deep underground military bases for human experimentation UNTIL THEY EXPIRE.(Remember Joseph Mengele and the Nazi doctors? Sadly, history DOES repea****elf.) Or turned over to Satanist covens for human sacrifice cannon fodder. I have inside basis and independent, repeat confirmations for each and every statement I have just made. -EYE WITNESS SIGHTINGS OF PRISONER BOXCARS WITH SHACKLES- I have interviewed many eye-witnesses to these prisoner boxcars. There are several varieties of prisoner boxcars, ranging from all new, metal, modern versions higher than average boxcars to refurbished older boxcars. Some versions have the modern guillotines (imported from Japan and China) installed in them, others do not. But ALL have shackles installed to restrain prisoners. One variety of prisoner boxcars has been imported from China, in the form of 40 foot cargo containers, with shackles installed and a modern guillotine at the head of each one. Their TRUE intentions are easily concealed from public scrutiny and have no windows. For all practical purposes, they appear to be normal Chinese cargo containers (like HANJIN, COSCO, etc.) that can be piggybacked on train flatbeds or trucks. It has been reported to me by NWO agenda investigator Lee Harrington that originally 20,000 of these prisoner cargo containers were ordered from China. These were ordered under secret contract through one cooperating Congressman who met with officials in China. (And you WONDER why NWO supporters like Clinton and Bush Sr. and Jr. have had\"love affairs\" with China??? China, through supplying these prisoner boxcars, has just enabled them to more speedily terminate the hatedresisters of their New World Order!) Some prisoner boxcars have been observed in Montana, at one point near Columbia Falls in the Glacier area. Personal friends taking a missionary journey across America stumbled upon them during a picture-taking expedition in the forest near Columbia Falls. My friend Marie McCullough recounted, \"We were following the railroad tracks into the forest, so that we would not get lost and could find out way out. We were surprised as we followed them deeper into the woods to discover boxcars, looking out of place and all painted black. Suspicious, we decided to look inside one if we could. We saw one that had a door partially open. We struggled to slide it open all the way, and when our eyes adjusted to the dark interior, what we saw shocked us. There were rows of shackles installed in the boxcar. My friend Rose pointed to the end of the boxcar and I said, 'Rose, what IS that?'\" \"She replied, 'Why, Marie, don't you SEE what that is??? IT IS A GUILLOTINE!' \" \"We were frightened by then, and decided to follow the railroad tracks and leave the area. When we returned to our host's home and shared what we had seen, they got angry and told us, 'we WARNED you to stay away from that area! It has guards with rifles...you could have gotten killed!'\" Marie admits she is under government surveillance and her phone is constantly monitored...simply for discovering a deadly NWO secret.When I finally traveled to Montana to investigate, I encountered Patriots in Columbia Falls who admitted that, while hunting in the northern wilderness above Glacier, they had stumbled on these boxcars on remote sidetracks as well. (They also encountered Russian soldiers in training with Americanmilitary counterparts.) I also met with Lee Harrington of Vallier, MT, former military liason officer and later a metal worker who admitted that there had been a \"boxcar with shackles\" operation in Glasgow, MT that employed summer youth workers one year to help weld shackles into boxcars. From there, they were shipped west along Highway 2, through Cut Bank and on to remote areas around Glacier to remain concealed on remote sidetracks until the hour of martial law takeover and their grim deployment. (These are the older boxcars that have been refurbished and painted black.) One eye-witness from the Cut Bank Indian reservation personally observed these boxcars as they slowly passed through his reservation, noting the doors on some still open and the shackles plainly in view. Disturbed about what he saw, he reported this to a Montana Christian intercessors' group, which reported this to me in person in Bozeman, MT. I personally observed, while investigating in White Fish near Kalispell in the Glacier area, frequent trains arriving with the Chinese 40 foot cargo containers on board, double stacked, all pulled by BURLINGTON NORTHERN/SANTAFE. While I realized that many could be legitimately filled with consumer goods, I also knew that others could be the deadly prisoner boxcar cargocontainers. It was impossible to tell one from the other. People who know this dark truth reported to me with alarm that many of these 40 foot cargo containers have been seen building up at Long Beach Naval Shipyards, which has been turned over to the Chinese. Knowing the role that Chinese troops will play against American resisters of the NWO/UN takeover (through the Trilateral Alliance Treaty secret agreement with China to deploy their troops against Americans offering resistance under martial law,) they are suspicious as to their nature. -TRUCKERS ENCOUNTER MODERN GUILLOTINES- Truckers also know some deadly secrets of the New World Order agenda for America. In the course of traveling thousands of miles across America to research this subject, I have interviewed many truckers and their contacts.They have admitted to me personally that they or their trucker buddies have delivered shipments of the MODERN GUILLOTINES, manufactured in China and Japan, and unloaded on the loading docks of San Diego and other west coast ports of entry. Guillotine shipments have been going on in earnest for many years now, and eyewitness sightings have increased. Military sources have admitted helping unload such deadly cargoes at military facilities, to be stored in warehouse for the hour of NWO/UN takeover. Incredulous over the early reports I received of guillotines in America, I discussed this subject with Patriot investigator Ed Pack, and former CIA NWO planner Elaine. Both admitted that the guillotines were a reality. Elaine commented, \"I have been to the manufacturing plant in Japan where they are made. And I have stood on the loading docks of San Diego as they were unloaded to be distributed across America. At THAT time I rejoiced, because I knew what they would be used for: the termination of Christians who stood in the way of our New World Order!\" Such sentiments were echoed to me by former high level Illuminati/Satanist DOC MARQUIS, now of CHRISTIANS EXPOSING THE OCCULT. Doc told me that when he was personally flown out to the FEMA gassing/crematory detention camp in the Mojave (it has a landing strip) he rejoiced as he was shown around ths deadly compound. \"My sentiments? I rejoiced over the thought that Christians would be terminated in this place.\" (\"Christians\" in reference to being \"resisters of the New World Order...THEIR Illuminati NWO! Doc is now a Christian and is exposing the deadly secrets of the NWO.) -FURTHER EYE WITNESSES TO THE NWO/NOAHIDE LAWS GUILLOTINES- Personal friends (Russian Christians that I network with across America)I have interviewed in Washington State have seen the guillotines in the back of one truck. Two state troopers pulled over a truck on the highway these eyewitnesses were traveling on. They were detained by this. They watched as the trucker led the troopers to the back of the truck and broke the seal and opened the doors to disclose the contents. \"We were shocked to see that the truck was filled from front to back with nothing but guillotines!\" Satisfied, the troopers then left. These Russian Christians in the car behind the truck came out to talk with the trucker. He was terrified about what his truck contained: it was a sealed shipment. He had not been informed of his deadly cargo! The eyewitnesses recounted, \"He was so shocked he turned in his truck and his papers and refused to even deliver his shipment and simply walked away...\" (These eyewitnesses are solid Christians living in Spokane, WA.) For Christians who would raise eyebrows at this, I will simply refer them to the Bible as evidence: \"Rev. 20:4-\"And I saw the souls of them who were beheaded for the witness ofJesus and for the word of God...\" While it is true that many, including the Apostle Paul, have been beheaded for the witness of Jesus, if you read it CAREFULLY you will see that this Scripture passage is SPECIFICALLY referring to this present time frame of the Kingdom of Satan on earth (the Kingdom of the Beast or AntiChrist) and the period when the cashless society will be manifested with the mark (Digital Angel?) in one's hand or forehead and it's blasphemous world religious system of Revelation 13. This is the end-time hour in which we live, my fellow Americans and concerned Christians. And in order to have mass beheading terminations of so many Christian resisters of the NWO, you must have the tools with which to do it. Bible prophecy, even that of negative implications for Christians, will be fulfilled regardless of whether we like it or not. And the guillotines ARE HERE! You can expect to see these modern guillotines in the near future throughout America. But if you read the rest of the verse carefully, you will see that there is no need to fear: those beheaded for their witness of Jesus will also be resurrected to reign with Jesus Christ at His return! The end for those who trust Him and refuse to deny Him is TOTAL VICTORY! Because I believe in Bible Scriptures, I have no fear as I investigate and expose such things. I face the same persecution as all my fellow Christians in North America. Will I be called upon to give my life for my testimony of Jesus and what I report upon??? Will YOU? Undoubtedly. But I have chosen to believe the Word of God, and to reject fear.\"In God have I put my trust. I will not fear what man can do to me, for thisI know, that God is for me.\" In spite of all I report on regarding concentration camps, boxcars and shackles and coming NWO takeover in America, I have perfect peace in my heart. AND YOU CAN TOO! OUR God of salvation through Jesus Christ IS greater than the Lucifer directing their New World Order. And regardless of what God may permit to happen in our lives, we can have the satisfaction of knowing as born again Christians that we are sealed for eternity as God's children and that our names are written in the Lamb's book of Life. Life is a series of choices. We therefore must CHOOSE to confess Jesus Christ before men and to seek God for the grace to remain faithful unto death throughout the coming times of testing. For the true Born-again believer in Jesus Christ, death holds no fears. Will you choose to obey the Word of God, and to confess Jesus Christ beforemen boldly, trusting Him to bring you through the coming times of testings??? It makes no difference if such a confession costs even your home...your job...your car and more. There is NOTHING MORE IMPORTANT than your eternal soul! \"For what shall it profit a man, if he gain the WHOLE WORLD and lose his soul?\" declared Jesus Christ. If you, as a Christian, are moved to deny Jesus Christ before men for any reason (even to save your own life) YOU WILL PERISH! We Christians are living in a hour in which we must realize that it is impossible for us to preserve our lives at the cost of our eternal souls...we can only seek God for the grace to lay our lives down completely and faithfully for Jesus Christ and the Gospel. End-time persecution is surely coming, and all our protesting and denial cannot stop it. For those of you great American Patriots,it is time for mature Christianity, and it is time to EMBRACE THE CROSS. Reporting from across the nation, Pamela Schuffert (American Holocaust Coming Blogspot)", 
        "intTime": 20090316, 
        "postID": 1, 
        "quote": "", 
        "reply": "UN/FEMA Prisoner Boxcars With Shackles, Guillotines, And the NWO AGENDA for \"AMERIKA\"NO LONGER Considered \"URBAN LEGEND\" The FEMA Boxcars Are Now CONFIRMED REALITY -by Pamela Schuffert, providing investigative journalism with a Christian perspective Since 1996, I have been consistently traveling, investigating, documenting and reporting that there are thousands of prisoner boxcars with shackles, manufactured out of Portland, OR, by GUNDERSON STEEL FABRICATION (plus other separate boxcar manufacturing companies/operations located nationwide.) Through numerous contacts, including CIA/Naval Intel and other sources, ithas been confirmed personally to me that there are numerous covert\"FEMA/HOMELAND SECURITY concentration camps\" located across America, Canada and Alaska for the hour of martial law and the seizure of this nation for the New World Order. Many of these camps are actual termination facilities, some equipped withgassing/crematory facilities. Some of these facilities are also incorporated into the military's DUMB's (deep underground military facilities.)From sources inside the CIA, it was revealed to me that these numerous camps have been established to detain and ultimately terminate what they consistently referred to as \"the resisters of the New World Order.\" (Michael Maholy, 20 years CIA/Naval Intelligence;confirmed independently by Elaine, former CIA assassin/NWO agenda planner.) \"Oh, all of us in the intelligence community know about the concentration camps and their purposes...we ALL know that they are to TERMINATE THE RESISTERS OF THE NEW WORLD ORDER UNDER MARTIAL LAW.\"(CIA/ONI Michael Maholy.) But what IS a resister of the New World Order? The definition our \"friendly\" US government has applied will surprise you! A \"NWO resister\" includes: -A Christian (firm Bible believer) -A Constitutionalist-A Patriot -A gun owner who refuse to relinquish 2nd Amendment rights -Anyone who adheres to the concepts of maintaining our national sovereignty,the Constitution and rejects the concept of United Nations world government control in it's place is labeled by the government as a \"resister of the New World Order.\" -Those radio broadcasters, lecturers, authors, and pastors who publicly come against the New World Order. Have you ever listened to alternate news radio broadcasts exposing the NWO? They are all telling America the truth about the New World Order and it's dark agenda for America via the UN/martial law agenda. And every independent reporter, including myself, knows that they are irrevocably marked for persecution under the NWO/martial law agenda our nation is now entering into. People like them are the more open and obvious examples of \"resisters of the NWO.\" Even now, listed silently in classified government/military/intelligence community computers are the names of millions of fellow American Patriots ALREADY PROFILED as \"resisters of the NWO.\" Such people have been marked for priority arrest, transport to these modern concentration camps (under FEMA or military jurisdiction,) interrogation in some cases, and ultimately termination for many. Interrogation? \"Are you a member of the militia? Who is your leader? Where are your secret cells located? How many secret weapons caches do you have?\"Or, \"Who is your Pastor? Where are your food supplies hidden? How manybelong to your prayer group?\" Etc. The CIA and the military have been secretly perfecting both mind control drugs and torture techniques designed to force compliance or to be used in interrogation sessions. I have been personally informed by former CIA planners of the NWO agenda under martial law that those arrested can anticipate \"...brutal rape, torture and death once they are arrested and taken to the camps!\" I know the credibility of these sources and I do not make these statements lightly. The people whom I have interviewed on this subject have been part of the \"inner planning\" of the coming New World order takeover for years.They know of what they speak. As one former CIA admitted, \"I even helped design the blueprints for some of these camps. And although NOW I greatly regret my role, the camps stand to this day and will be activated under martial law.\" It was then that this source paused, looked intently into my eyes and revealed,\"...I tell you, it will be brutal rape, torture and death once they are arrested and taken to the camps...\" One person who worked with military planners for NWO takeover admitted to me during an interview, \"We NWO satanists sat around discussing how long we could prolong the lives of arrested Christians under torture until they finally expired. We came up with 11-13 days.\" This source exposing the NWO agenda, CISCO WHEELER, has written several books on this subject, including CIA/mlitary torture/mind control drugs testing and their victims, and whose father was a military participant in all this. Particularly hated by the NWO agenda are Christians who, for Bible-based reasons, will refuse to participate in their Luciferic based NWO.Former Satanists/Illuminati, who are the backbone of the NWO, have admitted this to me repeatedly. And this is the reason why Christians will be considered a major target for arrest and removal as NWO takeover progresses in America. How many times must I emphasize this to wake up the churches in America??? I have interviewed victim-survivors of the CIA/military torture practice sessions in facilities such as China Lake Naval Ordnance Research facility. Neither infants nor children were spared the horrors of such brutal testing...testing that left many of them either dead or scarred for life. Those \"resisters of the NWO\" who are not speedily terminated at the many gassing/cremating or microwaving facilities across America, Canada andAlaska may instead be diverted to facilities such as those located in deep underground military bases for human experimentation UNTIL THEY EXPIRE.(Remember Joseph Mengele and the Nazi doctors? Sadly, history DOES repea****elf.) Or turned over to Satanist covens for human sacrifice cannon fodder. I have inside basis and independent, repeat confirmations for each and every statement I have just made. -EYE WITNESS SIGHTINGS OF PRISONER BOXCARS WITH SHACKLES- I have interviewed many eye-witnesses to these prisoner boxcars. There are several varieties of prisoner boxcars, ranging from all new, metal, modern versions higher than average boxcars to refurbished older boxcars. Some versions have the modern guillotines (imported from Japan and China) installed in them, others do not. But ALL have shackles installed to restrain prisoners. One variety of prisoner boxcars has been imported from China, in the form of 40 foot cargo containers, with shackles installed and a modern guillotine at the head of each one. Their TRUE intentions are easily concealed from public scrutiny and have no windows. For all practical purposes, they appear to be normal Chinese cargo containers (like HANJIN, COSCO, etc.) that can be piggybacked on train flatbeds or trucks. It has been reported to me by NWO agenda investigator Lee Harrington that originally 20,000 of these prisoner cargo containers were ordered from China. These were ordered under secret contract through one cooperating Congressman who met with officials in China. (And you WONDER why NWO supporters like Clinton and Bush Sr. and Jr. have had\"love affairs\" with China??? China, through supplying these prisoner boxcars, has just enabled them to more speedily terminate the hatedresisters of their New World Order!) Some prisoner boxcars have been observed in Montana, at one point near Columbia Falls in the Glacier area. Personal friends taking a missionary journey across America stumbled upon them during a picture-taking expedition in the forest near Columbia Falls. My friend Marie McCullough recounted, \"We were following the railroad tracks into the forest, so that we would not get lost and could find out way out. We were surprised as we followed them deeper into the woods to discover boxcars, looking out of place and all painted black. Suspicious, we decided to look inside one if we could. We saw one that had a door partially open. We struggled to slide it open all the way, and when our eyes adjusted to the dark interior, what we saw shocked us. There were rows of shackles installed in the boxcar. My friend Rose pointed to the end of the boxcar and I said, 'Rose, what IS that?'\" \"She replied, 'Why, Marie, don't you SEE what that is??? IT IS A GUILLOTINE!' \" \"We were frightened by then, and decided to follow the railroad tracks and leave the area. When we returned to our host's home and shared what we had seen, they got angry and told us, 'we WARNED you to stay away from that area! It has guards with rifles...you could have gotten killed!'\" Marie admits she is under government surveillance and her phone is constantly monitored...simply for discovering a deadly NWO secret.When I finally traveled to Montana to investigate, I encountered Patriots in Columbia Falls who admitted that, while hunting in the northern wilderness above Glacier, they had stumbled on these boxcars on remote sidetracks as well. (They also encountered Russian soldiers in training with Americanmilitary counterparts.) I also met with Lee Harrington of Vallier, MT, former military liason officer and later a metal worker who admitted that there had been a \"boxcar with shackles\" operation in Glasgow, MT that employed summer youth workers one year to help weld shackles into boxcars. From there, they were shipped west along Highway 2, through Cut Bank and on to remote areas around Glacier to remain concealed on remote sidetracks until the hour of martial law takeover and their grim deployment. (These are the older boxcars that have been refurbished and painted black.) One eye-witness from the Cut Bank Indian reservation personally observed these boxcars as they slowly passed through his reservation, noting the doors on some still open and the shackles plainly in view. Disturbed about what he saw, he reported this to a Montana Christian intercessors' group, which reported this to me in person in Bozeman, MT. I personally observed, while investigating in White Fish near Kalispell in the Glacier area, frequent trains arriving with the Chinese 40 foot cargo containers on board, double stacked, all pulled by BURLINGTON NORTHERN/SANTAFE. While I realized that many could be legitimately filled with consumer goods, I also knew that others could be the deadly prisoner boxcar cargocontainers. It was impossible to tell one from the other. People who know this dark truth reported to me with alarm that many of these 40 foot cargo containers have been seen building up at Long Beach Naval Shipyards, which has been turned over to the Chinese. Knowing the role that Chinese troops will play against American resisters of the NWO/UN takeover (through the Trilateral Alliance Treaty secret agreement with China to deploy their troops against Americans offering resistance under martial law,) they are suspicious as to their nature. -TRUCKERS ENCOUNTER MODERN GUILLOTINES- Truckers also know some deadly secrets of the New World Order agenda for America. In the course of traveling thousands of miles across America to research this subject, I have interviewed many truckers and their contacts.They have admitted to me personally that they or their trucker buddies have delivered shipments of the MODERN GUILLOTINES, manufactured in China and Japan, and unloaded on the loading docks of San Diego and other west coast ports of entry. Guillotine shipments have been going on in earnest for many years now, and eyewitness sightings have increased. Military sources have admitted helping unload such deadly cargoes at military facilities, to be stored in warehouse for the hour of NWO/UN takeover. Incredulous over the early reports I received of guillotines in America, I discussed this subject with Patriot investigator Ed Pack, and former CIA NWO planner Elaine. Both admitted that the guillotines were a reality. Elaine commented, \"I have been to the manufacturing plant in Japan where they are made. And I have stood on the loading docks of San Diego as they were unloaded to be distributed across America. At THAT time I rejoiced, because I knew what they would be used for: the termination of Christians who stood in the way of our New World Order!\" Such sentiments were echoed to me by former high level Illuminati/Satanist DOC MARQUIS, now of CHRISTIANS EXPOSING THE OCCULT. Doc told me that when he was personally flown out to the FEMA gassing/crematory detention camp in the Mojave (it has a landing strip) he rejoiced as he was shown around ths deadly compound. \"My sentiments? I rejoiced over the thought that Christians would be terminated in this place.\" (\"Christians\" in reference to being \"resisters of the New World Order...THEIR Illuminati NWO! Doc is now a Christian and is exposing the deadly secrets of the NWO.) -FURTHER EYE WITNESSES TO THE NWO/NOAHIDE LAWS GUILLOTINES- Personal friends (Russian Christians that I network with across America)I have interviewed in Washington State have seen the guillotines in the back of one truck. Two state troopers pulled over a truck on the highway these eyewitnesses were traveling on. They were detained by this. They watched as the trucker led the troopers to the back of the truck and broke the seal and opened the doors to disclose the contents. \"We were shocked to see that the truck was filled from front to back with nothing but guillotines!\" Satisfied, the troopers then left. These Russian Christians in the car behind the truck came out to talk with the trucker. He was terrified about what his truck contained: it was a sealed shipment. He had not been informed of his deadly cargo! The eyewitnesses recounted, \"He was so shocked he turned in his truck and his papers and refused to even deliver his shipment and simply walked away...\" (These eyewitnesses are solid Christians living in Spokane, WA.) For Christians who would raise eyebrows at this, I will simply refer them to the Bible as evidence: \"Rev. 20:4-\"And I saw the souls of them who were beheaded for the witness ofJesus and for the word of God...\" While it is true that many, including the Apostle Paul, have been beheaded for the witness of Jesus, if you read it CAREFULLY you will see that this Scripture passage is SPECIFICALLY referring to this present time frame of the Kingdom of Satan on earth (the Kingdom of the Beast or AntiChrist) and the period when the cashless society will be manifested with the mark (Digital Angel?) in one's hand or forehead and it's blasphemous world religious system of Revelation 13. This is the end-time hour in which we live, my fellow Americans and concerned Christians. And in order to have mass beheading terminations of so many Christian resisters of the NWO, you must have the tools with which to do it. Bible prophecy, even that of negative implications for Christians, will be fulfilled regardless of whether we like it or not. And the guillotines ARE HERE! You can expect to see these modern guillotines in the near future throughout America. But if you read the rest of the verse carefully, you will see that there is no need to fear: those beheaded for their witness of Jesus will also be resurrected to reign with Jesus Christ at His return! The end for those who trust Him and refuse to deny Him is TOTAL VICTORY! Because I believe in Bible Scriptures, I have no fear as I investigate and expose such things. I face the same persecution as all my fellow Christians in North America. Will I be called upon to give my life for my testimony of Jesus and what I report upon??? Will YOU? Undoubtedly. But I have chosen to believe the Word of God, and to reject fear.\"In God have I put my trust. I will not fear what man can do to me, for thisI know, that God is for me.\" In spite of all I report on regarding concentration camps, boxcars and shackles and coming NWO takeover in America, I have perfect peace in my heart. AND YOU CAN TOO! OUR God of salvation through Jesus Christ IS greater than the Lucifer directing their New World Order. And regardless of what God may permit to happen in our lives, we can have the satisfaction of knowing as born again Christians that we are sealed for eternity as God's children and that our names are written in the Lamb's book of Life. Life is a series of choices. We therefore must CHOOSE to confess Jesus Christ before men and to seek God for the grace to remain faithful unto death throughout the coming times of testing. For the true Born-again believer in Jesus Christ, death holds no fears. Will you choose to obey the Word of God, and to confess Jesus Christ beforemen boldly, trusting Him to bring you through the coming times of testings??? It makes no difference if such a confession costs even your home...your job...your car and more. There is NOTHING MORE IMPORTANT than your eternal soul! \"For what shall it profit a man, if he gain the WHOLE WORLD and lose his soul?\" declared Jesus Christ. If you, as a Christian, are moved to deny Jesus Christ before men for any reason (even to save your own life) YOU WILL PERISH! We Christians are living in a hour in which we must realize that it is impossible for us to preserve our lives at the cost of our eternal souls...we can only seek God for the grace to lay our lives down completely and faithfully for Jesus Christ and the Gospel. End-time persecution is surely coming, and all our protesting and denial cannot stop it. For those of you great American Patriots,it is time for mature Christianity, and it is time to EMBRACE THE CROSS. Reporting from across the nation, Pamela Schuffert (American Holocaust Coming Blogspot)", 
        "threadID": "4960045241001_1810070812001", 
        "time": "2009-03-16 22:54:00", 
        "title": "UN/FEMA Prisoner Boxcars with Shackles CONFIRMED", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "4960045241001_1810070812001", 
        "time": "2009-03-17 07:39:00", 
        "title": "UN/FEMA Prisoner Boxcars with Shackles CONFIRMED", 
        "userID": "JBL266"
    }
]