[
    {
        "content": "AN AMERICAN HOLOCAUST IS COMING and the CAMPS ARE REAL The information you are about to readr is highly controversial and profoundly disturbing to many Americans. However, my years of research coupled with thousands of miles of personal worldwide travel to investigate the following information about the NEW WORLD ORDER under martial law and the FEMA deathcamps and to document it in many cases has validated what you are about to read. Every American ought to be disturbed and awakened by the implications of such information being factual. And every American ought to be moved to great concern and subsequent appropriate actions to counter the threats that we now face to our sovereignty and Constitutionally guaranteed religious and national liberties and cherished Patriot heritage. I was born at the headquarters of the United States Air Force, (Bolling AFB) in Washington, DC. I was raised in the greater Washington metropolitan area for most of my life, living less than a hour from the White House, Capitol Hill, the Pentagon, CIA and FBI headquarters. Historic Mount Vernon, restored estate of our nation’s first President, was only a mile and a half from our home along the Potomac River. My famous USAF father, \"Jake\" Schuffert worked at both Bolling AFB and the Pentagon. (He died in 1998.) Even today, posthumously, he is referred to as the United States Air Force \"icon cartoonist\" whose military cartoons have filled USAF and US Army publications for many years. His cartoons continued to be published monthly, posthumously, for several years after he died in the widely read AIRMAN magazine, known and read by virtually every USAF person worldwide. My mother at various times worked as a secretary for a Congressman on Capitol Hill (Congressman McClory of IL), and for the US Army/Department of Defense for many years. The neighborhood that I grew up in was filled with high level military brass, the intelligence community (FBI, CIA, NSA, DIA, etc.), and the politically important…in essence, the \"rich, the elite and the powerful\" (as they love to refer to themselves as.) I am sharing this to establish my personal background in the reader’s mind so that you may understand that I know what I am talking about in the reports to follow. -INFORMATION SOURCES- Many of my information sources are in fact former and/or present intelligence community operatives (CIA, etc.)who have become deeply disturbed about what they know from the inside and are moved to sound the alarm by going public…even at the risk of their own personal lives. Others are credible military sources, both active and retired, who are equally disturbed over such information and it’s implications and are also going public. I have traveled thousands of miles, both across CONUS (the continental United States, ) Canada, Alaska, and overseas to Germany and Europe, London, Israel, Hawaii, Costa Rica and elsewhere to interview contacts and information sources from many different backgrounds, all of whom are confirming the reality of THE COMING AMERICAN HOLOCAUST. I have also lectured worldwide on this subject as well. My previous radio broadcast, DEFENDERS OF LIBERTY (WWCR RADIO), have presented this information to millions nationwide and worldwide. And radio listeners have frequently called in during my broadcasts to confirm such preparations taking place in their region across America for MARTIAL LAW and the coming Holocaust. I have uncovered information that often defies belief…from the manufacture and importing of modern guillotines into America since the 1970’s and distributed to military bases nationwide for the beheading of NWO resisters under NOAHIDE LAWS PROVISIONS …to UN/FEMA prisoner boxcars with shackles made to order by the thousands under secret contract with the US government…to modern-day FEMA/Homeland Security concentration camps equipped with various means of termination ranging from gassing/crematory facilities to ultra-modern microwaving facilities that will both terminate and dispose of victims’ remains in one action…to UN/NATO foreign troops already trained and prepositioned across this nation for the hour of NWO conquest under coming martial law, who are openly boasting, (as in the case of German Bundeswehr/Luftwaffe stationed at Holloman AFB and throughout the USA): \"We Germans won’t have a problem firing upon you Americans under martial law!\" Tragically, America’s leadership from the WHITE HOUSE DOWN has sold out at the highest levels to this ominous NWO/UN based agenda. Many of our own military bases have quietly been used to train the foreign troops that will be used to assist the NWO elements of our government/military in oppressing and arresting fellow Americans who will continue to stand up for our sovereignty, our Constitution and religious freedoms as they become threatened under coming events, beginning with \"9/11\" and culminating with martial law. The twin tragedies of September 11th, 2001, served only to further move America, not by consent but by brute force, into the direction of the New World Order…even as Tom Brokaw boldly declared on NBC nightly news on October 11th, 2001. What does the \"New World Order\" mean, in fact, for Patriotic Americans and Christians? It heralds the coming regime of tyrannical oppression of religious freedom of expression. It signals the end of national sovereignty of America (and every other nation ultimately,) and to be brought under the ruling force of the coming world government under the United Nations/NATO and the multinational military forces who will enforce the New World Order. It will consist of a world government, a world religious system and a world banking system. Every person on the face of the earth will be tied into this system with their own personal access number assigned to them, without which no one will be able to buy or sell in the coming cashless society. Here in AMERICA, we are about to enter, in fact, into that which has been long prophesied to the Church in the Book of Revelation, the kingdom of darkness on the earth called the Kingdom of the Beast, or Antichrist. And to this kingdom Satan/the Dragon HAS ALREADY GIVEN his throne, power and great authority. Those in authority over this world system will be in fact the world’s Illuminati/Luciferians, or Satanists. And it will be demonically powered by Satan himself. And Satan will demand and receive the worship of himself in place of the true God throughout the earth…and his followers will have the power to make war with the people of God and put them to death for non-compliance and faithfulness unto Jesus Christ. (Revelation 13) In the course of interviewing some of America’s former high level Satanists who had great power in the past, they have confirmed to me with one breath the reality of their Illuminati/Satanist/Luciferian-based New World Order and it’s globalist agenda. They also confirmed the plans for mass round-up, persecution and termination of ALL resisters of their NWO, with Bible-believing Christians placed highest on their list for arrest and termination. Former Satanists from inside the CIA have confirmed to me personally that the concentration camps I have investigated and documented were indeed designed with the termination of \"resisters of the NWO\" in mind in America. Also that Christians were considered their number one enemy and hindrance that stands in the way of their establishing their agenda throughout America. -USAF SATANISM AND THE NEW WORLD ORDER- I should know of the reality of this. What I did not previously reveal in this post regarding my father, Jake Schuffert, was that he tragically was recruited into the NWO agenda while working at Bolling AFB and the Pentagon, and also into the admitted religion of the NWO, Satanism/Luciferianism/Illuminism. People in the US military are constantly being quietly approached with the program to bring America under world globalist control, and are often threatened with failure of promotion, etc., if they will not consent to go along with this program. Many I have interviewed in the military have confirmed this to me. Many have sold out our nation for the promise of \"promotion, payraise and self-protection\" IF they will fully cooperate with the NWO agenda for our nation. This dark NWO agenda recruitment goes on even in the White House…even on Capitol Hill…the intelligence community…and even in the Pentagon and throughout every branch of our military. Throughout our nation, multitudes have quietly sold out this nation to the oppressive and freedom-destroying agenda of the New World Order. And America’s Illuminati/Satanists, which I have interviewed nationwide, have confirmed with one voice that the New World Order IS Satan’s agenda for the world and this nation, and that they, the Satanists, are the backbone of this coming regime. And as such, the Christians as all other resisters MUST GO! The Bible itself confirms \"the nature of the Beast.\" (Revelation 13.) Tragically, my father sold out his family and his nation to this Satanist agenda in the 1970’s. And the warm, loving father I had known throughout childhood was slowly transformed by Illuminati/NWO doctrines into a tyrant in our home, well concealed from the public eye by the veneer of \"the jolly USAF cartoonist\"…a public role he played well. But in our troubled home, we knew the truth. And I lived in terror of my father for many years. My once-loving Daddy was slowly transformed into a hard-core Satanist who upheld the New World Order’s anti-Christian agenda. He would come home from the Pentagon breathing out the NWO-inspired hatred for Christians (my mother and I were both strong Christians.) He knew of the concentration camps established by the military for the detention/termination of NWO resisters under martial law, for he would make statements like: \"Everyone who believes in God and miracles should be sent to concentration camps!\" Little did I realize then that, in fact, many modern concentration camps now exist through North America for the hour of the great persecution of the Church under the coming New World Order agenda. I was in fact forced to combat the New World Order and it’s Satanist religion from early youth in my very own home! (Through much painstaking Christian witness and prayer and longsuffering, my father finally repented and become a genuine Christian 6 months prior to his death. He was buried with honors at Arlington National Cemetery in Washington, DC, following a service in the Chapel which glorified Jesus Christ and shared his salvation experience.) So, in fact, I do have solid background and basis to CONFIRM THE FEMA DEATHCAMPS TO TERMINATE AMERIANS UNDER MARTIAL LAW are real. -Sincerely, Pamela Schuffert (American Holocaust Coming blogspot)", 
        "intTime": 20090316, 
        "postID": 7, 
        "quote": "", 
        "reply": "AN AMERICAN HOLOCAUST IS COMING and the CAMPS ARE REAL The information you are about to readr is highly controversial and profoundly disturbing to many Americans. However, my years of research coupled with thousands of miles of personal worldwide travel to investigate the following information about the NEW WORLD ORDER under martial law and the FEMA deathcamps and to document it in many cases has validated what you are about to read. Every American ought to be disturbed and awakened by the implications of such information being factual. And every American ought to be moved to great concern and subsequent appropriate actions to counter the threats that we now face to our sovereignty and Constitutionally guaranteed religious and national liberties and cherished Patriot heritage. I was born at the headquarters of the United States Air Force, (Bolling AFB) in Washington, DC. I was raised in the greater Washington metropolitan area for most of my life, living less than a hour from the White House, Capitol Hill, the Pentagon, CIA and FBI headquarters. Historic Mount Vernon, restored estate of our nation’s first President, was only a mile and a half from our home along the Potomac River. My famous USAF father, \"Jake\" Schuffert worked at both Bolling AFB and the Pentagon. (He died in 1998.) Even today, posthumously, he is referred to as the United States Air Force \"icon cartoonist\" whose military cartoons have filled USAF and US Army publications for many years. His cartoons continued to be published monthly, posthumously, for several years after he died in the widely read AIRMAN magazine, known and read by virtually every USAF person worldwide. My mother at various times worked as a secretary for a Congressman on Capitol Hill (Congressman McClory of IL), and for the US Army/Department of Defense for many years. The neighborhood that I grew up in was filled with high level military brass, the intelligence community (FBI, CIA, NSA, DIA, etc.), and the politically important…in essence, the \"rich, the elite and the powerful\" (as they love to refer to themselves as.) I am sharing this to establish my personal background in the reader’s mind so that you may understand that I know what I am talking about in the reports to follow. -INFORMATION SOURCES- Many of my information sources are in fact former and/or present intelligence community operatives (CIA, etc.)who have become deeply disturbed about what they know from the inside and are moved to sound the alarm by going public…even at the risk of their own personal lives. Others are credible military sources, both active and retired, who are equally disturbed over such information and it’s implications and are also going public. I have traveled thousands of miles, both across CONUS (the continental United States, ) Canada, Alaska, and overseas to Germany and Europe, London, Israel, Hawaii, Costa Rica and elsewhere to interview contacts and information sources from many different backgrounds, all of whom are confirming the reality of THE COMING AMERICAN HOLOCAUST. I have also lectured worldwide on this subject as well. My previous radio broadcast, DEFENDERS OF LIBERTY (WWCR RADIO), have presented this information to millions nationwide and worldwide. And radio listeners have frequently called in during my broadcasts to confirm such preparations taking place in their region across America for MARTIAL LAW and the coming Holocaust. I have uncovered information that often defies belief…from the manufacture and importing of modern guillotines into America since the 1970’s and distributed to military bases nationwide for the beheading of NWO resisters under NOAHIDE LAWS PROVISIONS …to UN/FEMA prisoner boxcars with shackles made to order by the thousands under secret contract with the US government…to modern-day FEMA/Homeland Security concentration camps equipped with various means of termination ranging from gassing/crematory facilities to ultra-modern microwaving facilities that will both terminate and dispose of victims’ remains in one action…to UN/NATO foreign troops already trained and prepositioned across this nation for the hour of NWO conquest under coming martial law, who are openly boasting, (as in the case of German Bundeswehr/Luftwaffe stationed at Holloman AFB and throughout the USA): \"We Germans won’t have a problem firing upon you Americans under martial law!\" Tragically, America’s leadership from the WHITE HOUSE DOWN has sold out at the highest levels to this ominous NWO/UN based agenda. Many of our own military bases have quietly been used to train the foreign troops that will be used to assist the NWO elements of our government/military in oppressing and arresting fellow Americans who will continue to stand up for our sovereignty, our Constitution and religious freedoms as they become threatened under coming events, beginning with \"9/11\" and culminating with martial law. The twin tragedies of September 11th, 2001, served only to further move America, not by consent but by brute force, into the direction of the New World Order…even as Tom Brokaw boldly declared on NBC nightly news on October 11th, 2001. What does the \"New World Order\" mean, in fact, for Patriotic Americans and Christians? It heralds the coming regime of tyrannical oppression of religious freedom of expression. It signals the end of national sovereignty of America (and every other nation ultimately,) and to be brought under the ruling force of the coming world government under the United Nations/NATO and the multinational military forces who will enforce the New World Order. It will consist of a world government, a world religious system and a world banking system. Every person on the face of the earth will be tied into this system with their own personal access number assigned to them, without which no one will be able to buy or sell in the coming cashless society. Here in AMERICA, we are about to enter, in fact, into that which has been long prophesied to the Church in the Book of Revelation, the kingdom of darkness on the earth called the Kingdom of the Beast, or Antichrist. And to this kingdom Satan/the Dragon HAS ALREADY GIVEN his throne, power and great authority. Those in authority over this world system will be in fact the world’s Illuminati/Luciferians, or Satanists. And it will be demonically powered by Satan himself. And Satan will demand and receive the worship of himself in place of the true God throughout the earth…and his followers will have the power to make war with the people of God and put them to death for non-compliance and faithfulness unto Jesus Christ. (Revelation 13) In the course of interviewing some of America’s former high level Satanists who had great power in the past, they have confirmed to me with one breath the reality of their Illuminati/Satanist/Luciferian-based New World Order and it’s globalist agenda. They also confirmed the plans for mass round-up, persecution and termination of ALL resisters of their NWO, with Bible-believing Christians placed highest on their list for arrest and termination. Former Satanists from inside the CIA have confirmed to me personally that the concentration camps I have investigated and documented were indeed designed with the termination of \"resisters of the NWO\" in mind in America. Also that Christians were considered their number one enemy and hindrance that stands in the way of their establishing their agenda throughout America. -USAF SATANISM AND THE NEW WORLD ORDER- I should know of the reality of this. What I did not previously reveal in this post regarding my father, Jake Schuffert, was that he tragically was recruited into the NWO agenda while working at Bolling AFB and the Pentagon, and also into the admitted religion of the NWO, Satanism/Luciferianism/Illuminism. People in the US military are constantly being quietly approached with the program to bring America under world globalist control, and are often threatened with failure of promotion, etc., if they will not consent to go along with this program. Many I have interviewed in the military have confirmed this to me. Many have sold out our nation for the promise of \"promotion, payraise and self-protection\" IF they will fully cooperate with the NWO agenda for our nation. This dark NWO agenda recruitment goes on even in the White House…even on Capitol Hill…the intelligence community…and even in the Pentagon and throughout every branch of our military. Throughout our nation, multitudes have quietly sold out this nation to the oppressive and freedom-destroying agenda of the New World Order. And America’s Illuminati/Satanists, which I have interviewed nationwide, have confirmed with one voice that the New World Order IS Satan’s agenda for the world and this nation, and that they, the Satanists, are the backbone of this coming regime. And as such, the Christians as all other resisters MUST GO! The Bible itself confirms \"the nature of the Beast.\" (Revelation 13.) Tragically, my father sold out his family and his nation to this Satanist agenda in the 1970’s. And the warm, loving father I had known throughout childhood was slowly transformed by Illuminati/NWO doctrines into a tyrant in our home, well concealed from the public eye by the veneer of \"the jolly USAF cartoonist\"…a public role he played well. But in our troubled home, we knew the truth. And I lived in terror of my father for many years. My once-loving Daddy was slowly transformed into a hard-core Satanist who upheld the New World Order’s anti-Christian agenda. He would come home from the Pentagon breathing out the NWO-inspired hatred for Christians (my mother and I were both strong Christians.) He knew of the concentration camps established by the military for the detention/termination of NWO resisters under martial law, for he would make statements like: \"Everyone who believes in God and miracles should be sent to concentration camps!\" Little did I realize then that, in fact, many modern concentration camps now exist through North America for the hour of the great persecution of the Church under the coming New World Order agenda. I was in fact forced to combat the New World Order and it’s Satanist religion from early youth in my very own home! (Through much painstaking Christian witness and prayer and longsuffering, my father finally repented and become a genuine Christian 6 months prior to his death. He was buried with honors at Arlington National Cemetery in Washington, DC, following a service in the Chapel which glorified Jesus Christ and shared his salvation experience.) So, in fact, I do have solid background and basis to CONFIRM THE FEMA DEATHCAMPS TO TERMINATE AMERIANS UNDER MARTIAL LAW are real. -Sincerely, Pamela Schuffert (American Holocaust Coming blogspot)", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-16 22:25:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "", 
        "reply": "I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 11:23:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights? LOL!", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "reply": " LOL!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 11:48:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights? Just bring that Avatar Picture you have as an ID and you should have NO trouble", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "reply": " Just bring that Avatar Picture you have as an ID and you should have NO trouble", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 17:14:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "government seduction and control seems to be upon us and the final preps are going in to place. They are fixin to gather the sheeple to their final pastures..What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "intTime": 20090325, 
        "postID": 11, 
        "quote": "", 
        "reply": "government seduction and control seems to be upon us and the final preps are going in to place. They are fixin to gather the sheeple to their final pastures..What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 17:15:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens? you already asked this and people answered you. If you feel those answers were wrong then explain why.", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "reply": " you already asked this and people answered you. If you feel those answers were wrong then explain why.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 23:56:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "intTime": 20090326, 
        "postID": 13, 
        "quote": "", 
        "reply": "The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 12:37:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "intTime": 20090326, 
        "postID": 14, 
        "quote": "public pre-K with breakfast, is all looking like Nazi-Germany", 
        "reply": " BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 21:29:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "yea they are to house the illegals in till they can be processed and sent back to whereever...", 
        "intTime": 20090326, 
        "postID": 15, 
        "quote": "", 
        "reply": "yea they are to house the illegals in till they can be processed and sent back to whereever...", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 23:14:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich. You'd be surprised just how already it's been approved with funding: \"http://www.rightsidenews.com/200903264165/homeland_security/training_of_new_civilian_security_force_passed_billions_allocated.html", 
        "intTime": 20090327, 
        "postID": 16, 
        "quote": "Originally posted by StaffSgtGraham: The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "reply": " You'd be surprised just how already it's been approved with funding: \"http://www.rightsidenews.com/200903264165/homeland_security/training_of_new_civilian_security_force_passed_billions_allocated.html", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 10:57:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts! But I like brats and sourkraut Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090327, 
        "postID": 17, 
        "quote": "Originally posted by karlhungusjr: quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "reply": " But I like brats and sourkraut Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 20:08:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "DSTremf"
    }, 
    {
        "content": "The NEA starts brainwashing the children as soon as they can get them(once potty-trained). Kindergarten, a German word, was started in Germany.", 
        "intTime": 20090327, 
        "postID": 18, 
        "quote": "", 
        "reply": "The NEA starts brainwashing the children as soon as they can get them(once potty-trained). Kindergarten, a German word, was started in Germany.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 20:33:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Kindergarten, a German word, was started in Germany. Obvious troll is obvious.", 
        "intTime": 20090328, 
        "postID": 19, 
        "quote": "Kindergarten, a German word, was started in Germany.", 
        "reply": " Obvious troll is obvious.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-28 22:38:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Tricky Dick Nixon in the early 1970s actually did propose 'concentration' camps into which he would herd war protesters and others he didn't like. His Cabinet talked him out of it before the public really got wind of it. Such camps were constructed and used during WW-I and were populated mostly by union activists and others under the sedition act. And then, of course, the Japanese in WW-II. It's not unheard of in the US that the government would build special treatment facilities to fit the needs of a special category of people for some reason but the FEMA camps don't appear to fit that mode. The other 'camp' attempts were basically secret. This doesn't appear to be. But one never knows, politics is a fickle thing.", 
        "intTime": 20090329, 
        "postID": 20, 
        "quote": "", 
        "reply": "Tricky Dick Nixon in the early 1970s actually did propose 'concentration' camps into which he would herd war protesters and others he didn't like. His Cabinet talked him out of it before the public really got wind of it. Such camps were constructed and used during WW-I and were populated mostly by union activists and others under the sedition act. And then, of course, the Japanese in WW-II. It's not unheard of in the US that the government would build special treatment facilities to fit the needs of a special category of people for some reason but the FEMA camps don't appear to fit that mode. The other 'camp' attempts were basically secret. This doesn't appear to be. But one never knows, politics is a fickle thing.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-29 10:16:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "intTime": 20090330, 
        "postID": 21, 
        "quote": "", 
        "reply": "These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 11:36:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter. Thats a load of crap. Nixon was the worst president we ever had. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090330, 
        "postID": 22, 
        "quote": "Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "reply": " Thats a load of crap. Nixon was the worst president we ever had. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 19:20:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter. Well, do you like to go to camp? Sounds to me like you are recruiting yourself! My mother was a NEA member for many years. But hardly a socialist and she was very patriotic, one of the first women of 270 some women to join the Woman's Auxiliary Army Air Corps in 1942. (And they didn't get recognized as a veteran until 1990s!) So, when did the NEA become socialist? When BHO became President? Maybe they'll let you have a bonfire and sing songs when you go to comrade Obama's camp? So, will these camps be Rapture proof, too?", 
        "intTime": 20090330, 
        "postID": 23, 
        "quote": "Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "reply": " Well, do you like to go to camp? Sounds to me like you are recruiting yourself! My mother was a NEA member for many years. But hardly a socialist and she was very patriotic, one of the first women of 270 some women to join the Woman's Auxiliary Army Air Corps in 1942. (And they didn't get recognized as a veteran until 1990s!) So, when did the NEA become socialist? When BHO became President? Maybe they'll let you have a bonfire and sing songs when you go to comrade Obama's camp? So, will these camps be Rapture proof, too?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 20:56:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "intTime": 20090331, 
        "postID": 24, 
        "quote": "", 
        "reply": "Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 11:35:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "Just because somebody is a NEA member doesn't mean they are a socialist. Public School(gov't) teachers in most states are REQUIRED to join the NEA. It is a closed-shop. I once had to join UAW to keep my job. They took my dues every month and sent some to Jesse Jackson & Dukakis against my wishes. I had no control over UAW's agenda just like most teachers are only concerned about their pay & benefits. Sadly the public schools are now institutions where the gov't brainwashes our children against parents and God. We are forced to pay for it. Public schools were originally meant for the indigent and not the runaway train they are now. We homeschooled our kids for few years and know the schoolday and schoolyear could both be shortened immensely.", 
        "intTime": 20090331, 
        "postID": 25, 
        "quote": "", 
        "reply": "Just because somebody is a NEA member doesn't mean they are a socialist. Public School(gov't) teachers in most states are REQUIRED to join the NEA. It is a closed-shop. I once had to join UAW to keep my job. They took my dues every month and sent some to Jesse Jackson & Dukakis against my wishes. I had no control over UAW's agenda just like most teachers are only concerned about their pay & benefits. Sadly the public schools are now institutions where the gov't brainwashes our children against parents and God. We are forced to pay for it. Public schools were originally meant for the indigent and not the runaway train they are now. We homeschooled our kids for few years and know the schoolday and schoolyear could both be shortened immensely.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 12:02:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be. If he's not the president, then who is? Under our Constitution, we are never without one.", 
        "intTime": 20090331, 
        "postID": 26, 
        "quote": "Originally posted by StaffSgtGraham: Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "reply": " If he's not the president, then who is? Under our Constitution, we are never without one.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:26:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "BillingsJT"
    }, 
    {
        "content": "He may be the ACTING president but he is holding office illegally and anything he signs or enacts should be rescinded. A civil war has already started in our country because of this. We are in the midst of a constitutional-crisis thanks to this Kenyan/Indonesian imposter. Barack H. Obama(if that is his name?) duped a lot of voters. This is still one of the best countries in the world so there is no better place to go. How can we just accept a fraudulent president? Why do so few people care?", 
        "intTime": 20090331, 
        "postID": 27, 
        "quote": "", 
        "reply": "He may be the ACTING president but he is holding office illegally and anything he signs or enacts should be rescinded. A civil war has already started in our country because of this. We are in the midst of a constitutional-crisis thanks to this Kenyan/Indonesian imposter. Barack H. Obama(if that is his name?) duped a lot of voters. This is still one of the best countries in the world so there is no better place to go. How can we just accept a fraudulent president? Why do so few people care?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:37:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "He can't be the acting president, since he has never been elected vice president. I think you need to read your Constitution again. He has been duly elected. Those who could challenge his qualifications did not do so. Case closed.", 
        "intTime": 20090331, 
        "postID": 28, 
        "quote": "", 
        "reply": "He can't be the acting president, since he has never been elected vice president. I think you need to read your Constitution again. He has been duly elected. Those who could challenge his qualifications did not do so. Case closed.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:49:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "BillingsJT"
    }, 
    {
        "content": "Well, this is the conspiracy thread and I would suppose there are those that would believe the American voters conspired to put a man in office who was not 'qualified' according to the Constitution. So, with BHO's high approval rating from the American public I guess the majority of us prefer to keep the 'conspiracy' going... it appears to be working well. Maybe we voters didn't think anyone with the proper credentials could do the job very well? Better get back to listening to Rush, he knows what's going on!", 
        "intTime": 20090401, 
        "postID": 29, 
        "quote": "", 
        "reply": "Well, this is the conspiracy thread and I would suppose there are those that would believe the American voters conspired to put a man in office who was not 'qualified' according to the Constitution. So, with BHO's high approval rating from the American public I guess the majority of us prefer to keep the 'conspiracy' going... it appears to be working well. Maybe we voters didn't think anyone with the proper credentials could do the job very well? Better get back to listening to Rush, he knows what's going on!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-04-01 11:38:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "This case will not be closed until the truth comes out. Obama might get a full term AS president but he is still a USURPER. I just hope I live long enough to say \"I told you so.\" The way you people made a big deal about Quayle and Bush2 being in the National Guard I am surprised you would not be up in arms about this fraud.", 
        "intTime": 20090401, 
        "postID": 30, 
        "quote": "", 
        "reply": "This case will not be closed until the truth comes out. Obama might get a full term AS president but he is still a USURPER. I just hope I live long enough to say \"I told you so.\" The way you people made a big deal about Quayle and Bush2 being in the National Guard I am surprised you would not be up in arms about this fraud.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-04-01 11:49:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "AN AMERICAN HOLOCAUST IS COMING and the CAMPS ARE REAL The information you are about to readr is highly controversial and profoundly disturbing to many Americans. However, my years of research coupled with thousands of miles of personal worldwide travel to investigate the following information about the NEW WORLD ORDER under martial law and the FEMA deathcamps and to document it in many cases has validated what you are about to read. Every American ought to be disturbed and awakened by the implications of such information being factual. And every American ought to be moved to great concern and subsequent appropriate actions to counter the threats that we now face to our sovereignty and Constitutionally guaranteed religious and national liberties and cherished Patriot heritage. I was born at the headquarters of the United States Air Force, (Bolling AFB) in Washington, DC. I was raised in the greater Washington metropolitan area for most of my life, living less than a hour from the White House, Capitol Hill, the Pentagon, CIA and FBI headquarters. Historic Mount Vernon, restored estate of our nation’s first President, was only a mile and a half from our home along the Potomac River. My famous USAF father, \"Jake\" Schuffert worked at both Bolling AFB and the Pentagon. (He died in 1998.) Even today, posthumously, he is referred to as the United States Air Force \"icon cartoonist\" whose military cartoons have filled USAF and US Army publications for many years. His cartoons continued to be published monthly, posthumously, for several years after he died in the widely read AIRMAN magazine, known and read by virtually every USAF person worldwide. My mother at various times worked as a secretary for a Congressman on Capitol Hill (Congressman McClory of IL), and for the US Army/Department of Defense for many years. The neighborhood that I grew up in was filled with high level military brass, the intelligence community (FBI, CIA, NSA, DIA, etc.), and the politically important…in essence, the \"rich, the elite and the powerful\" (as they love to refer to themselves as.) I am sharing this to establish my personal background in the reader’s mind so that you may understand that I know what I am talking about in the reports to follow. -INFORMATION SOURCES- Many of my information sources are in fact former and/or present intelligence community operatives (CIA, etc.)who have become deeply disturbed about what they know from the inside and are moved to sound the alarm by going public…even at the risk of their own personal lives. Others are credible military sources, both active and retired, who are equally disturbed over such information and it’s implications and are also going public. I have traveled thousands of miles, both across CONUS (the continental United States, ) Canada, Alaska, and overseas to Germany and Europe, London, Israel, Hawaii, Costa Rica and elsewhere to interview contacts and information sources from many different backgrounds, all of whom are confirming the reality of THE COMING AMERICAN HOLOCAUST. I have also lectured worldwide on this subject as well. My previous radio broadcast, DEFENDERS OF LIBERTY (WWCR RADIO), have presented this information to millions nationwide and worldwide. And radio listeners have frequently called in during my broadcasts to confirm such preparations taking place in their region across America for MARTIAL LAW and the coming Holocaust. I have uncovered information that often defies belief…from the manufacture and importing of modern guillotines into America since the 1970’s and distributed to military bases nationwide for the beheading of NWO resisters under NOAHIDE LAWS PROVISIONS …to UN/FEMA prisoner boxcars with shackles made to order by the thousands under secret contract with the US government…to modern-day FEMA/Homeland Security concentration camps equipped with various means of termination ranging from gassing/crematory facilities to ultra-modern microwaving facilities that will both terminate and dispose of victims’ remains in one action…to UN/NATO foreign troops already trained and prepositioned across this nation for the hour of NWO conquest under coming martial law, who are openly boasting, (as in the case of German Bundeswehr/Luftwaffe stationed at Holloman AFB and throughout the USA): \"We Germans won’t have a problem firing upon you Americans under martial law!\" Tragically, America’s leadership from the WHITE HOUSE DOWN has sold out at the highest levels to this ominous NWO/UN based agenda. Many of our own military bases have quietly been used to train the foreign troops that will be used to assist the NWO elements of our government/military in oppressing and arresting fellow Americans who will continue to stand up for our sovereignty, our Constitution and religious freedoms as they become threatened under coming events, beginning with \"9/11\" and culminating with martial law. The twin tragedies of September 11th, 2001, served only to further move America, not by consent but by brute force, into the direction of the New World Order…even as Tom Brokaw boldly declared on NBC nightly news on October 11th, 2001. What does the \"New World Order\" mean, in fact, for Patriotic Americans and Christians? It heralds the coming regime of tyrannical oppression of religious freedom of expression. It signals the end of national sovereignty of America (and every other nation ultimately,) and to be brought under the ruling force of the coming world government under the United Nations/NATO and the multinational military forces who will enforce the New World Order. It will consist of a world government, a world religious system and a world banking system. Every person on the face of the earth will be tied into this system with their own personal access number assigned to them, without which no one will be able to buy or sell in the coming cashless society. Here in AMERICA, we are about to enter, in fact, into that which has been long prophesied to the Church in the Book of Revelation, the kingdom of darkness on the earth called the Kingdom of the Beast, or Antichrist. And to this kingdom Satan/the Dragon HAS ALREADY GIVEN his throne, power and great authority. Those in authority over this world system will be in fact the world’s Illuminati/Luciferians, or Satanists. And it will be demonically powered by Satan himself. And Satan will demand and receive the worship of himself in place of the true God throughout the earth…and his followers will have the power to make war with the people of God and put them to death for non-compliance and faithfulness unto Jesus Christ. (Revelation 13) In the course of interviewing some of America’s former high level Satanists who had great power in the past, they have confirmed to me with one breath the reality of their Illuminati/Satanist/Luciferian-based New World Order and it’s globalist agenda. They also confirmed the plans for mass round-up, persecution and termination of ALL resisters of their NWO, with Bible-believing Christians placed highest on their list for arrest and termination. Former Satanists from inside the CIA have confirmed to me personally that the concentration camps I have investigated and documented were indeed designed with the termination of \"resisters of the NWO\" in mind in America. Also that Christians were considered their number one enemy and hindrance that stands in the way of their establishing their agenda throughout America. -USAF SATANISM AND THE NEW WORLD ORDER- I should know of the reality of this. What I did not previously reveal in this post regarding my father, Jake Schuffert, was that he tragically was recruited into the NWO agenda while working at Bolling AFB and the Pentagon, and also into the admitted religion of the NWO, Satanism/Luciferianism/Illuminism. People in the US military are constantly being quietly approached with the program to bring America under world globalist control, and are often threatened with failure of promotion, etc., if they will not consent to go along with this program. Many I have interviewed in the military have confirmed this to me. Many have sold out our nation for the promise of \"promotion, payraise and self-protection\" IF they will fully cooperate with the NWO agenda for our nation. This dark NWO agenda recruitment goes on even in the White House…even on Capitol Hill…the intelligence community…and even in the Pentagon and throughout every branch of our military. Throughout our nation, multitudes have quietly sold out this nation to the oppressive and freedom-destroying agenda of the New World Order. And America’s Illuminati/Satanists, which I have interviewed nationwide, have confirmed with one voice that the New World Order IS Satan’s agenda for the world and this nation, and that they, the Satanists, are the backbone of this coming regime. And as such, the Christians as all other resisters MUST GO! The Bible itself confirms \"the nature of the Beast.\" (Revelation 13.) Tragically, my father sold out his family and his nation to this Satanist agenda in the 1970’s. And the warm, loving father I had known throughout childhood was slowly transformed by Illuminati/NWO doctrines into a tyrant in our home, well concealed from the public eye by the veneer of \"the jolly USAF cartoonist\"…a public role he played well. But in our troubled home, we knew the truth. And I lived in terror of my father for many years. My once-loving Daddy was slowly transformed into a hard-core Satanist who upheld the New World Order’s anti-Christian agenda. He would come home from the Pentagon breathing out the NWO-inspired hatred for Christians (my mother and I were both strong Christians.) He knew of the concentration camps established by the military for the detention/termination of NWO resisters under martial law, for he would make statements like: \"Everyone who believes in God and miracles should be sent to concentration camps!\" Little did I realize then that, in fact, many modern concentration camps now exist through North America for the hour of the great persecution of the Church under the coming New World Order agenda. I was in fact forced to combat the New World Order and it’s Satanist religion from early youth in my very own home! (Through much painstaking Christian witness and prayer and longsuffering, my father finally repented and become a genuine Christian 6 months prior to his death. He was buried with honors at Arlington National Cemetery in Washington, DC, following a service in the Chapel which glorified Jesus Christ and shared his salvation experience.) So, in fact, I do have solid background and basis to CONFIRM THE FEMA DEATHCAMPS TO TERMINATE AMERIANS UNDER MARTIAL LAW are real. -Sincerely, Pamela Schuffert (American Holocaust Coming blogspot)", 
        "intTime": 20090316, 
        "postID": 37, 
        "quote": "", 
        "reply": "AN AMERICAN HOLOCAUST IS COMING and the CAMPS ARE REAL The information you are about to readr is highly controversial and profoundly disturbing to many Americans. However, my years of research coupled with thousands of miles of personal worldwide travel to investigate the following information about the NEW WORLD ORDER under martial law and the FEMA deathcamps and to document it in many cases has validated what you are about to read. Every American ought to be disturbed and awakened by the implications of such information being factual. And every American ought to be moved to great concern and subsequent appropriate actions to counter the threats that we now face to our sovereignty and Constitutionally guaranteed religious and national liberties and cherished Patriot heritage. I was born at the headquarters of the United States Air Force, (Bolling AFB) in Washington, DC. I was raised in the greater Washington metropolitan area for most of my life, living less than a hour from the White House, Capitol Hill, the Pentagon, CIA and FBI headquarters. Historic Mount Vernon, restored estate of our nation’s first President, was only a mile and a half from our home along the Potomac River. My famous USAF father, \"Jake\" Schuffert worked at both Bolling AFB and the Pentagon. (He died in 1998.) Even today, posthumously, he is referred to as the United States Air Force \"icon cartoonist\" whose military cartoons have filled USAF and US Army publications for many years. His cartoons continued to be published monthly, posthumously, for several years after he died in the widely read AIRMAN magazine, known and read by virtually every USAF person worldwide. My mother at various times worked as a secretary for a Congressman on Capitol Hill (Congressman McClory of IL), and for the US Army/Department of Defense for many years. The neighborhood that I grew up in was filled with high level military brass, the intelligence community (FBI, CIA, NSA, DIA, etc.), and the politically important…in essence, the \"rich, the elite and the powerful\" (as they love to refer to themselves as.) I am sharing this to establish my personal background in the reader’s mind so that you may understand that I know what I am talking about in the reports to follow. -INFORMATION SOURCES- Many of my information sources are in fact former and/or present intelligence community operatives (CIA, etc.)who have become deeply disturbed about what they know from the inside and are moved to sound the alarm by going public…even at the risk of their own personal lives. Others are credible military sources, both active and retired, who are equally disturbed over such information and it’s implications and are also going public. I have traveled thousands of miles, both across CONUS (the continental United States, ) Canada, Alaska, and overseas to Germany and Europe, London, Israel, Hawaii, Costa Rica and elsewhere to interview contacts and information sources from many different backgrounds, all of whom are confirming the reality of THE COMING AMERICAN HOLOCAUST. I have also lectured worldwide on this subject as well. My previous radio broadcast, DEFENDERS OF LIBERTY (WWCR RADIO), have presented this information to millions nationwide and worldwide. And radio listeners have frequently called in during my broadcasts to confirm such preparations taking place in their region across America for MARTIAL LAW and the coming Holocaust. I have uncovered information that often defies belief…from the manufacture and importing of modern guillotines into America since the 1970’s and distributed to military bases nationwide for the beheading of NWO resisters under NOAHIDE LAWS PROVISIONS …to UN/FEMA prisoner boxcars with shackles made to order by the thousands under secret contract with the US government…to modern-day FEMA/Homeland Security concentration camps equipped with various means of termination ranging from gassing/crematory facilities to ultra-modern microwaving facilities that will both terminate and dispose of victims’ remains in one action…to UN/NATO foreign troops already trained and prepositioned across this nation for the hour of NWO conquest under coming martial law, who are openly boasting, (as in the case of German Bundeswehr/Luftwaffe stationed at Holloman AFB and throughout the USA): \"We Germans won’t have a problem firing upon you Americans under martial law!\" Tragically, America’s leadership from the WHITE HOUSE DOWN has sold out at the highest levels to this ominous NWO/UN based agenda. Many of our own military bases have quietly been used to train the foreign troops that will be used to assist the NWO elements of our government/military in oppressing and arresting fellow Americans who will continue to stand up for our sovereignty, our Constitution and religious freedoms as they become threatened under coming events, beginning with \"9/11\" and culminating with martial law. The twin tragedies of September 11th, 2001, served only to further move America, not by consent but by brute force, into the direction of the New World Order…even as Tom Brokaw boldly declared on NBC nightly news on October 11th, 2001. What does the \"New World Order\" mean, in fact, for Patriotic Americans and Christians? It heralds the coming regime of tyrannical oppression of religious freedom of expression. It signals the end of national sovereignty of America (and every other nation ultimately,) and to be brought under the ruling force of the coming world government under the United Nations/NATO and the multinational military forces who will enforce the New World Order. It will consist of a world government, a world religious system and a world banking system. Every person on the face of the earth will be tied into this system with their own personal access number assigned to them, without which no one will be able to buy or sell in the coming cashless society. Here in AMERICA, we are about to enter, in fact, into that which has been long prophesied to the Church in the Book of Revelation, the kingdom of darkness on the earth called the Kingdom of the Beast, or Antichrist. And to this kingdom Satan/the Dragon HAS ALREADY GIVEN his throne, power and great authority. Those in authority over this world system will be in fact the world’s Illuminati/Luciferians, or Satanists. And it will be demonically powered by Satan himself. And Satan will demand and receive the worship of himself in place of the true God throughout the earth…and his followers will have the power to make war with the people of God and put them to death for non-compliance and faithfulness unto Jesus Christ. (Revelation 13) In the course of interviewing some of America’s former high level Satanists who had great power in the past, they have confirmed to me with one breath the reality of their Illuminati/Satanist/Luciferian-based New World Order and it’s globalist agenda. They also confirmed the plans for mass round-up, persecution and termination of ALL resisters of their NWO, with Bible-believing Christians placed highest on their list for arrest and termination. Former Satanists from inside the CIA have confirmed to me personally that the concentration camps I have investigated and documented were indeed designed with the termination of \"resisters of the NWO\" in mind in America. Also that Christians were considered their number one enemy and hindrance that stands in the way of their establishing their agenda throughout America. -USAF SATANISM AND THE NEW WORLD ORDER- I should know of the reality of this. What I did not previously reveal in this post regarding my father, Jake Schuffert, was that he tragically was recruited into the NWO agenda while working at Bolling AFB and the Pentagon, and also into the admitted religion of the NWO, Satanism/Luciferianism/Illuminism. People in the US military are constantly being quietly approached with the program to bring America under world globalist control, and are often threatened with failure of promotion, etc., if they will not consent to go along with this program. Many I have interviewed in the military have confirmed this to me. Many have sold out our nation for the promise of \"promotion, payraise and self-protection\" IF they will fully cooperate with the NWO agenda for our nation. This dark NWO agenda recruitment goes on even in the White House…even on Capitol Hill…the intelligence community…and even in the Pentagon and throughout every branch of our military. Throughout our nation, multitudes have quietly sold out this nation to the oppressive and freedom-destroying agenda of the New World Order. And America’s Illuminati/Satanists, which I have interviewed nationwide, have confirmed with one voice that the New World Order IS Satan’s agenda for the world and this nation, and that they, the Satanists, are the backbone of this coming regime. And as such, the Christians as all other resisters MUST GO! The Bible itself confirms \"the nature of the Beast.\" (Revelation 13.) Tragically, my father sold out his family and his nation to this Satanist agenda in the 1970’s. And the warm, loving father I had known throughout childhood was slowly transformed by Illuminati/NWO doctrines into a tyrant in our home, well concealed from the public eye by the veneer of \"the jolly USAF cartoonist\"…a public role he played well. But in our troubled home, we knew the truth. And I lived in terror of my father for many years. My once-loving Daddy was slowly transformed into a hard-core Satanist who upheld the New World Order’s anti-Christian agenda. He would come home from the Pentagon breathing out the NWO-inspired hatred for Christians (my mother and I were both strong Christians.) He knew of the concentration camps established by the military for the detention/termination of NWO resisters under martial law, for he would make statements like: \"Everyone who believes in God and miracles should be sent to concentration camps!\" Little did I realize then that, in fact, many modern concentration camps now exist through North America for the hour of the great persecution of the Church under the coming New World Order agenda. I was in fact forced to combat the New World Order and it’s Satanist religion from early youth in my very own home! (Through much painstaking Christian witness and prayer and longsuffering, my father finally repented and become a genuine Christian 6 months prior to his death. He was buried with honors at Arlington National Cemetery in Washington, DC, following a service in the Chapel which glorified Jesus Christ and shared his salvation experience.) So, in fact, I do have solid background and basis to CONFIRM THE FEMA DEATHCAMPS TO TERMINATE AMERIANS UNDER MARTIAL LAW are real. -Sincerely, Pamela Schuffert (American Holocaust Coming blogspot)", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-16 22:25:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "intTime": 20090325, 
        "postID": 38, 
        "quote": "", 
        "reply": "I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 11:23:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights? LOL!", 
        "intTime": 20090325, 
        "postID": 39, 
        "quote": "Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "reply": " LOL!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 11:48:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights? Just bring that Avatar Picture you have as an ID and you should have NO trouble", 
        "intTime": 20090325, 
        "postID": 40, 
        "quote": "Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "reply": " Just bring that Avatar Picture you have as an ID and you should have NO trouble", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 17:14:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "government seduction and control seems to be upon us and the final preps are going in to place. They are fixin to gather the sheeple to their final pastures..What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "intTime": 20090325, 
        "postID": 41, 
        "quote": "", 
        "reply": "government seduction and control seems to be upon us and the final preps are going in to place. They are fixin to gather the sheeple to their final pastures..What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 17:15:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens? you already asked this and people answered you. If you feel those answers were wrong then explain why.", 
        "intTime": 20090325, 
        "postID": 42, 
        "quote": "What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "reply": " you already asked this and people answered you. If you feel those answers were wrong then explain why.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 23:56:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "intTime": 20090326, 
        "postID": 43, 
        "quote": "", 
        "reply": "The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 12:37:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "intTime": 20090326, 
        "postID": 44, 
        "quote": "public pre-K with breakfast, is all looking like Nazi-Germany", 
        "reply": " BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 21:29:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "yea they are to house the illegals in till they can be processed and sent back to whereever...", 
        "intTime": 20090326, 
        "postID": 45, 
        "quote": "", 
        "reply": "yea they are to house the illegals in till they can be processed and sent back to whereever...", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 23:14:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich. You'd be surprised just how already it's been approved with funding: \"http://www.rightsidenews.com/200903264165/homeland_security/training_of_new_civilian_security_force_passed_billions_allocated.html", 
        "intTime": 20090327, 
        "postID": 46, 
        "quote": "Originally posted by StaffSgtGraham: The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "reply": " You'd be surprised just how already it's been approved with funding: \"http://www.rightsidenews.com/200903264165/homeland_security/training_of_new_civilian_security_force_passed_billions_allocated.html", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 10:57:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts! But I like brats and sourkraut Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090327, 
        "postID": 47, 
        "quote": "Originally posted by karlhungusjr: quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "reply": " But I like brats and sourkraut Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 20:08:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "DSTremf"
    }, 
    {
        "content": "The NEA starts brainwashing the children as soon as they can get them(once potty-trained). Kindergarten, a German word, was started in Germany.", 
        "intTime": 20090327, 
        "postID": 48, 
        "quote": "", 
        "reply": "The NEA starts brainwashing the children as soon as they can get them(once potty-trained). Kindergarten, a German word, was started in Germany.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 20:33:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Kindergarten, a German word, was started in Germany. Obvious troll is obvious.", 
        "intTime": 20090328, 
        "postID": 49, 
        "quote": "Kindergarten, a German word, was started in Germany.", 
        "reply": " Obvious troll is obvious.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-28 22:38:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Tricky Dick Nixon in the early 1970s actually did propose 'concentration' camps into which he would herd war protesters and others he didn't like. His Cabinet talked him out of it before the public really got wind of it. Such camps were constructed and used during WW-I and were populated mostly by union activists and others under the sedition act. And then, of course, the Japanese in WW-II. It's not unheard of in the US that the government would build special treatment facilities to fit the needs of a special category of people for some reason but the FEMA camps don't appear to fit that mode. The other 'camp' attempts were basically secret. This doesn't appear to be. But one never knows, politics is a fickle thing.", 
        "intTime": 20090329, 
        "postID": 50, 
        "quote": "", 
        "reply": "Tricky Dick Nixon in the early 1970s actually did propose 'concentration' camps into which he would herd war protesters and others he didn't like. His Cabinet talked him out of it before the public really got wind of it. Such camps were constructed and used during WW-I and were populated mostly by union activists and others under the sedition act. And then, of course, the Japanese in WW-II. It's not unheard of in the US that the government would build special treatment facilities to fit the needs of a special category of people for some reason but the FEMA camps don't appear to fit that mode. The other 'camp' attempts were basically secret. This doesn't appear to be. But one never knows, politics is a fickle thing.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-29 10:16:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "intTime": 20090330, 
        "postID": 51, 
        "quote": "", 
        "reply": "These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 11:36:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter. Thats a load of crap. Nixon was the worst president we ever had. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090330, 
        "postID": 52, 
        "quote": "Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "reply": " Thats a load of crap. Nixon was the worst president we ever had. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 19:20:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter. Well, do you like to go to camp? Sounds to me like you are recruiting yourself! My mother was a NEA member for many years. But hardly a socialist and she was very patriotic, one of the first women of 270 some women to join the Woman's Auxiliary Army Air Corps in 1942. (And they didn't get recognized as a veteran until 1990s!) So, when did the NEA become socialist? When BHO became President? Maybe they'll let you have a bonfire and sing songs when you go to comrade Obama's camp? So, will these camps be Rapture proof, too?", 
        "intTime": 20090330, 
        "postID": 53, 
        "quote": "Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "reply": " Well, do you like to go to camp? Sounds to me like you are recruiting yourself! My mother was a NEA member for many years. But hardly a socialist and she was very patriotic, one of the first women of 270 some women to join the Woman's Auxiliary Army Air Corps in 1942. (And they didn't get recognized as a veteran until 1990s!) So, when did the NEA become socialist? When BHO became President? Maybe they'll let you have a bonfire and sing songs when you go to comrade Obama's camp? So, will these camps be Rapture proof, too?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 20:56:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "intTime": 20090331, 
        "postID": 54, 
        "quote": "", 
        "reply": "Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 11:35:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "Just because somebody is a NEA member doesn't mean they are a socialist. Public School(gov't) teachers in most states are REQUIRED to join the NEA. It is a closed-shop. I once had to join UAW to keep my job. They took my dues every month and sent some to Jesse Jackson & Dukakis against my wishes. I had no control over UAW's agenda just like most teachers are only concerned about their pay & benefits. Sadly the public schools are now institutions where the gov't brainwashes our children against parents and God. We are forced to pay for it. Public schools were originally meant for the indigent and not the runaway train they are now. We homeschooled our kids for few years and know the schoolday and schoolyear could both be shortened immensely.", 
        "intTime": 20090331, 
        "postID": 55, 
        "quote": "", 
        "reply": "Just because somebody is a NEA member doesn't mean they are a socialist. Public School(gov't) teachers in most states are REQUIRED to join the NEA. It is a closed-shop. I once had to join UAW to keep my job. They took my dues every month and sent some to Jesse Jackson & Dukakis against my wishes. I had no control over UAW's agenda just like most teachers are only concerned about their pay & benefits. Sadly the public schools are now institutions where the gov't brainwashes our children against parents and God. We are forced to pay for it. Public schools were originally meant for the indigent and not the runaway train they are now. We homeschooled our kids for few years and know the schoolday and schoolyear could both be shortened immensely.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 12:02:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be. If he's not the president, then who is? Under our Constitution, we are never without one.", 
        "intTime": 20090331, 
        "postID": 56, 
        "quote": "Originally posted by StaffSgtGraham: Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "reply": " If he's not the president, then who is? Under our Constitution, we are never without one.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:26:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "BillingsJT"
    }, 
    {
        "content": "He may be the ACTING president but he is holding office illegally and anything he signs or enacts should be rescinded. A civil war has already started in our country because of this. We are in the midst of a constitutional-crisis thanks to this Kenyan/Indonesian imposter. Barack H. Obama(if that is his name?) duped a lot of voters. This is still one of the best countries in the world so there is no better place to go. How can we just accept a fraudulent president? Why do so few people care?", 
        "intTime": 20090331, 
        "postID": 57, 
        "quote": "", 
        "reply": "He may be the ACTING president but he is holding office illegally and anything he signs or enacts should be rescinded. A civil war has already started in our country because of this. We are in the midst of a constitutional-crisis thanks to this Kenyan/Indonesian imposter. Barack H. Obama(if that is his name?) duped a lot of voters. This is still one of the best countries in the world so there is no better place to go. How can we just accept a fraudulent president? Why do so few people care?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:37:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "He can't be the acting president, since he has never been elected vice president. I think you need to read your Constitution again. He has been duly elected. Those who could challenge his qualifications did not do so. Case closed.", 
        "intTime": 20090331, 
        "postID": 58, 
        "quote": "", 
        "reply": "He can't be the acting president, since he has never been elected vice president. I think you need to read your Constitution again. He has been duly elected. Those who could challenge his qualifications did not do so. Case closed.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:49:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "BillingsJT"
    }, 
    {
        "content": "Well, this is the conspiracy thread and I would suppose there are those that would believe the American voters conspired to put a man in office who was not 'qualified' according to the Constitution. So, with BHO's high approval rating from the American public I guess the majority of us prefer to keep the 'conspiracy' going... it appears to be working well. Maybe we voters didn't think anyone with the proper credentials could do the job very well? Better get back to listening to Rush, he knows what's going on!", 
        "intTime": 20090401, 
        "postID": 59, 
        "quote": "", 
        "reply": "Well, this is the conspiracy thread and I would suppose there are those that would believe the American voters conspired to put a man in office who was not 'qualified' according to the Constitution. So, with BHO's high approval rating from the American public I guess the majority of us prefer to keep the 'conspiracy' going... it appears to be working well. Maybe we voters didn't think anyone with the proper credentials could do the job very well? Better get back to listening to Rush, he knows what's going on!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-04-01 11:38:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "This case will not be closed until the truth comes out. Obama might get a full term AS president but he is still a USURPER. I just hope I live long enough to say \"I told you so.\" The way you people made a big deal about Quayle and Bush2 being in the National Guard I am surprised you would not be up in arms about this fraud.", 
        "intTime": 20090401, 
        "postID": 60, 
        "quote": "", 
        "reply": "This case will not be closed until the truth comes out. Obama might get a full term AS president but he is still a USURPER. I just hope I live long enough to say \"I told you so.\" The way you people made a big deal about Quayle and Bush2 being in the National Guard I am surprised you would not be up in arms about this fraud.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-04-01 11:49:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "AN AMERICAN HOLOCAUST IS COMING and the CAMPS ARE REAL The information you are about to readr is highly controversial and profoundly disturbing to many Americans. However, my years of research coupled with thousands of miles of personal worldwide travel to investigate the following information about the NEW WORLD ORDER under martial law and the FEMA deathcamps and to document it in many cases has validated what you are about to read. Every American ought to be disturbed and awakened by the implications of such information being factual. And every American ought to be moved to great concern and subsequent appropriate actions to counter the threats that we now face to our sovereignty and Constitutionally guaranteed religious and national liberties and cherished Patriot heritage. I was born at the headquarters of the United States Air Force, (Bolling AFB) in Washington, DC. I was raised in the greater Washington metropolitan area for most of my life, living less than a hour from the White House, Capitol Hill, the Pentagon, CIA and FBI headquarters. Historic Mount Vernon, restored estate of our nation’s first President, was only a mile and a half from our home along the Potomac River. My famous USAF father, \"Jake\" Schuffert worked at both Bolling AFB and the Pentagon. (He died in 1998.) Even today, posthumously, he is referred to as the United States Air Force \"icon cartoonist\" whose military cartoons have filled USAF and US Army publications for many years. His cartoons continued to be published monthly, posthumously, for several years after he died in the widely read AIRMAN magazine, known and read by virtually every USAF person worldwide. My mother at various times worked as a secretary for a Congressman on Capitol Hill (Congressman McClory of IL), and for the US Army/Department of Defense for many years. The neighborhood that I grew up in was filled with high level military brass, the intelligence community (FBI, CIA, NSA, DIA, etc.), and the politically important…in essence, the \"rich, the elite and the powerful\" (as they love to refer to themselves as.) I am sharing this to establish my personal background in the reader’s mind so that you may understand that I know what I am talking about in the reports to follow. -INFORMATION SOURCES- Many of my information sources are in fact former and/or present intelligence community operatives (CIA, etc.)who have become deeply disturbed about what they know from the inside and are moved to sound the alarm by going public…even at the risk of their own personal lives. Others are credible military sources, both active and retired, who are equally disturbed over such information and it’s implications and are also going public. I have traveled thousands of miles, both across CONUS (the continental United States, ) Canada, Alaska, and overseas to Germany and Europe, London, Israel, Hawaii, Costa Rica and elsewhere to interview contacts and information sources from many different backgrounds, all of whom are confirming the reality of THE COMING AMERICAN HOLOCAUST. I have also lectured worldwide on this subject as well. My previous radio broadcast, DEFENDERS OF LIBERTY (WWCR RADIO), have presented this information to millions nationwide and worldwide. And radio listeners have frequently called in during my broadcasts to confirm such preparations taking place in their region across America for MARTIAL LAW and the coming Holocaust. I have uncovered information that often defies belief…from the manufacture and importing of modern guillotines into America since the 1970’s and distributed to military bases nationwide for the beheading of NWO resisters under NOAHIDE LAWS PROVISIONS …to UN/FEMA prisoner boxcars with shackles made to order by the thousands under secret contract with the US government…to modern-day FEMA/Homeland Security concentration camps equipped with various means of termination ranging from gassing/crematory facilities to ultra-modern microwaving facilities that will both terminate and dispose of victims’ remains in one action…to UN/NATO foreign troops already trained and prepositioned across this nation for the hour of NWO conquest under coming martial law, who are openly boasting, (as in the case of German Bundeswehr/Luftwaffe stationed at Holloman AFB and throughout the USA): \"We Germans won’t have a problem firing upon you Americans under martial law!\" Tragically, America’s leadership from the WHITE HOUSE DOWN has sold out at the highest levels to this ominous NWO/UN based agenda. Many of our own military bases have quietly been used to train the foreign troops that will be used to assist the NWO elements of our government/military in oppressing and arresting fellow Americans who will continue to stand up for our sovereignty, our Constitution and religious freedoms as they become threatened under coming events, beginning with \"9/11\" and culminating with martial law. The twin tragedies of September 11th, 2001, served only to further move America, not by consent but by brute force, into the direction of the New World Order…even as Tom Brokaw boldly declared on NBC nightly news on October 11th, 2001. What does the \"New World Order\" mean, in fact, for Patriotic Americans and Christians? It heralds the coming regime of tyrannical oppression of religious freedom of expression. It signals the end of national sovereignty of America (and every other nation ultimately,) and to be brought under the ruling force of the coming world government under the United Nations/NATO and the multinational military forces who will enforce the New World Order. It will consist of a world government, a world religious system and a world banking system. Every person on the face of the earth will be tied into this system with their own personal access number assigned to them, without which no one will be able to buy or sell in the coming cashless society. Here in AMERICA, we are about to enter, in fact, into that which has been long prophesied to the Church in the Book of Revelation, the kingdom of darkness on the earth called the Kingdom of the Beast, or Antichrist. And to this kingdom Satan/the Dragon HAS ALREADY GIVEN his throne, power and great authority. Those in authority over this world system will be in fact the world’s Illuminati/Luciferians, or Satanists. And it will be demonically powered by Satan himself. And Satan will demand and receive the worship of himself in place of the true God throughout the earth…and his followers will have the power to make war with the people of God and put them to death for non-compliance and faithfulness unto Jesus Christ. (Revelation 13) In the course of interviewing some of America’s former high level Satanists who had great power in the past, they have confirmed to me with one breath the reality of their Illuminati/Satanist/Luciferian-based New World Order and it’s globalist agenda. They also confirmed the plans for mass round-up, persecution and termination of ALL resisters of their NWO, with Bible-believing Christians placed highest on their list for arrest and termination. Former Satanists from inside the CIA have confirmed to me personally that the concentration camps I have investigated and documented were indeed designed with the termination of \"resisters of the NWO\" in mind in America. Also that Christians were considered their number one enemy and hindrance that stands in the way of their establishing their agenda throughout America. -USAF SATANISM AND THE NEW WORLD ORDER- I should know of the reality of this. What I did not previously reveal in this post regarding my father, Jake Schuffert, was that he tragically was recruited into the NWO agenda while working at Bolling AFB and the Pentagon, and also into the admitted religion of the NWO, Satanism/Luciferianism/Illuminism. People in the US military are constantly being quietly approached with the program to bring America under world globalist control, and are often threatened with failure of promotion, etc., if they will not consent to go along with this program. Many I have interviewed in the military have confirmed this to me. Many have sold out our nation for the promise of \"promotion, payraise and self-protection\" IF they will fully cooperate with the NWO agenda for our nation. This dark NWO agenda recruitment goes on even in the White House…even on Capitol Hill…the intelligence community…and even in the Pentagon and throughout every branch of our military. Throughout our nation, multitudes have quietly sold out this nation to the oppressive and freedom-destroying agenda of the New World Order. And America’s Illuminati/Satanists, which I have interviewed nationwide, have confirmed with one voice that the New World Order IS Satan’s agenda for the world and this nation, and that they, the Satanists, are the backbone of this coming regime. And as such, the Christians as all other resisters MUST GO! The Bible itself confirms \"the nature of the Beast.\" (Revelation 13.) Tragically, my father sold out his family and his nation to this Satanist agenda in the 1970’s. And the warm, loving father I had known throughout childhood was slowly transformed by Illuminati/NWO doctrines into a tyrant in our home, well concealed from the public eye by the veneer of \"the jolly USAF cartoonist\"…a public role he played well. But in our troubled home, we knew the truth. And I lived in terror of my father for many years. My once-loving Daddy was slowly transformed into a hard-core Satanist who upheld the New World Order’s anti-Christian agenda. He would come home from the Pentagon breathing out the NWO-inspired hatred for Christians (my mother and I were both strong Christians.) He knew of the concentration camps established by the military for the detention/termination of NWO resisters under martial law, for he would make statements like: \"Everyone who believes in God and miracles should be sent to concentration camps!\" Little did I realize then that, in fact, many modern concentration camps now exist through North America for the hour of the great persecution of the Church under the coming New World Order agenda. I was in fact forced to combat the New World Order and it’s Satanist religion from early youth in my very own home! (Through much painstaking Christian witness and prayer and longsuffering, my father finally repented and become a genuine Christian 6 months prior to his death. He was buried with honors at Arlington National Cemetery in Washington, DC, following a service in the Chapel which glorified Jesus Christ and shared his salvation experience.) So, in fact, I do have solid background and basis to CONFIRM THE FEMA DEATHCAMPS TO TERMINATE AMERIANS UNDER MARTIAL LAW are real. -Sincerely, Pamela Schuffert (American Holocaust Coming blogspot)", 
        "intTime": 20090316, 
        "postID": 67, 
        "quote": "", 
        "reply": "AN AMERICAN HOLOCAUST IS COMING and the CAMPS ARE REAL The information you are about to readr is highly controversial and profoundly disturbing to many Americans. However, my years of research coupled with thousands of miles of personal worldwide travel to investigate the following information about the NEW WORLD ORDER under martial law and the FEMA deathcamps and to document it in many cases has validated what you are about to read. Every American ought to be disturbed and awakened by the implications of such information being factual. And every American ought to be moved to great concern and subsequent appropriate actions to counter the threats that we now face to our sovereignty and Constitutionally guaranteed religious and national liberties and cherished Patriot heritage. I was born at the headquarters of the United States Air Force, (Bolling AFB) in Washington, DC. I was raised in the greater Washington metropolitan area for most of my life, living less than a hour from the White House, Capitol Hill, the Pentagon, CIA and FBI headquarters. Historic Mount Vernon, restored estate of our nation’s first President, was only a mile and a half from our home along the Potomac River. My famous USAF father, \"Jake\" Schuffert worked at both Bolling AFB and the Pentagon. (He died in 1998.) Even today, posthumously, he is referred to as the United States Air Force \"icon cartoonist\" whose military cartoons have filled USAF and US Army publications for many years. His cartoons continued to be published monthly, posthumously, for several years after he died in the widely read AIRMAN magazine, known and read by virtually every USAF person worldwide. My mother at various times worked as a secretary for a Congressman on Capitol Hill (Congressman McClory of IL), and for the US Army/Department of Defense for many years. The neighborhood that I grew up in was filled with high level military brass, the intelligence community (FBI, CIA, NSA, DIA, etc.), and the politically important…in essence, the \"rich, the elite and the powerful\" (as they love to refer to themselves as.) I am sharing this to establish my personal background in the reader’s mind so that you may understand that I know what I am talking about in the reports to follow. -INFORMATION SOURCES- Many of my information sources are in fact former and/or present intelligence community operatives (CIA, etc.)who have become deeply disturbed about what they know from the inside and are moved to sound the alarm by going public…even at the risk of their own personal lives. Others are credible military sources, both active and retired, who are equally disturbed over such information and it’s implications and are also going public. I have traveled thousands of miles, both across CONUS (the continental United States, ) Canada, Alaska, and overseas to Germany and Europe, London, Israel, Hawaii, Costa Rica and elsewhere to interview contacts and information sources from many different backgrounds, all of whom are confirming the reality of THE COMING AMERICAN HOLOCAUST. I have also lectured worldwide on this subject as well. My previous radio broadcast, DEFENDERS OF LIBERTY (WWCR RADIO), have presented this information to millions nationwide and worldwide. And radio listeners have frequently called in during my broadcasts to confirm such preparations taking place in their region across America for MARTIAL LAW and the coming Holocaust. I have uncovered information that often defies belief…from the manufacture and importing of modern guillotines into America since the 1970’s and distributed to military bases nationwide for the beheading of NWO resisters under NOAHIDE LAWS PROVISIONS …to UN/FEMA prisoner boxcars with shackles made to order by the thousands under secret contract with the US government…to modern-day FEMA/Homeland Security concentration camps equipped with various means of termination ranging from gassing/crematory facilities to ultra-modern microwaving facilities that will both terminate and dispose of victims’ remains in one action…to UN/NATO foreign troops already trained and prepositioned across this nation for the hour of NWO conquest under coming martial law, who are openly boasting, (as in the case of German Bundeswehr/Luftwaffe stationed at Holloman AFB and throughout the USA): \"We Germans won’t have a problem firing upon you Americans under martial law!\" Tragically, America’s leadership from the WHITE HOUSE DOWN has sold out at the highest levels to this ominous NWO/UN based agenda. Many of our own military bases have quietly been used to train the foreign troops that will be used to assist the NWO elements of our government/military in oppressing and arresting fellow Americans who will continue to stand up for our sovereignty, our Constitution and religious freedoms as they become threatened under coming events, beginning with \"9/11\" and culminating with martial law. The twin tragedies of September 11th, 2001, served only to further move America, not by consent but by brute force, into the direction of the New World Order…even as Tom Brokaw boldly declared on NBC nightly news on October 11th, 2001. What does the \"New World Order\" mean, in fact, for Patriotic Americans and Christians? It heralds the coming regime of tyrannical oppression of religious freedom of expression. It signals the end of national sovereignty of America (and every other nation ultimately,) and to be brought under the ruling force of the coming world government under the United Nations/NATO and the multinational military forces who will enforce the New World Order. It will consist of a world government, a world religious system and a world banking system. Every person on the face of the earth will be tied into this system with their own personal access number assigned to them, without which no one will be able to buy or sell in the coming cashless society. Here in AMERICA, we are about to enter, in fact, into that which has been long prophesied to the Church in the Book of Revelation, the kingdom of darkness on the earth called the Kingdom of the Beast, or Antichrist. And to this kingdom Satan/the Dragon HAS ALREADY GIVEN his throne, power and great authority. Those in authority over this world system will be in fact the world’s Illuminati/Luciferians, or Satanists. And it will be demonically powered by Satan himself. And Satan will demand and receive the worship of himself in place of the true God throughout the earth…and his followers will have the power to make war with the people of God and put them to death for non-compliance and faithfulness unto Jesus Christ. (Revelation 13) In the course of interviewing some of America’s former high level Satanists who had great power in the past, they have confirmed to me with one breath the reality of their Illuminati/Satanist/Luciferian-based New World Order and it’s globalist agenda. They also confirmed the plans for mass round-up, persecution and termination of ALL resisters of their NWO, with Bible-believing Christians placed highest on their list for arrest and termination. Former Satanists from inside the CIA have confirmed to me personally that the concentration camps I have investigated and documented were indeed designed with the termination of \"resisters of the NWO\" in mind in America. Also that Christians were considered their number one enemy and hindrance that stands in the way of their establishing their agenda throughout America. -USAF SATANISM AND THE NEW WORLD ORDER- I should know of the reality of this. What I did not previously reveal in this post regarding my father, Jake Schuffert, was that he tragically was recruited into the NWO agenda while working at Bolling AFB and the Pentagon, and also into the admitted religion of the NWO, Satanism/Luciferianism/Illuminism. People in the US military are constantly being quietly approached with the program to bring America under world globalist control, and are often threatened with failure of promotion, etc., if they will not consent to go along with this program. Many I have interviewed in the military have confirmed this to me. Many have sold out our nation for the promise of \"promotion, payraise and self-protection\" IF they will fully cooperate with the NWO agenda for our nation. This dark NWO agenda recruitment goes on even in the White House…even on Capitol Hill…the intelligence community…and even in the Pentagon and throughout every branch of our military. Throughout our nation, multitudes have quietly sold out this nation to the oppressive and freedom-destroying agenda of the New World Order. And America’s Illuminati/Satanists, which I have interviewed nationwide, have confirmed with one voice that the New World Order IS Satan’s agenda for the world and this nation, and that they, the Satanists, are the backbone of this coming regime. And as such, the Christians as all other resisters MUST GO! The Bible itself confirms \"the nature of the Beast.\" (Revelation 13.) Tragically, my father sold out his family and his nation to this Satanist agenda in the 1970’s. And the warm, loving father I had known throughout childhood was slowly transformed by Illuminati/NWO doctrines into a tyrant in our home, well concealed from the public eye by the veneer of \"the jolly USAF cartoonist\"…a public role he played well. But in our troubled home, we knew the truth. And I lived in terror of my father for many years. My once-loving Daddy was slowly transformed into a hard-core Satanist who upheld the New World Order’s anti-Christian agenda. He would come home from the Pentagon breathing out the NWO-inspired hatred for Christians (my mother and I were both strong Christians.) He knew of the concentration camps established by the military for the detention/termination of NWO resisters under martial law, for he would make statements like: \"Everyone who believes in God and miracles should be sent to concentration camps!\" Little did I realize then that, in fact, many modern concentration camps now exist through North America for the hour of the great persecution of the Church under the coming New World Order agenda. I was in fact forced to combat the New World Order and it’s Satanist religion from early youth in my very own home! (Through much painstaking Christian witness and prayer and longsuffering, my father finally repented and become a genuine Christian 6 months prior to his death. He was buried with honors at Arlington National Cemetery in Washington, DC, following a service in the Chapel which glorified Jesus Christ and shared his salvation experience.) So, in fact, I do have solid background and basis to CONFIRM THE FEMA DEATHCAMPS TO TERMINATE AMERIANS UNDER MARTIAL LAW are real. -Sincerely, Pamela Schuffert (American Holocaust Coming blogspot)", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-16 22:25:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "intTime": 20090325, 
        "postID": 68, 
        "quote": "", 
        "reply": "I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 11:23:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights? LOL!", 
        "intTime": 20090325, 
        "postID": 69, 
        "quote": "Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "reply": " LOL!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 11:48:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights? Just bring that Avatar Picture you have as an ID and you should have NO trouble", 
        "intTime": 20090325, 
        "postID": 70, 
        "quote": "Originally posted by Philhelm: I just want to know how I can become a FEMA Death Camp guard. Also, will I get a higher food ration and mating rights?", 
        "reply": " Just bring that Avatar Picture you have as an ID and you should have NO trouble", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 17:14:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "government seduction and control seems to be upon us and the final preps are going in to place. They are fixin to gather the sheeple to their final pastures..What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "intTime": 20090325, 
        "postID": 71, 
        "quote": "", 
        "reply": "government seduction and control seems to be upon us and the final preps are going in to place. They are fixin to gather the sheeple to their final pastures..What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 17:15:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens? you already asked this and people answered you. If you feel those answers were wrong then explain why.", 
        "intTime": 20090325, 
        "postID": 72, 
        "quote": "What other possible explanation could there be for these prison camps then? Who are they planning on placing in them if not citizens?", 
        "reply": " you already asked this and people answered you. If you feel those answers were wrong then explain why.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-25 23:56:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "intTime": 20090326, 
        "postID": 73, 
        "quote": "", 
        "reply": "The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 12:37:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "intTime": 20090326, 
        "postID": 74, 
        "quote": "public pre-K with breakfast, is all looking like Nazi-Germany", 
        "reply": " BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 21:29:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "yea they are to house the illegals in till they can be processed and sent back to whereever...", 
        "intTime": 20090326, 
        "postID": 75, 
        "quote": "", 
        "reply": "yea they are to house the illegals in till they can be processed and sent back to whereever...", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-26 23:14:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich. You'd be surprised just how already it's been approved with funding: \"http://www.rightsidenews.com/200903264165/homeland_security/training_of_new_civilian_security_force_passed_billions_allocated.html", 
        "intTime": 20090327, 
        "postID": 76, 
        "quote": "Originally posted by StaffSgtGraham: The man some people refer to as \"President Obama\" has stated he wants to have a National Security Police force. Lt Easterling and others who question Obama's citizenship are called \"traitors\". Unborn baby experiments, gun control, school-to-work programs, public pre-K with breakfast, is all looking like Nazi-Germany and the movie: AMERIKA w/Kris Kristofferson & Olivia Newton-John. The Obama Nation is actually the 4th Reich.", 
        "reply": " You'd be surprised just how already it's been approved with funding: \"http://www.rightsidenews.com/200903264165/homeland_security/training_of_new_civilian_security_force_passed_billions_allocated.html", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 10:57:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts! But I like brats and sourkraut Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090327, 
        "postID": 77, 
        "quote": "Originally posted by karlhungusjr: quote: public pre-K with breakfast, is all looking like Nazi-Germany BWAHAHAHAHAHA! No true god loving American should ever support Nazi breakfasts!", 
        "reply": " But I like brats and sourkraut Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 20:08:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "DSTremf"
    }, 
    {
        "content": "The NEA starts brainwashing the children as soon as they can get them(once potty-trained). Kindergarten, a German word, was started in Germany.", 
        "intTime": 20090327, 
        "postID": 78, 
        "quote": "", 
        "reply": "The NEA starts brainwashing the children as soon as they can get them(once potty-trained). Kindergarten, a German word, was started in Germany.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-27 20:33:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Kindergarten, a German word, was started in Germany. Obvious troll is obvious.", 
        "intTime": 20090328, 
        "postID": 79, 
        "quote": "Kindergarten, a German word, was started in Germany.", 
        "reply": " Obvious troll is obvious.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-28 22:38:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Tricky Dick Nixon in the early 1970s actually did propose 'concentration' camps into which he would herd war protesters and others he didn't like. His Cabinet talked him out of it before the public really got wind of it. Such camps were constructed and used during WW-I and were populated mostly by union activists and others under the sedition act. And then, of course, the Japanese in WW-II. It's not unheard of in the US that the government would build special treatment facilities to fit the needs of a special category of people for some reason but the FEMA camps don't appear to fit that mode. The other 'camp' attempts were basically secret. This doesn't appear to be. But one never knows, politics is a fickle thing.", 
        "intTime": 20090329, 
        "postID": 80, 
        "quote": "", 
        "reply": "Tricky Dick Nixon in the early 1970s actually did propose 'concentration' camps into which he would herd war protesters and others he didn't like. His Cabinet talked him out of it before the public really got wind of it. Such camps were constructed and used during WW-I and were populated mostly by union activists and others under the sedition act. And then, of course, the Japanese in WW-II. It's not unheard of in the US that the government would build special treatment facilities to fit the needs of a special category of people for some reason but the FEMA camps don't appear to fit that mode. The other 'camp' attempts were basically secret. This doesn't appear to be. But one never knows, politics is a fickle thing.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-29 10:16:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "intTime": 20090330, 
        "postID": 81, 
        "quote": "", 
        "reply": "These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 11:36:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter. Thats a load of crap. Nixon was the worst president we ever had. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090330, 
        "postID": 82, 
        "quote": "Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "reply": " Thats a load of crap. Nixon was the worst president we ever had. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 19:20:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter. Well, do you like to go to camp? Sounds to me like you are recruiting yourself! My mother was a NEA member for many years. But hardly a socialist and she was very patriotic, one of the first women of 270 some women to join the Woman's Auxiliary Army Air Corps in 1942. (And they didn't get recognized as a veteran until 1990s!) So, when did the NEA become socialist? When BHO became President? Maybe they'll let you have a bonfire and sing songs when you go to comrade Obama's camp? So, will these camps be Rapture proof, too?", 
        "intTime": 20090330, 
        "postID": 83, 
        "quote": "Originally posted by StaffSgtGraham: These camps are probably meant for those who refuse to get with Obama's program. Those who believe he is a \"USURPER\" and those who recognize the public school teachers union(NEA) for the socialist organization it is. Anybody who claims they are \"born-again\" will likely be considered \"haters\" and also placed in these camps. Nixon wasn't a bad president at all compared to Clinton & Obama the Imposter.", 
        "reply": " Well, do you like to go to camp? Sounds to me like you are recruiting yourself! My mother was a NEA member for many years. But hardly a socialist and she was very patriotic, one of the first women of 270 some women to join the Woman's Auxiliary Army Air Corps in 1942. (And they didn't get recognized as a veteran until 1990s!) So, when did the NEA become socialist? When BHO became President? Maybe they'll let you have a bonfire and sing songs when you go to comrade Obama's camp? So, will these camps be Rapture proof, too?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-30 20:56:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "intTime": 20090331, 
        "postID": 84, 
        "quote": "", 
        "reply": "Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 11:35:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "Just because somebody is a NEA member doesn't mean they are a socialist. Public School(gov't) teachers in most states are REQUIRED to join the NEA. It is a closed-shop. I once had to join UAW to keep my job. They took my dues every month and sent some to Jesse Jackson & Dukakis against my wishes. I had no control over UAW's agenda just like most teachers are only concerned about their pay & benefits. Sadly the public schools are now institutions where the gov't brainwashes our children against parents and God. We are forced to pay for it. Public schools were originally meant for the indigent and not the runaway train they are now. We homeschooled our kids for few years and know the schoolday and schoolyear could both be shortened immensely.", 
        "intTime": 20090331, 
        "postID": 85, 
        "quote": "", 
        "reply": "Just because somebody is a NEA member doesn't mean they are a socialist. Public School(gov't) teachers in most states are REQUIRED to join the NEA. It is a closed-shop. I once had to join UAW to keep my job. They took my dues every month and sent some to Jesse Jackson & Dukakis against my wishes. I had no control over UAW's agenda just like most teachers are only concerned about their pay & benefits. Sadly the public schools are now institutions where the gov't brainwashes our children against parents and God. We are forced to pay for it. Public schools were originally meant for the indigent and not the runaway train they are now. We homeschooled our kids for few years and know the schoolday and schoolyear could both be shortened immensely.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 12:02:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "quote: Originally posted by StaffSgtGraham: Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be. If he's not the president, then who is? Under our Constitution, we are never without one.", 
        "intTime": 20090331, 
        "postID": 86, 
        "quote": "Originally posted by StaffSgtGraham: Nixon had guilty-knowledge of the Watergate break-in and that is all anybody had on him. Jimmy Carter's camp committed an identical crime against George Wallace's HQ in '76 and nobody said squat after Carter was elected. The issue isn't me, Carter, Nixon, Bush or McCain. The issue is BHO producing untampered documents proving his citizenship. The man is NOT the President, never has been and never will be.", 
        "reply": " If he's not the president, then who is? Under our Constitution, we are never without one.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:26:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "BillingsJT"
    }, 
    {
        "content": "He may be the ACTING president but he is holding office illegally and anything he signs or enacts should be rescinded. A civil war has already started in our country because of this. We are in the midst of a constitutional-crisis thanks to this Kenyan/Indonesian imposter. Barack H. Obama(if that is his name?) duped a lot of voters. This is still one of the best countries in the world so there is no better place to go. How can we just accept a fraudulent president? Why do so few people care?", 
        "intTime": 20090331, 
        "postID": 87, 
        "quote": "", 
        "reply": "He may be the ACTING president but he is holding office illegally and anything he signs or enacts should be rescinded. A civil war has already started in our country because of this. We are in the midst of a constitutional-crisis thanks to this Kenyan/Indonesian imposter. Barack H. Obama(if that is his name?) duped a lot of voters. This is still one of the best countries in the world so there is no better place to go. How can we just accept a fraudulent president? Why do so few people care?", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:37:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }, 
    {
        "content": "He can't be the acting president, since he has never been elected vice president. I think you need to read your Constitution again. He has been duly elected. Those who could challenge his qualifications did not do so. Case closed.", 
        "intTime": 20090331, 
        "postID": 88, 
        "quote": "", 
        "reply": "He can't be the acting president, since he has never been elected vice president. I think you need to read your Constitution again. He has been duly elected. Those who could challenge his qualifications did not do so. Case closed.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-03-31 17:49:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "BillingsJT"
    }, 
    {
        "content": "Well, this is the conspiracy thread and I would suppose there are those that would believe the American voters conspired to put a man in office who was not 'qualified' according to the Constitution. So, with BHO's high approval rating from the American public I guess the majority of us prefer to keep the 'conspiracy' going... it appears to be working well. Maybe we voters didn't think anyone with the proper credentials could do the job very well? Better get back to listening to Rush, he knows what's going on!", 
        "intTime": 20090401, 
        "postID": 89, 
        "quote": "", 
        "reply": "Well, this is the conspiracy thread and I would suppose there are those that would believe the American voters conspired to put a man in office who was not 'qualified' according to the Constitution. So, with BHO's high approval rating from the American public I guess the majority of us prefer to keep the 'conspiracy' going... it appears to be working well. Maybe we voters didn't think anyone with the proper credentials could do the job very well? Better get back to listening to Rush, he knows what's going on!", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-04-01 11:38:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "reducetension"
    }, 
    {
        "content": "This case will not be closed until the truth comes out. Obama might get a full term AS president but he is still a USURPER. I just hope I live long enough to say \"I told you so.\" The way you people made a big deal about Quayle and Bush2 being in the National Guard I am surprised you would not be up in arms about this fraud.", 
        "intTime": 20090401, 
        "postID": 90, 
        "quote": "", 
        "reply": "This case will not be closed until the truth comes out. Obama might get a full term AS president but he is still a USURPER. I just hope I live long enough to say \"I told you so.\" The way you people made a big deal about Quayle and Bush2 being in the National Guard I am surprised you would not be up in arms about this fraud.", 
        "threadID": "4960045241001_8530081512001", 
        "time": "2009-04-01 11:49:00", 
        "title": "Rumored FEMA Camps  Now Official - H.R. 645", 
        "userID": "StaffSgtGraham"
    }
]