[
    {
        "content": "\"WIll You LAUGH, Mr. Chertoff, As Patriotic Americans Are ARRESTED Under MARTIAL LAW in America?\" by Pamela Schuffert presenting investigative journalism from a Christian perspective [Forward-Although another Presidential Administration is now in office under OBAMA, and a new secretary is now in power over HOMELAND SECURITY, I noted with great interest in news articles stating that most of the PREVIOUS STAFF (DUAL CITIZENSHIP)IN HOMELAND SECURITY remain in place under this administration change. People have been very carefully screened and preselected to be in charge of Homeland Security. ONLY those people groups/types who are in full agreement with the coming NWO AGENDA, and are willing to go after the kinds of people groups they will target for ARREST and being TAKEN TO THE FEMA CAMPS, can be trusted to be in power at HOMELAND SECURITY. Chertoff (DUAL CITIZENSHIP)has worked furiously throughout the past years for the realization of a NWO (communist/globalist)agenda for America.Christians are traditionally targeted under every communist takeover worldwide, to be quickly taken to the camps and eliminated as true threats to godless/antichrist NWO communist agendas. So are Patriotic citizens. This is how the FEMA/Homeland Security camps will be utilized in the future of \"Amerika\" under martial law and the NEW WORLD ORDER. For this reason, I am leaving this post up. Nothing has changed regarding FUTURE NWO AGENDA and dual citizenship people at HOMELAND SECURITY.-Pamela Schuffert] ******************************* Will you laugh, Mr. Chertoff (DUAL CITIZENSHIP)and fellow NWO agenda supporters at HOMELAND SECURITY, as hapless Patriots, Christians, and other various NWO resisters are arrested and eliminated to bring down your cherished NEW WORLD ORDER under martial law? Will YOU join with millions of other people of NWO mindset, who will laugh at the apparent naivete of the Christians in America, as the modern guillotines we have documented are finally brought forth to BEHEAD THE OFFENDERS OF THE DISTINCTLY JEWISH NOAHIDE LAWS, \"offenders\" being the Christians of America (and the WORLD)??? Do you JOIN with certain OTHER people (DUAL CITIZENSHIP)at HOMElAND SECURITY and elsewhere, who are already lusting for the hour of Christians and Patriots being rounded up under martial law, to be brutally thrown into UN/FEMA prisoner boxcars with shackles AND your UN/Noahide Laws guillotines installed in many, to be terminated as NOAHIDE LAW breakers and NWO resisters? Former NWO adherents have already exposed the sad fact that SATANISM/Illuminism/Sabbateanism IS the \"religion\" undergirding the coming NEW WORLD ORDER (world globalist communism repackaged, with it's roots in the ILLUMINATI and the ROTHSCHILDS.) Former Illuminati and CIA members I have personally interviewed, informed me frankly that EVERY PERSON AND CHRISTIAN ARRESTED AND SENT TO THE CAMPS or BEHEADED IS GOING TO COUNT IN THEIR MINDS as \"ONE MORE SACRIFICE TO SATAN\" to obtain power to bring forth SATAN'S NEW WORLD ORDER on the earth. This is already revealed in THE BOOK OF REVELATION in the Christian Bible. Chapter 13 specifically addresses the Satanists/Illuminists who WORSHIP THE DRAGON, SATAN/LUCIFER, who in return GIVES POWER TO \"THE BEAST\" of the NEW WORLD ORDER AGENDA. \"And men worshipped THE DRAGON, who gave POWER TO THE BEAST [NWO.]\" The DRAGON is LUCIFER/Satan. Who worships SATAN, but SATANISTS. And HOW is he primarily worshipped? BY HUMAN SACRIFICE! I should know. My famous USAF father got recruited into the NWO agenda in the US military, and into it's horrific \"religion,\" hard-core satanism/Illuminism. Such satanism is in fact rampant through the four branches of the US military. It is rampant throughout alphabet soup agencies working feverishly to bring down the NWO, like the CIA. Those of us who have fought this curse in our own homes are not deceived as other Americans are, Mr. Chertoff. We KNOW the horrible truth FROM THE INSIDE. In fact, Mr. Chertoff, my own father would come home from the PENTAGON, breathing out the hate rhetoric the NWO agenda instilled into him there, making statements like, \"EVERYONE who BELIEVES IN GOD should be sent to concentration camps!\" Hmmm. How very communist/world globalist sounding.Could he have been referring to FEMA and HOMELAND SECURITY camps he knew about already from inside the US military/Pentagon? I believe now that he was indeed. My CIA contacts made it plan that they used to sit around discussing \"HOW THE HECK DO WE TERMINATE THE RESISTERS OF OUR NWO AGENDA?\" And their conclusion from within the CIA: TO FUND AND BUILD THE DETENTION CAMPS which many investigative journalists have been exposing and reporting on. \"We in the CIA planned to count every person terminated in those camps as ONE MORE SACRIFICE TO SATAN to get power to BRING DOWN OUR NEW WORLD ORDER AGENDA....\" And more than one former CIA source admitted that CHRISTIANS RANKED HIGH ON THE LIST to be arrested and terminated in the camps. \"We satanists knew that Christians would never accept our NEW WORLD ORDER. Satan/Lucifer is the leader, and we satanists/(Luciferians/Illuminati/Sabbateans) are the backbone, and hence we knew THE CHRISTIANS WOULD HAVE TO BE TERMINATED....\" And these NWO satanists are right. We Christians never WILL accept the accursed NWO agenda.Period. My beloved personal friend, former CIA/ONI turned whistleblower,Michael Maholy, agreed. \"Oh, ALL OF US in the CIA know about the DETENTION CAMPS and their purposes. WE ALL KNEW they would be used to TERMINATE THE 'RESISTERS OF THE NEW WORLD ORDER' as it came down in America under MARTIAL LAW...\" Former CIA and former satanists I have interviewed nationwide for over 13 years now have all basically concurred with this evaluation of the NWO agenda from the inside. Amazingly, so does the WORD OF GOD, the BIBLE, especially the BOOK OF REVELATION. The SAME Book of Revelation that surprisingly also refers to certain elements within the Jewish community of \"JEWS OF THE SYNAGOGUE OF SATAN.\" Certainly not ALL, of course, but admittedly SOME. There are satanists/Illuminati elements included in every people and ethnic group. And that certain element of Jews tragically involved in Sabbatean/Iluminati satanism, help to form the backbone of the NEW WORLD ORDER or world globalist \"kill the Christians\" communism. Mr. Chertoff, I am only reiterating the above for the benefit of naive Americans and Christians whom NWO agenda promoters like you have been able to successfully keep in the dark regarding your NWO black ops these many years, through news media bias/blackout etc. You and your fellow NWO supporters in your communities know exactly what I am talking about. You in fact have been among the perpetrators and the planners of this NWO (world globalist communist) agenda for my nation, Mr. Chertoff. Especially with your assistance in robbing Americans of their cherished freedoms through PATRIOT ACT I and II. Having studied communism in order to work with Russian Jews and Russian Christians for years, I know about communism and what was imposed on the people of the former Soviet Union. I noted carefully how much of your PATRIOT ACT laws sounded suspiciously like they were taken directly from oppressive COMMUNIST legislation that provided for the persecution of many, including political and religious dissidents. I have previously reported, through my interviews with Jewish contacts providing insider revelations, how many in the Jewish communities of America are already laughing at the future fate planned against the Christians of this nation. Many are making statements throughout the Jewish communities of America ( and I suppose the world) like, \"NOW it is THE CHRISTIANS' TURN to be sent to the camps!\" I don't think you will ever understand the piercing pain in my heart, as my Jewish friends from NYC and elsewhere relay this kind of saddening information to me. I don't think you and your fellow NWO agenda Jews realize how many Christians in America genuinely love the Jewish community, are praying for the peace of Jerusalem, are providing millions of American Christian tourist dollars to Israel annually, and are giving their own sons to fight Israel's battles in the Middle East. And I have been among the above. And are you joining with others in secretly laughing about Christian ignorance in general regarding the millions of modern guillotines in many of our US military bases, and also some UN/NWO prisoner boxcars with shackles as well? Who in the Jewish communities of the world and America does not realize how the NOAHIDE LAWS will bring forth the massive nationwide/worldwide EXECUTIONS BY BEHEADING of Christian \"offenders\" of the NOAHIDE LAWS, as they refuse to renounce their cherished faith in JESUS CHRIST AS DIVINE and GOD IN THE FLESH (Immanuel)??? All of this presents a very sad picture of how the Jews reward those Christians in America who have stood in defense of Israel and the Jews...with guillotines, boxcars and shackles, and NWO termination camps. How disturbing. And perhaps revealing. I stand proudly among those Christians endangered now by your NWO communist agenda for my nation, America, Mr. Chertoff. Frankly, there are not enough modern guillotines in the world to destroy our faith in the Messiah you have rejected, Yahshua Ha'Mashiach, ha kadosh Baruch HU. There are not enough FEMA/HOMELAND SECURITY deathcamps to be found throughout this continent which can suffice to purge our Christian faith in the Living God and His Messiah off the face of this earth under the decidedly Jewish antichrist world globalist agenda. Since the NEW WORLD ORDER is in fact a worldwide WAR AGAINST Jesus the Messiah and His devout followers, LET me therefore be arrested, shackled into your boxcars and taken to the camps to be terminated for my faith...LET me be beheaded under your Noahide Laws for the Divine One Who suffered and died for His people and the sins of the WHOLE WORLD. GIVE ME the honor of my blood being shed with the saints of Messiah throughout the centuries who refused to DENY HIS NAME BEFORE MEN, and who suffered brutal persecution, torture, crucifixion, and death for my Savior.GIVE me the privilege of wearing the martyr's crown in heaven with my Savior, Jesus Christ. In fact, let me openly break the NOAHIDE LAWS before all the world, and state without apology on this blog, that Jesus Christ/Yahshua Ha'Mashiach IS Divine, IS the promised Messiah (and ONLY one)and Is, as the Jewish prophet Isaiah declared of the Messiah, \"...The mighty God, the everlasting Father, the PRINCE OF PEACE\" and Immanuel, \"GOD WITH US.\" He is GOD IN THE FLESH, and NO man comes to God EXCEPT THROUGH HIM. So, there...I have just broken two Noahide laws, those against \"blasphemy\" and \"idolatry\" by JEWISH Noahide Law definition, by stating my beliefs in the Messiah, Jesus Christ. ALL your Noahide Laws guillotines IN THE WORLD cannot change the eternal TRUTH about Jesus the Messiah, nor shake us from our faith in Him and obedience to God. Bring out the Lubavitcher guillotines.......because this is where we as Christians stand unapologized, worldwide. Besides, our Bible told us this was coming, in REVELATION 20:4. We have been told that Christians who refuse to deny Jesus Christ in order to join up with the satanic world government will be beheaded for their faith. Well, it's a dirty job, but somebody has to do it, I guess...how sad it has to be the Jews that so many Christians in America have naively loved and prayed for and supported. We as Christians in America will NEVER DENY HIS NAME to join your satanic world globalist communist NWO agenda. The perceptions of the NWO are quite accurate regarding us as Christians. And certainly for US, as Christian NWO resisters, the HOMELAND SECURITY/FEMA camps have been prepared and are waiting. More of us know than you think. And of course, there is that certain element within the Jewish community, the dark Jewish Sabbatean satanists coupled with Illuminati elements, who are especially savvy in all this NWO insider knowledge. They already worship Lucifer, god of the NWO. They have long been abducting/breeding innocent victims and sacrificing on their altars and nailing them to crosses as sacrifices to OBTAIN POWER FROM LUCIFER TO BRING FORTH HIS/THEIR NWO WORLD ORDER AGENDA. Even as I have documented for many years in my previous reports, SATANISM IN AMERICA TODAY. And so have other independent researchers and former insiders. Such people as described above also cannot wait for Christians to be arrested under martial law and beheaded or taken to prisoner boxcars to be transported to the camps for elimination (Bolshevik style), because we indeed stand in the way of Lucifer's NWO agenda.I know, because former Illuminati (Rothschilds to be exact) TOLD me so. And the above questions must now be asked, with many of your NWO agenda supporting friends (DUAL CITIZENSHIP) Jay Cohen, Steve, Paul and others who are remaining in power in HOMELAND SECURITY. We realize that the many detention camps will be used extensively under the future MARTIAL LAW NWO CONQUEST for America. We have been informed that many of them are actual termination camps. We have been told by insiders that they will be used to TERMINATE RESISTERS OF THE NWO. And according to former CIA and other insider sources, CHRISTIANS rank high on the lists to be arrested and executed in such camps, EVEN AS CHRISTIANS were arrested and tortured, sent to camps and executed under a PREVIOUS Illuminati/Sabbatean takeover of RUSSIA under Jewish Bolshevik communism. Their gulags remain to this day, and so do vivid accounts of their former Christian victims who are still alive today. Tens of millions of Christians did NOT survive the horrors of the gulags and the high percentage of admitted Jewish capos and torturers and inquisitioners under BOLSHEVIK COMMUNISM.And your background, Mr. Chertoff, is decidedly both Slavic and Jewish. Could there possibly be a reason why, at this critical hour of America's destiny, there are so MANY other NWO-supporting dual-citizenship Jews as well at HOMELAND SECURITY? Am I and my fellow Christian NWO resisters destined and doomed to become just ONE MORE SACRIFICE TO LUCIFER on the altars of world globalist communism,to bring down your NEW WORLD ORDER agenda you have previously labored so hard to bring America under??? These are serious questions that must be asked in this hour when it becomes more and more apparent that America is being led down the slippery (no, FATAL) slope of THE NEW WORLD ORDER AGENDA. The NWO is simply WORLD GLOBALIST COMMUNISM repackaged with newer terms, but the same terrifying agenda. And it involves the same distinct people groups funding and backing the war against Christianity and America's Christian heritage. You see, my direct ancestors were Mayflower Pilgrims (the Aldens.) My Christian ancestors fought in the American Revolution. They were circuit riding Christian preachers in New England. I know my Christian heritage of this nation my ancestors founded to become A NATION UNDER GOD...and NOT under Lucifer father of the NEW WORLD ORDER! Actually, due to my type of background and years of investigative research, I already know the answers to the above questions. I also fully realize where my brand of honest, forthright reporting and truth-telling will eventually take me. But for the benefit of my endangered fellow Americans and Christians as well, I am once again bringing the painful hidden truth to the forefront. WILL you laugh, Mr. Chertoff and your NWO agenda/DUAL CITIZENSHIP friends? Because somehow, this is not a laughing matter for millions of us Patriotic Americans and Christians in America whose lives now clearly stand in the balance. -Pamela Schuffert", 
        "intTime": 20090316, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"WIll You LAUGH, Mr. Chertoff, As Patriotic Americans Are ARRESTED Under MARTIAL LAW in America?\" by Pamela Schuffert presenting investigative journalism from a Christian perspective [Forward-Although another Presidential Administration is now in office under OBAMA, and a new secretary is now in power over HOMELAND SECURITY, I noted with great interest in news articles stating that most of the PREVIOUS STAFF (DUAL CITIZENSHIP)IN HOMELAND SECURITY remain in place under this administration change. People have been very carefully screened and preselected to be in charge of Homeland Security. ONLY those people groups/types who are in full agreement with the coming NWO AGENDA, and are willing to go after the kinds of people groups they will target for ARREST and being TAKEN TO THE FEMA CAMPS, can be trusted to be in power at HOMELAND SECURITY. Chertoff (DUAL CITIZENSHIP)has worked furiously throughout the past years for the realization of a NWO (communist/globalist)agenda for America.Christians are traditionally targeted under every communist takeover worldwide, to be quickly taken to the camps and eliminated as true threats to godless/antichrist NWO communist agendas. So are Patriotic citizens. This is how the FEMA/Homeland Security camps will be utilized in the future of \"Amerika\" under martial law and the NEW WORLD ORDER. For this reason, I am leaving this post up. Nothing has changed regarding FUTURE NWO AGENDA and dual citizenship people at HOMELAND SECURITY.-Pamela Schuffert] ******************************* Will you laugh, Mr. Chertoff (DUAL CITIZENSHIP)and fellow NWO agenda supporters at HOMELAND SECURITY, as hapless Patriots, Christians, and other various NWO resisters are arrested and eliminated to bring down your cherished NEW WORLD ORDER under martial law? Will YOU join with millions of other people of NWO mindset, who will laugh at the apparent naivete of the Christians in America, as the modern guillotines we have documented are finally brought forth to BEHEAD THE OFFENDERS OF THE DISTINCTLY JEWISH NOAHIDE LAWS, \"offenders\" being the Christians of America (and the WORLD)??? Do you JOIN with certain OTHER people (DUAL CITIZENSHIP)at HOMElAND SECURITY and elsewhere, who are already lusting for the hour of Christians and Patriots being rounded up under martial law, to be brutally thrown into UN/FEMA prisoner boxcars with shackles AND your UN/Noahide Laws guillotines installed in many, to be terminated as NOAHIDE LAW breakers and NWO resisters? Former NWO adherents have already exposed the sad fact that SATANISM/Illuminism/Sabbateanism IS the \"religion\" undergirding the coming NEW WORLD ORDER (world globalist communism repackaged, with it's roots in the ILLUMINATI and the ROTHSCHILDS.) Former Illuminati and CIA members I have personally interviewed, informed me frankly that EVERY PERSON AND CHRISTIAN ARRESTED AND SENT TO THE CAMPS or BEHEADED IS GOING TO COUNT IN THEIR MINDS as \"ONE MORE SACRIFICE TO SATAN\" to obtain power to bring forth SATAN'S NEW WORLD ORDER on the earth. This is already revealed in THE BOOK OF REVELATION in the Christian Bible. Chapter 13 specifically addresses the Satanists/Illuminists who WORSHIP THE DRAGON, SATAN/LUCIFER, who in return GIVES POWER TO \"THE BEAST\" of the NEW WORLD ORDER AGENDA. \"And men worshipped THE DRAGON, who gave POWER TO THE BEAST [NWO.]\" The DRAGON is LUCIFER/Satan. Who worships SATAN, but SATANISTS. And HOW is he primarily worshipped? BY HUMAN SACRIFICE! I should know. My famous USAF father got recruited into the NWO agenda in the US military, and into it's horrific \"religion,\" hard-core satanism/Illuminism. Such satanism is in fact rampant through the four branches of the US military. It is rampant throughout alphabet soup agencies working feverishly to bring down the NWO, like the CIA. Those of us who have fought this curse in our own homes are not deceived as other Americans are, Mr. Chertoff. We KNOW the horrible truth FROM THE INSIDE. In fact, Mr. Chertoff, my own father would come home from the PENTAGON, breathing out the hate rhetoric the NWO agenda instilled into him there, making statements like, \"EVERYONE who BELIEVES IN GOD should be sent to concentration camps!\" Hmmm. How very communist/world globalist sounding.Could he have been referring to FEMA and HOMELAND SECURITY camps he knew about already from inside the US military/Pentagon? I believe now that he was indeed. My CIA contacts made it plan that they used to sit around discussing \"HOW THE HECK DO WE TERMINATE THE RESISTERS OF OUR NWO AGENDA?\" And their conclusion from within the CIA: TO FUND AND BUILD THE DETENTION CAMPS which many investigative journalists have been exposing and reporting on. \"We in the CIA planned to count every person terminated in those camps as ONE MORE SACRIFICE TO SATAN to get power to BRING DOWN OUR NEW WORLD ORDER AGENDA....\" And more than one former CIA source admitted that CHRISTIANS RANKED HIGH ON THE LIST to be arrested and terminated in the camps. \"We satanists knew that Christians would never accept our NEW WORLD ORDER. Satan/Lucifer is the leader, and we satanists/(Luciferians/Illuminati/Sabbateans) are the backbone, and hence we knew THE CHRISTIANS WOULD HAVE TO BE TERMINATED....\" And these NWO satanists are right. We Christians never WILL accept the accursed NWO agenda.Period. My beloved personal friend, former CIA/ONI turned whistleblower,Michael Maholy, agreed. \"Oh, ALL OF US in the CIA know about the DETENTION CAMPS and their purposes. WE ALL KNEW they would be used to TERMINATE THE 'RESISTERS OF THE NEW WORLD ORDER' as it came down in America under MARTIAL LAW...\" Former CIA and former satanists I have interviewed nationwide for over 13 years now have all basically concurred with this evaluation of the NWO agenda from the inside. Amazingly, so does the WORD OF GOD, the BIBLE, especially the BOOK OF REVELATION. The SAME Book of Revelation that surprisingly also refers to certain elements within the Jewish community of \"JEWS OF THE SYNAGOGUE OF SATAN.\" Certainly not ALL, of course, but admittedly SOME. There are satanists/Illuminati elements included in every people and ethnic group. And that certain element of Jews tragically involved in Sabbatean/Iluminati satanism, help to form the backbone of the NEW WORLD ORDER or world globalist \"kill the Christians\" communism. Mr. Chertoff, I am only reiterating the above for the benefit of naive Americans and Christians whom NWO agenda promoters like you have been able to successfully keep in the dark regarding your NWO black ops these many years, through news media bias/blackout etc. You and your fellow NWO supporters in your communities know exactly what I am talking about. You in fact have been among the perpetrators and the planners of this NWO (world globalist communist) agenda for my nation, Mr. Chertoff. Especially with your assistance in robbing Americans of their cherished freedoms through PATRIOT ACT I and II. Having studied communism in order to work with Russian Jews and Russian Christians for years, I know about communism and what was imposed on the people of the former Soviet Union. I noted carefully how much of your PATRIOT ACT laws sounded suspiciously like they were taken directly from oppressive COMMUNIST legislation that provided for the persecution of many, including political and religious dissidents. I have previously reported, through my interviews with Jewish contacts providing insider revelations, how many in the Jewish communities of America are already laughing at the future fate planned against the Christians of this nation. Many are making statements throughout the Jewish communities of America ( and I suppose the world) like, \"NOW it is THE CHRISTIANS' TURN to be sent to the camps!\" I don't think you will ever understand the piercing pain in my heart, as my Jewish friends from NYC and elsewhere relay this kind of saddening information to me. I don't think you and your fellow NWO agenda Jews realize how many Christians in America genuinely love the Jewish community, are praying for the peace of Jerusalem, are providing millions of American Christian tourist dollars to Israel annually, and are giving their own sons to fight Israel's battles in the Middle East. And I have been among the above. And are you joining with others in secretly laughing about Christian ignorance in general regarding the millions of modern guillotines in many of our US military bases, and also some UN/NWO prisoner boxcars with shackles as well? Who in the Jewish communities of the world and America does not realize how the NOAHIDE LAWS will bring forth the massive nationwide/worldwide EXECUTIONS BY BEHEADING of Christian \"offenders\" of the NOAHIDE LAWS, as they refuse to renounce their cherished faith in JESUS CHRIST AS DIVINE and GOD IN THE FLESH (Immanuel)??? All of this presents a very sad picture of how the Jews reward those Christians in America who have stood in defense of Israel and the Jews...with guillotines, boxcars and shackles, and NWO termination camps. How disturbing. And perhaps revealing. I stand proudly among those Christians endangered now by your NWO communist agenda for my nation, America, Mr. Chertoff. Frankly, there are not enough modern guillotines in the world to destroy our faith in the Messiah you have rejected, Yahshua Ha'Mashiach, ha kadosh Baruch HU. There are not enough FEMA/HOMELAND SECURITY deathcamps to be found throughout this continent which can suffice to purge our Christian faith in the Living God and His Messiah off the face of this earth under the decidedly Jewish antichrist world globalist agenda. Since the NEW WORLD ORDER is in fact a worldwide WAR AGAINST Jesus the Messiah and His devout followers, LET me therefore be arrested, shackled into your boxcars and taken to the camps to be terminated for my faith...LET me be beheaded under your Noahide Laws for the Divine One Who suffered and died for His people and the sins of the WHOLE WORLD. GIVE ME the honor of my blood being shed with the saints of Messiah throughout the centuries who refused to DENY HIS NAME BEFORE MEN, and who suffered brutal persecution, torture, crucifixion, and death for my Savior.GIVE me the privilege of wearing the martyr's crown in heaven with my Savior, Jesus Christ. In fact, let me openly break the NOAHIDE LAWS before all the world, and state without apology on this blog, that Jesus Christ/Yahshua Ha'Mashiach IS Divine, IS the promised Messiah (and ONLY one)and Is, as the Jewish prophet Isaiah declared of the Messiah, \"...The mighty God, the everlasting Father, the PRINCE OF PEACE\" and Immanuel, \"GOD WITH US.\" He is GOD IN THE FLESH, and NO man comes to God EXCEPT THROUGH HIM. So, there...I have just broken two Noahide laws, those against \"blasphemy\" and \"idolatry\" by JEWISH Noahide Law definition, by stating my beliefs in the Messiah, Jesus Christ. ALL your Noahide Laws guillotines IN THE WORLD cannot change the eternal TRUTH about Jesus the Messiah, nor shake us from our faith in Him and obedience to God. Bring out the Lubavitcher guillotines.......because this is where we as Christians stand unapologized, worldwide. Besides, our Bible told us this was coming, in REVELATION 20:4. We have been told that Christians who refuse to deny Jesus Christ in order to join up with the satanic world government will be beheaded for their faith. Well, it's a dirty job, but somebody has to do it, I guess...how sad it has to be the Jews that so many Christians in America have naively loved and prayed for and supported. We as Christians in America will NEVER DENY HIS NAME to join your satanic world globalist communist NWO agenda. The perceptions of the NWO are quite accurate regarding us as Christians. And certainly for US, as Christian NWO resisters, the HOMELAND SECURITY/FEMA camps have been prepared and are waiting. More of us know than you think. And of course, there is that certain element within the Jewish community, the dark Jewish Sabbatean satanists coupled with Illuminati elements, who are especially savvy in all this NWO insider knowledge. They already worship Lucifer, god of the NWO. They have long been abducting/breeding innocent victims and sacrificing on their altars and nailing them to crosses as sacrifices to OBTAIN POWER FROM LUCIFER TO BRING FORTH HIS/THEIR NWO WORLD ORDER AGENDA. Even as I have documented for many years in my previous reports, SATANISM IN AMERICA TODAY. And so have other independent researchers and former insiders. Such people as described above also cannot wait for Christians to be arrested under martial law and beheaded or taken to prisoner boxcars to be transported to the camps for elimination (Bolshevik style), because we indeed stand in the way of Lucifer's NWO agenda.I know, because former Illuminati (Rothschilds to be exact) TOLD me so. And the above questions must now be asked, with many of your NWO agenda supporting friends (DUAL CITIZENSHIP) Jay Cohen, Steve, Paul and others who are remaining in power in HOMELAND SECURITY. We realize that the many detention camps will be used extensively under the future MARTIAL LAW NWO CONQUEST for America. We have been informed that many of them are actual termination camps. We have been told by insiders that they will be used to TERMINATE RESISTERS OF THE NWO. And according to former CIA and other insider sources, CHRISTIANS rank high on the lists to be arrested and executed in such camps, EVEN AS CHRISTIANS were arrested and tortured, sent to camps and executed under a PREVIOUS Illuminati/Sabbatean takeover of RUSSIA under Jewish Bolshevik communism. Their gulags remain to this day, and so do vivid accounts of their former Christian victims who are still alive today. Tens of millions of Christians did NOT survive the horrors of the gulags and the high percentage of admitted Jewish capos and torturers and inquisitioners under BOLSHEVIK COMMUNISM.And your background, Mr. Chertoff, is decidedly both Slavic and Jewish. Could there possibly be a reason why, at this critical hour of America's destiny, there are so MANY other NWO-supporting dual-citizenship Jews as well at HOMELAND SECURITY? Am I and my fellow Christian NWO resisters destined and doomed to become just ONE MORE SACRIFICE TO LUCIFER on the altars of world globalist communism,to bring down your NEW WORLD ORDER agenda you have previously labored so hard to bring America under??? These are serious questions that must be asked in this hour when it becomes more and more apparent that America is being led down the slippery (no, FATAL) slope of THE NEW WORLD ORDER AGENDA. The NWO is simply WORLD GLOBALIST COMMUNISM repackaged with newer terms, but the same terrifying agenda. And it involves the same distinct people groups funding and backing the war against Christianity and America's Christian heritage. You see, my direct ancestors were Mayflower Pilgrims (the Aldens.) My Christian ancestors fought in the American Revolution. They were circuit riding Christian preachers in New England. I know my Christian heritage of this nation my ancestors founded to become A NATION UNDER GOD...and NOT under Lucifer father of the NEW WORLD ORDER! Actually, due to my type of background and years of investigative research, I already know the answers to the above questions. I also fully realize where my brand of honest, forthright reporting and truth-telling will eventually take me. But for the benefit of my endangered fellow Americans and Christians as well, I am once again bringing the painful hidden truth to the forefront. WILL you laugh, Mr. Chertoff and your NWO agenda/DUAL CITIZENSHIP friends? Because somehow, this is not a laughing matter for millions of us Patriotic Americans and Christians in America whose lives now clearly stand in the balance. -Pamela Schuffert", 
        "threadID": "4960045241001_8120070812001", 
        "time": "2009-03-16 23:05:00", 
        "title": "The DUAL CITIZENSHIP People Who WILL KILL AMERICANS Under Martial Law", 
        "userID": "PamelaSchuffert"
    }, 
    {
        "content": "Man my eyes are getting tired from all this rolling...", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "Man my eyes are getting tired from all this rolling...", 
        "threadID": "4960045241001_8120070812001", 
        "time": "2009-03-17 07:28:00", 
        "title": "The DUAL CITIZENSHIP People Who WILL KILL AMERICANS Under Martial Law", 
        "userID": "JBL266"
    }
]