[
    {
        "content": "Given the ego and pride of Patton, I think a case could be made for insubordination, which would have possibly led to a Court Martial and a loss of rank, with possibly a less than honorable discharge, imprisonment, loss of pay and/or allowances, etc. Confronted with this ultimatum, I believe he would have kept his mouth shut, making assassination unnecessary.", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "", 
        "reply": "Given the ego and pride of Patton, I think a case could be made for insubordination, which would have possibly led to a Court Martial and a loss of rank, with possibly a less than honorable discharge, imprisonment, loss of pay and/or allowances, etc. Confronted with this ultimatum, I believe he would have kept his mouth shut, making assassination unnecessary.", 
        "threadID": "4960045241001_6550078902001", 
        "time": "2009-04-22 16:54:00", 
        "title": "OSS Responsible for Patton's Death?", 
        "userID": "20802653"
    }, 
    {
        "content": "quote: Originally posted by sullivan013: So for this to be true (which I don't believe for a second), the following must be true: President Truman would allow/order the killing of an egotistical outspoken Army four star general to silence his criticism in 1945 (Patton), but merely relieve from command an egotistical outspoken Army FIVE star general in 1951 (MacArthur). In the first instance, we had the bomb and the Soviet Union did not. In the second instance, the Soviets had the bomb as well. In the first instance, he chose an Army 2 1/2 ton truck as his instrument of death [insert Dr. Evil's incredibly slow dipping process joke] and the second he just met with the guy, told him to shut his trap and then relieved him the next time he said anything to the papers. Pull the other leg. Sullivan013 If Patton was indeed murdered by the OSS, they didn't need, nor did they seek Truman's advice or permission. Patton was a loose cannon and had to be eliminated by those who truly held the reigns of power in Washington. Patton was probably the most cerebral, the best read, and the most politically aware general in the US Army. After the war Patton stated that the Germans were the only decent people in Europe. That incurred the wrath of the propagandists in America who were portraying the Soviets as God's gift to the world. The US had expended thousands of American lives and billions of American dollars to help save communism from the evil fascists. The Bolsheviks had exterminated millions of people, including the holocaust of 6 to 7 million Ukranians with few Americans blinking an eye in protest. Patton understood this and was very vocal about his hatred for the Soviets and for Jews. Patton blamed the Jews for most of the ills in the world, and he predicted that the Jews would have the US at war again within five years after WWII ended. Those who have read Patton's biographies are well aware of Patton's attitude toward Jews. It's probably true that Eisenhower would never have been elected president if Patton had lived. Patton was without a doubt the most popular American alive in the early and mid-40's. After he was eliminated, the US was complacent in handing over eastern Europe to the USSR and enslaving millions. Would have never happened had Patton been alive.", 
        "intTime": 20090428, 
        "postID": 14, 
        "quote": "Originally posted by sullivan013: So for this to be true (which I don't believe for a second), the following must be true: President Truman would allow/order the killing of an egotistical outspoken Army four star general to silence his criticism in 1945 (Patton), but merely relieve from command an egotistical outspoken Army FIVE star general in 1951 (MacArthur). In the first instance, we had the bomb and the Soviet Union did not. In the second instance, the Soviets had the bomb as well. In the first instance, he chose an Army 2 1/2 ton truck as his instrument of death [insert Dr. Evil's incredibly slow dipping process joke] and the second he just met with the guy, told him to shut his trap and then relieved him the next time he said anything to the papers. Pull the other leg. Sullivan013", 
        "reply": " If Patton was indeed murdered by the OSS, they didn't need, nor did they seek Truman's advice or permission. Patton was a loose cannon and had to be eliminated by those who truly held the reigns of power in Washington. Patton was probably the most cerebral, the best read, and the most politically aware general in the US Army. After the war Patton stated that the Germans were the only decent people in Europe. That incurred the wrath of the propagandists in America who were portraying the Soviets as God's gift to the world. The US had expended thousands of American lives and billions of American dollars to help save communism from the evil fascists. The Bolsheviks had exterminated millions of people, including the holocaust of 6 to 7 million Ukranians with few Americans blinking an eye in protest. Patton understood this and was very vocal about his hatred for the Soviets and for Jews. Patton blamed the Jews for most of the ills in the world, and he predicted that the Jews would have the US at war again within five years after WWII ended. Those who have read Patton's biographies are well aware of Patton's attitude toward Jews. It's probably true that Eisenhower would never have been elected president if Patton had lived. Patton was without a doubt the most popular American alive in the early and mid-40's. After he was eliminated, the US was complacent in handing over eastern Europe to the USSR and enslaving millions. Would have never happened had Patton been alive.", 
        "threadID": "4960045241001_6550078902001", 
        "time": "2009-04-28 12:12:00", 
        "title": "OSS Responsible for Patton's Death?", 
        "userID": "Misanthrope2"
    }
]