[
    {
        "content": "ET's, Mile-Length ET Crafts, Strange sightings at Top Secret Nuclear Facilities, Abductions, Existence Cover-ups, Gary Mckinnon Case, Rise of Cyber-Militias/Foot-Militias worldwide, Hollywoods portrayal of our Visitors, Missile Sabotage by UFO's to secret groups within the government permitting attacks against UFO's. Our Visitors don't speak to communicate, rather they communicate through Symbolism by occupying our skies, abductions, and by disarmament of Nuclear Missiles stored in military bases across the globe. They, as in many Civilizations, come here, unarmed to help the world disarm itself from our own destruction. Every ET craft or UFO that had been fired upon never retaliated, instead, pulled miraculous speeds and maneuvers, disappearing into the sky. Some have even jammed the radars of pursuing pilots of armed jet fighters to defend themselves. What do these reports of pursuit and Take down ET Crafts hovering our skies symbolize? Domination and The Lust for Harvesting and Utilize Alien Technology to create *DeathTech. DeathTech meaning, WMD's. Possibilities for the Technology we have of theirs will not be made use for the benefit of every day life, instead, spend an untold number of years to research ways to take lives than to help give it. Sadly, they continue to tread this path by continuing their production patterns. We are destined for self destruction. Are we still primitive? That question is asked a countless number of times and the answer is, Yes. Primitive not as in the caveman times, but as in the way we have dealt with things through history. Examples, Conquering/claiming/taking of ones territory, and on the rise,\"The need to take,Territory in Space\". Our actions are primitive and that pertains to the way we use Technology. It is the thought of \"If we can't have, We take it\" and \"Destroy anything that we fail to understand\". Through the years we have done that to our planet, but space remained calm except the booms from dieing stars. Conflicts were made on earth, but in space, civilizations made no conflicts. Now in our age, our quest to weaponize space is about to change things for the worst. There are other civilizations that Occupy Space, not just us; however, they are what is keeping the peace out there. As humans, we see peace through a treaty, a signature on paper. If that fails, we force it. The label Violent remains permanent below the title Human and to some of us it still lies there, at a dormant state. So have we made ourselves unwelcome in this universe to continue on with the rest to travel across the stars, into a gateway that branches another Universe so that we live on when our Current Universe reaches that 5th Era? The answer is Yes. Until we prove and break sweat for achieving true peace by eliminating all of the worlds WMD's. It is obvious why they keep the eye over us, why sightings are so common upon the people. Our actions show them that we are violent and for that, I am nowhere near in a Proud state of mind. The Weaponization of Space is Unnecessary and is disruption to the peace within our neighbors lightyears away from us. Why are mass numbers of witnesses afraid to go public with their story? It is the fear of Ridicule. People who host at Fox News air a legit sighting, then get a chuckle here and there. It's the feeling that nobody will believe you, and you could lose your job, possibly lose your wife, and like one man, had all that happen to him, plus the burning of his house. What in the Human mind thinks that we are the only, walking, living things that occupy the universe? After wall, we were all created from Space Dust. The Iron, ect. It can be found in Star Nurseries. People whom have been abducted, or have seen a legit UFO that should by common sense be considered alien, have been laughed at to the point where all is lost. Lets break it down shall we? Referring back up to what I had just mentioned fear of ridicule. Abductees and Ufo Witnesses who want to believe are not the crazy ones. They are not ignorant like the rest. Facts show hundreds upon thousands of evidence in reports. Most of which contain key recordings, like Holts recording at Rendlesham forest. The indentations the craft left after taking off and the radiation levels that were recorded there. Ignorant debunkers and skeptics have made no succession in legit UFO sightings. Notice they don't leave their name on their claims on what it might be, example, Weather balloon/Flare attached together theory because they are afraid of backfire. To even think most of us have absolutely no common sense to pass off a theory so adolescent, unsophisticated, brainless, dumb, idiotic and moronic claim like Flares and Weather balloons tied together to take triangle formation also takes someone whom is beyond feeble-minded. That theory was tested and their flare/Weather balloon theory was swept away like a Tsunami hitting a wasp head on. The lighthouse theory of one of the many incidents at Rendlesham Forest was proven absurd due to the light being 3 miles away from the farmhouse and the intensity of the glow and only had aim out towards the sea because of the metal plating, not enough to be compared to what was seen, in addition to that, was nowhere near the line of sight that the UFO appeared at. Second, A lighthouse does not glow red like this did, and third, a lighthouse cannot in any way speed off to the farmhouse, shoot a beam down, then explode into 5 other miniature orbs and takeoff at unimaginable speeds you. If someone believes that a lighthouse can do that, please go hide yourself when disclosure day comes. That there is the first piece of bread with cheese, ham and mayo. We are almost there, Second incident. The Triangle ufo, glowed intensely, it left a strong static charge the witnesses said as he touched the side of the craft, then, it took off at extreme speeds through the forest floor then shot off in the sky. In 1980 there were no craft with that capability and there are not today no matter how secret you want to call the military's air projects. It left \"three depressions 1 1/2\" deep and 7\" in diameter were found where the object had been sighted on the ground. The following night (29 Dec 80) the area was checked for radiation. Beta/gamma readings of 0.1 milliroentgens were recorded with peak readings in the three depressions and near the center of the triangle formed by the depressions. A nearby tree had moderate (.05 - .07) readings on the side of the tree toward the depressions. \" You see, witnesses are like bits and pieces of a broken key, you get all of them and mold them together, you are only a couple steps away from unlocking the secret. It helps if whomever you are come forward. We are not weird, we just have more common sense to realize what things really are and what they are not. We can differentiate better. Why should witnesses be afraid when Debunkers debunking the truth don't have the balls to publish a theory that would take a mere five year old to think up in their name. If you feel you have to do so, just every one of you deniers prepare for your day of ridicule when disclosure comes to full effect. I surely hope suicide rises amongst them from daily humiliation. I, as a strong Gary McKinnon supporter, will say this,\"You can't hide a secret forever, and if you continue to do so there will be an increase of people with knowledge compared to him. Cyber Militias will be on the rise and a matter of time Riots/Foot Militias will run a muck, and the agenda will be \"The Freedom to Know\". I strongly suggest, as one person and maybe many others, that you do not weaponize their technology or even try to, no matter whose hands it is in. Nuclear weapons are bad enough as it is in ANYBODIES hands. It has been proven that Intelligent Civilizations that have advanced rapidly are on a quick trip for their own destruction. Including Stupid Decisions and Primitive ways.", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "ET's, Mile-Length ET Crafts, Strange sightings at Top Secret Nuclear Facilities, Abductions, Existence Cover-ups, Gary Mckinnon Case, Rise of Cyber-Militias/Foot-Militias worldwide, Hollywoods portrayal of our Visitors, Missile Sabotage by UFO's to secret groups within the government permitting attacks against UFO's. Our Visitors don't speak to communicate, rather they communicate through Symbolism by occupying our skies, abductions, and by disarmament of Nuclear Missiles stored in military bases across the globe. They, as in many Civilizations, come here, unarmed to help the world disarm itself from our own destruction. Every ET craft or UFO that had been fired upon never retaliated, instead, pulled miraculous speeds and maneuvers, disappearing into the sky. Some have even jammed the radars of pursuing pilots of armed jet fighters to defend themselves. What do these reports of pursuit and Take down ET Crafts hovering our skies symbolize? Domination and The Lust for Harvesting and Utilize Alien Technology to create *DeathTech. DeathTech meaning, WMD's. Possibilities for the Technology we have of theirs will not be made use for the benefit of every day life, instead, spend an untold number of years to research ways to take lives than to help give it. Sadly, they continue to tread this path by continuing their production patterns. We are destined for self destruction. Are we still primitive? That question is asked a countless number of times and the answer is, Yes. Primitive not as in the caveman times, but as in the way we have dealt with things through history. Examples, Conquering/claiming/taking of ones territory, and on the rise,\"The need to take,Territory in Space\". Our actions are primitive and that pertains to the way we use Technology. It is the thought of \"If we can't have, We take it\" and \"Destroy anything that we fail to understand\". Through the years we have done that to our planet, but space remained calm except the booms from dieing stars. Conflicts were made on earth, but in space, civilizations made no conflicts. Now in our age, our quest to weaponize space is about to change things for the worst. There are other civilizations that Occupy Space, not just us; however, they are what is keeping the peace out there. As humans, we see peace through a treaty, a signature on paper. If that fails, we force it. The label Violent remains permanent below the title Human and to some of us it still lies there, at a dormant state. So have we made ourselves unwelcome in this universe to continue on with the rest to travel across the stars, into a gateway that branches another Universe so that we live on when our Current Universe reaches that 5th Era? The answer is Yes. Until we prove and break sweat for achieving true peace by eliminating all of the worlds WMD's. It is obvious why they keep the eye over us, why sightings are so common upon the people. Our actions show them that we are violent and for that, I am nowhere near in a Proud state of mind. The Weaponization of Space is Unnecessary and is disruption to the peace within our neighbors lightyears away from us. Why are mass numbers of witnesses afraid to go public with their story? It is the fear of Ridicule. People who host at Fox News air a legit sighting, then get a chuckle here and there. It's the feeling that nobody will believe you, and you could lose your job, possibly lose your wife, and like one man, had all that happen to him, plus the burning of his house. What in the Human mind thinks that we are the only, walking, living things that occupy the universe? After wall, we were all created from Space Dust. The Iron, ect. It can be found in Star Nurseries. People whom have been abducted, or have seen a legit UFO that should by common sense be considered alien, have been laughed at to the point where all is lost. Lets break it down shall we? Referring back up to what I had just mentioned fear of ridicule. Abductees and Ufo Witnesses who want to believe are not the crazy ones. They are not ignorant like the rest. Facts show hundreds upon thousands of evidence in reports. Most of which contain key recordings, like Holts recording at Rendlesham forest. The indentations the craft left after taking off and the radiation levels that were recorded there. Ignorant debunkers and skeptics have made no succession in legit UFO sightings. Notice they don't leave their name on their claims on what it might be, example, Weather balloon/Flare attached together theory because they are afraid of backfire. To even think most of us have absolutely no common sense to pass off a theory so adolescent, unsophisticated, brainless, dumb, idiotic and moronic claim like Flares and Weather balloons tied together to take triangle formation also takes someone whom is beyond feeble-minded. That theory was tested and their flare/Weather balloon theory was swept away like a Tsunami hitting a wasp head on. The lighthouse theory of one of the many incidents at Rendlesham Forest was proven absurd due to the light being 3 miles away from the farmhouse and the intensity of the glow and only had aim out towards the sea because of the metal plating, not enough to be compared to what was seen, in addition to that, was nowhere near the line of sight that the UFO appeared at. Second, A lighthouse does not glow red like this did, and third, a lighthouse cannot in any way speed off to the farmhouse, shoot a beam down, then explode into 5 other miniature orbs and takeoff at unimaginable speeds you. If someone believes that a lighthouse can do that, please go hide yourself when disclosure day comes. That there is the first piece of bread with cheese, ham and mayo. We are almost there, Second incident. The Triangle ufo, glowed intensely, it left a strong static charge the witnesses said as he touched the side of the craft, then, it took off at extreme speeds through the forest floor then shot off in the sky. In 1980 there were no craft with that capability and there are not today no matter how secret you want to call the military's air projects. It left \"three depressions 1 1/2\" deep and 7\" in diameter were found where the object had been sighted on the ground. The following night (29 Dec 80) the area was checked for radiation. Beta/gamma readings of 0.1 milliroentgens were recorded with peak readings in the three depressions and near the center of the triangle formed by the depressions. A nearby tree had moderate (.05 - .07) readings on the side of the tree toward the depressions. \" You see, witnesses are like bits and pieces of a broken key, you get all of them and mold them together, you are only a couple steps away from unlocking the secret. It helps if whomever you are come forward. We are not weird, we just have more common sense to realize what things really are and what they are not. We can differentiate better. Why should witnesses be afraid when Debunkers debunking the truth don't have the balls to publish a theory that would take a mere five year old to think up in their name. If you feel you have to do so, just every one of you deniers prepare for your day of ridicule when disclosure comes to full effect. I surely hope suicide rises amongst them from daily humiliation. I, as a strong Gary McKinnon supporter, will say this,\"You can't hide a secret forever, and if you continue to do so there will be an increase of people with knowledge compared to him. Cyber Militias will be on the rise and a matter of time Riots/Foot Militias will run a muck, and the agenda will be \"The Freedom to Know\". I strongly suggest, as one person and maybe many others, that you do not weaponize their technology or even try to, no matter whose hands it is in. Nuclear weapons are bad enough as it is in ANYBODIES hands. It has been proven that Intelligent Civilizations that have advanced rapidly are on a quick trip for their own destruction. Including Stupid Decisions and Primitive ways.", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-11 13:57:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "iError_SyS7yM_7Hr347"
    }, 
    {
        "content": "", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-12 07:58:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "JBL266"
    }, 
    {
        "content": "Nothing personal: I peer at the first typical response. An internet Emoticon of <Rolling the Eyes>. Do you see me as a nutcase because I support Genuine and Cold hard evidence? Cases that you bring to your dear dear president of yours and he is speechless on the topic. It seems still that you would rather panic about this \"Small\" life's Reputation with people whom on the contrary know absolutely nothing but the basic 1+1 and have that impenetrable wall blocking them from mind expansion? Whom think if they see it they believe it. Documents people, Documents. Does not take a doltish person to figure that out. #2: ZPEnergy: It IS a Foreign Technology not of Human Origin, And is this overstepping going to cause Global Chaos? Lets start out with ZPEnergy or Zero Point Energy. Now don't act as if we found out about that because we are just intelligent. Einstein, should be the definition of intelligent, and there was only one of him. Here is a letter on this Zero Point Energy that scientist \"Claim\" that hey found out. Other than what was truly supposed to be said as \"Reverse Engineered\" on a craft that is not meant for us \"To Begin With\". Kiril Chukanov writes: Hi Feng Hsu, Hi to all my friends, I'm forced to go into the \"dark world\" for while, I'm in trouble. Some dark forces are not happy with my practical successes on harnessinf of Quantum Free Energy from artificially created giant ball lightning. Whatever happens with me, remember me and remember my words: Quantum Free Energy is the future major energy source on our planet. Mother Nature is very economic, it gave to the human race only four major energy sources:mechanical energy (water fall, wind, heat, our muscles, etc.), chemical energy (wood, coal,gas, oil,...), nuclear energy, and quantum free energy. Quantum Free Energy is the last gift from God to the Human Race: unlimited source of safe, inexpensive, no fuel or any other primary energy source, no hazardous by-products or dangerous emissions, multiple practical applications, energy source. Unfortunately QFE could become apocalyptic for the Human race energy if used as weapon of mega-mass destruction. All people on our planet must unite their efforts to avoid this sinister possibility. QFE is given to us ONLY for peaceful applications and to make life of all human beings paradise. Big Oil and other energy monsters are not happy with the perspective to lose their mega-business, so, they are trying to stop the process of change of the existing major energy sources. However nobody, no money, can stop the Progress. Best wishes and good health to all of you. Kiril Chukanov \"www.chukanovenergy.com\" See also: \"www.freeenergynews.com/Directory/Chukanov/#Latest\" The humorous thing I find about this subject, all these hybrid cars. Running off what exactly? Water. We are having to pay off mass amounts of money to go into hydro fueled cars because of our fuel crisis. There is \"No\" Ands, ifs, or buts about this. It is right there, on the news,\"Hydro Cars: THE FUTURE!\" Look below for details. FFS, Don't be lazy, Type it in google, I'd give you some credit and cut you some slack if one had lost both hands or all fingers. *Nov 17, 2008 ... Hydrogen: The Fuel of the Future. Will It Always Be Thus? by Richard T. Stuebi For years, the utopian vision for powering humankind's energy ... *Atomic energy used to charge chemical batteries to run short-ranged electric cars does not sound like the wave of the future. Hydrogen fuel does. ... Dec 7, 2004 ... Solar power these days comes from cells that turn light into electricity, but researchers are now working on materials that can crank out ... The hydrogen fuel cell car is gaining speed. Learn more. Our Hydrogen Future in Action Take a look at the Hydrogen Highway and the Hydrogen Village. ... Hydrogen burns clean and nearly everyone agrees that running vehicles with hydrogen fuel cells instead of oil would be a great step forward for the ... Jan 21, 2009 ... Making and distributing hydrogen fuel is the long pole in the tent, ... engines are the interim step to an all-electric vehicle future. ... Now what is this telling us? Hey, hydrogen cars is the future. Now that we got witnesses from NASA and other parts of the military they start explaining this Zero Point Energy being part of the Alien Technology recovered. Hold up Hold up. I thought This was supposed to be the Hydrogen age! Everybody was ****ting bricks about hydrogen cars, but now, out of the blue, coming from a National UFO Press Conference, they explain this Zero Point Energy. Now that's got everyone ****ting limestones the size of boulders! If anyone here has a brain cell among them, they will tell me, \"Hey, you got a solid point there. There must be something going on behind government curtains!\" Zero point energy is Alien technology that we would love to have. It is an \"Infinite Battery\". But you also know what that means, Oil companies will collapse and well, ****, all economic corporations that are based on energy are going to fall. Eventually sending the world into ****. We all love free energy, but it is not our time and by each step we take on technological advancement there is going to be a consequence. Overstepping years upon thousands of years within our knowledge is a behemothic crisis waiting to happen. You think our economic situation right now is bad? Wait until the fall of Gas and Oil Corporations, electric power, and anything to do with energy. Come on, I'm not even in the military working with intelligence or a DoD spook. I just know many computer languages of the various amounts, I wide thinker, and enjoy the knowledge of knowing that we have made contact with some form of life out there. In the future, post any links as I have modified the ones above. Hot links/direct links aren't allowed. Welcome to the discussions. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Thu 12 March 2009 08:36 PM", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "", 
        "reply": "Nothing personal: I peer at the first typical response. An internet Emoticon of <Rolling the Eyes>. Do you see me as a nutcase because I support Genuine and Cold hard evidence? Cases that you bring to your dear dear president of yours and he is speechless on the topic. It seems still that you would rather panic about this \"Small\" life's Reputation with people whom on the contrary know absolutely nothing but the basic 1+1 and have that impenetrable wall blocking them from mind expansion? Whom think if they see it they believe it. Documents people, Documents. Does not take a doltish person to figure that out. #2: ZPEnergy: It IS a Foreign Technology not of Human Origin, And is this overstepping going to cause Global Chaos? Lets start out with ZPEnergy or Zero Point Energy. Now don't act as if we found out about that because we are just intelligent. Einstein, should be the definition of intelligent, and there was only one of him. Here is a letter on this Zero Point Energy that scientist \"Claim\" that hey found out. Other than what was truly supposed to be said as \"Reverse Engineered\" on a craft that is not meant for us \"To Begin With\". Kiril Chukanov writes: Hi Feng Hsu, Hi to all my friends, I'm forced to go into the \"dark world\" for while, I'm in trouble. Some dark forces are not happy with my practical successes on harnessinf of Quantum Free Energy from artificially created giant ball lightning. Whatever happens with me, remember me and remember my words: Quantum Free Energy is the future major energy source on our planet. Mother Nature is very economic, it gave to the human race only four major energy sources:mechanical energy (water fall, wind, heat, our muscles, etc.), chemical energy (wood, coal,gas, oil,...), nuclear energy, and quantum free energy. Quantum Free Energy is the last gift from God to the Human Race: unlimited source of safe, inexpensive, no fuel or any other primary energy source, no hazardous by-products or dangerous emissions, multiple practical applications, energy source. Unfortunately QFE could become apocalyptic for the Human race energy if used as weapon of mega-mass destruction. All people on our planet must unite their efforts to avoid this sinister possibility. QFE is given to us ONLY for peaceful applications and to make life of all human beings paradise. Big Oil and other energy monsters are not happy with the perspective to lose their mega-business, so, they are trying to stop the process of change of the existing major energy sources. However nobody, no money, can stop the Progress. Best wishes and good health to all of you. Kiril Chukanov \"www.chukanovenergy.com\" See also: \"www.freeenergynews.com/Directory/Chukanov/#Latest\" The humorous thing I find about this subject, all these hybrid cars. Running off what exactly? Water. We are having to pay off mass amounts of money to go into hydro fueled cars because of our fuel crisis. There is \"No\" Ands, ifs, or buts about this. It is right there, on the news,\"Hydro Cars: THE FUTURE!\" Look below for details. FFS, Don't be lazy, Type it in google, I'd give you some credit and cut you some slack if one had lost both hands or all fingers. *Nov 17, 2008 ... Hydrogen: The Fuel of the Future. Will It Always Be Thus? by Richard T. Stuebi For years, the utopian vision for powering humankind's energy ... *Atomic energy used to charge chemical batteries to run short-ranged electric cars does not sound like the wave of the future. Hydrogen fuel does. ... Dec 7, 2004 ... Solar power these days comes from cells that turn light into electricity, but researchers are now working on materials that can crank out ... The hydrogen fuel cell car is gaining speed. Learn more. Our Hydrogen Future in Action Take a look at the Hydrogen Highway and the Hydrogen Village. ... Hydrogen burns clean and nearly everyone agrees that running vehicles with hydrogen fuel cells instead of oil would be a great step forward for the ... Jan 21, 2009 ... Making and distributing hydrogen fuel is the long pole in the tent, ... engines are the interim step to an all-electric vehicle future. ... Now what is this telling us? Hey, hydrogen cars is the future. Now that we got witnesses from NASA and other parts of the military they start explaining this Zero Point Energy being part of the Alien Technology recovered. Hold up Hold up. I thought This was supposed to be the Hydrogen age! Everybody was ****ting bricks about hydrogen cars, but now, out of the blue, coming from a National UFO Press Conference, they explain this Zero Point Energy. Now that's got everyone ****ting limestones the size of boulders! If anyone here has a brain cell among them, they will tell me, \"Hey, you got a solid point there. There must be something going on behind government curtains!\" Zero point energy is Alien technology that we would love to have. It is an \"Infinite Battery\". But you also know what that means, Oil companies will collapse and well, ****, all economic corporations that are based on energy are going to fall. Eventually sending the world into ****. We all love free energy, but it is not our time and by each step we take on technological advancement there is going to be a consequence. Overstepping years upon thousands of years within our knowledge is a behemothic crisis waiting to happen. You think our economic situation right now is bad? Wait until the fall of Gas and Oil Corporations, electric power, and anything to do with energy. Come on, I'm not even in the military working with intelligence or a DoD spook. I just know many computer languages of the various amounts, I wide thinker, and enjoy the knowledge of knowing that we have made contact with some form of life out there. In the future, post any links as I have modified the ones above. Hot links/direct links aren't allowed. Welcome to the discussions. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Thu 12 March 2009 08:36 PM", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-12 18:40:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "iError_SyS7yM_7Hr347"
    }, 
    {
        "content": "I'm also slowly twirling my index finger in a circular motion by my right temple.", 
        "intTime": 20090314, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'm also slowly twirling my index finger in a circular motion by my right temple.", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-14 10:28:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "JBL266"
    }, 
    {
        "content": "cue Twilight Zone music....", 
        "intTime": 20090314, 
        "postID": 5, 
        "quote": "", 
        "reply": "cue Twilight Zone music....", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-14 21:11:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "Obviousman"
    }, 
    {
        "content": "Junior's about to get his butt kicked for getting into daddy's stash...", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "", 
        "reply": "Junior's about to get his butt kicked for getting into daddy's stash...", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-23 19:24:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "Using hydrogen as a fuel is an alien invention? That would come as a surprise to François Isaac de Rivaz. He was the first to use hydrogen in an internal combustion engine. In 1806. Yes, the idea is that old. As an aside, gasoline wasn't invented until 1892 when it was first sold as.... a lice treatment for the scalp. Sullivan013", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "", 
        "reply": "Using hydrogen as a fuel is an alien invention? That would come as a surprise to François Isaac de Rivaz. He was the first to use hydrogen in an internal combustion engine. In 1806. Yes, the idea is that old. As an aside, gasoline wasn't invented until 1892 when it was first sold as.... a lice treatment for the scalp. Sullivan013", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-24 04:49:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: Originally posted by iError_SyS7yM_7Hr347 I error system threat", 
        "intTime": 20090324, 
        "postID": 8, 
        "quote": "Originally posted by iError_SyS7yM_7Hr347", 
        "reply": " I error system threat", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-03-24 15:45:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "CiviLegg"
    }, 
    {
        "content": "I was quite upset when a friend showed me testimonies about the Disclosure project, just hearing them say they were beaten. Are we being blindfolded into what is really happening in our country. I hope you did not take the harsh words to heart, we have no such growing problem. ------------------------------------------------------------------------------------------------------------ quote: Using hydrogen as a fuel is an alien invention? That would come as a surprise to François Isaac de Rivaz. He was the first to use hydrogen in an internal combustion engine. In 1806. Yes, the idea is that old. As an aside, gasoline wasn't invented until 1892 when it was first sold as.... a lice treatment for the scalp. Sullivan013 Let me say this back in an elucidate form. What is being said, today, is that we are just now on Hydrogen cars, or just cars depending on electricity itself. What I am trying to explain is \"Why are we working on Zero Point Energy\"? The \"Timely Evolution\" of this world and minds of the people has become a far-flung displacement in our technological advancement in time. The human mind can only go so far in our time. ------------------------------------------------------------------------------------------------------------ Deep down in every \"Authority Group\" or \"Figure\" that runs in every country, especially the US in particular, has had corruption. I am sure most members of the CIA, NASA, DoD, USAirforce, DNS and maybe a few members of the Military are quite familiar with the terms \"Black Budget\" or \"Black Operations\". Such as Crypto Clearances and different levels of the Need to Know which was only given to 25 people around the world and only 5 have been given the highest clearance, in which they can view any project kept secret. Seeing that this is the \"Actual\" military site, I would have expected someone to say,\"Yes I have seen things or people that look like they could have belonged to a Dark Secret.\" People have been beaten along with their families threatened just because A.) they were in the wrong place at the wrong time or B.) feel that the world needs to know of an extra-terrestrial presence, speaking words of \"Evidence of Alien Crafts\" and \"What happened in the Black Operation.\" [B]The Interesting Facts Daniel Sheenan: Legal Council for the Disclosure Project – I was contacted by Mrs. Marshal Smith, who was director of the “Science and Technology Division” of the “Congressional Research Service”. She asked to meet with me and I met with her and she informed me that President Carter, upon taking office in January 1977, held a meeting within the Director of Central Intelligence, who was George Bush Senior and demanded that the Director of Central Intelligence turn over to the President the classified information about Unidentified Flying Objects, and the information was in the possession of the United States Intelligence Community concerning the existence of “Extra Terrestrial Intelligence”. THIS INFORMATION WAS [U]REFUSED TO THE PRESIDENT OF THE UNITED STATES[/U] by the director of central intelligence, George Bush Senior. Remark to reporter “Sarah McLendon”:”Yeah, Sarah, if people find out what we’ve done, they’ll chase us down the street and lynch us” [U]George Herbert Walker Bush[/U] Lt. Col. Robert Salas: United States AirForce – SAC Launch OfficerEngineer We could not talk about this to anyone, including any of the other crews, our spouses, our family, even amongst each other. So, you could not discuss this at all. Sergeant Leonard Pretko: United States Air Force…then I’m gonna tell ya, they do ridicule me and I was ridiculed a few times. I was told I would never make Master Sergeant… Neil Daniels: Pilot-United States Air Force Captain United AirlinesThe pilots that had seen things and talked about them, some of them were gone, some of them were leased from their flying and treated as nutcases and things like that. Major George Filer III: United States Air Force – Deputy Director of IntelligenceAt times I used to carry Nuclear Weapons and as I was,[U] “Mentally fit to carry Nuclear Weapons”[/U] and [I][U]Not mentally fit when I see a UFO. [/U] And this criticism and this ridicule, as I think, done more to keep the story coming out than almost anything else[/I] Brigadier General Stephen Lovekin: National Guard JAG – Eisenhower White House…they have been discussed with me on numerous occasions. Talked about what could happen, to me Militarily and even what could happen if I discussed this as a civilian. Lt. Col. Joe Wojtecki: US Air Force – Strategic Air Command That subject was. Just dropped. It just wasn’t discussed Michael Smith: USAF – Aircraft Control / Early Warning Operation [U]Anything to Discredit you and we never get a promotion and spend the next 3 and a half years up at the North Pole living in a tent[/U] Prof. Robert Jacobs: USAF – Vandenberg Air Force Base I’ve made no money from this. I’ve got nothing but pain and suffering out of it from talking about it, I’ve been harassed at my home.[U]This was used against me partially losing a job once in teaching.[/U]I’ve had a hell’uv a time after I told this story, but I continue to tell the story [U]because I think it is important for people to understand, that this sort of s***! goes on in the government[/U] Phillip Corso Jr. – The Disclosure Project [U]He was sorry he wrote the book. He was sorry he exposed a family to the ridicule, to the lawsuits, it’s been tough on our “entire” family. He did not want to die leaving us with these problems. Just hope, future people such as yourself, will know what to do with this type of knowledge that this man brought forward. I do say that he is the first man to come forward with a high capacity.[/U] This patriot, Colonel Philip James Corso, died on July 16, 1998 [U]He is well remembered for standing up to the Giant that we still live under today, we will pressure this Government until the people hear the truth[/U] Gordon Creighton: Military Intelligence – Ministry of Defense Actions have been taken by Agencies, to **TERMINATE** people who are, who appear to be inconvenient or troublesome, through lying too much. Daniel Salter: U.S. Air Force, Chief Master Sergeant – NRO I would go and interview people who would claim they had seen something and try to convince them they hadn’t seen something or they were hallucinating or something. Well if that didn’t work, another team would come in, Give all the threats, and threaten your family and so and so forth. They would be charged with discredit, make them look foolish and all so forth. And if that didn’t work, [U]“Then there was another team that put an end to that problem one way or the other.”[/U] Daniel Salter continues down below Secretary of Defense, Forrestal, was the first, “Real Powerful Known” person that was eliminated because he was gonna release the information. And. Nobody has ever “Paid for that crime”. The crime that had never really been thoroughly investigated by forced us to see what happened to him. [U]But most people, know that he was thrown out the window of the hospital. He never got up alive. Brigadier General Stephen Lovekin: National Guard JAG Continues on with James Forrestal. He was talking about [U]Being Erased[/U] and I said what do you mean “Erased”? He said yes, He said, “You will be Erased”. I said, how do you know all this? It’s something. The fact that he said, “I know”. Brigadier General Stephen Lovekin Continues He said they’ll go only not after you. [U]”He said they’ll go after your family.”[/U] And those were his words. Unable to identify And they’re yelling at me and they’re hollering and cursing saying, you didn’t see anything, we’ll do you and your whole Godd*** family. And they’re you know, its basically that for 8 or 9 hours…They’re just off on their own, there’s no oversight, no control, they just do whatever they want. They’re evil, these people are evil. Unable to Identify National Security Council National Security Planning Group No Congressional Oversight Basically its an oversight group, inner-mingled with the National Security Council and the National Security Planning Group. They have full control, they have NO congressional oversight what so ever, they answer to nobody. Except for the President of the United States, but they’re trying to push aside away from the President. Dr. Carol Rosin: Aerospace Executive – Fairchild Industries When I was a Corporate Manager of Fairchild Industries in 1974 through 77, I met Dr. Wernher von Braun in early 74. At that time, Von Braun was dying of cancer, but he assured me that he would live a few more years in order to tell me about the game that was being played. That game being the effort to, “Weaponize Space.” Von Braun’s purpose in life during the last years of his life, his dying years, was to educate the public and decision makers, of why space based weapons are a dumb, dangerous, destabilizing, too costly, unnecessary, unworkable, undesirable. The strategy that Wernher von Braun taught me is at first the Russians are going to be considered the enemy, when I met him in 74, they were the enemy. They identified the enemy. We were told they had killer satellites, we were told they were coming to get us and control us, the dirty commi’s that whole story. But first the Russians were the enemy in which whom we are going to build space based weapons against. In 1977 I was in a meeting in Fairchild Industries in their conference room called the War Room, and in that room were a lot of charts on the walls with enemies, enemies in which people have never heard of. Names like Saddam Hussein and Kadafi. We were then talking about terrorists, the potential terrorist. No one had ever talked about this before. But this was the next stage after the Russians, of whom we were going to build space based weapons. These terrorists. This is 1977 and they were talking about, Creating a war in the Gulf Region where there was 25 billion dollars in the space based weapons program, that yet, had not been identified. It wasn’t called the Strategic Defense Initiative at least until 1983. This weapons system had obviously been going on for some time, that I didn’t know anything about. So I stood up in this meeting in 1977 and then said, “I’d like to know why we’re talking about Space Based Weapons against these enemies? Id like to know more about this, would someone tell me more on what this is about.” And nobody answered. They went on with this meeting as if I hadn’t said anything. We heard a lot about terrorism, then we were going to hear about 3rd world country crazies we now call the Nations of Concern. But he said that would be the 3rd enemy that’s whom would be needing to build Space Based Weapons. And the next enemy was Asteroids. Now at this point, he kind of chuckled the first time he said it. Asteroids. Against Asteroids we’re going to build space based weapons. So it was funny then. And the funniest one of all, Was what he called Aliens, Extra Terrestrials.” That would be the final card. And over, and over, and over, during the four years that I knew him, and was giving his speeches for him, he would bring up that last card, and remember now, and that last card, is the alien card. You have to build space based weapons against Aliens. And all of it he said. Was A LIE John Maynard: Retired Military Intelligence Analyst – Army Security, DEA Weapons in space is still a big enigma. Black covert operations have always been trying to do something like that. They wanted a weapons system they could put in space that would stop a ballistic missile. That was the concept. When star wars was brought out as an idea which was before Reagan, it had incorporated into his administration. There was a lot of truth on what they wanted to do, and they knew the basic principal on what they wanted to do. Dr. Paul Czysz: United States Air Force – McDonald Douglas Engineer The ballistic missile is probably, a pipe drain in the sense that, if what it’s designed for that you know where its coming from. And when we had Russia, there was a 50/50 chance that you knew about where it would be coming from. With the rogue nations we have today its absolutely ludicrous. Don Phillips: United States Air Force - Lockheed Skunkworks [U]Well if they were hostile, my own knowledge is, in feeling. I don’t know about all of them, is that we could have been uh, their weaponry as it might be used, could’ve destroyed us a LONG time ago.[/U] Dr. Paul Czysz of the United States Air Force. Continues on [U]If beings can travel in time space, then anything we put in as a weapon would be like going against Genghis Khan with a fire cracker.[/U] Daniel Salter of the U.S. Air Force, adds in the conversation Now some would like for us to believe that, the idea that Aliens and People are enemy now. But that’s not true. John Maynard: who is a Retired Military Intelligence Analyst adds to the conversation I noticed the satellites positions, and I said, “Now this is supposed to be a system that tracks radar anomalies on Earth” you know the whole thing moving, and he says that’s what it does, and I say “Why are half of them pointing towards outer space?” Towards the Moon, Towards areas where there is just quiet space. Sergeant Clifford Stone: US Army – Extraterrestrial Retrieval Team I have concluded, that we are fighting against the clock. I have got a short time, to convince people that we are moving to the point where we are going to Militarize Space. As we saw Militarizing space, we are going to acquire new technology, we are going to evolve in technology John Maynard: who is a Retired Military Intelligence Analyst adds to the conversation [I]At least half of those satellites you have up there, aren’t looking at earth [Unknown] You have to receive, several transmissions from the Pentagon and from the other Satellite monitoring the station at the NSA that they were tracking ETV’s. Extra Terrestrial. That stands for Extra Terrestrial Vehicles. John Maynard: who is a Retired Military Intelligence Analyst adds to the conversation And I says, “What are they looking for?” and he says, “well you got to have a Need To Know to know about that.” Daniel Salter of the U.S. Air Force, adds in the conversation We put nuclear weapons Out. In. Space! That was a line of defense, and we was ready to blow em up if they started in. Dr. Carol Rosin: Aerospace Executive for Fairchild Industries, continues the conversation He didn’t mention a timeline, but he said it was going to be speeding up faster than anybody could possibly imagine. NASA Broadcast Live at NASA: Ok, uhhhh, we’re not jokin about this but uhhh, was that window 1 where we saw an object floating nearby, we took several pictures of it, its uhhh very small CNN Shuttle Trouble? We just heard that in the process of, pouring over that Heat Shield they found, 3 more objects floating, in close proximity to the space shuttle Atlantis, here we go, 1…2…and 3.. uhh unclear on what those are. Maybe a fourth there, uh I’m not clear what those are. It could be Ice, it could be, it could be little pieces of harmless debris, worst case scenario is that it could be part of that heat shield, that is why NASA is concerned. Another News Station [I]Uhh, its very hard to be able to identify on what those little things might be If you love this country, You would respect and trust those who had fought and did their duty to defend it whom are now speaking out about the dark truth of what is now still today, going on militarily. Life matters, but it is better to be remembered as someone that has tried to fight against the biggest conspiracy theory since the time our visitors showed up in our skies. There are possibly more than 400 witnesses ready to go to congress right now and that majority has served in the United States Military, and have undergone Harsh criticism that they do not deserve. They need to be announced as Hero’s of this time and place before they pass on to the next life with their knowledge. I understand conspiracies are hard to prove, especially when they are involved with our government here. You have 400+ witnesses that have been there, and seen it and heard it and are not afraid to speak. Those 400 stand strong, and they are not dead. The opportunity to change the world is here, support them. If you know anyone who could be of extreme help, contact them and let them know about The Disclosure Project. Its not crazy when your doing the right thing, and don’t let these men they talk about threaten you to hush. These are troubled times, listen to the witness testimonies, its all there. Think, if you got caught in a situation like theirs, would you want other people to know? I would not and do not stand for a people that threaten a family because of something the public really needs to know of I have typed this out, I did not enjoy it. I used some of the witness testimonies from “UFO’s: The greatest story ever denied”. It is something that people have to know and if we don’t we are all going to pay a price because of these people. Im not crazy, but saying they have not visited us is just like saying they don’t exist at all. After all, they do have a better eye in space than we do.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Using hydrogen as a fuel is an alien invention? That would come as a surprise to François Isaac de Rivaz. He was the first to use hydrogen in an internal combustion engine. In 1806. Yes, the idea is that old. As an aside, gasoline wasn't invented until 1892 when it was first sold as.... a lice treatment for the scalp. Sullivan013", 
        "reply": "I was quite upset when a friend showed me testimonies about the Disclosure project, just hearing them say they were beaten. Are we being blindfolded into what is really happening in our country. I hope you did not take the harsh words to heart, we have no such growing problem. ------------------------------------------------------------------------------------------------------------  Let me say this back in an elucidate form. What is being said, today, is that we are just now on Hydrogen cars, or just cars depending on electricity itself. What I am trying to explain is \"Why are we working on Zero Point Energy\"? The \"Timely Evolution\" of this world and minds of the people has become a far-flung displacement in our technological advancement in time. The human mind can only go so far in our time. ------------------------------------------------------------------------------------------------------------ Deep down in every \"Authority Group\" or \"Figure\" that runs in every country, especially the US in particular, has had corruption. I am sure most members of the CIA, NASA, DoD, USAirforce, DNS and maybe a few members of the Military are quite familiar with the terms \"Black Budget\" or \"Black Operations\". Such as Crypto Clearances and different levels of the Need to Know which was only given to 25 people around the world and only 5 have been given the highest clearance, in which they can view any project kept secret. Seeing that this is the \"Actual\" military site, I would have expected someone to say,\"Yes I have seen things or people that look like they could have belonged to a Dark Secret.\" People have been beaten along with their families threatened just because A.) they were in the wrong place at the wrong time or B.) feel that the world needs to know of an extra-terrestrial presence, speaking words of \"Evidence of Alien Crafts\" and \"What happened in the Black Operation.\" [B]The Interesting Facts Daniel Sheenan: Legal Council for the Disclosure Project – I was contacted by Mrs. Marshal Smith, who was director of the “Science and Technology Division” of the “Congressional Research Service”. She asked to meet with me and I met with her and she informed me that President Carter, upon taking office in January 1977, held a meeting within the Director of Central Intelligence, who was George Bush Senior and demanded that the Director of Central Intelligence turn over to the President the classified information about Unidentified Flying Objects, and the information was in the possession of the United States Intelligence Community concerning the existence of “Extra Terrestrial Intelligence”. THIS INFORMATION WAS [U]REFUSED TO THE PRESIDENT OF THE UNITED STATES[/U] by the director of central intelligence, George Bush Senior. Remark to reporter “Sarah McLendon”:”Yeah, Sarah, if people find out what we’ve done, they’ll chase us down the street and lynch us” [U]George Herbert Walker Bush[/U] Lt. Col. Robert Salas: United States AirForce – SAC Launch OfficerEngineer We could not talk about this to anyone, including any of the other crews, our spouses, our family, even amongst each other. So, you could not discuss this at all. Sergeant Leonard Pretko: United States Air Force…then I’m gonna tell ya, they do ridicule me and I was ridiculed a few times. I was told I would never make Master Sergeant… Neil Daniels: Pilot-United States Air Force Captain United AirlinesThe pilots that had seen things and talked about them, some of them were gone, some of them were leased from their flying and treated as nutcases and things like that. Major George Filer III: United States Air Force – Deputy Director of IntelligenceAt times I used to carry Nuclear Weapons and as I was,[U] “Mentally fit to carry Nuclear Weapons”[/U] and [I][U]Not mentally fit when I see a UFO. [/U] And this criticism and this ridicule, as I think, done more to keep the story coming out than almost anything else[/I] Brigadier General Stephen Lovekin: National Guard JAG – Eisenhower White House…they have been discussed with me on numerous occasions. Talked about what could happen, to me Militarily and even what could happen if I discussed this as a civilian. Lt. Col. Joe Wojtecki: US Air Force – Strategic Air Command That subject was. Just dropped. It just wasn’t discussed Michael Smith: USAF – Aircraft Control / Early Warning Operation [U]Anything to Discredit you and we never get a promotion and spend the next 3 and a half years up at the North Pole living in a tent[/U] Prof. Robert Jacobs: USAF – Vandenberg Air Force Base I’ve made no money from this. I’ve got nothing but pain and suffering out of it from talking about it, I’ve been harassed at my home.[U]This was used against me partially losing a job once in teaching.[/U]I’ve had a hell’uv a time after I told this story, but I continue to tell the story [U]because I think it is important for people to understand, that this sort of s***! goes on in the government[/U] Phillip Corso Jr. – The Disclosure Project [U]He was sorry he wrote the book. He was sorry he exposed a family to the ridicule, to the lawsuits, it’s been tough on our “entire” family. He did not want to die leaving us with these problems. Just hope, future people such as yourself, will know what to do with this type of knowledge that this man brought forward. I do say that he is the first man to come forward with a high capacity.[/U] This patriot, Colonel Philip James Corso, died on July 16, 1998 [U]He is well remembered for standing up to the Giant that we still live under today, we will pressure this Government until the people hear the truth[/U] Gordon Creighton: Military Intelligence – Ministry of Defense Actions have been taken by Agencies, to **TERMINATE** people who are, who appear to be inconvenient or troublesome, through lying too much. Daniel Salter: U.S. Air Force, Chief Master Sergeant – NRO I would go and interview people who would claim they had seen something and try to convince them they hadn’t seen something or they were hallucinating or something. Well if that didn’t work, another team would come in, Give all the threats, and threaten your family and so and so forth. They would be charged with discredit, make them look foolish and all so forth. And if that didn’t work, [U]“Then there was another team that put an end to that problem one way or the other.”[/U] Daniel Salter continues down below Secretary of Defense, Forrestal, was the first, “Real Powerful Known” person that was eliminated because he was gonna release the information. And. Nobody has ever “Paid for that crime”. The crime that had never really been thoroughly investigated by forced us to see what happened to him. [U]But most people, know that he was thrown out the window of the hospital. He never got up alive. Brigadier General Stephen Lovekin: National Guard JAG Continues on with James Forrestal. He was talking about [U]Being Erased[/U] and I said what do you mean “Erased”? He said yes, He said, “You will be Erased”. I said, how do you know all this? It’s something. The fact that he said, “I know”. Brigadier General Stephen Lovekin Continues He said they’ll go only not after you. [U]”He said they’ll go after your family.”[/U] And those were his words. Unable to identify And they’re yelling at me and they’re hollering and cursing saying, you didn’t see anything, we’ll do you and your whole Godd*** family. And they’re you know, its basically that for 8 or 9 hours…They’re just off on their own, there’s no oversight, no control, they just do whatever they want. They’re evil, these people are evil. Unable to Identify National Security Council National Security Planning Group No Congressional Oversight Basically its an oversight group, inner-mingled with the National Security Council and the National Security Planning Group. They have full control, they have NO congressional oversight what so ever, they answer to nobody. Except for the President of the United States, but they’re trying to push aside away from the President. Dr. Carol Rosin: Aerospace Executive – Fairchild Industries When I was a Corporate Manager of Fairchild Industries in 1974 through 77, I met Dr. Wernher von Braun in early 74. At that time, Von Braun was dying of cancer, but he assured me that he would live a few more years in order to tell me about the game that was being played. That game being the effort to, “Weaponize Space.” Von Braun’s purpose in life during the last years of his life, his dying years, was to educate the public and decision makers, of why space based weapons are a dumb, dangerous, destabilizing, too costly, unnecessary, unworkable, undesirable. The strategy that Wernher von Braun taught me is at first the Russians are going to be considered the enemy, when I met him in 74, they were the enemy. They identified the enemy. We were told they had killer satellites, we were told they were coming to get us and control us, the dirty commi’s that whole story. But first the Russians were the enemy in which whom we are going to build space based weapons against. In 1977 I was in a meeting in Fairchild Industries in their conference room called the War Room, and in that room were a lot of charts on the walls with enemies, enemies in which people have never heard of. Names like Saddam Hussein and Kadafi. We were then talking about terrorists, the potential terrorist. No one had ever talked about this before. But this was the next stage after the Russians, of whom we were going to build space based weapons. These terrorists. This is 1977 and they were talking about, Creating a war in the Gulf Region where there was 25 billion dollars in the space based weapons program, that yet, had not been identified. It wasn’t called the Strategic Defense Initiative at least until 1983. This weapons system had obviously been going on for some time, that I didn’t know anything about. So I stood up in this meeting in 1977 and then said, “I’d like to know why we’re talking about Space Based Weapons against these enemies? Id like to know more about this, would someone tell me more on what this is about.” And nobody answered. They went on with this meeting as if I hadn’t said anything. We heard a lot about terrorism, then we were going to hear about 3rd world country crazies we now call the Nations of Concern. But he said that would be the 3rd enemy that’s whom would be needing to build Space Based Weapons. And the next enemy was Asteroids. Now at this point, he kind of chuckled the first time he said it. Asteroids. Against Asteroids we’re going to build space based weapons. So it was funny then. And the funniest one of all, Was what he called Aliens, Extra Terrestrials.” That would be the final card. And over, and over, and over, during the four years that I knew him, and was giving his speeches for him, he would bring up that last card, and remember now, and that last card, is the alien card. You have to build space based weapons against Aliens. And all of it he said. Was A LIE John Maynard: Retired Military Intelligence Analyst – Army Security, DEA Weapons in space is still a big enigma. Black covert operations have always been trying to do something like that. They wanted a weapons system they could put in space that would stop a ballistic missile. That was the concept. When star wars was brought out as an idea which was before Reagan, it had incorporated into his administration. There was a lot of truth on what they wanted to do, and they knew the basic principal on what they wanted to do. Dr. Paul Czysz: United States Air Force – McDonald Douglas Engineer The ballistic missile is probably, a pipe drain in the sense that, if what it’s designed for that you know where its coming from. And when we had Russia, there was a 50/50 chance that you knew about where it would be coming from. With the rogue nations we have today its absolutely ludicrous. Don Phillips: United States Air Force - Lockheed Skunkworks [U]Well if they were hostile, my own knowledge is, in feeling. I don’t know about all of them, is that we could have been uh, their weaponry as it might be used, could’ve destroyed us a LONG time ago.[/U] Dr. Paul Czysz of the United States Air Force. Continues on [U]If beings can travel in time space, then anything we put in as a weapon would be like going against Genghis Khan with a fire cracker.[/U] Daniel Salter of the U.S. Air Force, adds in the conversation Now some would like for us to believe that, the idea that Aliens and People are enemy now. But that’s not true. John Maynard: who is a Retired Military Intelligence Analyst adds to the conversation I noticed the satellites positions, and I said, “Now this is supposed to be a system that tracks radar anomalies on Earth” you know the whole thing moving, and he says that’s what it does, and I say “Why are half of them pointing towards outer space?” Towards the Moon, Towards areas where there is just quiet space. Sergeant Clifford Stone: US Army – Extraterrestrial Retrieval Team I have concluded, that we are fighting against the clock. I have got a short time, to convince people that we are moving to the point where we are going to Militarize Space. As we saw Militarizing space, we are going to acquire new technology, we are going to evolve in technology John Maynard: who is a Retired Military Intelligence Analyst adds to the conversation [I]At least half of those satellites you have up there, aren’t looking at earth [Unknown] You have to receive, several transmissions from the Pentagon and from the other Satellite monitoring the station at the NSA that they were tracking ETV’s. Extra Terrestrial. That stands for Extra Terrestrial Vehicles. John Maynard: who is a Retired Military Intelligence Analyst adds to the conversation And I says, “What are they looking for?” and he says, “well you got to have a Need To Know to know about that.” Daniel Salter of the U.S. Air Force, adds in the conversation We put nuclear weapons Out. In. Space! That was a line of defense, and we was ready to blow em up if they started in. Dr. Carol Rosin: Aerospace Executive for Fairchild Industries, continues the conversation He didn’t mention a timeline, but he said it was going to be speeding up faster than anybody could possibly imagine. NASA Broadcast Live at NASA: Ok, uhhhh, we’re not jokin about this but uhhh, was that window 1 where we saw an object floating nearby, we took several pictures of it, its uhhh very small CNN Shuttle Trouble? We just heard that in the process of, pouring over that Heat Shield they found, 3 more objects floating, in close proximity to the space shuttle Atlantis, here we go, 1…2…and 3.. uhh unclear on what those are. Maybe a fourth there, uh I’m not clear what those are. It could be Ice, it could be, it could be little pieces of harmless debris, worst case scenario is that it could be part of that heat shield, that is why NASA is concerned. Another News Station [I]Uhh, its very hard to be able to identify on what those little things might be If you love this country, You would respect and trust those who had fought and did their duty to defend it whom are now speaking out about the dark truth of what is now still today, going on militarily. Life matters, but it is better to be remembered as someone that has tried to fight against the biggest conspiracy theory since the time our visitors showed up in our skies. There are possibly more than 400 witnesses ready to go to congress right now and that majority has served in the United States Military, and have undergone Harsh criticism that they do not deserve. They need to be announced as Hero’s of this time and place before they pass on to the next life with their knowledge. I understand conspiracies are hard to prove, especially when they are involved with our government here. You have 400+ witnesses that have been there, and seen it and heard it and are not afraid to speak. Those 400 stand strong, and they are not dead. The opportunity to change the world is here, support them. If you know anyone who could be of extreme help, contact them and let them know about The Disclosure Project. Its not crazy when your doing the right thing, and don’t let these men they talk about threaten you to hush. These are troubled times, listen to the witness testimonies, its all there. Think, if you got caught in a situation like theirs, would you want other people to know? I would not and do not stand for a people that threaten a family because of something the public really needs to know of I have typed this out, I did not enjoy it. I used some of the witness testimonies from “UFO’s: The greatest story ever denied”. It is something that people have to know and if we don’t we are all going to pay a price because of these people. Im not crazy, but saying they have not visited us is just like saying they don’t exist at all. After all, they do have a better eye in space than we do.", 
        "threadID": "4960045241001_5210075712001", 
        "time": "2009-05-06 20:06:00", 
        "title": "Secrecy & Expeditious Technological Advancement sets fourth Human Extinction .", 
        "userID": "iError_SyS7yM_7Hr347"
    }
]