[
    {
        "content": "Mod Hat Off Following posted without opinion on either side of the issue.... just thought it was an interesting bit of information. All of the below are contained either in the preamble to the states constitution, or within the document itself. quote: Alabama 1901, Preamble. We the people of the State of Alabama, invoking the favor and guidance of Almighty God, do ordain and establish the following Constitution .. Alaska 1956, Preamble. We, the people of Alaska, grateful to God and to those who founded our nation and pioneered this great land .. Arizona 1911, Preamble. We, the people of the State of Arizona, grateful to Almighty God for our liberties, do ordain this Constitution... Arkansas 1874, Preamble. We, the people of the State of Arkansas, grateful to Almighty God for the privilege of choosing our own form of government... California 1879, Preamble. We, the People of the State of California, grateful to Almighty God for our freedom . Colorado 1876, Preamble. We, the people of Colorado, with profound reverence for the Supreme Ruler of Universe . Connecticut 1818, Preamble. The People of Connecticut, acknowledging with gratitude the good Providence of God in permitting them to enjoy ... Delaware 1897, Preamble. Through Divine Goodness all men have, by nature, the rights of worshipping and serving their Creator according to the dictates of their consciences . Florida 1845, Preamble. We, the people of the State of Florida, grateful to Almighty God for our constitutional liberty ... establish this Constitution... Georgia 1777, Preamble. We, the people of Georgia, relying upon protection and guidance of Almighty God, do ordain and establish this Constitution... Hawaii 1959, Preamble. We, the people of Hawaii, Grateful for Divine Guidance . establish this Constitution Idaho 1889, Preamble. We, the people of the State of Idaho, grateful to Almighty God for our freedom, to secure its blessings .. Illinois 1870, Preamble. We, the people of the State of Illinois, grateful to Almighty God for the civil, political and religious liberty which He hath so long permitted us to enjoy and looking to Him for a blessing on our endeavors . Indiana 1851, Preamble. We, the People of the State of Indiana, grateful to Almighty God for the free exercise of the right to chose our form of government .. Iowa 1857, Preamble. We, the People of the State of Iowa, grateful to the Supreme Being for the blessings hitherto enjoyed, and feeling our dependence on Him for a continuation of these blessings ... establish this Constitution Kansas 1859, Preamble. We, the people of Kansas, grateful to Almighty God for our civil and religious privileges . establish this Constitution. Kentucky 1891, Preamble. We, the people of the Commonwealth of grateful to Almighty God for the civil, political and religious liberties... Louisiana 1921, Preamble. We, the people of the State of Louisiana, grateful to Almighty God for the civil, political and religious liberties we enjoy .. Maine 1820, Preamble. We the People of Maine .. acknowledging with grateful hearts the goodness of the Sovereign Ruler of the Universe in affording us an opportunity ... and imploring His aid and direction Maryland 1776, Preamble. We, the people of the state of Maryland, grateful to Almighty God or our civil and religious liberty... Massachusetts 1780, Preamble. We...the people of Massachusetts, acknowledging with grateful hearts, the goodness of the Great Legislator of the Universe...in the course of His Providence, an opportunity and devoutly imploring His direction ... Michigan 1908, Preamble. We, the people of the State of Michigan, grateful to Almighty God for the blessings of freedom ... establish this Constitution Minnesota, 1857, Preamble. We, the people of the State of Minnesota, grateful to God for our civil and religious liberty, and desiring to perpetuate its blessings Mississippi 1890, Preamble. We, the people of Mississippi in convention assembled, grateful to Almighty God, and invoking His blessing on our work. Missouri 1845, Preamble. We, the people of Missouri, with profound reverence for the Supreme Ruler of the Universe, and grateful for His goodness .. establish this Constitution .. Montana 1889, Preamble. We, the people of Montana, grateful to Almighty God for the blessings of liberty establish this Constitution .. Nebraska 1875, Preamble. We, the people, grateful to Almighty God for our freedom .. establish this Constitution Nevada 1864, Preamble. We the people of the State of Nevada, grateful to Almighty God for our freedom . establish this Constitution .. New Hampshire 1792, Part I. Art. I. Sec. V. Every individual has a natural and unalienable right to worship God according to the dictates of his own conscience . New Jersey 1844, Preamble. We, the people of the State of New Jersey, grateful to Almighty God for civil and religious liberty which He hath so long permitted us to enjoy, and looking to Him for a blessing on our endeavors . New Mexico 1911, Preamble. We, the People of New Mexico, grateful to Almighty God for the blessings of liberty .. New York 1846, Preamble. We, the people of the State of New York, grateful to Almighty God for our freedom, in order to secure its blessings . North Carolina 1868, Preamble. We the people of the State of North Carolina, grateful to Almighty God, the Sovereign Ruler of Nations, for our civil, political, and religious liberties, and acknowledging our dependence upon Him for the continuance of those North Dakota 1889, Preamble. We, the people of North Dakota, grateful to Almighty God for the blessings of civil and religious liberty, do ordain... Ohio 1852, Preamble. We the people of the state of Ohio, grateful to Almighty God for our freedom, to secure its blessings and to promote our common .. Oklahoma 1907, Preamble. Invoking the guidance of Almighty God, in order to secure and perpetuate the blessings of liberty ... establish this Oregon 1857, Bill of Rights, Article I. Section 2. All men shall be secure in the Natural right, to worship Almighty God according to the dictates of their consciences . Pennsylvania 1776, Preamble. We, the people of Pennsylvania, grateful to Almighty God for the blessings of civil and religious liberty, and humbly invoking His guidance Rhode Island 1842, Preamble. We the People of the State of Rhode Island grateful to Almighty God for the civil and religious liberty which He hath so long permitted us to enjoy, and looking to Him for a blessing South Carolina, 1778, Preamble. We, the people of the State of South Carolina grateful to God for our liberties, do ordain and establish this Constitution South Dakota 1889, Preamble. We, the people of South Dakota, grateful to Almighty God for our civil and religious liberties . establish this Tennessee 1796, Art. XI.III. That all men have a natural and indefeasible right to worship Almighty God according to the dictates of their conscience... Texas 1845, Preamble. We the People of the Republic of Texas, acknowledging, with gratitude, the grace and beneficence of God Utah 1896, Preamble. Grateful to Almighty God for life and liberty, we establish this Constitution . Vermont 1777, Preamble. Whereas all government ought to ... enable the individuals who compose it to enjoy their natural rights, and other blessings which the Author of Existence has bestowed on man ... Virginia 1776, Bill of Rights, XVI ... Religion, or the Duty which we owe our Creator . can be directed only by Reason ... and that it is the mutual duty of all to practice Christian Forbearance, Love and Charity towards each other ... Washington 1889, Preamble. We the People of the State of Washington, grateful to the Supreme Ruler of the Universe for our liberties, do ordain this Constitution . West Virginia 1872, Preamble. Since through Divine Providence we enjoy the blessings of civil, political and religious liberty, we, the people of West Virginia .. reaffirm our faith in and constant reliance upon God . Wisconsin 1848, Preamble. We, the people of Wisconsin, grateful to Almighty God for our freedom, domestic tranquility Wyoming 1890, Preamble. We, the people of the State of Wyoming, grateful to God for our civil, political, and religious liberties ... establish this Constitution . \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "Alabama 1901, Preamble. We the people of the State of Alabama, invoking the favor and guidance of Almighty God, do ordain and establish the following Constitution .. Alaska 1956, Preamble. We, the people of Alaska, grateful to God and to those who founded our nation and pioneered this great land .. Arizona 1911, Preamble. We, the people of the State of Arizona, grateful to Almighty God for our liberties, do ordain this Constitution... Arkansas 1874, Preamble. We, the people of the State of Arkansas, grateful to Almighty God for the privilege of choosing our own form of government... California 1879, Preamble. We, the People of the State of California, grateful to Almighty God for our freedom . Colorado 1876, Preamble. We, the people of Colorado, with profound reverence for the Supreme Ruler of Universe . Connecticut 1818, Preamble. The People of Connecticut, acknowledging with gratitude the good Providence of God in permitting them to enjoy ... Delaware 1897, Preamble. Through Divine Goodness all men have, by nature, the rights of worshipping and serving their Creator according to the dictates of their consciences . Florida 1845, Preamble. We, the people of the State of Florida, grateful to Almighty God for our constitutional liberty ... establish this Constitution... Georgia 1777, Preamble. We, the people of Georgia, relying upon protection and guidance of Almighty God, do ordain and establish this Constitution... Hawaii 1959, Preamble. We, the people of Hawaii, Grateful for Divine Guidance . establish this Constitution Idaho 1889, Preamble. We, the people of the State of Idaho, grateful to Almighty God for our freedom, to secure its blessings .. Illinois 1870, Preamble. We, the people of the State of Illinois, grateful to Almighty God for the civil, political and religious liberty which He hath so long permitted us to enjoy and looking to Him for a blessing on our endeavors . Indiana 1851, Preamble. We, the People of the State of Indiana, grateful to Almighty God for the free exercise of the right to chose our form of government .. Iowa 1857, Preamble. We, the People of the State of Iowa, grateful to the Supreme Being for the blessings hitherto enjoyed, and feeling our dependence on Him for a continuation of these blessings ... establish this Constitution Kansas 1859, Preamble. We, the people of Kansas, grateful to Almighty God for our civil and religious privileges . establish this Constitution. Kentucky 1891, Preamble. We, the people of the Commonwealth of grateful to Almighty God for the civil, political and religious liberties... Louisiana 1921, Preamble. We, the people of the State of Louisiana, grateful to Almighty God for the civil, political and religious liberties we enjoy .. Maine 1820, Preamble. We the People of Maine .. acknowledging with grateful hearts the goodness of the Sovereign Ruler of the Universe in affording us an opportunity ... and imploring His aid and direction Maryland 1776, Preamble. We, the people of the state of Maryland, grateful to Almighty God or our civil and religious liberty... Massachusetts 1780, Preamble. We...the people of Massachusetts, acknowledging with grateful hearts, the goodness of the Great Legislator of the Universe...in the course of His Providence, an opportunity and devoutly imploring His direction ... Michigan 1908, Preamble. We, the people of the State of Michigan, grateful to Almighty God for the blessings of freedom ... establish this Constitution Minnesota, 1857, Preamble. We, the people of the State of Minnesota, grateful to God for our civil and religious liberty, and desiring to perpetuate its blessings Mississippi 1890, Preamble. We, the people of Mississippi in convention assembled, grateful to Almighty God, and invoking His blessing on our work. Missouri 1845, Preamble. We, the people of Missouri, with profound reverence for the Supreme Ruler of the Universe, and grateful for His goodness .. establish this Constitution .. Montana 1889, Preamble. We, the people of Montana, grateful to Almighty God for the blessings of liberty establish this Constitution .. Nebraska 1875, Preamble. We, the people, grateful to Almighty God for our freedom .. establish this Constitution Nevada 1864, Preamble. We the people of the State of Nevada, grateful to Almighty God for our freedom . establish this Constitution .. New Hampshire 1792, Part I. Art. I. Sec. V. Every individual has a natural and unalienable right to worship God according to the dictates of his own conscience . New Jersey 1844, Preamble. We, the people of the State of New Jersey, grateful to Almighty God for civil and religious liberty which He hath so long permitted us to enjoy, and looking to Him for a blessing on our endeavors . New Mexico 1911, Preamble. We, the People of New Mexico, grateful to Almighty God for the blessings of liberty .. New York 1846, Preamble. We, the people of the State of New York, grateful to Almighty God for our freedom, in order to secure its blessings . North Carolina 1868, Preamble. We the people of the State of North Carolina, grateful to Almighty God, the Sovereign Ruler of Nations, for our civil, political, and religious liberties, and acknowledging our dependence upon Him for the continuance of those North Dakota 1889, Preamble. We, the people of North Dakota, grateful to Almighty God for the blessings of civil and religious liberty, do ordain... Ohio 1852, Preamble. We the people of the state of Ohio, grateful to Almighty God for our freedom, to secure its blessings and to promote our common .. Oklahoma 1907, Preamble. Invoking the guidance of Almighty God, in order to secure and perpetuate the blessings of liberty ... establish this Oregon 1857, Bill of Rights, Article I. Section 2. All men shall be secure in the Natural right, to worship Almighty God according to the dictates of their consciences . Pennsylvania 1776, Preamble. We, the people of Pennsylvania, grateful to Almighty God for the blessings of civil and religious liberty, and humbly invoking His guidance Rhode Island 1842, Preamble. We the People of the State of Rhode Island grateful to Almighty God for the civil and religious liberty which He hath so long permitted us to enjoy, and looking to Him for a blessing South Carolina, 1778, Preamble. We, the people of the State of South Carolina grateful to God for our liberties, do ordain and establish this Constitution South Dakota 1889, Preamble. We, the people of South Dakota, grateful to Almighty God for our civil and religious liberties . establish this Tennessee 1796, Art. XI.III. That all men have a natural and indefeasible right to worship Almighty God according to the dictates of their conscience... Texas 1845, Preamble. We the People of the Republic of Texas, acknowledging, with gratitude, the grace and beneficence of God Utah 1896, Preamble. Grateful to Almighty God for life and liberty, we establish this Constitution . Vermont 1777, Preamble. Whereas all government ought to ... enable the individuals who compose it to enjoy their natural rights, and other blessings which the Author of Existence has bestowed on man ... Virginia 1776, Bill of Rights, XVI ... Religion, or the Duty which we owe our Creator . can be directed only by Reason ... and that it is the mutual duty of all to practice Christian Forbearance, Love and Charity towards each other ... Washington 1889, Preamble. We the People of the State of Washington, grateful to the Supreme Ruler of the Universe for our liberties, do ordain this Constitution . West Virginia 1872, Preamble. Since through Divine Providence we enjoy the blessings of civil, political and religious liberty, we, the people of West Virginia .. reaffirm our faith in and constant reliance upon God . Wisconsin 1848, Preamble. We, the people of Wisconsin, grateful to Almighty God for our freedom, domestic tranquility Wyoming 1890, Preamble. We, the people of the State of Wyoming, grateful to God for our civil, political, and religious liberties ... establish this Constitution .", 
        "reply": "Mod Hat Off Following posted without opinion on either side of the issue.... just thought it was an interesting bit of information. All of the below are contained either in the preamble to the states constitution, or within the document itself.  \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-01 15:51:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "Silent_Surface"
    }, 
    {
        "content": "Evidently the individual States weren't as happy with Madison's deism as he was - - Interesting that two or three predate the Constitution itself, including (GASP!) Jefferson and Madison's home state of Virginia - - Looks to me that those two men were trying to shape this country (wrongfully) in their own images - Makes we wonder anew why Randolf of Virginia said \"I cannot in good conscience, sign this Constitution in its present form!\" and refused to sign it at all, though he supposedly wrote and promoted 2/3s of it. In fact, Madison, under epistolary tutelage from Jefferson in France, wrote most of it, and got Gov. Randolf of Virginia to present it as his own to allay suspicion that it was Madison's work. the Subterfuge of the time makes it a wonder America ever got a document of any kind of quality at all - - Wandering and Wondering", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "Evidently the individual States weren't as happy with Madison's deism as he was - - Interesting that two or three predate the Constitution itself, including (GASP!) Jefferson and Madison's home state of Virginia - - Looks to me that those two men were trying to shape this country (wrongfully) in their own images - Makes we wonder anew why Randolf of Virginia said \"I cannot in good conscience, sign this Constitution in its present form!\" and refused to sign it at all, though he supposedly wrote and promoted 2/3s of it. In fact, Madison, under epistolary tutelage from Jefferson in France, wrote most of it, and got Gov. Randolf of Virginia to present it as his own to allay suspicion that it was Madison's work. the Subterfuge of the time makes it a wonder America ever got a document of any kind of quality at all - - Wandering and Wondering", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-01 16:03:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "moderator Hat off. This Florida boy, born, raised and resides therein. State motto, \"In God We Trust\" God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "", 
        "reply": "moderator Hat off. This Florida boy, born, raised and resides therein. State motto, \"In God We Trust\" God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-01 16:50:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "It is interesting that all of the states reference God or a supreme being of some type in their constitutions... \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "It is interesting that all of the states reference God or a supreme being of some type in their constitutions... \"The things that will destroy America are prosperity at any price, peace at any price, safety first instead of duty first, the love of soft living and the get rich quick theory of life.\" ~~~Theodore Roosevelt~~~", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 06:43:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "Silent_Surface"
    }, 
    {
        "content": "Probably another reason for that was that the States were thought on as still being quite independent back then and able to regulate and promote whatever they wanted inside their own borders. Though they did not want the Central Federal Government imposing a single religious faith on the whole nation (Thus the lack of religious references within the the Constitution, except towards the very end), they had no problem with the people of individual states deciding for themselves how they wanted their states to stand concerning religion - - I very much doubt they ever envisioned that the Constitution's vagueness about religion would ever be interpreted by minority fringe groups as a battle ax they could use to invade every corner of society in each state to drive out religion as far and as much as possible - Had they thought this would happen, I'm certain the Constitution would have had language at least similar to the Declaration of Independence (\"endowed by their Creator\") to clearly make a stand on where our rights come from - - They assumed people would never turn against the wording that made the Declaration of Independence so powerful, and we have been suffering because of that assumption quite badly in this generation - - Wandering and Wondering", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "", 
        "reply": "Probably another reason for that was that the States were thought on as still being quite independent back then and able to regulate and promote whatever they wanted inside their own borders. Though they did not want the Central Federal Government imposing a single religious faith on the whole nation (Thus the lack of religious references within the the Constitution, except towards the very end), they had no problem with the people of individual states deciding for themselves how they wanted their states to stand concerning religion - - I very much doubt they ever envisioned that the Constitution's vagueness about religion would ever be interpreted by minority fringe groups as a battle ax they could use to invade every corner of society in each state to drive out religion as far and as much as possible - Had they thought this would happen, I'm certain the Constitution would have had language at least similar to the Declaration of Independence (\"endowed by their Creator\") to clearly make a stand on where our rights come from - - They assumed people would never turn against the wording that made the Declaration of Independence so powerful, and we have been suffering because of that assumption quite badly in this generation - - Wandering and Wondering", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 06:57:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "It is also instructive that the state constitution of Maryland, from approximately 1919 until 1954 (when that section was amended), specifically stated that Roman Catholics could not hold elective or appointive office in the state of Maryland, because \"they owed allegience to a foreign power\" - the Vatican and the Pope. Just goes to show that State constitutions and the Federal constitution aren't written in stone - and sometimes need to be amended when it is realized that the original writers or past amenders had made a mistake.", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "", 
        "reply": "It is also instructive that the state constitution of Maryland, from approximately 1919 until 1954 (when that section was amended), specifically stated that Roman Catholics could not hold elective or appointive office in the state of Maryland, because \"they owed allegience to a foreign power\" - the Vatican and the Pope. Just goes to show that State constitutions and the Federal constitution aren't written in stone - and sometimes need to be amended when it is realized that the original writers or past amenders had made a mistake.", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 07:19:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I posted this about two years ago here and on my blog. It is still PROUDLY archived there!! T", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "", 
        "reply": "I posted this about two years ago here and on my blog. It is still PROUDLY archived there!! T", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 07:49:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "tawodi"
    }, 
    {
        "content": "Did you notice that none of the preambles mention Jesus, some do not use the word God? Christians are not the only ones who believe in God.", 
        "intTime": 20090502, 
        "postID": 8, 
        "quote": "", 
        "reply": "Did you notice that none of the preambles mention Jesus, some do not use the word God? Christians are not the only ones who believe in God.", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 11:50:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "Ranger, I don't know of anyone that does believe that others believe other things....", 
        "intTime": 20090502, 
        "postID": 9, 
        "quote": "", 
        "reply": "Ranger, I don't know of anyone that does believe that others believe other things....", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 13:10:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "2494906"
    }, 
    {
        "content": "I trace Jeffersons use of \"Life, Liberty, and the Pursuit of Happiness\" (French Perspective), or \" Life , Liberty, & Property\" (English Perspective\" in \"The Declaration Of Independence\", and James Madisons discription of \"Seperation of Church and State\" in \"Memorial and Remonstrance\" to the teachings of John Locke. For anyone interested in some of what came to be the root of why we were set up the way we were, and the true intent buried by false claim, Locke nails it. ........The toleration of those that differ from others in matters of religion is so agreeable to the Gospel of Jesus Christ, and to the genuine reason of mankind, that it seems monstrous for men to be so blind as not to perceive the necessity and advantage of it in so clear a light. I will not here tax the pride and ambition of some, the passion and uncharitable zeal of others. These are faults from which human affairs can perhaps scarce ever be perfectly freed; but yet such as nobody will bear the plain imputation of, without covering them with some specious colour; and so pretend to commendation, whilst they are carried away by their own irregular passions. But, however, that some may not colour their spirit of persecution and unchristian cruelty with a pretence of care of the public weal and observation of the laws; and that others, under pretence of religion, may not seek impunity for their libertinism and licentiousness; in a word, that none may impose either upon himself or others, by the pretences of loyalty and obedience to the prince, or of tenderness and sincerity in the worship of God; I esteem it above all things necessary to distinguish exactly the business of civil government from that of religion and to settle the just bounds that lie between the one and the other. If this be not done, there can be no end put to the controversies that will be always arising between those that have, or at least pretend to have, on the one side, a concernment for the interest of men's souls, and, on the other side, a care of the commonwealth. The commonwealth seems to me to be a society of men constituted only for the procuring, preserving, and advancing their own civil interests. Civil interests I call life, liberty, health, and indolency of body; and the possession of outward things, such as money, lands, houses, furniture, and the like. Now that the whole jurisdiction of the magistrate reaches only to these civil concernments, and that all civil power, right and dominion, is bounded and confined to the only care of promoting these things; and that it neither can nor ought in any manner to be extended to the salvation of souls, these following considerations seem unto me abundantly to demonstrate. First, because the care of souls is not committed to the civil magistrate, any more than to other men. It is not committed unto him, I say, by God; because it appears not that God has ever given any such authority to one man over another as to compel anyone to his religion. Nor can any such power be vested in the magistrate by the consent of the people, because no man can so far abandon the care of his own salvation as blindly to leave to the choice of any other, whether prince or subject, to prescribe to him what faith or worship he shall embrace. For no man can, if he would, conform his faith to the dictates of another. All the life and power of true religion consist in the inward and full persuasion of the mind; and faith is not faith without believing. Whatever profession we make, to whatever outward worship we conform, if we are not fully satisfied in our own mind that the one is true and the other well pleasing unto God, such profession and such practice, far from being any furtherance, are indeed great obstacles to our salvation. For in this manner, instead of expiating other sins by the exercise of religion, I say, in offering thus unto God Almighty such a worship as we esteem to be displeasing unto Him, we add unto the number of our other sins those also of hypocrisy and contempt of His Divine Majesty...... A Letter Concerning Toleration by John Locke 1689 Translated by William Popple \"http://www.constitution.org/jl/tolerati.htm\" This message has been edited. Last edited by: AngryPuppy, Tue 05 May 2009 01:53 PM", 
        "intTime": 20090502, 
        "postID": 10, 
        "quote": "", 
        "reply": "I trace Jeffersons use of \"Life, Liberty, and the Pursuit of Happiness\" (French Perspective), or \" Life , Liberty, & Property\" (English Perspective\" in \"The Declaration Of Independence\", and James Madisons discription of \"Seperation of Church and State\" in \"Memorial and Remonstrance\" to the teachings of John Locke. For anyone interested in some of what came to be the root of why we were set up the way we were, and the true intent buried by false claim, Locke nails it. ........The toleration of those that differ from others in matters of religion is so agreeable to the Gospel of Jesus Christ, and to the genuine reason of mankind, that it seems monstrous for men to be so blind as not to perceive the necessity and advantage of it in so clear a light. I will not here tax the pride and ambition of some, the passion and uncharitable zeal of others. These are faults from which human affairs can perhaps scarce ever be perfectly freed; but yet such as nobody will bear the plain imputation of, without covering them with some specious colour; and so pretend to commendation, whilst they are carried away by their own irregular passions. But, however, that some may not colour their spirit of persecution and unchristian cruelty with a pretence of care of the public weal and observation of the laws; and that others, under pretence of religion, may not seek impunity for their libertinism and licentiousness; in a word, that none may impose either upon himself or others, by the pretences of loyalty and obedience to the prince, or of tenderness and sincerity in the worship of God; I esteem it above all things necessary to distinguish exactly the business of civil government from that of religion and to settle the just bounds that lie between the one and the other. If this be not done, there can be no end put to the controversies that will be always arising between those that have, or at least pretend to have, on the one side, a concernment for the interest of men's souls, and, on the other side, a care of the commonwealth. The commonwealth seems to me to be a society of men constituted only for the procuring, preserving, and advancing their own civil interests. Civil interests I call life, liberty, health, and indolency of body; and the possession of outward things, such as money, lands, houses, furniture, and the like. Now that the whole jurisdiction of the magistrate reaches only to these civil concernments, and that all civil power, right and dominion, is bounded and confined to the only care of promoting these things; and that it neither can nor ought in any manner to be extended to the salvation of souls, these following considerations seem unto me abundantly to demonstrate. First, because the care of souls is not committed to the civil magistrate, any more than to other men. It is not committed unto him, I say, by God; because it appears not that God has ever given any such authority to one man over another as to compel anyone to his religion. Nor can any such power be vested in the magistrate by the consent of the people, because no man can so far abandon the care of his own salvation as blindly to leave to the choice of any other, whether prince or subject, to prescribe to him what faith or worship he shall embrace. For no man can, if he would, conform his faith to the dictates of another. All the life and power of true religion consist in the inward and full persuasion of the mind; and faith is not faith without believing. Whatever profession we make, to whatever outward worship we conform, if we are not fully satisfied in our own mind that the one is true and the other well pleasing unto God, such profession and such practice, far from being any furtherance, are indeed great obstacles to our salvation. For in this manner, instead of expiating other sins by the exercise of religion, I say, in offering thus unto God Almighty such a worship as we esteem to be displeasing unto Him, we add unto the number of our other sins those also of hypocrisy and contempt of His Divine Majesty...... A Letter Concerning Toleration by John Locke 1689 Translated by William Popple \"http://www.constitution.org/jl/tolerati.htm\" This message has been edited. Last edited by: AngryPuppy, Tue 05 May 2009 01:53 PM", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 13:48:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by Silent_Surface: It is interesting that all of the states reference God or a supreme being of some type in their constitutions... Amen, Silent Surface ! You'll not be getting a Birthday card from the A.C.L.U. this year.", 
        "intTime": 20090502, 
        "postID": 11, 
        "quote": "Originally posted by Silent_Surface: It is interesting that all of the states reference God or a supreme being of some type in their constitutions...", 
        "reply": " Amen, Silent Surface ! You'll not be getting a Birthday card from the A.C.L.U. this year.", 
        "threadID": "5291911282_2580072222001", 
        "time": "2009-05-02 14:18:00", 
        "title": "I never knew... The Preambles to the State Constitutions", 
        "userID": "swremwin"
    }
]