[
    {
        "content": "MY NAME IS ASHLEE I JUST RECENTLY JOINED MILITARY.COM JUST LOOKING FOR FRIENDS THAT ARE ALREADY IN THE COAST GUARD ACTIVE DUTY...I WILL BE ENLISTING NEXT MONTH. Question: SO WHAT IS THE COAST GUARD LIKE? Choices: ITS' FUN ITS OKAY  ", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "MY NAME IS ASHLEE I JUST RECENTLY JOINED MILITARY.COM JUST LOOKING FOR FRIENDS THAT ARE ALREADY IN THE COAST GUARD ACTIVE DUTY...I WILL BE ENLISTING NEXT MONTH. Question: SO WHAT IS THE COAST GUARD LIKE? Choices: ITS' FUN ITS OKAY  ", 
        "threadID": "5291911282_7790034122001", 
        "time": "2009-04-22 06:26:00", 
        "title": "LOOKING FOR FRIENDS ON HERE THAT ARE ALREADY IN THE COAST GUARD", 
        "userID": "ashlee87s05"
    }, 
    {
        "content": "Ashlee, welcome to the board but do us a favor, unlock your caps. Locked caps usually indicate yelling. I was in the Coast Guard from 1982-1988 and I have a brother who is in his 14th year with them. Like any other branch of service, it's what you make of it. There are many times you'll ask, \"Why did I do this?\" but other times, you'll know why. I served two years on a 378' cutter, a year at a SAR station in Mass and the last three years at a SAR/LE Station in the Florida Keys. Good luck, Don Proud father of a U.S. Marine Here's a link to the USCG \"Recruiter's Desk\" forum located in the USCG section of military.com; http://forums.military.com/eve/forums/a/frm/f/2151997295 This message has been edited. Last edited by: 21yrsUSCGUSCS, Thu 23 April 2009 09:06 AM", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "", 
        "reply": "Ashlee, welcome to the board but do us a favor, unlock your caps. Locked caps usually indicate yelling. I was in the Coast Guard from 1982-1988 and I have a brother who is in his 14th year with them. Like any other branch of service, it's what you make of it. There are many times you'll ask, \"Why did I do this?\" but other times, you'll know why. I served two years on a 378' cutter, a year at a SAR station in Mass and the last three years at a SAR/LE Station in the Florida Keys. Good luck, Don Proud father of a U.S. Marine Here's a link to the USCG \"Recruiter's Desk\" forum located in the USCG section of military.com; http://forums.military.com/eve/forums/a/frm/f/2151997295 This message has been edited. Last edited by: 21yrsUSCGUSCS, Thu 23 April 2009 09:06 AM", 
        "threadID": "5291911282_7790034122001", 
        "time": "2009-04-22 06:39:00", 
        "title": "LOOKING FOR FRIENDS ON HERE THAT ARE ALREADY IN THE COAST GUARD", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Like any other branch of service, it's what you make of it. There are many times you'll ask, \"Why did I do this?\" but other times, you'll know why. 100% agree! I recommended that my oldest daughter join the CG, over 27 years ago. She is still on active duty it has been very good to her. Her oldest daughter has just joined the CG reserves. As far as telling you about it. It's like the old saying, \"If you have to ask you wouldn't understand the answer.\" We all wish you the very best. Please keep us posted. Also, this would be better as a discussion form. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "Like any other branch of service, it's what you make of it. There are many times you'll ask, \"Why did I do this?\" but other times, you'll know why.", 
        "reply": " 100% agree! I recommended that my oldest daughter join the CG, over 27 years ago. She is still on active duty it has been very good to her. Her oldest daughter has just joined the CG reserves. As far as telling you about it. It's like the old saying, \"If you have to ask you wouldn't understand the answer.\" We all wish you the very best. Please keep us posted. Also, this would be better as a discussion form. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_7790034122001", 
        "time": "2009-04-22 15:15:00", 
        "title": "LOOKING FOR FRIENDS ON HERE THAT ARE ALREADY IN THE COAST GUARD", 
        "userID": "OldArmyLove"
    }
]