[
    {
        "content": "My boyfriend just left for fort jackson, and i am looking to see if there is anyone that has gone to fort jackson, or a wife or husband, girlfriend, mother, sibling that has experienced anyone who knew someone who went there? I know they will get phone calls and i will get his mailing address but im hearing a bunch of different things. I know family day is the day before graduation and some say that after graduation you will get to see them for a little, and others say they have to leave right after?", 
        "intTime": 20090409, 
        "postID": 1, 
        "quote": "", 
        "reply": "My boyfriend just left for fort jackson, and i am looking to see if there is anyone that has gone to fort jackson, or a wife or husband, girlfriend, mother, sibling that has experienced anyone who knew someone who went there? I know they will get phone calls and i will get his mailing address but im hearing a bunch of different things. I know family day is the day before graduation and some say that after graduation you will get to see them for a little, and others say they have to leave right after?", 
        "threadID": "5291911282_8600062022001", 
        "time": "2009-04-09 06:10:00", 
        "title": "my boyfriend left for fort jacskon", 
        "userID": "tammy914"
    }, 
    {
        "content": "I was in Fort Jackson, SC a long time ago and I assume that thins are pretty much the same as then. The military does not like too much change. The procedure is that he can call out but no calls in if he is in basic training. The day before graduation you will be able to visit with him and I spent one night with my wife before I was shipped off to my next destination. Now I went to basic in Fort Lenardowood, Missouri and then I went to Fort Jackson. So if his MOS will allow him he might just stay at Fort Jackson for AIT. I hope things work out for you two and good luck with everything.", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "", 
        "reply": "I was in Fort Jackson, SC a long time ago and I assume that thins are pretty much the same as then. The military does not like too much change. The procedure is that he can call out but no calls in if he is in basic training. The day before graduation you will be able to visit with him and I spent one night with my wife before I was shipped off to my next destination. Now I went to basic in Fort Lenardowood, Missouri and then I went to Fort Jackson. So if his MOS will allow him he might just stay at Fort Jackson for AIT. I hope things work out for you two and good luck with everything.", 
        "threadID": "5291911282_8600062022001", 
        "time": "2009-04-09 06:42:00", 
        "title": "my boyfriend left for fort jacskon", 
        "userID": "2478587"
    }, 
    {
        "content": "quote: Originally posted by tammy914: My boyfriend just left for fort jackson, and i am looking to see if there is anyone that has gone to fort jackson, or a wife or husband, girlfriend, mother, sibling that has experienced anyone who knew someone who went there? I know they will get phone calls and i will get his mailing address but im hearing a bunch of different things. I know family day is the day before graduation and some say that after graduation you will get to see them for a little, and others say they have to leave right after? Ahhh, relaxin' Jackson... my cousin went there, but DH was at Fort Knox KY. Their phone call will be after all their in processing, they get 30 seconds to call someone and tell them that they are alive, they love you, and give you their address. Don't expect regular phone calls during basic, it usually depends on how well the Company has behaved. As far as family day, it is the day before graduation, most of the time they are not allowed off base and have to be back in the barracks by a certain time (DH's was 2200, but he was in a really good group). Afterwards, it depends on his MOS and when his AIT starts. He may get 2 weeks after, he might get 20 mins before he has to be back on the bus. It all depends. The closer he gets to graduation the more he will know. Also, don't expect him to call you... he might call his mom instead. Don't take offense to it, but he only gets one call and Mom might be on the top of the list.", 
        "intTime": 20090409, 
        "postID": 3, 
        "quote": "Originally posted by tammy914: My boyfriend just left for fort jackson, and i am looking to see if there is anyone that has gone to fort jackson, or a wife or husband, girlfriend, mother, sibling that has experienced anyone who knew someone who went there? I know they will get phone calls and i will get his mailing address but im hearing a bunch of different things. I know family day is the day before graduation and some say that after graduation you will get to see them for a little, and others say they have to leave right after?", 
        "reply": " Ahhh, relaxin' Jackson... my cousin went there, but DH was at Fort Knox KY. Their phone call will be after all their in processing, they get 30 seconds to call someone and tell them that they are alive, they love you, and give you their address. Don't expect regular phone calls during basic, it usually depends on how well the Company has behaved. As far as family day, it is the day before graduation, most of the time they are not allowed off base and have to be back in the barracks by a certain time (DH's was 2200, but he was in a really good group). Afterwards, it depends on his MOS and when his AIT starts. He may get 2 weeks after, he might get 20 mins before he has to be back on the bus. It all depends. The closer he gets to graduation the more he will know. Also, don't expect him to call you... he might call his mom instead. Don't take offense to it, but he only gets one call and Mom might be on the top of the list.", 
        "threadID": "5291911282_8600062022001", 
        "time": "2009-04-09 07:05:00", 
        "title": "my boyfriend left for fort jacskon", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Contact the Army Forum! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090409, 
        "postID": 4, 
        "quote": "", 
        "reply": "Contact the Army Forum! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8600062022001", 
        "time": "2009-04-09 07:46:00", 
        "title": "my boyfriend left for fort jacskon", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Also, don't expect him to call you... he might call his mom instead. Don't take offense to it, but he only gets one call and Mom might be on the top of the list. I can tell you what will happen if he DOESN'T call mom first, \"Hell hath NO fury like a Mother passed over for a GF.\" If you were his wife already, ( I assume that you and he are young adults, as in 17-22 years old), he would call you first and mom would understand...maybe! armywifefigueroa had a good clue in her post, many things depend on how well his unit, platoon, squad, and his own self follow the rules/requests of the Drill Instructor(s). IF and WHEN you get a chance to talk to him, (in the meantime, explain it in a letter), tell him to do his best and to \"Play well with the others\" as much as possible. It's in HIS best interest to do so. Good Fortune to you and him. These are my opinions. Yours may differ.", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "Originally posted by armywifefigueroa: Also, don't expect him to call you... he might call his mom instead. Don't take offense to it, but he only gets one call and Mom might be on the top of the list.", 
        "reply": " I can tell you what will happen if he DOESN'T call mom first, \"Hell hath NO fury like a Mother passed over for a GF.\" If you were his wife already, ( I assume that you and he are young adults, as in 17-22 years old), he would call you first and mom would understand...maybe! armywifefigueroa had a good clue in her post, many things depend on how well his unit, platoon, squad, and his own self follow the rules/requests of the Drill Instructor(s). IF and WHEN you get a chance to talk to him, (in the meantime, explain it in a letter), tell him to do his best and to \"Play well with the others\" as much as possible. It's in HIS best interest to do so. Good Fortune to you and him. These are my opinions. Yours may differ.", 
        "threadID": "5291911282_8600062022001", 
        "time": "2009-04-09 09:17:00", 
        "title": "my boyfriend left for fort jacskon", 
        "userID": "4403771"
    }, 
    {
        "content": "Tammy914; I want to welcome you to Military.com I see you are a new member and have a love one in the military. Good luck to the both of you and hope to hear from you often.", 
        "intTime": 20090410, 
        "postID": 6, 
        "quote": "", 
        "reply": "Tammy914; I want to welcome you to Military.com I see you are a new member and have a love one in the military. Good luck to the both of you and hope to hear from you often.", 
        "threadID": "5291911282_8600062022001", 
        "time": "2009-04-10 03:58:00", 
        "title": "my boyfriend left for fort jacskon", 
        "userID": "Duster6"
    }
]