[
    {
        "content": "Really a shame about Paul Harvey passing away. He was Ninty years old and I remember him from somewhere back in the sixties. He was fair, non prejudiced and non bigoted and had a kind word for almost everyone (except stupid politicians). He read the news in his own manner and could tell a story like noone else. His \"rest of the story\" keep your attention until the finish and then surprised you with who the story was about. I looked up to Paul Harvey for being a roll model to American youth. Lead on Paul. You will be missed!", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "", 
        "reply": "Really a shame about Paul Harvey passing away. He was Ninty years old and I remember him from somewhere back in the sixties. He was fair, non prejudiced and non bigoted and had a kind word for almost everyone (except stupid politicians). He read the news in his own manner and could tell a story like noone else. His \"rest of the story\" keep your attention until the finish and then surprised you with who the story was about. I looked up to Paul Harvey for being a roll model to American youth. Lead on Paul. You will be missed!", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-04 16:19:00", 
        "title": "Paul Harvey", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Yes he will! I remember listening to him as a kid and enjoying the stories he spoke of… RIP Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yes he will! I remember listening to him as a kid and enjoying the stories he spoke of… RIP Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-04 16:27:00", 
        "title": "Paul Harvey", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "quote: He was fair, non prejudiced and non bigoted and had a kind word for almost everyone (except stupid politicians). Hey Richard, I hate to ever disagree, in public, with a brother member of WOPA, So I will just invite your attention to the following: Forums military.com, Hot Topics & Current Events, Point-Counterpoint Congresswomen (Dem) Walks Away From $578K Mortgage http://forums.military.com/eve/forums/a/tpc/f/409192893...481001#6580042481001 Posted Wed 21 May 2008 06:33 - 07:33 PM quote: Originally posted by OldArmyWOPA: I think we'll have to wait for Paul Harvey to tell us “The Rest of the Story?” As long as I mentioned my favorite broadcaster, Paul Harvey, I thought some people might be interested in his bio, especially his military service. *http://www.basicfamouspeople.com/index.php?aid=1164]http://www.basicfamouspeople.com/index.php?aid=1164 ------------------------------------------------ quote: Originally posted by Pomelesk: I think I will take anyone over Paul Harvey's opinion on this issue, this is the same Harvey, who stated\" Harvey concluded: We didn't come this far because we're made of sugar candy. Once upon a time, we elbowed our way onto and across this continent by giving smallpox-infected blankets to Native Americans. That was biological warfare. And we used every other weapon we could get our hands on to grab this land from whomever. And we grew prosperous. And yes, we greased the skids with the sweat of slaves. So it goes with most great nation-states, which--feeling guilty about their savage pasts--eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy. *http://www.fair.org/index.php?page=2569]http://www.fair.org/index.php?page=2569 And gets a freedom award from Bush.... quote: Originally posted by OldArmyWOPA: Thank you! I had not seen or heard of this. But, it is OBVIOUSLY TRUE. And, it is one of the most disgusting speeches “RANTS” that I have ever heard of. It appears that the military doctors who gave him a “section 8” 60 years ago knew a whole more than the rest of the world (or at least more than I knew). [QUOTE]Originally posted by OldArmyWOPA:I have edited my original post because of the information. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "He was fair, non prejudiced and non bigoted and had a kind word for almost everyone (except stupid politicians).", 
        "reply": " Hey Richard, I hate to ever disagree, in public, with a brother member of WOPA, So I will just invite your attention to the following: Forums military.com, Hot Topics & Current Events, Point-Counterpoint Congresswomen (Dem) Walks Away From $578K Mortgage http://forums.military.com/eve/forums/a/tpc/f/409192893...481001#6580042481001 Posted Wed 21 May 2008 06:33 - 07:33 PM quote: Originally posted by OldArmyWOPA: I think we'll have to wait for Paul Harvey to tell us “The Rest of the Story?” As long as I mentioned my favorite broadcaster, Paul Harvey, I thought some people might be interested in his bio, especially his military service. *http://www.basicfamouspeople.com/index.php?aid=1164]http://www.basicfamouspeople.com/index.php?aid=1164 ------------------------------------------------ quote: Originally posted by Pomelesk: I think I will take anyone over Paul Harvey's opinion on this issue, this is the same Harvey, who stated\" Harvey concluded: We didn't come this far because we're made of sugar candy. Once upon a time, we elbowed our way onto and across this continent by giving smallpox-infected blankets to Native Americans. That was biological warfare. And we used every other weapon we could get our hands on to grab this land from whomever. And we grew prosperous. And yes, we greased the skids with the sweat of slaves. So it goes with most great nation-states, which--feeling guilty about their savage pasts--eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy. *http://www.fair.org/index.php?page=2569]http://www.fair.org/index.php?page=2569 And gets a freedom award from Bush.... quote: Originally posted by OldArmyWOPA: Thank you! I had not seen or heard of this. But, it is OBVIOUSLY TRUE. And, it is one of the most disgusting speeches “RANTS” that I have ever heard of. It appears that the military doctors who gave him a “section 8” 60 years ago knew a whole more than the rest of the world (or at least more than I knew). [QUOTE]Originally posted by OldArmyWOPA:I have edited my original post because of the information. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-04 17:25:00", 
        "title": "Paul Harvey", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Harvey concluded: We didn't come this far because we're made of sugar candy. Once upon a time, we elbowed our way onto and across this continent by giving smallpox-infected blankets to Native Americans. That was biological warfare. And we used every other weapon we could get our hands on to grab this land from whomever. And we grew prosperous. And yes, we greased the skids with the sweat of slaves. So it goes with most great nation-states, which--feeling guilty about their savage pasts--eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy. *http://www.fair.org/index.php?page=2569]http://www.fair.org/index.php?page=2569 And gets a freedom award from Bush.... So, what's wrong with telling the truth? Ain't a single empire in recorded history that hasn't followed that model. What makes you think America is sacrosanct. If you believe in God and \"manifest destiny\", he hit the nail square on the head. If you believe in science and evolution, which makes no room for anything but Machiavellian situational ethics and amorality, he still hit the nail square on the head. And if you don't believe in anything, then he STILL hit the nail square on the head.... Now, if all you agree with is sounding politically correct, being namby pamby, and not saying anything that will hurt someone's feelings, then you fit into this paragraph describing the current trend of knee-jerk liberal no spine America: \"eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy.\" .....and could possibly be around to see it come true, as our economy and society collapses. But even in that case, he STILL hit the nail right on the head - - And THAT may be the REST of the story! Wandering and Wondering", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "Harvey concluded: We didn't come this far because we're made of sugar candy. Once upon a time, we elbowed our way onto and across this continent by giving smallpox-infected blankets to Native Americans. That was biological warfare. And we used every other weapon we could get our hands on to grab this land from whomever. And we grew prosperous. And yes, we greased the skids with the sweat of slaves. So it goes with most great nation-states, which--feeling guilty about their savage pasts--eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy. *http://www.fair.org/index.php?page=2569]http://www.fair.org/index.php?page=2569 And gets a freedom award from Bush....", 
        "reply": " So, what's wrong with telling the truth? Ain't a single empire in recorded history that hasn't followed that model. What makes you think America is sacrosanct. If you believe in God and \"manifest destiny\", he hit the nail square on the head. If you believe in science and evolution, which makes no room for anything but Machiavellian situational ethics and amorality, he still hit the nail square on the head. And if you don't believe in anything, then he STILL hit the nail square on the head.... Now, if all you agree with is sounding politically correct, being namby pamby, and not saying anything that will hurt someone's feelings, then you fit into this paragraph describing the current trend of knee-jerk liberal no spine America: \"eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy.\" .....and could possibly be around to see it come true, as our economy and society collapses. But even in that case, he STILL hit the nail right on the head - - And THAT may be the REST of the story! Wandering and Wondering", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-04 17:39:00", 
        "title": "Paul Harvey", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: So, what's wrong with telling the truth? Ain't a single empire in recorded history that hasn't followed that model. What makes you think America is sacrosanct. Right on, GWG!! History aint pretty, and those who try and make it so, are those self-same \"politically correct\" individuals who will throw this country away!! I say; Be proud of this old body we call America, scars and all. Those scars are the map of all the trials we have come thru, good bad or indifferent! Without which, we would never have learned what freedom truely means. The absence of which, would disgrace all those men and women who fought so hard to make her so.... Embrace the bad the with the good, without which we could never appriciate these United States to their fullest!!! We'll miss you Paul!", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "So, what's wrong with telling the truth? Ain't a single empire in recorded history that hasn't followed that model. What makes you think America is sacrosanct.", 
        "reply": " Right on, GWG!! History aint pretty, and those who try and make it so, are those self-same \"politically correct\" individuals who will throw this country away!! I say; Be proud of this old body we call America, scars and all. Those scars are the map of all the trials we have come thru, good bad or indifferent! Without which, we would never have learned what freedom truely means. The absence of which, would disgrace all those men and women who fought so hard to make her so.... Embrace the bad the with the good, without which we could never appriciate these United States to their fullest!!! We'll miss you Paul!", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-05 06:37:00", 
        "title": "Paul Harvey", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Harvey concluded: We didn't come this far because we're made of sugar candy. Once upon a time, we elbowed our way onto and across this continent by giving smallpox-infected blankets to Native Americans. That was biological warfare. And we used every other weapon we could get our hands on to grab this land from whomever. And we grew prosperous. And yes, we greased the skids with the sweat of slaves. So it goes with most great nation-states, which--feeling guilty about their savage pasts--eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy. *http://www.fair.org/index.php?page=2569]http://www.fair.org/index.php?page=2569 And gets a freedom award from Bush.... So, what's wrong with telling the truth? Ain't a single empire in recorded history that hasn't followed that model. What makes you think America is sacrosanct. If you believe in God and \"manifest destiny\", he hit the nail square on the head. If you believe in science and evolution, which makes no room for anything but Machiavellian situational ethics and amorality, he still hit the nail square on the head. And if you don't believe in anything, then he STILL hit the nail square on the head.... Now, if all you agree with is sounding politically correct, being namby pamby, and not saying anything that will hurt someone's feelings, then you fit into this paragraph describing the current trend of knee-jerk liberal no spine America: \"eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy.\" .....and could possibly be around to see it come true, as our economy and society collapses. But even in that case, he STILL hit the nail right on the head - - And THAT may be the REST of the story! And we did almost annihilate the native americans as we pushed west taking land and moving our settlers in. Custer was just a small payback. We then imported slaves to work our cotton fields and treated them the same as we would animals. Bought and sold them like bags of flour, And now we have the brown hoard from the South steadly moving in to take what we have created and push us out of existance. So where was Paul Harvey wrong. Our history was not always pretty and I certainly hope that we learned from our ancestors and do not repeat what we did to gain a foothold here in America. Sounds like Paul Harvey told the rest of the story and perhaps we need to reflect on his words and then move on.", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "Originally posted by greywolfghost: quote: Harvey concluded: We didn't come this far because we're made of sugar candy. Once upon a time, we elbowed our way onto and across this continent by giving smallpox-infected blankets to Native Americans. That was biological warfare. And we used every other weapon we could get our hands on to grab this land from whomever. And we grew prosperous. And yes, we greased the skids with the sweat of slaves. So it goes with most great nation-states, which--feeling guilty about their savage pasts--eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy. *http://www.fair.org/index.php?page=2569]http://www.fair.org/index.php?page=2569 And gets a freedom award from Bush.... So, what's wrong with telling the truth? Ain't a single empire in recorded history that hasn't followed that model. What makes you think America is sacrosanct. If you believe in God and \"manifest destiny\", he hit the nail square on the head. If you believe in science and evolution, which makes no room for anything but Machiavellian situational ethics and amorality, he still hit the nail square on the head. And if you don't believe in anything, then he STILL hit the nail square on the head.... Now, if all you agree with is sounding politically correct, being namby pamby, and not saying anything that will hurt someone's feelings, then you fit into this paragraph describing the current trend of knee-jerk liberal no spine America: \"eventually civilize themselves out of business and wind up invaded and ultimately dominated by the lean, hungry up-and-coming who are not made of sugar candy.\" .....and could possibly be around to see it come true, as our economy and society collapses. But even in that case, he STILL hit the nail right on the head - - And THAT may be the REST of the story!", 
        "reply": " And we did almost annihilate the native americans as we pushed west taking land and moving our settlers in. Custer was just a small payback. We then imported slaves to work our cotton fields and treated them the same as we would animals. Bought and sold them like bags of flour, And now we have the brown hoard from the South steadly moving in to take what we have created and push us out of existance. So where was Paul Harvey wrong. Our history was not always pretty and I certainly hope that we learned from our ancestors and do not repeat what we did to gain a foothold here in America. Sounds like Paul Harvey told the rest of the story and perhaps we need to reflect on his words and then move on.", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-05 07:01:00", 
        "title": "Paul Harvey", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Paul Harvey was an Icon and Legend in radio. He was the only man that couldn't be replaced. In radio thats one heck of a feat. R.I.P. Mr. Harvey, you will be missed.", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "", 
        "reply": "Paul Harvey was an Icon and Legend in radio. He was the only man that couldn't be replaced. In radio thats one heck of a feat. R.I.P. Mr. Harvey, you will be missed.", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-05 07:07:00", 
        "title": "Paul Harvey", 
        "userID": "CiviLegg"
    }, 
    {
        "content": "As Teddy Roosevelt once said, \"The people of the World will never love us. They may respect us. They may even grow to fear us. But they will never love us, for we have too much Audacity!\" He also wanted the Grizzly Bear to be the symbol of our Nation, because it always wondered its territory alone, respected and feared by all it met - but always alone - - As for the Eagle? He considered it a \"Dandified Vulture!\". . . We could use a \"Trust Busting, Azz Kicking Teddy,\" Right Now!! Note the Globe is positioned to show North America, from Panama to the North Pole. If Teddy had stayed in office, instead of turning over the country to Taft, that would probably be the United States of America today - - What a pity - Wandering and Wondering", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "", 
        "reply": "As Teddy Roosevelt once said, \"The people of the World will never love us. They may respect us. They may even grow to fear us. But they will never love us, for we have too much Audacity!\" He also wanted the Grizzly Bear to be the symbol of our Nation, because it always wondered its territory alone, respected and feared by all it met - but always alone - - As for the Eagle? He considered it a \"Dandified Vulture!\". . . We could use a \"Trust Busting, Azz Kicking Teddy,\" Right Now!! Note the Globe is positioned to show North America, from Panama to the North Pole. If Teddy had stayed in office, instead of turning over the country to Taft, that would probably be the United States of America today - - What a pity - Wandering and Wondering", 
        "threadID": "5291911282_3990019612001", 
        "time": "2009-03-05 07:10:00", 
        "title": "Paul Harvey", 
        "userID": "greywolfghost"
    }
]