[
    {
        "content": "Stephen Colbert stopped by the office before heading to the sandbox. http://podcasts.military.com/2009/04/stephen-colbert-he...closed-location.html \"I know you believe you understand what you think I said, but I am not sure you realize that what you heard is not what I meant.\" - Oscar Wilde", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "Stephen Colbert stopped by the office before heading to the sandbox. http://podcasts.military.com/2009/04/stephen-colbert-he...closed-location.html \"I know you believe you understand what you think I said, but I am not sure you realize that what you heard is not what I meant.\" - Oscar Wilde", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 14:40:00", 
        "title": "Stephen Colbert", 
        "userID": "RobRodriguez"
    }, 
    {
        "content": "Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Wandering and Wondering", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 15:27:00", 
        "title": "Stephen Colbert", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Yep. Once again, our brothers and sisters used as propaganda for an agenda. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't", 
        "reply": " Yep. Once again, our brothers and sisters used as propaganda for an agenda. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 15:45:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "So, why is MDC promoting HIM? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "", 
        "reply": "So, why is MDC promoting HIM? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 17:59:00", 
        "title": "Stephen Colbert", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "", 
        "reply": "Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:03:00", 
        "title": "Stephen Colbert", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't I miss Bob Hope Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't", 
        "reply": " I miss Bob Hope Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:06:00", 
        "title": "Stephen Colbert", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. Yeah, sure... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090428, 
        "postID": 7, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " Yeah, sure... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:08:00", 
        "title": "Stephen Colbert", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 8, 
        "quote": "", 
        "reply": "Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! Wandering and Wondering", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:09:00", 
        "title": "Stephen Colbert", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "next time you see Steven Colbert check out his right ear Space alien iff'n I ever see'd one", 
        "intTime": 20090428, 
        "postID": 9, 
        "quote": "", 
        "reply": "next time you see Steven Colbert check out his right ear Space alien iff'n I ever see'd one", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:13:00", 
        "title": "Stephen Colbert", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! And I hardly think His Agenda is Troop Pleasing. For a reason indeed. In any case you have to give him a blow for effort. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090428, 
        "postID": 10, 
        "quote": "Originally posted by greywolfghost: Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!!", 
        "reply": " And I hardly think His Agenda is Troop Pleasing. For a reason indeed. In any case you have to give him a blow for effort. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:19:00", 
        "title": "Stephen Colbert", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "intTime": 20090429, 
        "postID": 11, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " So is that post with Mod Hat on or Mod Hat off ?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 00:02:00", 
        "title": "Stephen Colbert", 
        "userID": "swremwin"
    }, 
    {
        "content": "I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "intTime": 20090429, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 00:23:00", 
        "title": "Stephen Colbert", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ? Oh quit. The man has a right to his opinion. The whole \"mod hat off/on\" thing is stupid to the nth degree. Some of you are so anal about \"moderator this!\" and \"moderator that!\" that I begin to wonder what the average age is around here. And before you say a word, know this: it was ME that suggested he'd be a good moderator and put him up for a vote back when I myself was a moderator. But, seriously - what does it matter if a moderator has his \"hat\" on or off? We're all supposed to be adults here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 13, 
        "quote": "Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "reply": " Oh quit. The man has a right to his opinion. The whole \"mod hat off/on\" thing is stupid to the nth degree. Some of you are so anal about \"moderator this!\" and \"moderator that!\" that I begin to wonder what the average age is around here. And before you say a word, know this: it was ME that suggested he'd be a good moderator and put him up for a vote back when I myself was a moderator. But, seriously - what does it matter if a moderator has his \"hat\" on or off? We're all supposed to be adults here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 02:34:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090429, 
        "postID": 14, 
        "quote": "Originally posted by FollowMeInfantry: Some of you are so anal....", 
        "reply": " You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:20:00", 
        "title": "Stephen Colbert", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ? Sorry. That's MOD HAT OFF", 
        "intTime": 20090429, 
        "postID": 15, 
        "quote": "Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "reply": " Sorry. That's MOD HAT OFF", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Stephen Colbert", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! Well, I have no qualms with that. Entertainers jabbing politicians is fine. Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. However, I did neglect to mention my admiration and thanks to Mr. Colbert for his charity work for military dependents in my original post, which is shame on me and inexcusable. Regardless, that some here have it out for a moderator based solely on their title is equally as inexcusable; and pathetic, childish, immature and outright shameful. Just because someone is a moderator makes them no less a veteran, a brother or sister in arms that has earned their respect due. I am not accusing anyone of that bias, including the person I quoted before, but we all know it exists here. There is no reason to ostracize a fellow veteran that decides to help this online community in the capacity of a moderator. I have been a target myself, so I know how it feels. A moderator should be entitled to his or her opinion without the antics, given that they are clear that it is only their opinion and not the board's position. Stillkit made that obvious - no \"mod hat off\" needed for anyone with a modicum of comprehension. But that is just my humble opinion, and I am sure my detractors will be once again whining to management that I have a voice and an opinion that differs from theirs. It's a damn shame that we can't all act like adults and discuss the issues rather than playing the \"I'll tell mom!\" games. But it is what it is. If I learned anything at all from my time in the Infantry, it is that some people will do anything to cover their own sins by exposing the faults of others, be they real or conceived. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 16, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that!", 
        "reply": " Well, I have no qualms with that. Entertainers jabbing politicians is fine. Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. However, I did neglect to mention my admiration and thanks to Mr. Colbert for his charity work for military dependents in my original post, which is shame on me and inexcusable. Regardless, that some here have it out for a moderator based solely on their title is equally as inexcusable; and pathetic, childish, immature and outright shameful. Just because someone is a moderator makes them no less a veteran, a brother or sister in arms that has earned their respect due. I am not accusing anyone of that bias, including the person I quoted before, but we all know it exists here. There is no reason to ostracize a fellow veteran that decides to help this online community in the capacity of a moderator. I have been a target myself, so I know how it feels. A moderator should be entitled to his or her opinion without the antics, given that they are clear that it is only their opinion and not the board's position. Stillkit made that obvious - no \"mod hat off\" needed for anyone with a modicum of comprehension. But that is just my humble opinion, and I am sure my detractors will be once again whining to management that I have a voice and an opinion that differs from theirs. It's a damn shame that we can't all act like adults and discuss the issues rather than playing the \"I'll tell mom!\" games. But it is what it is. If I learned anything at all from my time in the Infantry, it is that some people will do anything to cover their own sins by exposing the faults of others, be they real or conceived. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:39:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "intTime": 20090429, 
        "postID": 17, 
        "quote": "Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed.", 
        "reply": " I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:46:00", 
        "title": "Stephen Colbert", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage. I like your exemplar. I guess no matter who's in power the same thing is going to happen. All it really does is turn debate from the issues. I used to respond to those one track paranoid posts but gave it up as a waste of time. I find most of those posters are so busy lashing out in their paranoia that they cannot debate. On another forum the users are castigating President Obama for allowing the fiasco photo session involving Air force One and a fighter plane flying in the vicinity of The Statue of Liberty. It didn't matter a bit that Obama was not told of the photo shoot and that he was just as irate as everyone else when he was told. The president is trashed for every single thing he does and every single thing he does not do. As I said, all it accomplishes is to cloud the issues. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090429, 
        "postID": 18, 
        "quote": "Originally posted by karlhungusjr: I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "reply": " I like your exemplar. I guess no matter who's in power the same thing is going to happen. All it really does is turn debate from the issues. I used to respond to those one track paranoid posts but gave it up as a waste of time. I find most of those posters are so busy lashing out in their paranoia that they cannot debate. On another forum the users are castigating President Obama for allowing the fiasco photo session involving Air force One and a fighter plane flying in the vicinity of The Statue of Liberty. It didn't matter a bit that Obama was not told of the photo shoot and that he was just as irate as everyone else when he was told. The president is trashed for every single thing he does and every single thing he does not do. As I said, all it accomplishes is to cloud the issues. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:50:00", 
        "title": "Stephen Colbert", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what? I have no relevant citations to post in order to confirm my fears. The record is quite clear, however: very few entertainers visit war areas only in the name of the men and women in harm's way without seeking a personal gain. Toby Keith is an exception. But history tells me that the Dixie Chicks, Bill O'Reilly and former president Bush are three examples -- recent examples -- of the political ploy to \"support\" our troops while wishing for personal clout in the political mainstream. If you get to know me, you will find that I am neither right or left of the spectrum, sir. All I care about is the Joe in the foxhole, his or her family, the veterans that have been there and done that, and the American opinion surrounding them and their mission. When I see a farce on the horizon, I speak up for those engaged in protecting my freedoms, regardless of the R or D behind their names. When it comes to politicians, I am an equal opportunity hater. I distrust them all. A very quick and brief review of my posts here will reveal that I take one side, and one side only: the side that represents those doing the job the politicians have tasked them with. And you will also find that I make no exceptions to the monikers our two-party system holds. ANYONE not on the real side of our guys and gals on the ground is my enemy, be it Bush, Obama, Pelosi or Cheney. Mess with my brothers and sisters, you're walking on the fighting side of me (to paraphrase an old Merle Haggard song). Not that YOU are, mind you - I only wish to convey my take on the matter. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 19, 
        "quote": "Originally posted by karlhungusjr: quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "reply": " I have no relevant citations to post in order to confirm my fears. The record is quite clear, however: very few entertainers visit war areas only in the name of the men and women in harm's way without seeking a personal gain. Toby Keith is an exception. But history tells me that the Dixie Chicks, Bill O'Reilly and former president Bush are three examples -- recent examples -- of the political ploy to \"support\" our troops while wishing for personal clout in the political mainstream. If you get to know me, you will find that I am neither right or left of the spectrum, sir. All I care about is the Joe in the foxhole, his or her family, the veterans that have been there and done that, and the American opinion surrounding them and their mission. When I see a farce on the horizon, I speak up for those engaged in protecting my freedoms, regardless of the R or D behind their names. When it comes to politicians, I am an equal opportunity hater. I distrust them all. A very quick and brief review of my posts here will reveal that I take one side, and one side only: the side that represents those doing the job the politicians have tasked them with. And you will also find that I make no exceptions to the monikers our two-party system holds. ANYONE not on the real side of our guys and gals on the ground is my enemy, be it Bush, Obama, Pelosi or Cheney. Mess with my brothers and sisters, you're walking on the fighting side of me (to paraphrase an old Merle Haggard song). Not that YOU are, mind you - I only wish to convey my take on the matter. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 05:21:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. Still, you make a good point. But, I think why people are skeptical, because of some of these peoples past atitudes towards the USA, administration, and our troops. I know nothing about Colbert, but that would seem to be a good reason on at least other 'entertainers' who 'support the troops'", 
        "intTime": 20090429, 
        "postID": 20, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " Still, you make a good point. But, I think why people are skeptical, because of some of these peoples past atitudes towards the USA, administration, and our troops. I know nothing about Colbert, but that would seem to be a good reason on at least other 'entertainers' who 'support the troops'", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 05:58:00", 
        "title": "Stephen Colbert", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Stephen Colbert stopped by the office before heading to the sandbox. http://podcasts.military.com/2009/04/stephen-colbert-he...closed-location.html \"I know you believe you understand what you think I said, but I am not sure you realize that what you heard is not what I meant.\" - Oscar Wilde", 
        "intTime": 20090428, 
        "postID": 21, 
        "quote": "", 
        "reply": "Stephen Colbert stopped by the office before heading to the sandbox. http://podcasts.military.com/2009/04/stephen-colbert-he...closed-location.html \"I know you believe you understand what you think I said, but I am not sure you realize that what you heard is not what I meant.\" - Oscar Wilde", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 14:40:00", 
        "title": "Stephen Colbert", 
        "userID": "RobRodriguez"
    }, 
    {
        "content": "Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 22, 
        "quote": "", 
        "reply": "Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Wandering and Wondering", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 15:27:00", 
        "title": "Stephen Colbert", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Yep. Once again, our brothers and sisters used as propaganda for an agenda. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090428, 
        "postID": 23, 
        "quote": "Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't", 
        "reply": " Yep. Once again, our brothers and sisters used as propaganda for an agenda. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 15:45:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "So, why is MDC promoting HIM? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090428, 
        "postID": 24, 
        "quote": "", 
        "reply": "So, why is MDC promoting HIM? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 17:59:00", 
        "title": "Stephen Colbert", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "intTime": 20090428, 
        "postID": 25, 
        "quote": "", 
        "reply": "Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:03:00", 
        "title": "Stephen Colbert", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't I miss Bob Hope Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090428, 
        "postID": 26, 
        "quote": "Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't", 
        "reply": " I miss Bob Hope Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:06:00", 
        "title": "Stephen Colbert", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. Yeah, sure... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090428, 
        "postID": 27, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " Yeah, sure... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:08:00", 
        "title": "Stephen Colbert", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 28, 
        "quote": "", 
        "reply": "Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! Wandering and Wondering", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:09:00", 
        "title": "Stephen Colbert", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "next time you see Steven Colbert check out his right ear Space alien iff'n I ever see'd one", 
        "intTime": 20090428, 
        "postID": 29, 
        "quote": "", 
        "reply": "next time you see Steven Colbert check out his right ear Space alien iff'n I ever see'd one", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:13:00", 
        "title": "Stephen Colbert", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! And I hardly think His Agenda is Troop Pleasing. For a reason indeed. In any case you have to give him a blow for effort. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090428, 
        "postID": 30, 
        "quote": "Originally posted by greywolfghost: Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!!", 
        "reply": " And I hardly think His Agenda is Troop Pleasing. For a reason indeed. In any case you have to give him a blow for effort. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:19:00", 
        "title": "Stephen Colbert", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "intTime": 20090429, 
        "postID": 31, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " So is that post with Mod Hat on or Mod Hat off ?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 00:02:00", 
        "title": "Stephen Colbert", 
        "userID": "swremwin"
    }, 
    {
        "content": "I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "intTime": 20090429, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 00:23:00", 
        "title": "Stephen Colbert", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ? Oh quit. The man has a right to his opinion. The whole \"mod hat off/on\" thing is stupid to the nth degree. Some of you are so anal about \"moderator this!\" and \"moderator that!\" that I begin to wonder what the average age is around here. And before you say a word, know this: it was ME that suggested he'd be a good moderator and put him up for a vote back when I myself was a moderator. But, seriously - what does it matter if a moderator has his \"hat\" on or off? We're all supposed to be adults here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 33, 
        "quote": "Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "reply": " Oh quit. The man has a right to his opinion. The whole \"mod hat off/on\" thing is stupid to the nth degree. Some of you are so anal about \"moderator this!\" and \"moderator that!\" that I begin to wonder what the average age is around here. And before you say a word, know this: it was ME that suggested he'd be a good moderator and put him up for a vote back when I myself was a moderator. But, seriously - what does it matter if a moderator has his \"hat\" on or off? We're all supposed to be adults here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 02:34:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090429, 
        "postID": 34, 
        "quote": "Originally posted by FollowMeInfantry: Some of you are so anal....", 
        "reply": " You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:20:00", 
        "title": "Stephen Colbert", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ? Sorry. That's MOD HAT OFF", 
        "intTime": 20090429, 
        "postID": 35, 
        "quote": "Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "reply": " Sorry. That's MOD HAT OFF", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Stephen Colbert", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! Well, I have no qualms with that. Entertainers jabbing politicians is fine. Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. However, I did neglect to mention my admiration and thanks to Mr. Colbert for his charity work for military dependents in my original post, which is shame on me and inexcusable. Regardless, that some here have it out for a moderator based solely on their title is equally as inexcusable; and pathetic, childish, immature and outright shameful. Just because someone is a moderator makes them no less a veteran, a brother or sister in arms that has earned their respect due. I am not accusing anyone of that bias, including the person I quoted before, but we all know it exists here. There is no reason to ostracize a fellow veteran that decides to help this online community in the capacity of a moderator. I have been a target myself, so I know how it feels. A moderator should be entitled to his or her opinion without the antics, given that they are clear that it is only their opinion and not the board's position. Stillkit made that obvious - no \"mod hat off\" needed for anyone with a modicum of comprehension. But that is just my humble opinion, and I am sure my detractors will be once again whining to management that I have a voice and an opinion that differs from theirs. It's a damn shame that we can't all act like adults and discuss the issues rather than playing the \"I'll tell mom!\" games. But it is what it is. If I learned anything at all from my time in the Infantry, it is that some people will do anything to cover their own sins by exposing the faults of others, be they real or conceived. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 36, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that!", 
        "reply": " Well, I have no qualms with that. Entertainers jabbing politicians is fine. Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. However, I did neglect to mention my admiration and thanks to Mr. Colbert for his charity work for military dependents in my original post, which is shame on me and inexcusable. Regardless, that some here have it out for a moderator based solely on their title is equally as inexcusable; and pathetic, childish, immature and outright shameful. Just because someone is a moderator makes them no less a veteran, a brother or sister in arms that has earned their respect due. I am not accusing anyone of that bias, including the person I quoted before, but we all know it exists here. There is no reason to ostracize a fellow veteran that decides to help this online community in the capacity of a moderator. I have been a target myself, so I know how it feels. A moderator should be entitled to his or her opinion without the antics, given that they are clear that it is only their opinion and not the board's position. Stillkit made that obvious - no \"mod hat off\" needed for anyone with a modicum of comprehension. But that is just my humble opinion, and I am sure my detractors will be once again whining to management that I have a voice and an opinion that differs from theirs. It's a damn shame that we can't all act like adults and discuss the issues rather than playing the \"I'll tell mom!\" games. But it is what it is. If I learned anything at all from my time in the Infantry, it is that some people will do anything to cover their own sins by exposing the faults of others, be they real or conceived. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:39:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "intTime": 20090429, 
        "postID": 37, 
        "quote": "Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed.", 
        "reply": " I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:46:00", 
        "title": "Stephen Colbert", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage. I like your exemplar. I guess no matter who's in power the same thing is going to happen. All it really does is turn debate from the issues. I used to respond to those one track paranoid posts but gave it up as a waste of time. I find most of those posters are so busy lashing out in their paranoia that they cannot debate. On another forum the users are castigating President Obama for allowing the fiasco photo session involving Air force One and a fighter plane flying in the vicinity of The Statue of Liberty. It didn't matter a bit that Obama was not told of the photo shoot and that he was just as irate as everyone else when he was told. The president is trashed for every single thing he does and every single thing he does not do. As I said, all it accomplishes is to cloud the issues. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090429, 
        "postID": 38, 
        "quote": "Originally posted by karlhungusjr: I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "reply": " I like your exemplar. I guess no matter who's in power the same thing is going to happen. All it really does is turn debate from the issues. I used to respond to those one track paranoid posts but gave it up as a waste of time. I find most of those posters are so busy lashing out in their paranoia that they cannot debate. On another forum the users are castigating President Obama for allowing the fiasco photo session involving Air force One and a fighter plane flying in the vicinity of The Statue of Liberty. It didn't matter a bit that Obama was not told of the photo shoot and that he was just as irate as everyone else when he was told. The president is trashed for every single thing he does and every single thing he does not do. As I said, all it accomplishes is to cloud the issues. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:50:00", 
        "title": "Stephen Colbert", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what? I have no relevant citations to post in order to confirm my fears. The record is quite clear, however: very few entertainers visit war areas only in the name of the men and women in harm's way without seeking a personal gain. Toby Keith is an exception. But history tells me that the Dixie Chicks, Bill O'Reilly and former president Bush are three examples -- recent examples -- of the political ploy to \"support\" our troops while wishing for personal clout in the political mainstream. If you get to know me, you will find that I am neither right or left of the spectrum, sir. All I care about is the Joe in the foxhole, his or her family, the veterans that have been there and done that, and the American opinion surrounding them and their mission. When I see a farce on the horizon, I speak up for those engaged in protecting my freedoms, regardless of the R or D behind their names. When it comes to politicians, I am an equal opportunity hater. I distrust them all. A very quick and brief review of my posts here will reveal that I take one side, and one side only: the side that represents those doing the job the politicians have tasked them with. And you will also find that I make no exceptions to the monikers our two-party system holds. ANYONE not on the real side of our guys and gals on the ground is my enemy, be it Bush, Obama, Pelosi or Cheney. Mess with my brothers and sisters, you're walking on the fighting side of me (to paraphrase an old Merle Haggard song). Not that YOU are, mind you - I only wish to convey my take on the matter. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 39, 
        "quote": "Originally posted by karlhungusjr: quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "reply": " I have no relevant citations to post in order to confirm my fears. The record is quite clear, however: very few entertainers visit war areas only in the name of the men and women in harm's way without seeking a personal gain. Toby Keith is an exception. But history tells me that the Dixie Chicks, Bill O'Reilly and former president Bush are three examples -- recent examples -- of the political ploy to \"support\" our troops while wishing for personal clout in the political mainstream. If you get to know me, you will find that I am neither right or left of the spectrum, sir. All I care about is the Joe in the foxhole, his or her family, the veterans that have been there and done that, and the American opinion surrounding them and their mission. When I see a farce on the horizon, I speak up for those engaged in protecting my freedoms, regardless of the R or D behind their names. When it comes to politicians, I am an equal opportunity hater. I distrust them all. A very quick and brief review of my posts here will reveal that I take one side, and one side only: the side that represents those doing the job the politicians have tasked them with. And you will also find that I make no exceptions to the monikers our two-party system holds. ANYONE not on the real side of our guys and gals on the ground is my enemy, be it Bush, Obama, Pelosi or Cheney. Mess with my brothers and sisters, you're walking on the fighting side of me (to paraphrase an old Merle Haggard song). Not that YOU are, mind you - I only wish to convey my take on the matter. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 05:21:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. Still, you make a good point. But, I think why people are skeptical, because of some of these peoples past atitudes towards the USA, administration, and our troops. I know nothing about Colbert, but that would seem to be a good reason on at least other 'entertainers' who 'support the troops'", 
        "intTime": 20090429, 
        "postID": 40, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " Still, you make a good point. But, I think why people are skeptical, because of some of these peoples past atitudes towards the USA, administration, and our troops. I know nothing about Colbert, but that would seem to be a good reason on at least other 'entertainers' who 'support the troops'", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 05:58:00", 
        "title": "Stephen Colbert", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Stephen Colbert stopped by the office before heading to the sandbox. http://podcasts.military.com/2009/04/stephen-colbert-he...closed-location.html \"I know you believe you understand what you think I said, but I am not sure you realize that what you heard is not what I meant.\" - Oscar Wilde", 
        "intTime": 20090428, 
        "postID": 41, 
        "quote": "", 
        "reply": "Stephen Colbert stopped by the office before heading to the sandbox. http://podcasts.military.com/2009/04/stephen-colbert-he...closed-location.html \"I know you believe you understand what you think I said, but I am not sure you realize that what you heard is not what I meant.\" - Oscar Wilde", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 14:40:00", 
        "title": "Stephen Colbert", 
        "userID": "RobRodriguez"
    }, 
    {
        "content": "Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 42, 
        "quote": "", 
        "reply": "Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Wandering and Wondering", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 15:27:00", 
        "title": "Stephen Colbert", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't Yep. Once again, our brothers and sisters used as propaganda for an agenda. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090428, 
        "postID": 43, 
        "quote": "Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't", 
        "reply": " Yep. Once again, our brothers and sisters used as propaganda for an agenda. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 15:45:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "So, why is MDC promoting HIM? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090428, 
        "postID": 44, 
        "quote": "", 
        "reply": "So, why is MDC promoting HIM? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 17:59:00", 
        "title": "Stephen Colbert", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "intTime": 20090428, 
        "postID": 45, 
        "quote": "", 
        "reply": "Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:03:00", 
        "title": "Stephen Colbert", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't I miss Bob Hope Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090428, 
        "postID": 46, 
        "quote": "Originally posted by greywolfghost: Another rich celebrity seeking a foto op with the troops to promote his liberal agenda and career - - Bob Hope, he ain't", 
        "reply": " I miss Bob Hope Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:06:00", 
        "title": "Stephen Colbert", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. Yeah, sure... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090428, 
        "postID": 47, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " Yeah, sure... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:08:00", 
        "title": "Stephen Colbert", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 48, 
        "quote": "", 
        "reply": "Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! Wandering and Wondering", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:09:00", 
        "title": "Stephen Colbert", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "next time you see Steven Colbert check out his right ear Space alien iff'n I ever see'd one", 
        "intTime": 20090428, 
        "postID": 49, 
        "quote": "", 
        "reply": "next time you see Steven Colbert check out his right ear Space alien iff'n I ever see'd one", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:13:00", 
        "title": "Stephen Colbert", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!! And I hardly think His Agenda is Troop Pleasing. For a reason indeed. In any case you have to give him a blow for effort. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090428, 
        "postID": 50, 
        "quote": "Originally posted by greywolfghost: Until I see his routine, I'll abate judgment. Everything I've seen of him on TV makes me want to up chuck... Hope bolstered us troops and kept the Government in a positive light at the same time, all the way through WW II, Korea, and Vietnam. These \"entertainers\" today are a bunch of counter-culture back-stabbers, then they want to go and be loved by the troops . . . Like I said, he ain't no Bob Hope - - We'll see - - As for being ashamed...The only thing I am ashamed of is not being young enough and healthy enough to be there myself!!", 
        "reply": " And I hardly think His Agenda is Troop Pleasing. For a reason indeed. In any case you have to give him a blow for effort. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-28 18:19:00", 
        "title": "Stephen Colbert", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "intTime": 20090429, 
        "postID": 51, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " So is that post with Mod Hat on or Mod Hat off ?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 00:02:00", 
        "title": "Stephen Colbert", 
        "userID": "swremwin"
    }, 
    {
        "content": "I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "intTime": 20090429, 
        "postID": 52, 
        "quote": "", 
        "reply": "I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 00:23:00", 
        "title": "Stephen Colbert", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ? Oh quit. The man has a right to his opinion. The whole \"mod hat off/on\" thing is stupid to the nth degree. Some of you are so anal about \"moderator this!\" and \"moderator that!\" that I begin to wonder what the average age is around here. And before you say a word, know this: it was ME that suggested he'd be a good moderator and put him up for a vote back when I myself was a moderator. But, seriously - what does it matter if a moderator has his \"hat\" on or off? We're all supposed to be adults here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 53, 
        "quote": "Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "reply": " Oh quit. The man has a right to his opinion. The whole \"mod hat off/on\" thing is stupid to the nth degree. Some of you are so anal about \"moderator this!\" and \"moderator that!\" that I begin to wonder what the average age is around here. And before you say a word, know this: it was ME that suggested he'd be a good moderator and put him up for a vote back when I myself was a moderator. But, seriously - what does it matter if a moderator has his \"hat\" on or off? We're all supposed to be adults here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 02:34:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090429, 
        "postID": 54, 
        "quote": "Originally posted by FollowMeInfantry: Some of you are so anal....", 
        "reply": " You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:20:00", 
        "title": "Stephen Colbert", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ? Sorry. That's MOD HAT OFF", 
        "intTime": 20090429, 
        "postID": 55, 
        "quote": "Originally posted by swremwin: quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. So is that post with Mod Hat on or Mod Hat off ?", 
        "reply": " Sorry. That's MOD HAT OFF", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Stephen Colbert", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that! Well, I have no qualms with that. Entertainers jabbing politicians is fine. Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. However, I did neglect to mention my admiration and thanks to Mr. Colbert for his charity work for military dependents in my original post, which is shame on me and inexcusable. Regardless, that some here have it out for a moderator based solely on their title is equally as inexcusable; and pathetic, childish, immature and outright shameful. Just because someone is a moderator makes them no less a veteran, a brother or sister in arms that has earned their respect due. I am not accusing anyone of that bias, including the person I quoted before, but we all know it exists here. There is no reason to ostracize a fellow veteran that decides to help this online community in the capacity of a moderator. I have been a target myself, so I know how it feels. A moderator should be entitled to his or her opinion without the antics, given that they are clear that it is only their opinion and not the board's position. Stillkit made that obvious - no \"mod hat off\" needed for anyone with a modicum of comprehension. But that is just my humble opinion, and I am sure my detractors will be once again whining to management that I have a voice and an opinion that differs from theirs. It's a damn shame that we can't all act like adults and discuss the issues rather than playing the \"I'll tell mom!\" games. But it is what it is. If I learned anything at all from my time in the Infantry, it is that some people will do anything to cover their own sins by exposing the faults of others, be they real or conceived. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 56, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by FollowMeInfantry: Some of you are so anal.... You could have just left it there, Richard! In some people's minds, it all comes back to that episode where Colbert made light of GWB at the 2006 Roast of then President Bush; many Bush-bots will never forgive him that!", 
        "reply": " Well, I have no qualms with that. Entertainers jabbing politicians is fine. Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. However, I did neglect to mention my admiration and thanks to Mr. Colbert for his charity work for military dependents in my original post, which is shame on me and inexcusable. Regardless, that some here have it out for a moderator based solely on their title is equally as inexcusable; and pathetic, childish, immature and outright shameful. Just because someone is a moderator makes them no less a veteran, a brother or sister in arms that has earned their respect due. I am not accusing anyone of that bias, including the person I quoted before, but we all know it exists here. There is no reason to ostracize a fellow veteran that decides to help this online community in the capacity of a moderator. I have been a target myself, so I know how it feels. A moderator should be entitled to his or her opinion without the antics, given that they are clear that it is only their opinion and not the board's position. Stillkit made that obvious - no \"mod hat off\" needed for anyone with a modicum of comprehension. But that is just my humble opinion, and I am sure my detractors will be once again whining to management that I have a voice and an opinion that differs from theirs. It's a damn shame that we can't all act like adults and discuss the issues rather than playing the \"I'll tell mom!\" games. But it is what it is. If I learned anything at all from my time in the Infantry, it is that some people will do anything to cover their own sins by exposing the faults of others, be they real or conceived. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:39:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "intTime": 20090429, 
        "postID": 57, 
        "quote": "Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed.", 
        "reply": " I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:46:00", 
        "title": "Stephen Colbert", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage. I like your exemplar. I guess no matter who's in power the same thing is going to happen. All it really does is turn debate from the issues. I used to respond to those one track paranoid posts but gave it up as a waste of time. I find most of those posters are so busy lashing out in their paranoia that they cannot debate. On another forum the users are castigating President Obama for allowing the fiasco photo session involving Air force One and a fighter plane flying in the vicinity of The Statue of Liberty. It didn't matter a bit that Obama was not told of the photo shoot and that he was just as irate as everyone else when he was told. The president is trashed for every single thing he does and every single thing he does not do. As I said, all it accomplishes is to cloud the issues. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090429, 
        "postID": 58, 
        "quote": "Originally posted by karlhungusjr: I'd bet money some of you people question the political orthodoxy of your dogs crotch licking habits. \"Why is Spot trying to push his gay liberal agenda on me!\" lighten the hell up. Not everything is some sort of liberal plot to destroy the world and make you have a gay muslim aborted marriage.", 
        "reply": " I like your exemplar. I guess no matter who's in power the same thing is going to happen. All it really does is turn debate from the issues. I used to respond to those one track paranoid posts but gave it up as a waste of time. I find most of those posters are so busy lashing out in their paranoia that they cannot debate. On another forum the users are castigating President Obama for allowing the fiasco photo session involving Air force One and a fighter plane flying in the vicinity of The Statue of Liberty. It didn't matter a bit that Obama was not told of the photo shoot and that he was just as irate as everyone else when he was told. The president is trashed for every single thing he does and every single thing he does not do. As I said, all it accomplishes is to cloud the issues. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 04:50:00", 
        "title": "Stephen Colbert", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what? I have no relevant citations to post in order to confirm my fears. The record is quite clear, however: very few entertainers visit war areas only in the name of the men and women in harm's way without seeking a personal gain. Toby Keith is an exception. But history tells me that the Dixie Chicks, Bill O'Reilly and former president Bush are three examples -- recent examples -- of the political ploy to \"support\" our troops while wishing for personal clout in the political mainstream. If you get to know me, you will find that I am neither right or left of the spectrum, sir. All I care about is the Joe in the foxhole, his or her family, the veterans that have been there and done that, and the American opinion surrounding them and their mission. When I see a farce on the horizon, I speak up for those engaged in protecting my freedoms, regardless of the R or D behind their names. When it comes to politicians, I am an equal opportunity hater. I distrust them all. A very quick and brief review of my posts here will reveal that I take one side, and one side only: the side that represents those doing the job the politicians have tasked them with. And you will also find that I make no exceptions to the monikers our two-party system holds. ANYONE not on the real side of our guys and gals on the ground is my enemy, be it Bush, Obama, Pelosi or Cheney. Mess with my brothers and sisters, you're walking on the fighting side of me (to paraphrase an old Merle Haggard song). Not that YOU are, mind you - I only wish to convey my take on the matter. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090429, 
        "postID": 59, 
        "quote": "Originally posted by karlhungusjr: quote: Where I draw my personal line is when an entertainer wants to exploit our men and women of the military in a political statement - which is where I see this headed. I'm leaving for the day so I won't be able to respond....but what do you base this on? Why would you think Colbert will \"exploit our men and women of the military in a political statement\". Ive never seen him do any thing like that in the past. Is there some story floating around that I've missed? what?", 
        "reply": " I have no relevant citations to post in order to confirm my fears. The record is quite clear, however: very few entertainers visit war areas only in the name of the men and women in harm's way without seeking a personal gain. Toby Keith is an exception. But history tells me that the Dixie Chicks, Bill O'Reilly and former president Bush are three examples -- recent examples -- of the political ploy to \"support\" our troops while wishing for personal clout in the political mainstream. If you get to know me, you will find that I am neither right or left of the spectrum, sir. All I care about is the Joe in the foxhole, his or her family, the veterans that have been there and done that, and the American opinion surrounding them and their mission. When I see a farce on the horizon, I speak up for those engaged in protecting my freedoms, regardless of the R or D behind their names. When it comes to politicians, I am an equal opportunity hater. I distrust them all. A very quick and brief review of my posts here will reveal that I take one side, and one side only: the side that represents those doing the job the politicians have tasked them with. And you will also find that I make no exceptions to the monikers our two-party system holds. ANYONE not on the real side of our guys and gals on the ground is my enemy, be it Bush, Obama, Pelosi or Cheney. Mess with my brothers and sisters, you're walking on the fighting side of me (to paraphrase an old Merle Haggard song). Not that YOU are, mind you - I only wish to convey my take on the matter. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 05:21:00", 
        "title": "Stephen Colbert", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves. Still, you make a good point. But, I think why people are skeptical, because of some of these peoples past atitudes towards the USA, administration, and our troops. I know nothing about Colbert, but that would seem to be a good reason on at least other 'entertainers' who 'support the troops'", 
        "intTime": 20090429, 
        "postID": 60, 
        "quote": "Originally posted by stillkit: Boy, you guys are something else. Here's someone willing to take the time and risk to entertain our troops overseas and y'all trash him because his politics ain't \"right.\" Which is more important to you? The troops or your own political position? That's a damn shame. You should all be ashamed of yourselves.", 
        "reply": " Still, you make a good point. But, I think why people are skeptical, because of some of these peoples past atitudes towards the USA, administration, and our troops. I know nothing about Colbert, but that would seem to be a good reason on at least other 'entertainers' who 'support the troops'", 
        "threadID": "5291911282_6550099122001", 
        "time": "2009-04-29 05:58:00", 
        "title": "Stephen Colbert", 
        "userID": "billdawg24"
    }
]