[
    {
        "content": "My partner Lynn and I were in an interesting discussion the other day about airline deregulation. She believes deregulation is a falacy. She said \"the FAA controls the airlines. It controls where they fly into, what time slots and gates they get, and how much of the market they can acquire.\" I have to admit I think she's right. We (the FAA) do control all of the above. The only thing we don't do is set the price of tickets. My question to her was why is that a bad thing. We have the safest, busiest, most robust aviation system in the world. So what if it borders on being a socialist organization. Who wants to fly in a non-regulated capitalistic aviation system where airlines compromise safety to be the cheapist? Comments?", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "My partner Lynn and I were in an interesting discussion the other day about airline deregulation. She believes deregulation is a falacy. She said \"the FAA controls the airlines. It controls where they fly into, what time slots and gates they get, and how much of the market they can acquire.\" I have to admit I think she's right. We (the FAA) do control all of the above. The only thing we don't do is set the price of tickets. My question to her was why is that a bad thing. We have the safest, busiest, most robust aviation system in the world. So what if it borders on being a socialist organization. Who wants to fly in a non-regulated capitalistic aviation system where airlines compromise safety to be the cheapist? Comments?", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 04:51:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: My partner Lynn and I were in an interesting discussion the other day about airline deregulation. She believes deregulation is a falacy. She said \"the FAA controls the airlines. It controls where they fly into, what time slots and gates they get, and how much of the market they can acquire.\" I have to admit I think she's right. We (the FAA) do control all of the above. The only thing we don't do is set the price of tickets. My question to her was why is that a bad thing. We have the safest, busiest, most robust aviation system in the world. So what if it borders on being a socialist organization. Who wants to fly in a non-regulated capitalistic aviation system where airlines compromise safety to be the cheapist? Comments? The way I see it is it's not all bad or all good. The FAA definitely should have total control over everything that concerns airline safety. I take umbrage at the FAA controlling airlines market share and where they can fly into. We are capitalists. The airlines should be allowed to vie for market share and cities served. Controlling those areas smacks of Socialism. Allowing airlines to vie for market share and cities covered are not safety issues and should not be regulated. Who tells Sears how many stores they may have and what cities they're allowed to have them in? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "Originally posted by Flygirl62: My partner Lynn and I were in an interesting discussion the other day about airline deregulation. She believes deregulation is a falacy. She said \"the FAA controls the airlines. It controls where they fly into, what time slots and gates they get, and how much of the market they can acquire.\" I have to admit I think she's right. We (the FAA) do control all of the above. The only thing we don't do is set the price of tickets. My question to her was why is that a bad thing. We have the safest, busiest, most robust aviation system in the world. So what if it borders on being a socialist organization. Who wants to fly in a non-regulated capitalistic aviation system where airlines compromise safety to be the cheapist? Comments?", 
        "reply": " The way I see it is it's not all bad or all good. The FAA definitely should have total control over everything that concerns airline safety. I take umbrage at the FAA controlling airlines market share and where they can fly into. We are capitalists. The airlines should be allowed to vie for market share and cities served. Controlling those areas smacks of Socialism. Allowing airlines to vie for market share and cities covered are not safety issues and should not be regulated. Who tells Sears how many stores they may have and what cities they're allowed to have them in? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 07:21:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: The way I see it is it's not all bad or all good. The FAA definitely should have total control over everything that concerns airline safety. I take umbrage at the FAA controlling airlines market share and where they can fly into. We are capitalists. The airlines should be allowed to vie for market share and cities served. Controlling those areas smacks of Socialism. Allowing airlines to vie for market share and cities covered are not safety issues and should not be regulated. Who tells Sears how many stores they may have and what cities they're allowed to have them in? All good points Vic. But what if all the airlines want to service the same airports at the same time? Should we concern ourselves with overtaxing the available airspace during high travel periods? Do you think that some airlines should be forced to use reliever airports (e.g. Midway instead of Chicago, Houston Hobby instead of Bush Intl.)? Who decides? What about the FAA preventing some mergers because we don't want super-airlines who create price wars, drive other airlines out of business, then raise prices?", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "Originally posted by Vicdude: The way I see it is it's not all bad or all good. The FAA definitely should have total control over everything that concerns airline safety. I take umbrage at the FAA controlling airlines market share and where they can fly into. We are capitalists. The airlines should be allowed to vie for market share and cities served. Controlling those areas smacks of Socialism. Allowing airlines to vie for market share and cities covered are not safety issues and should not be regulated. Who tells Sears how many stores they may have and what cities they're allowed to have them in?", 
        "reply": " All good points Vic. But what if all the airlines want to service the same airports at the same time? Should we concern ourselves with overtaxing the available airspace during high travel periods? Do you think that some airlines should be forced to use reliever airports (e.g. Midway instead of Chicago, Houston Hobby instead of Bush Intl.)? Who decides? What about the FAA preventing some mergers because we don't want super-airlines who create price wars, drive other airlines out of business, then raise prices?", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 09:12:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "Deregulation of the airlines was for pricing issues just the same as deregulation for the shipping industry. Wasn't to let the airline/shiplines decide when where they wanted to service. The airlines/shiplines can now charge as they see fit w/ out Gov say so. Legs and tracks are still decided by the FAA ... but the carriers have the latitude to \"request\" changes if the market dictates a need for change.", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "", 
        "reply": "Deregulation of the airlines was for pricing issues just the same as deregulation for the shipping industry. Wasn't to let the airline/shiplines decide when where they wanted to service. The airlines/shiplines can now charge as they see fit w/ out Gov say so. Legs and tracks are still decided by the FAA ... but the carriers have the latitude to \"request\" changes if the market dictates a need for change.", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 11:41:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "TsgtTharin"
    }, 
    {
        "content": "quote: All good points Vic. But what if all the airlines want to service the same airports at the same time? Should we concern ourselves with overtaxing the available airspace during high travel periods? Do you think that some airlines should be forced to use reliever airports (e.g. Midway instead of Chicago, Houston Hobby instead of Bush Intl.)? Who decides? What about the FAA preventing some mergers because we don't want super-airlines who create price wars, drive other airlines out of business, then raise prices? I believe the public would be the ones to decide where each airline services. The good airlines providing the best, cheapest service would crowd out the expensive poorer ones. That's free enterprise at it's best. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "All good points Vic. But what if all the airlines want to service the same airports at the same time? Should we concern ourselves with overtaxing the available airspace during high travel periods? Do you think that some airlines should be forced to use reliever airports (e.g. Midway instead of Chicago, Houston Hobby instead of Bush Intl.)? Who decides? What about the FAA preventing some mergers because we don't want super-airlines who create price wars, drive other airlines out of business, then raise prices?", 
        "reply": " I believe the public would be the ones to decide where each airline services. The good airlines providing the best, cheapest service would crowd out the expensive poorer ones. That's free enterprise at it's best. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 12:06:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I would rather have a MEGA-High Speed rail system and forget about worrying/wondering if that mechanic got the bolt in right on that last engine change-out. The infrastructure would be less expensive for that. Dedicated tracks and timetables that don't get shoved back to wait for some clown who can't get a door closed. I will be able to set my camera on a higher shutter speed and get shots of the wonderful countryside. If the engine quits or the power fails then our glide path is not a matter to fear. Let the airlines cover the heavy routes and do their own thing. International flights and major city inter-travel. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "", 
        "reply": "I would rather have a MEGA-High Speed rail system and forget about worrying/wondering if that mechanic got the bolt in right on that last engine change-out. The infrastructure would be less expensive for that. Dedicated tracks and timetables that don't get shoved back to wait for some clown who can't get a door closed. I will be able to set my camera on a higher shutter speed and get shots of the wonderful countryside. If the engine quits or the power fails then our glide path is not a matter to fear. Let the airlines cover the heavy routes and do their own thing. International flights and major city inter-travel. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 12:16:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: I would rather have a MEGA-High Speed rail system and forget about worrying/wondering if that mechanic got the bolt in right on that last engine change-out. The infrastructure would be less expensive for that. Dedicated tracks and timetables that don't get shoved back to wait for some clown who can't get a door closed. I will be able to set my camera on a higher shutter speed and get shots of the wonderful countryside. If the engine quits or the power fails then our glide path is not a matter to fear. Let the airlines cover the heavy routes and do their own thing. International flights and major city inter-travel. Don't forget trains are machines too and can break at anytime. Derailments occur and doors can stick on rail cars. The software that controls movement can be come corrupt, the system could crash, etc. A train wreck at 150 MPH will kill you just as dead as a plane crash. Severe weather can impact train movement as well as air travel. The dedicated nationwide tracks sounds good, but by the time all the environmental impact studies, lawsuits, and other challanges get done and cost overruns dealt with, etc., my great grandchildren will be dead of old age.", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "Originally posted by sargeant_green: I would rather have a MEGA-High Speed rail system and forget about worrying/wondering if that mechanic got the bolt in right on that last engine change-out. The infrastructure would be less expensive for that. Dedicated tracks and timetables that don't get shoved back to wait for some clown who can't get a door closed. I will be able to set my camera on a higher shutter speed and get shots of the wonderful countryside. If the engine quits or the power fails then our glide path is not a matter to fear. Let the airlines cover the heavy routes and do their own thing. International flights and major city inter-travel.", 
        "reply": " Don't forget trains are machines too and can break at anytime. Derailments occur and doors can stick on rail cars. The software that controls movement can be come corrupt, the system could crash, etc. A train wreck at 150 MPH will kill you just as dead as a plane crash. Severe weather can impact train movement as well as air travel. The dedicated nationwide tracks sounds good, but by the time all the environmental impact studies, lawsuits, and other challanges get done and cost overruns dealt with, etc., my great grandchildren will be dead of old age.", 
        "threadID": "5291911282_2760026712001", 
        "time": "2009-03-12 12:30:00", 
        "title": "Is Airline Dereguation a Falacy?", 
        "userID": "sw614"
    }
]