[
    {
        "content": "Stole this from SOCNET. It is just TOO good not to post here. EDIT: to fix picture This message has been edited. Last edited by: FollowMeInfantry, Sat 16 May 2009 09:47 AM It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "", 
        "reply": "Stole this from SOCNET. It is just TOO good not to post here. EDIT: to fix picture This message has been edited. Last edited by: FollowMeInfantry, Sat 16 May 2009 09:47 AM It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 07:41:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Richard, I'm not sure what I'm to look for at that website! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "", 
        "reply": "Richard, I'm not sure what I'm to look for at that website! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 07:49:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website! Whatcha mean, bro? Didn't the picture show up? It shows up here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website!", 
        "reply": " Whatcha mean, bro? Didn't the picture show up? It shows up here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 07:59:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website! Whatcha mean, bro? Didn't the picture show up? It shows up here. Not on my screen it doesn't. All I see is the infamous red x.", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website! Whatcha mean, bro? Didn't the picture show up? It shows up here.", 
        "reply": " Not on my screen it doesn't. All I see is the infamous red x.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:21:00", 
        "title": "The REALITY of gun control", 
        "userID": "stillkit"
    }, 
    {
        "content": "Well, RATS. Try this. Can you see it now? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "Well, RATS. Try this. Can you see it now? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:34:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "It's a lady in a T-shirt with a pistol aiming at a target. The T-shirt reads: \"Gun Control: The theory that a woman found dead in an alley, raped and strangled with her own pantyhose, is somehow morally superior to a woman explaining to police how her attacker got that fatal bullet wound.\" \"http://www.socnet.com/showthread.php?t=86272\" (Remove quotes, copy and paste link) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 6, 
        "quote": "", 
        "reply": "It's a lady in a T-shirt with a pistol aiming at a target. The T-shirt reads: \"Gun Control: The theory that a woman found dead in an alley, raped and strangled with her own pantyhose, is somehow morally superior to a woman explaining to police how her attacker got that fatal bullet wound.\" \"http://www.socnet.com/showthread.php?t=86272\" (Remove quotes, copy and paste link) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:38:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Gun control: Being able to hit what you aim at. There is only one thing worse than messing an old fart, and that is messing with two.", 
        "intTime": 20090516, 
        "postID": 7, 
        "quote": "", 
        "reply": "Gun control: Being able to hit what you aim at. There is only one thing worse than messing an old fart, and that is messing with two.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:41:00", 
        "title": "The REALITY of gun control", 
        "userID": "Hutch863"
    }, 
    {
        "content": "Love it !!!", 
        "intTime": 20090516, 
        "postID": 8, 
        "quote": "", 
        "reply": "Love it !!!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 09:37:00", 
        "title": "The REALITY of gun control", 
        "userID": "PBMKC"
    }, 
    {
        "content": "There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns????", 
        "intTime": 20090516, 
        "postID": 9, 
        "quote": "", 
        "reply": "There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns????", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 11:05:00", 
        "title": "The REALITY of gun control", 
        "userID": "DeBe888"
    }, 
    {
        "content": "I can see it now and wonder if it's significant that the target she's aiming at is.....a MAN!", 
        "intTime": 20090516, 
        "postID": 10, 
        "quote": "", 
        "reply": "I can see it now and wonder if it's significant that the target she's aiming at is.....a MAN!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 14:29:00", 
        "title": "The REALITY of gun control", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by DeBe888: There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns???? Good idea, a doctor damn near killed me in 1987! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090516, 
        "postID": 11, 
        "quote": "Originally posted by DeBe888: There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns????", 
        "reply": " Good idea, a doctor damn near killed me in 1987! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 19:39:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090516, 
        "postID": 12, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 19:43:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "In this day and age, how can you tell beyond all doubt that the target is a man?", 
        "intTime": 20090516, 
        "postID": 13, 
        "quote": "", 
        "reply": "In this day and age, how can you tell beyond all doubt that the target is a man?", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 20:28:00", 
        "title": "The REALITY of gun control", 
        "userID": "tawodi"
    }, 
    {
        "content": "Good one tawodi! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "", 
        "reply": "Good one tawodi! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 06:52:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "", 
        "reply": "I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 07:01:00", 
        "title": "The REALITY of gun control", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state.", 
        "reply": " Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 07:07:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. Richard, you said it well! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090517, 
        "postID": 17, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality.", 
        "reply": " Richard, you said it well! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 18:27:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. Oh, no! It's reality, but the reality as it exists in our geographic region. Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies). While murder certainly isn't unknown up here, it's rarely more than one per year (if that), and is often on the part of passers-through on one-another and not natives! About a decade or so back, the Crips and Bloods both tried making inroads up here forming gangs for the purpose of drug-running and such, but we as a populace saw them and put the rush on them; they've not returned! Most households are armed (hunting) and know how to use those arms (mucho former Military), but the majority are not Wayne LaPierre type paranoids. I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! Don't take this as an indictment as I am not in \"your\" shoes and don't see what you see where you are, but it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue! The Second Amendment is safe IMHO; if I seriously thought that it was truly in danger, I'd be out there screaming my head off too! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090518, 
        "postID": 18, 
        "quote": "Originally posted by FollowMeInfantry: Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality.", 
        "reply": " Oh, no! It's reality, but the reality as it exists in our geographic region. Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies). While murder certainly isn't unknown up here, it's rarely more than one per year (if that), and is often on the part of passers-through on one-another and not natives! About a decade or so back, the Crips and Bloods both tried making inroads up here forming gangs for the purpose of drug-running and such, but we as a populace saw them and put the rush on them; they've not returned! Most households are armed (hunting) and know how to use those arms (mucho former Military), but the majority are not Wayne LaPierre type paranoids. I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! Don't take this as an indictment as I am not in \"your\" shoes and don't see what you see where you are, but it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue! The Second Amendment is safe IMHO; if I seriously thought that it was truly in danger, I'd be out there screaming my head off too! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-18 06:49:00", 
        "title": "The REALITY of gun control", 
        "userID": "KJ1110"
    }, 
    {
        "content": "When Guns Are Outlawed...Only Oulaws Will Have Gun's! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090518, 
        "postID": 19, 
        "quote": "", 
        "reply": "When Guns Are Outlawed...Only Oulaws Will Have Gun's! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-18 06:56:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies)... I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! ...it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue! I agree it would suck to constantly exist in a state of fear but a little paranoia has saved many a person many a time. The idea of being armed and prepared to use is just the old Boy Scout motto: Be Prepared. As the saying goes, \"better to have a gun and not need it than to need one and NOT have it\". Maybe a gun in the right hand at the right time would reduce that \"one murder per year\" you mentioned to one per decade...or century.", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "Originally posted by KJ1110: Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies)... I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! ...it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue!", 
        "reply": " I agree it would suck to constantly exist in a state of fear but a little paranoia has saved many a person many a time. The idea of being armed and prepared to use is just the old Boy Scout motto: Be Prepared. As the saying goes, \"better to have a gun and not need it than to need one and NOT have it\". Maybe a gun in the right hand at the right time would reduce that \"one murder per year\" you mentioned to one per decade...or century.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-18 16:53:00", 
        "title": "The REALITY of gun control", 
        "userID": "cheapthrills"
    }, 
    {
        "content": "Stole this from SOCNET. It is just TOO good not to post here. EDIT: to fix picture This message has been edited. Last edited by: FollowMeInfantry, Sat 16 May 2009 09:47 AM It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 21, 
        "quote": "", 
        "reply": "Stole this from SOCNET. It is just TOO good not to post here. EDIT: to fix picture This message has been edited. Last edited by: FollowMeInfantry, Sat 16 May 2009 09:47 AM It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 07:41:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Richard, I'm not sure what I'm to look for at that website! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090516, 
        "postID": 22, 
        "quote": "", 
        "reply": "Richard, I'm not sure what I'm to look for at that website! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 07:49:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website! Whatcha mean, bro? Didn't the picture show up? It shows up here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 23, 
        "quote": "Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website!", 
        "reply": " Whatcha mean, bro? Didn't the picture show up? It shows up here. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 07:59:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website! Whatcha mean, bro? Didn't the picture show up? It shows up here. Not on my screen it doesn't. All I see is the infamous red x.", 
        "intTime": 20090516, 
        "postID": 24, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: Richard, I'm not sure what I'm to look for at that website! Whatcha mean, bro? Didn't the picture show up? It shows up here.", 
        "reply": " Not on my screen it doesn't. All I see is the infamous red x.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:21:00", 
        "title": "The REALITY of gun control", 
        "userID": "stillkit"
    }, 
    {
        "content": "Well, RATS. Try this. Can you see it now? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 25, 
        "quote": "", 
        "reply": "Well, RATS. Try this. Can you see it now? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:34:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "It's a lady in a T-shirt with a pistol aiming at a target. The T-shirt reads: \"Gun Control: The theory that a woman found dead in an alley, raped and strangled with her own pantyhose, is somehow morally superior to a woman explaining to police how her attacker got that fatal bullet wound.\" \"http://www.socnet.com/showthread.php?t=86272\" (Remove quotes, copy and paste link) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090516, 
        "postID": 26, 
        "quote": "", 
        "reply": "It's a lady in a T-shirt with a pistol aiming at a target. The T-shirt reads: \"Gun Control: The theory that a woman found dead in an alley, raped and strangled with her own pantyhose, is somehow morally superior to a woman explaining to police how her attacker got that fatal bullet wound.\" \"http://www.socnet.com/showthread.php?t=86272\" (Remove quotes, copy and paste link) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:38:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Gun control: Being able to hit what you aim at. There is only one thing worse than messing an old fart, and that is messing with two.", 
        "intTime": 20090516, 
        "postID": 27, 
        "quote": "", 
        "reply": "Gun control: Being able to hit what you aim at. There is only one thing worse than messing an old fart, and that is messing with two.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 08:41:00", 
        "title": "The REALITY of gun control", 
        "userID": "Hutch863"
    }, 
    {
        "content": "Love it !!!", 
        "intTime": 20090516, 
        "postID": 28, 
        "quote": "", 
        "reply": "Love it !!!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 09:37:00", 
        "title": "The REALITY of gun control", 
        "userID": "PBMKC"
    }, 
    {
        "content": "There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns????", 
        "intTime": 20090516, 
        "postID": 29, 
        "quote": "", 
        "reply": "There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns????", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 11:05:00", 
        "title": "The REALITY of gun control", 
        "userID": "DeBe888"
    }, 
    {
        "content": "I can see it now and wonder if it's significant that the target she's aiming at is.....a MAN!", 
        "intTime": 20090516, 
        "postID": 30, 
        "quote": "", 
        "reply": "I can see it now and wonder if it's significant that the target she's aiming at is.....a MAN!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 14:29:00", 
        "title": "The REALITY of gun control", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by DeBe888: There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns???? Good idea, a doctor damn near killed me in 1987! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090516, 
        "postID": 31, 
        "quote": "Originally posted by DeBe888: There are over 700,000 deaths in the US EVERY year due to medical ERROR. Approx. 1500 accidental deaths from weapons. Perhaps we should outlaw Doctors instead of handguns????", 
        "reply": " Good idea, a doctor damn near killed me in 1987! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 19:39:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090516, 
        "postID": 32, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 19:43:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "In this day and age, how can you tell beyond all doubt that the target is a man?", 
        "intTime": 20090516, 
        "postID": 33, 
        "quote": "", 
        "reply": "In this day and age, how can you tell beyond all doubt that the target is a man?", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-16 20:28:00", 
        "title": "The REALITY of gun control", 
        "userID": "tawodi"
    }, 
    {
        "content": "Good one tawodi! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090517, 
        "postID": 34, 
        "quote": "", 
        "reply": "Good one tawodi! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 06:52:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090517, 
        "postID": 35, 
        "quote": "", 
        "reply": "I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 07:01:00", 
        "title": "The REALITY of gun control", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090517, 
        "postID": 36, 
        "quote": "Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state.", 
        "reply": " Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 07:07:00", 
        "title": "The REALITY of gun control", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. Richard, you said it well! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090517, 
        "postID": 37, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by KJ1110: I find it telling that so many of you choose to live in an area where a human being is your potential target (for whatever reason) is so common a concept! In this region, about the only time a human is in somebody's sights is when an over-eager, inexperienced idiot is trusted with a high-powered rifle during hunting season, and they're usually from a large city or out of state. Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality.", 
        "reply": " Richard, you said it well! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-17 18:27:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality. Oh, no! It's reality, but the reality as it exists in our geographic region. Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies). While murder certainly isn't unknown up here, it's rarely more than one per year (if that), and is often on the part of passers-through on one-another and not natives! About a decade or so back, the Crips and Bloods both tried making inroads up here forming gangs for the purpose of drug-running and such, but we as a populace saw them and put the rush on them; they've not returned! Most households are armed (hunting) and know how to use those arms (mucho former Military), but the majority are not Wayne LaPierre type paranoids. I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! Don't take this as an indictment as I am not in \"your\" shoes and don't see what you see where you are, but it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue! The Second Amendment is safe IMHO; if I seriously thought that it was truly in danger, I'd be out there screaming my head off too! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090518, 
        "postID": 38, 
        "quote": "Originally posted by FollowMeInfantry: Then you have a personal Utopia distanced from reality. Crime happens EVERYWHERE, friend. Everywhere. You can pretend that it does not exist. But it does. The only thing that keeps a person from becoming a victim is the refusal to have a victim's mentality.", 
        "reply": " Oh, no! It's reality, but the reality as it exists in our geographic region. Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies). While murder certainly isn't unknown up here, it's rarely more than one per year (if that), and is often on the part of passers-through on one-another and not natives! About a decade or so back, the Crips and Bloods both tried making inroads up here forming gangs for the purpose of drug-running and such, but we as a populace saw them and put the rush on them; they've not returned! Most households are armed (hunting) and know how to use those arms (mucho former Military), but the majority are not Wayne LaPierre type paranoids. I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! Don't take this as an indictment as I am not in \"your\" shoes and don't see what you see where you are, but it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue! The Second Amendment is safe IMHO; if I seriously thought that it was truly in danger, I'd be out there screaming my head off too! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-18 06:49:00", 
        "title": "The REALITY of gun control", 
        "userID": "KJ1110"
    }, 
    {
        "content": "When Guns Are Outlawed...Only Oulaws Will Have Gun's! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090518, 
        "postID": 39, 
        "quote": "", 
        "reply": "When Guns Are Outlawed...Only Oulaws Will Have Gun's! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-18 06:56:00", 
        "title": "The REALITY of gun control", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies)... I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! ...it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue! I agree it would suck to constantly exist in a state of fear but a little paranoia has saved many a person many a time. The idea of being armed and prepared to use is just the old Boy Scout motto: Be Prepared. As the saying goes, \"better to have a gun and not need it than to need one and NOT have it\". Maybe a gun in the right hand at the right time would reduce that \"one murder per year\" you mentioned to one per decade...or century.", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "Originally posted by KJ1110: Around here, many still don't lock their doors (I do, but that's just me), most get along well with their neighbors and even are welcoming of total strangers, and most don't feel a need for CCW (many have the permits, but don't carry). We have our share of crime, but most of it is petty (Joy-riding, OUI, traffic, minor possession busts, and the odd growing operation or Meth Cook-shack) or low-level white-collar (embezzling, high-grading supplies)... I think that largely, it's just an attitude of not allowing the fear-mongers to stampede us into being always afraid! ...it just strikes me as incredibly sad that people always seem to be in some state of fear over this issue!", 
        "reply": " I agree it would suck to constantly exist in a state of fear but a little paranoia has saved many a person many a time. The idea of being armed and prepared to use is just the old Boy Scout motto: Be Prepared. As the saying goes, \"better to have a gun and not need it than to need one and NOT have it\". Maybe a gun in the right hand at the right time would reduce that \"one murder per year\" you mentioned to one per decade...or century.", 
        "threadID": "5291911282_8830044322001", 
        "time": "2009-05-18 16:53:00", 
        "title": "The REALITY of gun control", 
        "userID": "cheapthrills"
    }
]