[
    {
        "content": "First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 06:58:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Only that the winner usually decides for the history books which title to apply. Whether one fights in a \"rebellion\" or a \"revolution\" depends on if you are successful. Makes it all the more important to win.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "Only that the winner usually decides for the history books which title to apply. Whether one fights in a \"rebellion\" or a \"revolution\" depends on if you are successful. Makes it all the more important to win.", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 07:24:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: Only that the winner usually decides for the history books which title to apply. Whether one fights in a \"rebellion\" or a \"revolution\" depends on if you are successful. Makes it all the more important to win. I remember a quote from General Patton something like \"I wouldn't give a da*n for someone who lost and laughed.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "Originally posted by M1Lase_n_Blaze: Only that the winner usually decides for the history books which title to apply. Whether one fights in a \"rebellion\" or a \"revolution\" depends on if you are successful. Makes it all the more important to win.", 
        "reply": " I remember a quote from General Patton something like \"I wouldn't give a da*n for someone who lost and laughed.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 07:44:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Can Insurgents really win against Partisans who are organized? It seems that Insurgents are a ragtag bunch who use violence to intimidate. If the Partisans organize and refuse to be intimidated they can defeat the Insurgents Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "Can Insurgents really win against Partisans who are organized? It seems that Insurgents are a ragtag bunch who use violence to intimidate. If the Partisans organize and refuse to be intimidated they can defeat the Insurgents Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 08:00:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: Only that the winner usually decides for the history books which title to apply. Whether one fights in a \"rebellion\" or a \"revolution\" depends on if you are successful. Makes it all the more important to win. A history professor once told our class that the difference between a traitor and a patriot is the winner of the war. If the British has put down that little uprising by the colonials in the late 1700's, kids in New York would be attending Benedict Arnold HS. There would a Cornwallis University somewhere in Ohio. But that't not the case. The patriots won the Revolution and the name Benedict Arnold will always be synonymous with traitor.", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Originally posted by M1Lase_n_Blaze: Only that the winner usually decides for the history books which title to apply. Whether one fights in a \"rebellion\" or a \"revolution\" depends on if you are successful. Makes it all the more important to win.", 
        "reply": " A history professor once told our class that the difference between a traitor and a patriot is the winner of the war. If the British has put down that little uprising by the colonials in the late 1700's, kids in New York would be attending Benedict Arnold HS. There would a Cornwallis University somewhere in Ohio. But that't not the case. The patriots won the Revolution and the name Benedict Arnold will always be synonymous with traitor.", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 10:02:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Can Insurgents really win against Partisans who are organized? It seems that Insurgents are a ragtag bunch who use violence to intimidate. If the Partisans organize and refuse to be intimidated they can defeat the Insurgents Hmmm, I never considered them fighting against each other but that's an interesting idea. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "Originally posted by Bergy46: Can Insurgents really win against Partisans who are organized? It seems that Insurgents are a ragtag bunch who use violence to intimidate. If the Partisans organize and refuse to be intimidated they can defeat the Insurgents", 
        "reply": " Hmmm, I never considered them fighting against each other but that's an interesting idea. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 10:09:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: history professor once told our class that the difference between a traitor and a patriot is the winner of the war. If the British has put down that little uprising by the colonials in the late 1700's, kids in New York would be attending Benedict Arnold HS. There would a Cornwallis University somewhere in Ohio. Do you think we might also be speaking English? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "history professor once told our class that the difference between a traitor and a patriot is the winner of the war. If the British has put down that little uprising by the colonials in the late 1700's, kids in New York would be attending Benedict Arnold HS. There would a Cornwallis University somewhere in Ohio.", 
        "reply": " Do you think we might also be speaking English? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 10:11:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Do you think we might also be speaking English? Naaah...I think we'd still be using the American dialect we use now. The schools might to teach it correctly differently. I forget who said it, but it was something about the American's and British are separated by a comman language.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "Do you think we might also be speaking English?", 
        "reply": " Naaah...I think we'd still be using the American dialect we use now. The schools might to teach it correctly differently. I forget who said it, but it was something about the American's and British are separated by a comman language.", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 10:57:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Bergy46: Can Insurgents really win against Partisans who are organized? It seems that Insurgents are a ragtag bunch who use violence to intimidate. If the Partisans organize and refuse to be intimidated they can defeat the Insurgents Hmmm, I never considered them fighting against each other but that's an interesting idea. I thought they were two different factions! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Bergy46: Can Insurgents really win against Partisans who are organized? It seems that Insurgents are a ragtag bunch who use violence to intimidate. If the Partisans organize and refuse to be intimidated they can defeat the Insurgents Hmmm, I never considered them fighting against each other but that's an interesting idea.", 
        "reply": " I thought they were two different factions! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 16:38:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Bergy46"
    }, 
    {
        "content": "It probably depends on whether your the invader or the invadee Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090302, 
        "postID": 10, 
        "quote": "", 
        "reply": "It probably depends on whether your the invader or the invadee Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 19:09:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts? PArtisans - shouldering up with ya - - Insurgents - shootin' at ya - - Simple 'nough - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "Originally posted by Vicdude: First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts?", 
        "reply": " PArtisans - shouldering up with ya - - Insurgents - shootin' at ya - - Simple 'nough - - Wandering and Wondering", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-02 20:35:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts? I'm with you sans one caveat - Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "Originally posted by Vicdude: First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts?", 
        "reply": " I'm with you sans one caveat - Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 03:09:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents?", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland.", 
        "reply": " Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 05:10:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: quote: Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents? Yup. Yup. Yup...... Look, both the media and our government have given them this nice, credible name \"insurgent\", instead of calling them \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" because it would be too factual, it would take up too much ink/space, and it might pizz off the \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" so much to be properly described that they would declare \"jihad\" on specific media groups and governmental agencies, who would then have to run and hide in a hole to survive, like Salman Rushdie... They are alll to chickenshyyt for that... So it's safer to call the \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" Insurgents - - Wandering and Wondering", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "Originally posted by PSimon572: quote: Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents?", 
        "reply": " Yup. Yup. Yup...... Look, both the media and our government have given them this nice, credible name \"insurgent\", instead of calling them \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" because it would be too factual, it would take up too much ink/space, and it might pizz off the \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" so much to be properly described that they would declare \"jihad\" on specific media groups and governmental agencies, who would then have to run and hide in a hole to survive, like Salman Rushdie... They are alll to chickenshyyt for that... So it's safer to call the \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" Insurgents - - Wandering and Wondering", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 06:13:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: quote: Do you think we might also be speaking English? Naaah...I think we'd still be using the American dialect we use now. The schools might to teach it correctly differently. I forget who said it, but it was something about the American's and British are separated by a comman language. That gentleman was Sir Winston Churchill. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by PSimon572: quote: Do you think we might also be speaking English? Naaah...I think we'd still be using the American dialect we use now. The schools might to teach it correctly differently. I forget who said it, but it was something about the American's and British are separated by a comman language.", 
        "reply": " That gentleman was Sir Winston Churchill. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 06:21:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents? I suspect so since the term insurgent isn't tied to any particular group. This is the definition of insurgent. in·sur·gent (n-sûrjnt) adj. 1. Rising in revolt against established authority, especially a government. 2. Rebelling against the leadership of a political party. n. One who is insurgent. Actually I hadn't thought about an exact definition. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents?", 
        "reply": " I suspect so since the term insurgent isn't tied to any particular group. This is the definition of insurgent. in·sur·gent (n-sûrjnt) adj. 1. Rising in revolt against established authority, especially a government. 2. Rebelling against the leadership of a political party. n. One who is insurgent. Actually I hadn't thought about an exact definition. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 06:37:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: quote: Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents? I thought that was exactly what I said... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "Originally posted by PSimon572: quote: Iraqi insurgents are nothing akin to partisans, as a partisan defends his or her country. The Iraqi insurgents care nothing for patriotism; they just want to kill infidels because we're the debil. Unlike a partisan, they'll go anywhere to do just that. A partisan is only interested in the integrity of their homeland. Isn't the goal of the insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If that's the case, they don't have a single nation to be partisans of, but they are partisans of their world. The outcome will determine if they are partisans or insurgents. Afterall, if the Nazis had won WWII, wouldn't the partisans been tried as criminals/insurgents?", 
        "reply": " I thought that was exactly what I said... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 07:12:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: I thought that was exactly what I said... Then I didn't make my point very clear. I took your statement to show a difference between partisans and insurgents. I'm saying that history will determine if the \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" are partisans or insurgents.", 
        "intTime": 20090303, 
        "postID": 18, 
        "quote": "I thought that was exactly what I said...", 
        "reply": " Then I didn't make my point very clear. I took your statement to show a difference between partisans and insurgents. I'm saying that history will determine if the \"murdering, animalistic, slimeball fvvvking Islamic shyyytheads\" are partisans or insurgents.", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 07:27:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by Vicdude: First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts? PArtisans - shouldering up with ya - - Insurgents - shootin' at ya - - Simple 'nough - - GWG, That's what I thought. That's basically what I was refering to in my first post! Thanks for clearing that up! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 19, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by Vicdude: First please don't think I'm defending the insurgents in Iraq in any way, shape or form. If y'all find this topic offensive I hope the administrator will remove it. That being said, I've often made mental comparisons between the insurgents in Iraq and the partisans<SP> that fought in France and other countries, I guess, during WWII. Has anyone else had smiler thoughts? PArtisans - shouldering up with ya - - Insurgents - shootin' at ya - - Simple 'nough - -", 
        "reply": " GWG, That's what I thought. That's basically what I was refering to in my first post! Thanks for clearing that up! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 07:31:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Isn't the goal of those insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World? If I'm reading this right replacing the word \"the\" with \"those\" is all that's needed to make it clear. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 20, 
        "quote": "Isn't the goal of those insurgents to drive the Great Satan from the world? Aren't they hell bent on making it an Islamic World?", 
        "reply": " If I'm reading this right replacing the word \"the\" with \"those\" is all that's needed to make it clear. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1430066612001", 
        "time": "2009-03-03 07:37:00", 
        "title": "Insurgents vs Partisans", 
        "userID": "Vicdude"
    }
]