[
    {
        "content": "Snake eats frog. Frog finally gets tired of being eaten and jumps out of snakes mouth. Kinda' neat, actually. \"http://www.break.com/index/frog-escapes-snakes-stomach.html\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "", 
        "reply": "Snake eats frog. Frog finally gets tired of being eaten and jumps out of snakes mouth. Kinda' neat, actually. \"http://www.break.com/index/frog-escapes-snakes-stomach.html\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 06:09:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "The best footage I ever saw of a battle of wildlife has to be what they showed on CNN a few years back. A whale watch boat was offshore of maybe Washington State when they filmed a Great White Shark battling a Killer Whale. I guess it went on for about 40 mins with blood flying everywhere. Eventually, the Orca won. Don", 
        "intTime": 20090514, 
        "postID": 2, 
        "quote": "", 
        "reply": "The best footage I ever saw of a battle of wildlife has to be what they showed on CNN a few years back. A whale watch boat was offshore of maybe Washington State when they filmed a Great White Shark battling a Killer Whale. I guess it went on for about 40 mins with blood flying everywhere. Eventually, the Orca won. Don", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 06:44:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "THAT is what happens when snakes start on the wrong side. amazingly enough, their prey does not WANT to be eaten. i gigured, once it got to the upper arms, that frog was going to ave enough. that frog was never going to be digested, dead of alive. the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach. cool thging is, i have HEARD of snakes trying to eat a meal backwards, but until today i have never SEEN it. thanks FMI, i'll be passing this video off to the Herp society.", 
        "intTime": 20090514, 
        "postID": 3, 
        "quote": "", 
        "reply": "THAT is what happens when snakes start on the wrong side. amazingly enough, their prey does not WANT to be eaten. i gigured, once it got to the upper arms, that frog was going to ave enough. that frog was never going to be digested, dead of alive. the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach. cool thging is, i have HEARD of snakes trying to eat a meal backwards, but until today i have never SEEN it. thanks FMI, i'll be passing this video off to the Herp society.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 06:57:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Elesso"
    }, 
    {
        "content": "Felt so sorry for the frog when he was being eaten. I can't stand to hear anything cry. I think the snake might have succeeded, if only he had stayed on dry land, but when he went for a swim, maybe enough water got into his mouth to help the frog get free. Resist the devil.... even when it seems hopeless! Ya never know!", 
        "intTime": 20090514, 
        "postID": 4, 
        "quote": "", 
        "reply": "Felt so sorry for the frog when he was being eaten. I can't stand to hear anything cry. I think the snake might have succeeded, if only he had stayed on dry land, but when he went for a swim, maybe enough water got into his mouth to help the frog get free. Resist the devil.... even when it seems hopeless! Ya never know!", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 09:38:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Kinda' neat, actually. Down right cool !!", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "Kinda' neat, actually.", 
        "reply": " Down right cool !!", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 09:56:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "spikerzzz"
    }, 
    {
        "content": "saw something similar on Nat'l Geo channel a while back.. in some jungle somewhere - they were filming this frog and this salamander walks in front of it. The frog snaps it up and swallows it - begins walking away. Then a short time later they show the frog, dead and the salamander comes crawling out of its mouth. Then it said the salamander was of a poisonous type, that when pestered it's skin seeps this poison stuff...... never saw anything like that before. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090514, 
        "postID": 6, 
        "quote": "", 
        "reply": "saw something similar on Nat'l Geo channel a while back.. in some jungle somewhere - they were filming this frog and this salamander walks in front of it. The frog snaps it up and swallows it - begins walking away. Then a short time later they show the frog, dead and the salamander comes crawling out of its mouth. Then it said the salamander was of a poisonous type, that when pestered it's skin seeps this poison stuff...... never saw anything like that before. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 10:07:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: saw something similar on Nat'l Geo channel a while back.. in some jungle somewhere - they were filming this frog and this salamander walks in front of it. The frog snaps it up and swallows it - begins walking away. Then a short time later they show the frog, dead and the salamander comes crawling out of its mouth. Then it said the salamander was of a poisonous type, that when pestered it's skin seeps this poison stuff...... never saw anything like that before. yup... it was a Newt.... they are quite toxic when tey need to be", 
        "intTime": 20090514, 
        "postID": 7, 
        "quote": "Originally posted by m551sheridan: saw something similar on Nat'l Geo channel a while back.. in some jungle somewhere - they were filming this frog and this salamander walks in front of it. The frog snaps it up and swallows it - begins walking away. Then a short time later they show the frog, dead and the salamander comes crawling out of its mouth. Then it said the salamander was of a poisonous type, that when pestered it's skin seeps this poison stuff...... never saw anything like that before.", 
        "reply": " yup... it was a Newt.... they are quite toxic when tey need to be", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 10:23:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by m551sheridan: saw something similar on Nat'l Geo channel a while back.. in some jungle somewhere - they were filming this frog and this salamander walks in front of it. The frog snaps it up and swallows it - begins walking away. Then a short time later they show the frog, dead and the salamander comes crawling out of its mouth. Then it said the salamander was of a poisonous type, that when pestered it's skin seeps this poison stuff...... never saw anything like that before. yup... it was a Newt.... they are quite toxic when tey need to be Yeah, that's what they said it was... could'nt think of the name. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "Originally posted by Elesso: quote: Originally posted by m551sheridan: saw something similar on Nat'l Geo channel a while back.. in some jungle somewhere - they were filming this frog and this salamander walks in front of it. The frog snaps it up and swallows it - begins walking away. Then a short time later they show the frog, dead and the salamander comes crawling out of its mouth. Then it said the salamander was of a poisonous type, that when pestered it's skin seeps this poison stuff...... never saw anything like that before. yup... it was a Newt.... they are quite toxic when tey need to be", 
        "reply": " Yeah, that's what they said it was... could'nt think of the name. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 10:41:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Go Kermie! Go Kermie! Go Kermie!", 
        "intTime": 20090514, 
        "postID": 9, 
        "quote": "", 
        "reply": "Go Kermie! Go Kermie! Go Kermie!", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 13:53:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Go Kermie! Go Kermie! Go Kermie! that's pretty good there girl...... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090514, 
        "postID": 10, 
        "quote": "Originally posted by Cider33_Alpha: Go Kermie! Go Kermie! Go Kermie!", 
        "reply": " that's pretty good there girl...... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 14:00:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "There is suppose to be a video on Youtube of a killer whale she has a liking for shark livers. I haven't seen it, but someone else has and says she hangs out with the seals or near them, you see a shark slowly homing in on a seal, and just when you think the shark is going to grab the seal, the orca makes a grab for the shark. It is all over so quick, and eats it's liver. I can't watch things like that. There is another one of some tourists watching whales, I think, and they see one chasing a penguin, they watched it for a while, and then the penguin jumps on their boat LOL.", 
        "intTime": 20090514, 
        "postID": 11, 
        "quote": "", 
        "reply": "There is suppose to be a video on Youtube of a killer whale she has a liking for shark livers. I haven't seen it, but someone else has and says she hangs out with the seals or near them, you see a shark slowly homing in on a seal, and just when you think the shark is going to grab the seal, the orca makes a grab for the shark. It is all over so quick, and eats it's liver. I can't watch things like that. There is another one of some tourists watching whales, I think, and they see one chasing a penguin, they watched it for a while, and then the penguin jumps on their boat LOL.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 15:12:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Opalfire"
    }, 
    {
        "content": "There was Python Gator battle in the Everglades a while back that was a pretty interesting sight. Don't think there was any video. There was a still though that I can't find now. Was pretty amazing they both died but the gator split the python wide open. woop found a link:++http://news.nationalgeographic.com/news/2005/10/1006_051006_pythoneatsgator.html++ As the kids said, eeewwww!", 
        "intTime": 20090514, 
        "postID": 12, 
        "quote": "", 
        "reply": "There was Python Gator battle in the Everglades a while back that was a pretty interesting sight. Don't think there was any video. There was a still though that I can't find now. Was pretty amazing they both died but the gator split the python wide open. woop found a link:++http://news.nationalgeographic.com/news/2005/10/1006_051006_pythoneatsgator.html++ As the kids said, eeewwww!", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-14 17:43:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "If you have a weak stomach don't open this one. \"http://home.att.net/~crinaustin/Snake2.htm\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090515, 
        "postID": 13, 
        "quote": "", 
        "reply": "If you have a weak stomach don't open this one. \"http://home.att.net/~crinaustin/Snake2.htm\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 06:20:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Opalfire: There is another one of some tourists watching whales, I think, and they see one chasing a penguin, they watched it for a while, and then the penguin jumps on their boat LOL. HAHA, GREAT video! \"http://www.youtube.com/watch?v=EBwqbqZ3L60\" (remove quotes, copy and paste link). I love the way the penguin is on the side of the boat looking at the Orcas - you can almost hear it going \"plllllbbbbbbttttttttt!\" LMAO! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 14, 
        "quote": "Originally posted by Opalfire: There is another one of some tourists watching whales, I think, and they see one chasing a penguin, they watched it for a while, and then the penguin jumps on their boat LOL.", 
        "reply": " HAHA, GREAT video! \"http://www.youtube.com/watch?v=EBwqbqZ3L60\" (remove quotes, copy and paste link). I love the way the penguin is on the side of the boat looking at the Orcas - you can almost hear it going \"plllllbbbbbbttttttttt!\" LMAO! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 06:21:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Elesso: THAT is what happens when snakes start on the wrong side. amazingly enough, their prey does not WANT to be eaten. i gigured, once it got to the upper arms, that frog was going to ave enough. that frog was never going to be digested, dead of alive. the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach. cool thging is, i have HEARD of snakes trying to eat a meal backwards, but until today i have never SEEN it. thanks FMI, i'll be passing this video off to the Herp society. Hi Elesso, As our resident snake expert, can you explain what this means in layman's terms to me? \"the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach.\" What does \"impacted in the [...] stomach\" mean? That it would get stuck or something? And why would the snake regurgitate the frog after a day just because it ate it backwards? This stuff is FASCINATING! I like to learn all I can about it, and I love snakes. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "Originally posted by Elesso: THAT is what happens when snakes start on the wrong side. amazingly enough, their prey does not WANT to be eaten. i gigured, once it got to the upper arms, that frog was going to ave enough. that frog was never going to be digested, dead of alive. the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach. cool thging is, i have HEARD of snakes trying to eat a meal backwards, but until today i have never SEEN it. thanks FMI, i'll be passing this video off to the Herp society.", 
        "reply": " Hi Elesso, As our resident snake expert, can you explain what this means in layman's terms to me? \"the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach.\" What does \"impacted in the [...] stomach\" mean? That it would get stuck or something? And why would the snake regurgitate the frog after a day just because it ate it backwards? This stuff is FASCINATING! I like to learn all I can about it, and I love snakes. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 06:31:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Elesso: THAT is what happens when snakes start on the wrong side. amazingly enough, their prey does not WANT to be eaten. i gigured, once it got to the upper arms, that frog was going to ave enough. that frog was never going to be digested, dead of alive. the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach. cool thging is, i have HEARD of snakes trying to eat a meal backwards, but until today i have never SEEN it. thanks FMI, i'll be passing this video off to the Herp society. Hi Elesso, As our resident snake expert, can you explain what this means in layman's terms to me? \"the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach.\" What does \"impacted in the [...] stomach\" mean? That it would get stuck or something? And why would the snake regurgitate the frog after a day just because it ate it backwards? This stuff is FASCINATING! I like to learn all I can about it, and I love snakes. nowhere close to expert. just know a little here and therer. in laymen's terms, \"to regurge\" is to regurgitate. (obviously) there is lies a problem, as most snakes have a bacteria intheir stomachs that break down the food. when they throw up the food AND the bacteris comes out, and unless replaced, the snake can starve to death. remember the snake matrix 1.- can i eat it? 2.- can it eat ME? 3.- can i make more snakes with it? beyond that they are not really concerned with anything else so \"i feel sick\" is followed with where is there food? as far as an impaction goes, impaction is plainly a blockage in the intestine: snake anatomy (hot link, i know) this will lead to death more often than not, unless taken toa vet, and since this one is in the wild, his chances are lessened", 
        "intTime": 20090515, 
        "postID": 16, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Elesso: THAT is what happens when snakes start on the wrong side. amazingly enough, their prey does not WANT to be eaten. i gigured, once it got to the upper arms, that frog was going to ave enough. that frog was never going to be digested, dead of alive. the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach. cool thging is, i have HEARD of snakes trying to eat a meal backwards, but until today i have never SEEN it. thanks FMI, i'll be passing this video off to the Herp society. Hi Elesso, As our resident snake expert, can you explain what this means in layman's terms to me? \"the snake was lucky. that frog would have either been regurged within the day, or would have impacted in the snake's stomach.\" What does \"impacted in the [...] stomach\" mean? That it would get stuck or something? And why would the snake regurgitate the frog after a day just because it ate it backwards? This stuff is FASCINATING! I like to learn all I can about it, and I love snakes.", 
        "reply": " nowhere close to expert. just know a little here and therer. in laymen's terms, \"to regurge\" is to regurgitate. (obviously) there is lies a problem, as most snakes have a bacteria intheir stomachs that break down the food. when they throw up the food AND the bacteris comes out, and unless replaced, the snake can starve to death. remember the snake matrix 1.- can i eat it? 2.- can it eat ME? 3.- can i make more snakes with it? beyond that they are not really concerned with anything else so \"i feel sick\" is followed with where is there food? as far as an impaction goes, impaction is plainly a blockage in the intestine: snake anatomy (hot link, i know) this will lead to death more often than not, unless taken toa vet, and since this one is in the wild, his chances are lessened", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 07:40:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Elesso"
    }, 
    {
        "content": "Mornin yall, Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090515, 
        "postID": 17, 
        "quote": "", 
        "reply": "Mornin yall, Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 07:45:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "Bergy46"
    }, 
    {
        "content": "You see poster of crane with frog in throat and the frog has the crane BY the throat, caption, \"Never give in!\"", 
        "intTime": 20090515, 
        "postID": 18, 
        "quote": "", 
        "reply": "You see poster of crane with frog in throat and the frog has the crane BY the throat, caption, \"Never give in!\"", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 11:21:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "SGTBJH"
    }, 
    {
        "content": "quote: Originally posted by SGTBJH: You see poster of crane with frog in throat and the frog has the crane BY the throat, caption, \"Never give in!\" That's what motivated me to post this. I love that poster! Check out the penguin a few posts back if'n you get a chance. You'll get a good chuckle from it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090515, 
        "postID": 19, 
        "quote": "Originally posted by SGTBJH: You see poster of crane with frog in throat and the frog has the crane BY the throat, caption, \"Never give in!\"", 
        "reply": " That's what motivated me to post this. I love that poster! Check out the penguin a few posts back if'n you get a chance. You'll get a good chuckle from it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-15 11:52:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "'Pengies' are very funny, indeed. New ones have a tough row to hoe getting past the many predators (seals, etc) that await them once they leave the nesting/nursery areas where they are born and raised to sufficient age. What unusual and well-adapted birds.", 
        "intTime": 20090519, 
        "postID": 20, 
        "quote": "", 
        "reply": "'Pengies' are very funny, indeed. New ones have a tough row to hoe getting past the many predators (seals, etc) that await them once they leave the nesting/nursery areas where they are born and raised to sufficient age. What unusual and well-adapted birds.", 
        "threadID": "5291911282_2100082322001", 
        "time": "2009-05-19 09:19:00", 
        "title": "Never surrender!  Snake v. frog", 
        "userID": "LHA_3Rusty"
    }
]