[
    {
        "content": "Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl.", 
        "intTime": 20090306, 
        "postID": 1, 
        "quote": "", 
        "reply": "Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:19:00", 
        "title": "Disgusting", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: He glared at me Beat the snot out of the POS. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "He glared at me", 
        "reply": " Beat the snot out of the POS. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:25:00", 
        "title": "Disgusting", 
        "userID": "rm444"
    }, 
    {
        "content": "Welcome to Amexica - - Wandering and Wondering", 
        "intTime": 20090306, 
        "postID": 3, 
        "quote": "", 
        "reply": "Welcome to Amexica - - Wandering and Wondering", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:41:00", 
        "title": "Disgusting", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Maybe he thought he was still at home.... Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "", 
        "reply": "Maybe he thought he was still at home.... Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:43:00", 
        "title": "Disgusting", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "quote: Originally posted by ReaperDoc: Maybe he thought he was still at in his home.... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "Originally posted by ReaperDoc: Maybe he thought he was still at in his home....", 
        "reply": " Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:32:00", 
        "title": "Disgusting", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "That is mcnasty!!!!! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "", 
        "reply": "That is mcnasty!!!!! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:37:00", 
        "title": "Disgusting", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "kinda makes one wonder what he does in the produce isle.... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "", 
        "reply": "kinda makes one wonder what he does in the produce isle.... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:41:00", 
        "title": "Disgusting", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Terry, If ya could have grabbed him around the back of the neck, force him to his knees, make him lick it off the floor. If he doesn't want to do that, advise him he is in great danger of physical pain!!!! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "", 
        "reply": "Terry, If ya could have grabbed him around the back of the neck, force him to his knees, make him lick it off the floor. If he doesn't want to do that, advise him he is in great danger of physical pain!!!! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:42:00", 
        "title": "Disgusting", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Do what I do: Stay out of Wal-Mart.", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "", 
        "reply": "Do what I do: Stay out of Wal-Mart.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:30:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart. Easy to Say, wanta talk to my Wife? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart.", 
        "reply": " Easy to Say, wanta talk to my Wife? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:38:00", 
        "title": "Disgusting", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "I hate the place mcgreer and we grocery shop at 2 other stores but needed three things that would have required going to a sporting good store a pharmacy and a grocery store. We decided to get all 3 at Wally World. Bruce, believe me I wanted to do just that.", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "", 
        "reply": "I hate the place mcgreer and we grocery shop at 2 other stores but needed three things that would have required going to a sporting good store a pharmacy and a grocery store. We decided to get all 3 at Wally World. Bruce, believe me I wanted to do just that.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:40:00", 
        "title": "Disgusting", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart. Easy to Say, wanta talk to my Wife? Nope - that's your job. My wife hates the place.", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart. Easy to Say, wanta talk to my Wife?", 
        "reply": " Nope - that's your job. My wife hates the place.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:40:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Walmart use to be good place to shop when Sam Walton was alive. But after he died the the stores were changed into cess pits for goods from third world countries. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "", 
        "reply": "Walmart use to be good place to shop when Sam Walton was alive. But after he died the the stores were changed into cess pits for goods from third world countries. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:08:00", 
        "title": "Disgusting", 
        "userID": "DSTremf"
    }, 
    {
        "content": "It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "", 
        "reply": "It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:23:00", 
        "title": "Disgusting", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl. I would smacked him upside his head with a beef brisket. People have no decorum or just simple decency. It almost makes me want to cry.", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "Originally posted by Wolfhound_1968: Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl.", 
        "reply": " I would smacked him upside his head with a beef brisket. People have no decorum or just simple decency. It almost makes me want to cry.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:29:00", 
        "title": "Disgusting", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? The Target thign about it being French is false. go to snopes and check it out", 
        "intTime": 20090306, 
        "postID": 16, 
        "quote": "Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "reply": " The Target thign about it being French is false. go to snopes and check it out", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:30:00", 
        "title": "Disgusting", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Oh thanks for letting me know billdawg. I am a creature of habit and I was not looking forward to having to change my route. lol Kinda scary how a rumor can get started like that, don't you think? What if someone at the other company like Walmart started it?", 
        "intTime": 20090306, 
        "postID": 17, 
        "quote": "", 
        "reply": "Oh thanks for letting me know billdawg. I am a creature of habit and I was not looking forward to having to change my route. lol Kinda scary how a rumor can get started like that, don't you think? What if someone at the other company like Walmart started it?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:57:00", 
        "title": "Disgusting", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? LMAO Where do you guys get your information? a. Target is an American company. Its headquarters is in Minneapolis, and has been around for over 100 years (though under a different name), b. Target has been a corporate sponsor of the Vietnam Veterans' Memorial Fund. I never cease to be amazed at the level of ignorance out here. Do you guys ever bother to check the information you get?", 
        "intTime": 20090306, 
        "postID": 18, 
        "quote": "Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "reply": " LMAO Where do you guys get your information? a. Target is an American company. Its headquarters is in Minneapolis, and has been around for over 100 years (though under a different name), b. Target has been a corporate sponsor of the Vietnam Veterans' Memorial Fund. I never cease to be amazed at the level of ignorance out here. Do you guys ever bother to check the information you get?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 21:20:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? The Target thign about it being French is false. go to snopes and check it out Oh, no - the real pronunciation is Tar-ZHEY. LOL", 
        "intTime": 20090306, 
        "postID": 19, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? The Target thign about it being French is false. go to snopes and check it out", 
        "reply": " Oh, no - the real pronunciation is Tar-ZHEY. LOL", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 21:21:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Target gives a lot of money away to the community too, they always have. There are several people I know who work for places that benefit from targets charitable contributions. There are a lot of rumours and urban legends out there, most don't make any sense, but my mil keeps sending me so much false information because she received via email. I don't think Walmart is so charitable anymore. I could be wrong.", 
        "intTime": 20090306, 
        "postID": 20, 
        "quote": "", 
        "reply": "Target gives a lot of money away to the community too, they always have. There are several people I know who work for places that benefit from targets charitable contributions. There are a lot of rumours and urban legends out there, most don't make any sense, but my mil keeps sending me so much false information because she received via email. I don't think Walmart is so charitable anymore. I could be wrong.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 22:13:00", 
        "title": "Disgusting", 
        "userID": "Opalfire"
    }, 
    {
        "content": "Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl.", 
        "intTime": 20090306, 
        "postID": 21, 
        "quote": "", 
        "reply": "Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:19:00", 
        "title": "Disgusting", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: He glared at me Beat the snot out of the POS. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090306, 
        "postID": 22, 
        "quote": "He glared at me", 
        "reply": " Beat the snot out of the POS. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:25:00", 
        "title": "Disgusting", 
        "userID": "rm444"
    }, 
    {
        "content": "Welcome to Amexica - - Wandering and Wondering", 
        "intTime": 20090306, 
        "postID": 23, 
        "quote": "", 
        "reply": "Welcome to Amexica - - Wandering and Wondering", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:41:00", 
        "title": "Disgusting", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Maybe he thought he was still at home.... Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090306, 
        "postID": 24, 
        "quote": "", 
        "reply": "Maybe he thought he was still at home.... Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 16:43:00", 
        "title": "Disgusting", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "quote: Originally posted by ReaperDoc: Maybe he thought he was still at in his home.... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090306, 
        "postID": 25, 
        "quote": "Originally posted by ReaperDoc: Maybe he thought he was still at in his home....", 
        "reply": " Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:32:00", 
        "title": "Disgusting", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "That is mcnasty!!!!! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090306, 
        "postID": 26, 
        "quote": "", 
        "reply": "That is mcnasty!!!!! \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:37:00", 
        "title": "Disgusting", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "kinda makes one wonder what he does in the produce isle.... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090306, 
        "postID": 27, 
        "quote": "", 
        "reply": "kinda makes one wonder what he does in the produce isle.... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:41:00", 
        "title": "Disgusting", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Terry, If ya could have grabbed him around the back of the neck, force him to his knees, make him lick it off the floor. If he doesn't want to do that, advise him he is in great danger of physical pain!!!! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090306, 
        "postID": 28, 
        "quote": "", 
        "reply": "Terry, If ya could have grabbed him around the back of the neck, force him to his knees, make him lick it off the floor. If he doesn't want to do that, advise him he is in great danger of physical pain!!!! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 17:42:00", 
        "title": "Disgusting", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Do what I do: Stay out of Wal-Mart.", 
        "intTime": 20090306, 
        "postID": 29, 
        "quote": "", 
        "reply": "Do what I do: Stay out of Wal-Mart.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:30:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart. Easy to Say, wanta talk to my Wife? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090306, 
        "postID": 30, 
        "quote": "Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart.", 
        "reply": " Easy to Say, wanta talk to my Wife? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:38:00", 
        "title": "Disgusting", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "I hate the place mcgreer and we grocery shop at 2 other stores but needed three things that would have required going to a sporting good store a pharmacy and a grocery store. We decided to get all 3 at Wally World. Bruce, believe me I wanted to do just that.", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "", 
        "reply": "I hate the place mcgreer and we grocery shop at 2 other stores but needed three things that would have required going to a sporting good store a pharmacy and a grocery store. We decided to get all 3 at Wally World. Bruce, believe me I wanted to do just that.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:40:00", 
        "title": "Disgusting", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart. Easy to Say, wanta talk to my Wife? Nope - that's your job. My wife hates the place.", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by mcgreer: Do what I do: Stay out of Wal-Mart. Easy to Say, wanta talk to my Wife?", 
        "reply": " Nope - that's your job. My wife hates the place.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 18:40:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Walmart use to be good place to shop when Sam Walton was alive. But after he died the the stores were changed into cess pits for goods from third world countries. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "", 
        "reply": "Walmart use to be good place to shop when Sam Walton was alive. But after he died the the stores were changed into cess pits for goods from third world countries. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:08:00", 
        "title": "Disgusting", 
        "userID": "DSTremf"
    }, 
    {
        "content": "It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "", 
        "reply": "It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:23:00", 
        "title": "Disgusting", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl. I would smacked him upside his head with a beef brisket. People have no decorum or just simple decency. It almost makes me want to cry.", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "Originally posted by Wolfhound_1968: Just got back from Walmart and what I saw is disgusting. I was standing by the frozen food counter and a Mexican spit a goober on the floor not 20 feet from me. I responded without thinking and said, “You filthy son-of-a-*****”. He glared at me but said nothing and walked away. I was ready to hit him beside the head with anything I could get my hands on if he said anything or started trouble. I showed Sharon where he spit (beside the food) and said it makes me want to put everything back and leave. I’ve seen people spit on sidewalks outside but never in the store and especially in the food section. Still makes my skin crawl.", 
        "reply": " I would smacked him upside his head with a beef brisket. People have no decorum or just simple decency. It almost makes me want to cry.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:29:00", 
        "title": "Disgusting", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? The Target thign about it being French is false. go to snopes and check it out", 
        "intTime": 20090306, 
        "postID": 36, 
        "quote": "Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "reply": " The Target thign about it being French is false. go to snopes and check it out", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:30:00", 
        "title": "Disgusting", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Oh thanks for letting me know billdawg. I am a creature of habit and I was not looking forward to having to change my route. lol Kinda scary how a rumor can get started like that, don't you think? What if someone at the other company like Walmart started it?", 
        "intTime": 20090306, 
        "postID": 37, 
        "quote": "", 
        "reply": "Oh thanks for letting me know billdawg. I am a creature of habit and I was not looking forward to having to change my route. lol Kinda scary how a rumor can get started like that, don't you think? What if someone at the other company like Walmart started it?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 20:57:00", 
        "title": "Disgusting", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? LMAO Where do you guys get your information? a. Target is an American company. Its headquarters is in Minneapolis, and has been around for over 100 years (though under a different name), b. Target has been a corporate sponsor of the Vietnam Veterans' Memorial Fund. I never cease to be amazed at the level of ignorance out here. Do you guys ever bother to check the information you get?", 
        "intTime": 20090306, 
        "postID": 38, 
        "quote": "Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think?", 
        "reply": " LMAO Where do you guys get your information? a. Target is an American company. Its headquarters is in Minneapolis, and has been around for over 100 years (though under a different name), b. Target has been a corporate sponsor of the Vietnam Veterans' Memorial Fund. I never cease to be amazed at the level of ignorance out here. Do you guys ever bother to check the information you get?", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 21:20:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? The Target thign about it being French is false. go to snopes and check it out Oh, no - the real pronunciation is Tar-ZHEY. LOL", 
        "intTime": 20090306, 
        "postID": 39, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by usa_girl: It is all so disrespectful. I can't believe how some people act in public. I see people throw things out of their car all the time and it makes me sick. I wish I could give them a ticket. I think the only way to stop people from doing things like that is to make them have to deal with the after math. Like the person in the store should have had to clean the floor, the person throwing things out of the car should have to pick up trash on the side of the road, the person who does not pick up after their pet should have to pick up poo etc Oh, and did anyone get the email about Target? It said that Target is a French owned company and does not support the military. Is that true? They said it did not meet their charitable deeds. If that is true it offends me and I am not shopping there. We have to wake up and only support American business right now. We have to be informed and active in keeping the money and the jobs here don't you think? The Target thign about it being French is false. go to snopes and check it out", 
        "reply": " Oh, no - the real pronunciation is Tar-ZHEY. LOL", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 21:21:00", 
        "title": "Disgusting", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Target gives a lot of money away to the community too, they always have. There are several people I know who work for places that benefit from targets charitable contributions. There are a lot of rumours and urban legends out there, most don't make any sense, but my mil keeps sending me so much false information because she received via email. I don't think Walmart is so charitable anymore. I could be wrong.", 
        "intTime": 20090306, 
        "postID": 40, 
        "quote": "", 
        "reply": "Target gives a lot of money away to the community too, they always have. There are several people I know who work for places that benefit from targets charitable contributions. There are a lot of rumours and urban legends out there, most don't make any sense, but my mil keeps sending me so much false information because she received via email. I don't think Walmart is so charitable anymore. I could be wrong.", 
        "threadID": "5291911282_8350031712001", 
        "time": "2009-03-06 22:13:00", 
        "title": "Disgusting", 
        "userID": "Opalfire"
    }
]