[
    {
        "content": "Original work of poster, Thomas E. Carsley Citations at bottom of work. Since the days of its European discovery and subsequent colonization, then the formation into the United States of America, we have been a nation of linguistic diversity. Europeans that came here to the United States were just as different in the tongues they spoke as in any other geographic area of the globe. However, as time went on English became the dominant language. Though many are of European decent, English is not the language of their ancestors. It is only correct to dismiss the “my culture” argument that is presented as an excuse by many people for not learning English. For example, my family coming here was to escape the Nazi government in Germany, and then learned English. In America, it is widely ignored that Europeans are so diverse. Research shows many amazing studies and analyses of this subject. From the logical and well thought out to the complete opposite fringes of Hispanic groups wanting to kick all Europeans out of the Americas in the name of a mythical Aztlan nation (La voz de Aztlan. Volume IV. Issue 28. March, 09 2008). The reviews have been startling; they are all over the place in perspectives. This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion. Over the many past generations our ancestors came here having many different goals yet overall the desire was to be Americans, and a factor of that becoming an American was the pride in knowing English. There is pride in becoming a part of something held dear, dreams, and aspirations, saluting the flag of the nation and getting goose bumps as it goes by, being able to speak the tongue of the land. In America today, there are 311 languages spoken in the home once the day is done. More than half are indigenous, 162 are pre-European languages (National Virtual Translation Center. 2007). While it is perceived by the public that Spanish is an up and rising overwhelming language (Oxford Analytica. 2006), statistically speaking, it is only 10% of the population speaking it at home (NVTC 2007). Granted, those figures change with a migratory mainly Spanish-speaking population coming and going from their countries of origin (Migration Policy Institute 2007). English is the number one household language at 82% (NVTC 2007), all other languages, aside from English and Spanish, combined make up 8% (NVTC 2007). We are Americans; the operational language of America is English. Whether there is a Constitutional Amendment or not. If a person comes to the United States it should be expected that they adjust to this country, not the reverse. Can it be imagined a military made up of people all speaking other languages and trying to communicate a mission. Or in a business trying to pass on a plan of action, yet it never goes anywhere because no one can fully understand the intent of direction? A climate of political correctness, extremist lobbyist (Tancredo, T. 2006) and corporate pandering (Latin Know. 2006) is affecting this aspect of the language war that is simmering just below the surface of our society. Instead of pulling America together under a common condition, they are all instead creating divisiveness among the people of the Nation. Americans all celebrate their cultures, recognize our heritages, but together we are this, we are Americans, and to take this quoted passage from Theodore Roosevelt all the way back in 1915 and is still just as meaningful today, just forgotten, Roosevelt, T. (1915) “There is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalized Americans. Some of the very best Americans I have ever known were naturalized Americans, Americans born abroad. But a hyphenated American is not an American at all. This is just as true of the man who puts “native” before the hyphen as of the man who puts German or Irish or English or French before the hyphen. Americanism is a matter of the spirit and of the soul. Our allegiance must be purely to the United States. We must unsparingly condemn any man who holds any other allegiance. But if he is heartily and singly loyal to this Republic, then no matter where he was born, he is just as good an American as any one else.” (Chapultepec, Inc. 1999-2006). Americans live by the attitude of recognition when dealing with all manners of heritages in this Nation. For example, I, as someone having traveled to other countries that do not have the tapestry of cultures as we do, and as much as I loved experiencing the cultures of the world, I could not wait to get back to the United States and immerse myself in all the colors, languages and fantastic people of this country. Though it seems we are slipping and letting the standards slide (Turbak, G. 2008). There are even naturalization ceremonies being conducted in Spanish (Turbak, G. 2008). The standard of expectations of new immigrants to learn English is not being held up; instead it is being lowered to make accommodations (Jacoby, J. 2002). The United States fails with a lower standard, the farther America slips into no longer being a nation of united peoples, we will only become divided and then we will surly fail all who are in search of the American ideals so proudly and strongly held onto. Many have the belief that the while many younger Spanish speaking people feel that learning English is a burden and resist it, it is their parents, that in a Florida survey (Turbak, G. 2008), stated that learning English was their 4th priority for the education of their children, learning Spanish place 67th in priority (Turbak, G. 2008). All the while school bilingual classes instead of immersion are having no affect on the drop out rate of Spanish speaking students. The drop out rate has remained closely the same hovering around 44% now and as it was when the program started (Institute of education sciences 2000). This is the highest drop out rate of any sector of American society (IES 2000). This dropout rate is higher among Hispanic students coming in from other countries than those born in the United States (IES 2000). However, the percentages drop dramatically as the generations go by to about 15%, yet still nearly twice that of other sectors (IES 2000). Perhaps the direct immersion into the culture can be the cause of this lower drop out rate of second generations and beyond. The evidence of the statistics points directly in the direction of teaching English all the time and not having these bilingual programs throughout the school grades. Children raised in direct contact instead of continuously taught in the culture of origin as time goes by do become more of the American norm. My own home is an example of this. My wife is from Puerto Rico, and even though it is an American territory, the language is Spanish. My children are fluent in both English and Spanish. English because my wife and I recognize that America is English based and to advance and have opportunity to take and not have to wait on anything the children must know English. My wife does not hide behind the argument of, “it is my culture,” she knows being an American is first and yet she maintains her heritage. Speaking English is not a threat to her culture. As a part of this same example, while we having been living in Puerto Rico it is nothing for a Puerto Rican to boldly tell me I need to learn Spanish to live there, and that person would be correct. Yet in the United States, if I were to tell a Spanish speaker that they needed to learn English, I immediately would have an accusation of racism. That is so far the point that political correctness has taken us to in always trying to be nice to everyone. No one would ever live in another country and expect the host nation to convert to your own language, you would have to learn the host nations. While language in America is by no means a simple argument, the research presented here is that the United States should and always be a diverse yet never divided people. As time and generations go by the American Dream will always be the same. Heritage will not be lost. Cultures will still be there. Each group must preserve individual pasts. To be here in America it is necessary to become an American, and here the day-to-day language is English. Presented here is a clear case of being able to speak the common language of the United States to advance in society, become educated, independent and be able to become a more productive member of American society. By allowing the catering to another language and not being more steadfast in influencing the desire to learn English we are ultimately hurting the United Stated and more obviously failing the youngest and newest within our society. A stand must be made to counter the bilingual America. Instead, guide immigrants to learn English and become Americans that are more productive. References Chapultepec, Inc. (1999-2006). Theodore Roosevelt, quotes, sayings, and aphorisms Retrieved February 18, 2008 from theodore-roosevelt.com/trquotes.html Institute of Education Sciences. (2000). Drop out rates in the United States: 2000. Retrieved March 10, 2008 from nces.ed.gov/pubs2002/droppub_2001/ Jacoby, J. (2002). Bilingual education’s voluminous failure. Retrieved March 09, 2008 from capmag.com/article.asp?ID=1925 Latin Know. (2006) The Latino marketing report. Retrieved March 09, 2008 from latin-know.typepad.com/latin_know_the_latino_mar/2006/02/index.html La voz de Aztlan. (Volume IV. Issue 28. March, 09 2008). Fidel Castro Ruz says US should return Aztlan back to Mexico. Retrieved March 09, 2008 from aztlan.net/castroaztlan.htm Mount, S. (2006). The U.S. Constitution Online. Official language legislation. Retrieved February 18, 2008 from usconstitution.net/consttop_lang.html Migration Policy Institute. (2007). Migration statistics for the United States. Retrieved March 09, 2008 from migrationinformation.org/datahub/charts/fb.1.shtml National Virtual Translation Center. (2007). Languages spoken in the United States. Retrieved February 18, 2008 from nvtc.gov/lotw/months/november/USlanguages.html Oxford Analytica. (2006). Spanish on the rise. Retrieved Sunday, March 09, 2008 from snurl.com/21d1l .forbes.com Pro-english language advocates. (2002). Teach our children English. Retrieved March 09, 2008 from proenglish.org/issues/education/bestatus.html Turbak, G. (2008). The Social Contract Press. The campaign against English. Retrieved February 18, 2008 from thesocialcontract.com/artman2/publish/tsc0403/article_347.shtml Tancredo, T. (2006) Treason lobby electing new (Spanish-Speaking) people in Denver Retrieved March 09, 2008 from buchanan.org/blog/?p=81", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "Original work of poster, Thomas E. Carsley Citations at bottom of work. Since the days of its European discovery and subsequent colonization, then the formation into the United States of America, we have been a nation of linguistic diversity. Europeans that came here to the United States were just as different in the tongues they spoke as in any other geographic area of the globe. However, as time went on English became the dominant language. Though many are of European decent, English is not the language of their ancestors. It is only correct to dismiss the “my culture” argument that is presented as an excuse by many people for not learning English. For example, my family coming here was to escape the Nazi government in Germany, and then learned English. In America, it is widely ignored that Europeans are so diverse. Research shows many amazing studies and analyses of this subject. From the logical and well thought out to the complete opposite fringes of Hispanic groups wanting to kick all Europeans out of the Americas in the name of a mythical Aztlan nation (La voz de Aztlan. Volume IV. Issue 28. March, 09 2008). The reviews have been startling; they are all over the place in perspectives. This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion. Over the many past generations our ancestors came here having many different goals yet overall the desire was to be Americans, and a factor of that becoming an American was the pride in knowing English. There is pride in becoming a part of something held dear, dreams, and aspirations, saluting the flag of the nation and getting goose bumps as it goes by, being able to speak the tongue of the land. In America today, there are 311 languages spoken in the home once the day is done. More than half are indigenous, 162 are pre-European languages (National Virtual Translation Center. 2007). While it is perceived by the public that Spanish is an up and rising overwhelming language (Oxford Analytica. 2006), statistically speaking, it is only 10% of the population speaking it at home (NVTC 2007). Granted, those figures change with a migratory mainly Spanish-speaking population coming and going from their countries of origin (Migration Policy Institute 2007). English is the number one household language at 82% (NVTC 2007), all other languages, aside from English and Spanish, combined make up 8% (NVTC 2007). We are Americans; the operational language of America is English. Whether there is a Constitutional Amendment or not. If a person comes to the United States it should be expected that they adjust to this country, not the reverse. Can it be imagined a military made up of people all speaking other languages and trying to communicate a mission. Or in a business trying to pass on a plan of action, yet it never goes anywhere because no one can fully understand the intent of direction? A climate of political correctness, extremist lobbyist (Tancredo, T. 2006) and corporate pandering (Latin Know. 2006) is affecting this aspect of the language war that is simmering just below the surface of our society. Instead of pulling America together under a common condition, they are all instead creating divisiveness among the people of the Nation. Americans all celebrate their cultures, recognize our heritages, but together we are this, we are Americans, and to take this quoted passage from Theodore Roosevelt all the way back in 1915 and is still just as meaningful today, just forgotten, Roosevelt, T. (1915) “There is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalized Americans. Some of the very best Americans I have ever known were naturalized Americans, Americans born abroad. But a hyphenated American is not an American at all. This is just as true of the man who puts “native” before the hyphen as of the man who puts German or Irish or English or French before the hyphen. Americanism is a matter of the spirit and of the soul. Our allegiance must be purely to the United States. We must unsparingly condemn any man who holds any other allegiance. But if he is heartily and singly loyal to this Republic, then no matter where he was born, he is just as good an American as any one else.” (Chapultepec, Inc. 1999-2006). Americans live by the attitude of recognition when dealing with all manners of heritages in this Nation. For example, I, as someone having traveled to other countries that do not have the tapestry of cultures as we do, and as much as I loved experiencing the cultures of the world, I could not wait to get back to the United States and immerse myself in all the colors, languages and fantastic people of this country. Though it seems we are slipping and letting the standards slide (Turbak, G. 2008). There are even naturalization ceremonies being conducted in Spanish (Turbak, G. 2008). The standard of expectations of new immigrants to learn English is not being held up; instead it is being lowered to make accommodations (Jacoby, J. 2002). The United States fails with a lower standard, the farther America slips into no longer being a nation of united peoples, we will only become divided and then we will surly fail all who are in search of the American ideals so proudly and strongly held onto. Many have the belief that the while many younger Spanish speaking people feel that learning English is a burden and resist it, it is their parents, that in a Florida survey (Turbak, G. 2008), stated that learning English was their 4th priority for the education of their children, learning Spanish place 67th in priority (Turbak, G. 2008). All the while school bilingual classes instead of immersion are having no affect on the drop out rate of Spanish speaking students. The drop out rate has remained closely the same hovering around 44% now and as it was when the program started (Institute of education sciences 2000). This is the highest drop out rate of any sector of American society (IES 2000). This dropout rate is higher among Hispanic students coming in from other countries than those born in the United States (IES 2000). However, the percentages drop dramatically as the generations go by to about 15%, yet still nearly twice that of other sectors (IES 2000). Perhaps the direct immersion into the culture can be the cause of this lower drop out rate of second generations and beyond. The evidence of the statistics points directly in the direction of teaching English all the time and not having these bilingual programs throughout the school grades. Children raised in direct contact instead of continuously taught in the culture of origin as time goes by do become more of the American norm. My own home is an example of this. My wife is from Puerto Rico, and even though it is an American territory, the language is Spanish. My children are fluent in both English and Spanish. English because my wife and I recognize that America is English based and to advance and have opportunity to take and not have to wait on anything the children must know English. My wife does not hide behind the argument of, “it is my culture,” she knows being an American is first and yet she maintains her heritage. Speaking English is not a threat to her culture. As a part of this same example, while we having been living in Puerto Rico it is nothing for a Puerto Rican to boldly tell me I need to learn Spanish to live there, and that person would be correct. Yet in the United States, if I were to tell a Spanish speaker that they needed to learn English, I immediately would have an accusation of racism. That is so far the point that political correctness has taken us to in always trying to be nice to everyone. No one would ever live in another country and expect the host nation to convert to your own language, you would have to learn the host nations. While language in America is by no means a simple argument, the research presented here is that the United States should and always be a diverse yet never divided people. As time and generations go by the American Dream will always be the same. Heritage will not be lost. Cultures will still be there. Each group must preserve individual pasts. To be here in America it is necessary to become an American, and here the day-to-day language is English. Presented here is a clear case of being able to speak the common language of the United States to advance in society, become educated, independent and be able to become a more productive member of American society. By allowing the catering to another language and not being more steadfast in influencing the desire to learn English we are ultimately hurting the United Stated and more obviously failing the youngest and newest within our society. A stand must be made to counter the bilingual America. Instead, guide immigrants to learn English and become Americans that are more productive. References Chapultepec, Inc. (1999-2006). Theodore Roosevelt, quotes, sayings, and aphorisms Retrieved February 18, 2008 from theodore-roosevelt.com/trquotes.html Institute of Education Sciences. (2000). Drop out rates in the United States: 2000. Retrieved March 10, 2008 from nces.ed.gov/pubs2002/droppub_2001/ Jacoby, J. (2002). Bilingual education’s voluminous failure. Retrieved March 09, 2008 from capmag.com/article.asp?ID=1925 Latin Know. (2006) The Latino marketing report. Retrieved March 09, 2008 from latin-know.typepad.com/latin_know_the_latino_mar/2006/02/index.html La voz de Aztlan. (Volume IV. Issue 28. March, 09 2008). Fidel Castro Ruz says US should return Aztlan back to Mexico. Retrieved March 09, 2008 from aztlan.net/castroaztlan.htm Mount, S. (2006). The U.S. Constitution Online. Official language legislation. Retrieved February 18, 2008 from usconstitution.net/consttop_lang.html Migration Policy Institute. (2007). Migration statistics for the United States. Retrieved March 09, 2008 from migrationinformation.org/datahub/charts/fb.1.shtml National Virtual Translation Center. (2007). Languages spoken in the United States. Retrieved February 18, 2008 from nvtc.gov/lotw/months/november/USlanguages.html Oxford Analytica. (2006). Spanish on the rise. Retrieved Sunday, March 09, 2008 from snurl.com/21d1l .forbes.com Pro-english language advocates. (2002). Teach our children English. Retrieved March 09, 2008 from proenglish.org/issues/education/bestatus.html Turbak, G. (2008). The Social Contract Press. The campaign against English. Retrieved February 18, 2008 from thesocialcontract.com/artman2/publish/tsc0403/article_347.shtml Tancredo, T. (2006) Treason lobby electing new (Spanish-Speaking) people in Denver Retrieved March 09, 2008 from buchanan.org/blog/?p=81", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 03:53:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "", 
        "reply": "MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 04:15:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again. All Good.", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "reply": " All Good.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 04:27:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": "The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost  There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 06:06:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "Originally posted by greywolfghost: The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time...", 
        "reply": " SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 07:08:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "EOCRon"
    }, 
    {
        "content": "There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "", 
        "reply": "There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 09:05:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again. You've been bad Kit! Now bend over and grab your ankles....", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "reply": " You've been bad Kit! Now bend over and grab your ankles....", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 10:59:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I agree Bergy.", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "", 
        "reply": "I agree Bergy.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 11:00:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Personally I'd love to learn a second language and Spanish would be my choice. That doesn't mean I'd abandon English. Nor does it mean I think the language of The USA will ever be Spanish. Some years ago I went to Austria. I was in a position to meet a lot of the Austrians and was shocked and embarrassed by the crowds of people who conversed with me in English. I'm not only speaking of \"educated\" adults. I'm speaking also of children maybe seven or eight. Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. Check out this URL \"http://en.wikipedia.org/wiki/Bilingualism_in_Canada\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment!", 
        "reply": " Personally I'd love to learn a second language and Spanish would be my choice. That doesn't mean I'd abandon English. Nor does it mean I think the language of The USA will ever be Spanish. Some years ago I went to Austria. I was in a position to meet a lot of the Austrians and was shocked and embarrassed by the crowds of people who conversed with me in English. I'm not only speaking of \"educated\" adults. I'm speaking also of children maybe seven or eight. Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. Check out this URL \"http://en.wikipedia.org/wiki/Bilingualism_in_Canada\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 11:44:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well.", 
        "reply": " +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 12:00:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Knele"
    }, 
    {
        "content": "Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same... Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "", 
        "reply": "Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same... Wandering and Wondering", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 12:05:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same... The research Mr. Carsley did was addressing two specific areas. \"This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion.\" He did not, directly address the question of illegals in the country. Even with that said, if one were to remove the illegals, there would still be the fact that the fastest segment of population growth in America is Hispanic. The desirably of having Spanish as a second language still exists. It will happen eventually. It's only a matter of taking a longer time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "Originally posted by greywolfghost: Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same...", 
        "reply": " The research Mr. Carsley did was addressing two specific areas. \"This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion.\" He did not, directly address the question of illegals in the country. Even with that said, if one were to remove the illegals, there would still be the fact that the fastest segment of population growth in America is Hispanic. The desirably of having Spanish as a second language still exists. It will happen eventually. It's only a matter of taking a longer time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 12:40:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Look, America has just about run the 2-300 year course that most Nations and/or Empires have ever managed to keep from crumbling. Most (Example: The Soviet Union) seldom even come close to that. With all the economic/political/military problems America is facing right now, it could be at or past the tipping point. I'm just telling you America has very little \"National Glue\" to hold it together. Because each State is a miniature Republic with its own Constitution, etc., there is no reason to believe America could not fracture into regions very easily. It has abandoned any attempt to hold together as a \"Christian Nation with a Manifest Destiny,\" and that rips away a good portion of its \"Traditional and Cultural\" glue. The \"Economy/Trade\" glue is dissolving right now, especially when the credit card bubble blows up. So, about the only things left to hold it together is its Federal/Constitutional Law glue and it Language glue. That's about all the Soviet Union had, just before it crumbled. Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "", 
        "reply": "Look, America has just about run the 2-300 year course that most Nations and/or Empires have ever managed to keep from crumbling. Most (Example: The Soviet Union) seldom even come close to that. With all the economic/political/military problems America is facing right now, it could be at or past the tipping point. I'm just telling you America has very little \"National Glue\" to hold it together. Because each State is a miniature Republic with its own Constitution, etc., there is no reason to believe America could not fracture into regions very easily. It has abandoned any attempt to hold together as a \"Christian Nation with a Manifest Destiny,\" and that rips away a good portion of its \"Traditional and Cultural\" glue. The \"Economy/Trade\" glue is dissolving right now, especially when the credit card bubble blows up. So, about the only things left to hold it together is its Federal/Constitutional Law glue and it Language glue. That's about all the Soviet Union had, just before it crumbled. Wandering and Wondering", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 13:06:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Exactly, the point is that not pushing to learn English is hurting people, with 2 for Spanish, all signs, packaging, having to know spanish to get a teaching job....all that is wrong headed. At home, people can speak whatever they want, I don't care. My own home is bilingual. If I could find people of other languages to hang out with my kids I'd be happy to add others to their abilities. But thinking that it is ok to not bother to learn English, that America should change for them, it silly. Every generation coming here has had to learn English, now, all of a sudden it's an issue.", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment!", 
        "reply": " Exactly, the point is that not pushing to learn English is hurting people, with 2 for Spanish, all signs, packaging, having to know spanish to get a teaching job....all that is wrong headed. At home, people can speak whatever they want, I don't care. My own home is bilingual. If I could find people of other languages to hang out with my kids I'd be happy to add others to their abilities. But thinking that it is ok to not bother to learn English, that America should change for them, it silly. Every generation coming here has had to learn English, now, all of a sudden it's an issue.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 15:07:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions Really, you mean like Quebec always trying to break away?", 
        "intTime": 20090323, 
        "postID": 15, 
        "quote": "Originally posted by Knele: quote: Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions", 
        "reply": " Really, you mean like Quebec always trying to break away?", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 15:11:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "I think it is great to speak more than one language. I am learning Spanish with Rosetta and at my age it is not that easy. I have sympathy for others who come here and shy away from learning English. I do think that people who want to come here and be American should want to learn English and embrace that as much as their native language. I don't think we should change our language to Spanish or any other language.", 
        "intTime": 20090323, 
        "postID": 16, 
        "quote": "", 
        "reply": "I think it is great to speak more than one language. I am learning Spanish with Rosetta and at my age it is not that easy. I have sympathy for others who come here and shy away from learning English. I do think that people who want to come here and be American should want to learn English and embrace that as much as their native language. I don't think we should change our language to Spanish or any other language.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 18:04:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles.... As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that!", 
        "intTime": 20090323, 
        "postID": 17, 
        "quote": "Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles....", 
        "reply": " As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that!", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 19:01:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stillkit"
    }, 
    {
        "content": "Don't y'all understand? Language isn't the issue which \"threatens\" America as we've known it. It's demographics. The inescapable fact is that immigrants coming to America now are not coming from Europe. They're coming from Latin America, southwest Asia and the Pacific Islands. That means a totally different majority looms in the future, which will mean fundamental changes to America IF the Constitution remains as it's guiding instrument. One of those changes will most likely be the dominant language, whether anybody likes it or not. The real issue which will determine America's future is whether or not white, Protestant descendents of Western European's will peacefully transfer power to the new brown and Catholic/Muslim/other/none majority. We've been the political power now for over 200 years, but that's changing and we will become less and less powerful as time goes by. Those \"new\" American's will become more and more powerful as they outnumber us. That means they'll have the votes and the power to change anything they like about this country. This will not be an immediate process. It will take a generation or more, but we are already nearly a minority to those other groups. All this talk about illegals and Mexican's and Muslim's and the English language is just the opening salvos of the struggle for political dominance, a struggle we white, Protestant Europeans are bound to lose eventually. If we lose gracefully and peacefully, America will survive just fine, but it will be radically different from the America we're used to. If we don't, we could see the end of our great experiment in representative democracy.", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "", 
        "reply": "Don't y'all understand? Language isn't the issue which \"threatens\" America as we've known it. It's demographics. The inescapable fact is that immigrants coming to America now are not coming from Europe. They're coming from Latin America, southwest Asia and the Pacific Islands. That means a totally different majority looms in the future, which will mean fundamental changes to America IF the Constitution remains as it's guiding instrument. One of those changes will most likely be the dominant language, whether anybody likes it or not. The real issue which will determine America's future is whether or not white, Protestant descendents of Western European's will peacefully transfer power to the new brown and Catholic/Muslim/other/none majority. We've been the political power now for over 200 years, but that's changing and we will become less and less powerful as time goes by. Those \"new\" American's will become more and more powerful as they outnumber us. That means they'll have the votes and the power to change anything they like about this country. This will not be an immediate process. It will take a generation or more, but we are already nearly a minority to those other groups. All this talk about illegals and Mexican's and Muslim's and the English language is just the opening salvos of the struggle for political dominance, a struggle we white, Protestant Europeans are bound to lose eventually. If we lose gracefully and peacefully, America will survive just fine, but it will be radically different from the America we're used to. If we don't, we could see the end of our great experiment in representative democracy.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 19:10:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles.... As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that! Now why the hell do you think I had whips (the closet thing available for a spanking) instead of something else????? Trust me, I don't go that way either.... LOL", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles.... As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that!", 
        "reply": " Now why the hell do you think I had whips (the closet thing available for a spanking) instead of something else????? Trust me, I don't go that way either.... LOL", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 19:25:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I took Spanish lessons in high school I failed it, I admire those who speak spanish AND English most Hispanics speak both. Some of the people I know speak 3 languages. I'm SO stupid I speak Enlish only", 
        "intTime": 20090324, 
        "postID": 20, 
        "quote": "", 
        "reply": "I took Spanish lessons in high school I failed it, I admire those who speak spanish AND English most Hispanics speak both. Some of the people I know speak 3 languages. I'm SO stupid I speak Enlish only", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-24 07:23:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stormer73"
    }, 
    {
        "content": "Original work of poster, Thomas E. Carsley Citations at bottom of work. Since the days of its European discovery and subsequent colonization, then the formation into the United States of America, we have been a nation of linguistic diversity. Europeans that came here to the United States were just as different in the tongues they spoke as in any other geographic area of the globe. However, as time went on English became the dominant language. Though many are of European decent, English is not the language of their ancestors. It is only correct to dismiss the “my culture” argument that is presented as an excuse by many people for not learning English. For example, my family coming here was to escape the Nazi government in Germany, and then learned English. In America, it is widely ignored that Europeans are so diverse. Research shows many amazing studies and analyses of this subject. From the logical and well thought out to the complete opposite fringes of Hispanic groups wanting to kick all Europeans out of the Americas in the name of a mythical Aztlan nation (La voz de Aztlan. Volume IV. Issue 28. March, 09 2008). The reviews have been startling; they are all over the place in perspectives. This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion. Over the many past generations our ancestors came here having many different goals yet overall the desire was to be Americans, and a factor of that becoming an American was the pride in knowing English. There is pride in becoming a part of something held dear, dreams, and aspirations, saluting the flag of the nation and getting goose bumps as it goes by, being able to speak the tongue of the land. In America today, there are 311 languages spoken in the home once the day is done. More than half are indigenous, 162 are pre-European languages (National Virtual Translation Center. 2007). While it is perceived by the public that Spanish is an up and rising overwhelming language (Oxford Analytica. 2006), statistically speaking, it is only 10% of the population speaking it at home (NVTC 2007). Granted, those figures change with a migratory mainly Spanish-speaking population coming and going from their countries of origin (Migration Policy Institute 2007). English is the number one household language at 82% (NVTC 2007), all other languages, aside from English and Spanish, combined make up 8% (NVTC 2007). We are Americans; the operational language of America is English. Whether there is a Constitutional Amendment or not. If a person comes to the United States it should be expected that they adjust to this country, not the reverse. Can it be imagined a military made up of people all speaking other languages and trying to communicate a mission. Or in a business trying to pass on a plan of action, yet it never goes anywhere because no one can fully understand the intent of direction? A climate of political correctness, extremist lobbyist (Tancredo, T. 2006) and corporate pandering (Latin Know. 2006) is affecting this aspect of the language war that is simmering just below the surface of our society. Instead of pulling America together under a common condition, they are all instead creating divisiveness among the people of the Nation. Americans all celebrate their cultures, recognize our heritages, but together we are this, we are Americans, and to take this quoted passage from Theodore Roosevelt all the way back in 1915 and is still just as meaningful today, just forgotten, Roosevelt, T. (1915) “There is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalized Americans. Some of the very best Americans I have ever known were naturalized Americans, Americans born abroad. But a hyphenated American is not an American at all. This is just as true of the man who puts “native” before the hyphen as of the man who puts German or Irish or English or French before the hyphen. Americanism is a matter of the spirit and of the soul. Our allegiance must be purely to the United States. We must unsparingly condemn any man who holds any other allegiance. But if he is heartily and singly loyal to this Republic, then no matter where he was born, he is just as good an American as any one else.” (Chapultepec, Inc. 1999-2006). Americans live by the attitude of recognition when dealing with all manners of heritages in this Nation. For example, I, as someone having traveled to other countries that do not have the tapestry of cultures as we do, and as much as I loved experiencing the cultures of the world, I could not wait to get back to the United States and immerse myself in all the colors, languages and fantastic people of this country. Though it seems we are slipping and letting the standards slide (Turbak, G. 2008). There are even naturalization ceremonies being conducted in Spanish (Turbak, G. 2008). The standard of expectations of new immigrants to learn English is not being held up; instead it is being lowered to make accommodations (Jacoby, J. 2002). The United States fails with a lower standard, the farther America slips into no longer being a nation of united peoples, we will only become divided and then we will surly fail all who are in search of the American ideals so proudly and strongly held onto. Many have the belief that the while many younger Spanish speaking people feel that learning English is a burden and resist it, it is their parents, that in a Florida survey (Turbak, G. 2008), stated that learning English was their 4th priority for the education of their children, learning Spanish place 67th in priority (Turbak, G. 2008). All the while school bilingual classes instead of immersion are having no affect on the drop out rate of Spanish speaking students. The drop out rate has remained closely the same hovering around 44% now and as it was when the program started (Institute of education sciences 2000). This is the highest drop out rate of any sector of American society (IES 2000). This dropout rate is higher among Hispanic students coming in from other countries than those born in the United States (IES 2000). However, the percentages drop dramatically as the generations go by to about 15%, yet still nearly twice that of other sectors (IES 2000). Perhaps the direct immersion into the culture can be the cause of this lower drop out rate of second generations and beyond. The evidence of the statistics points directly in the direction of teaching English all the time and not having these bilingual programs throughout the school grades. Children raised in direct contact instead of continuously taught in the culture of origin as time goes by do become more of the American norm. My own home is an example of this. My wife is from Puerto Rico, and even though it is an American territory, the language is Spanish. My children are fluent in both English and Spanish. English because my wife and I recognize that America is English based and to advance and have opportunity to take and not have to wait on anything the children must know English. My wife does not hide behind the argument of, “it is my culture,” she knows being an American is first and yet she maintains her heritage. Speaking English is not a threat to her culture. As a part of this same example, while we having been living in Puerto Rico it is nothing for a Puerto Rican to boldly tell me I need to learn Spanish to live there, and that person would be correct. Yet in the United States, if I were to tell a Spanish speaker that they needed to learn English, I immediately would have an accusation of racism. That is so far the point that political correctness has taken us to in always trying to be nice to everyone. No one would ever live in another country and expect the host nation to convert to your own language, you would have to learn the host nations. While language in America is by no means a simple argument, the research presented here is that the United States should and always be a diverse yet never divided people. As time and generations go by the American Dream will always be the same. Heritage will not be lost. Cultures will still be there. Each group must preserve individual pasts. To be here in America it is necessary to become an American, and here the day-to-day language is English. Presented here is a clear case of being able to speak the common language of the United States to advance in society, become educated, independent and be able to become a more productive member of American society. By allowing the catering to another language and not being more steadfast in influencing the desire to learn English we are ultimately hurting the United Stated and more obviously failing the youngest and newest within our society. A stand must be made to counter the bilingual America. Instead, guide immigrants to learn English and become Americans that are more productive. References Chapultepec, Inc. (1999-2006). Theodore Roosevelt, quotes, sayings, and aphorisms Retrieved February 18, 2008 from theodore-roosevelt.com/trquotes.html Institute of Education Sciences. (2000). Drop out rates in the United States: 2000. Retrieved March 10, 2008 from nces.ed.gov/pubs2002/droppub_2001/ Jacoby, J. (2002). Bilingual education’s voluminous failure. Retrieved March 09, 2008 from capmag.com/article.asp?ID=1925 Latin Know. (2006) The Latino marketing report. Retrieved March 09, 2008 from latin-know.typepad.com/latin_know_the_latino_mar/2006/02/index.html La voz de Aztlan. (Volume IV. Issue 28. March, 09 2008). Fidel Castro Ruz says US should return Aztlan back to Mexico. Retrieved March 09, 2008 from aztlan.net/castroaztlan.htm Mount, S. (2006). The U.S. Constitution Online. Official language legislation. Retrieved February 18, 2008 from usconstitution.net/consttop_lang.html Migration Policy Institute. (2007). Migration statistics for the United States. Retrieved March 09, 2008 from migrationinformation.org/datahub/charts/fb.1.shtml National Virtual Translation Center. (2007). Languages spoken in the United States. Retrieved February 18, 2008 from nvtc.gov/lotw/months/november/USlanguages.html Oxford Analytica. (2006). Spanish on the rise. Retrieved Sunday, March 09, 2008 from snurl.com/21d1l .forbes.com Pro-english language advocates. (2002). Teach our children English. Retrieved March 09, 2008 from proenglish.org/issues/education/bestatus.html Turbak, G. (2008). The Social Contract Press. The campaign against English. Retrieved February 18, 2008 from thesocialcontract.com/artman2/publish/tsc0403/article_347.shtml Tancredo, T. (2006) Treason lobby electing new (Spanish-Speaking) people in Denver Retrieved March 09, 2008 from buchanan.org/blog/?p=81", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "", 
        "reply": "Original work of poster, Thomas E. Carsley Citations at bottom of work. Since the days of its European discovery and subsequent colonization, then the formation into the United States of America, we have been a nation of linguistic diversity. Europeans that came here to the United States were just as different in the tongues they spoke as in any other geographic area of the globe. However, as time went on English became the dominant language. Though many are of European decent, English is not the language of their ancestors. It is only correct to dismiss the “my culture” argument that is presented as an excuse by many people for not learning English. For example, my family coming here was to escape the Nazi government in Germany, and then learned English. In America, it is widely ignored that Europeans are so diverse. Research shows many amazing studies and analyses of this subject. From the logical and well thought out to the complete opposite fringes of Hispanic groups wanting to kick all Europeans out of the Americas in the name of a mythical Aztlan nation (La voz de Aztlan. Volume IV. Issue 28. March, 09 2008). The reviews have been startling; they are all over the place in perspectives. This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion. Over the many past generations our ancestors came here having many different goals yet overall the desire was to be Americans, and a factor of that becoming an American was the pride in knowing English. There is pride in becoming a part of something held dear, dreams, and aspirations, saluting the flag of the nation and getting goose bumps as it goes by, being able to speak the tongue of the land. In America today, there are 311 languages spoken in the home once the day is done. More than half are indigenous, 162 are pre-European languages (National Virtual Translation Center. 2007). While it is perceived by the public that Spanish is an up and rising overwhelming language (Oxford Analytica. 2006), statistically speaking, it is only 10% of the population speaking it at home (NVTC 2007). Granted, those figures change with a migratory mainly Spanish-speaking population coming and going from their countries of origin (Migration Policy Institute 2007). English is the number one household language at 82% (NVTC 2007), all other languages, aside from English and Spanish, combined make up 8% (NVTC 2007). We are Americans; the operational language of America is English. Whether there is a Constitutional Amendment or not. If a person comes to the United States it should be expected that they adjust to this country, not the reverse. Can it be imagined a military made up of people all speaking other languages and trying to communicate a mission. Or in a business trying to pass on a plan of action, yet it never goes anywhere because no one can fully understand the intent of direction? A climate of political correctness, extremist lobbyist (Tancredo, T. 2006) and corporate pandering (Latin Know. 2006) is affecting this aspect of the language war that is simmering just below the surface of our society. Instead of pulling America together under a common condition, they are all instead creating divisiveness among the people of the Nation. Americans all celebrate their cultures, recognize our heritages, but together we are this, we are Americans, and to take this quoted passage from Theodore Roosevelt all the way back in 1915 and is still just as meaningful today, just forgotten, Roosevelt, T. (1915) “There is no room in this country for hyphenated Americanism. When I refer to hyphenated Americans, I do not refer to naturalized Americans. Some of the very best Americans I have ever known were naturalized Americans, Americans born abroad. But a hyphenated American is not an American at all. This is just as true of the man who puts “native” before the hyphen as of the man who puts German or Irish or English or French before the hyphen. Americanism is a matter of the spirit and of the soul. Our allegiance must be purely to the United States. We must unsparingly condemn any man who holds any other allegiance. But if he is heartily and singly loyal to this Republic, then no matter where he was born, he is just as good an American as any one else.” (Chapultepec, Inc. 1999-2006). Americans live by the attitude of recognition when dealing with all manners of heritages in this Nation. For example, I, as someone having traveled to other countries that do not have the tapestry of cultures as we do, and as much as I loved experiencing the cultures of the world, I could not wait to get back to the United States and immerse myself in all the colors, languages and fantastic people of this country. Though it seems we are slipping and letting the standards slide (Turbak, G. 2008). There are even naturalization ceremonies being conducted in Spanish (Turbak, G. 2008). The standard of expectations of new immigrants to learn English is not being held up; instead it is being lowered to make accommodations (Jacoby, J. 2002). The United States fails with a lower standard, the farther America slips into no longer being a nation of united peoples, we will only become divided and then we will surly fail all who are in search of the American ideals so proudly and strongly held onto. Many have the belief that the while many younger Spanish speaking people feel that learning English is a burden and resist it, it is their parents, that in a Florida survey (Turbak, G. 2008), stated that learning English was their 4th priority for the education of their children, learning Spanish place 67th in priority (Turbak, G. 2008). All the while school bilingual classes instead of immersion are having no affect on the drop out rate of Spanish speaking students. The drop out rate has remained closely the same hovering around 44% now and as it was when the program started (Institute of education sciences 2000). This is the highest drop out rate of any sector of American society (IES 2000). This dropout rate is higher among Hispanic students coming in from other countries than those born in the United States (IES 2000). However, the percentages drop dramatically as the generations go by to about 15%, yet still nearly twice that of other sectors (IES 2000). Perhaps the direct immersion into the culture can be the cause of this lower drop out rate of second generations and beyond. The evidence of the statistics points directly in the direction of teaching English all the time and not having these bilingual programs throughout the school grades. Children raised in direct contact instead of continuously taught in the culture of origin as time goes by do become more of the American norm. My own home is an example of this. My wife is from Puerto Rico, and even though it is an American territory, the language is Spanish. My children are fluent in both English and Spanish. English because my wife and I recognize that America is English based and to advance and have opportunity to take and not have to wait on anything the children must know English. My wife does not hide behind the argument of, “it is my culture,” she knows being an American is first and yet she maintains her heritage. Speaking English is not a threat to her culture. As a part of this same example, while we having been living in Puerto Rico it is nothing for a Puerto Rican to boldly tell me I need to learn Spanish to live there, and that person would be correct. Yet in the United States, if I were to tell a Spanish speaker that they needed to learn English, I immediately would have an accusation of racism. That is so far the point that political correctness has taken us to in always trying to be nice to everyone. No one would ever live in another country and expect the host nation to convert to your own language, you would have to learn the host nations. While language in America is by no means a simple argument, the research presented here is that the United States should and always be a diverse yet never divided people. As time and generations go by the American Dream will always be the same. Heritage will not be lost. Cultures will still be there. Each group must preserve individual pasts. To be here in America it is necessary to become an American, and here the day-to-day language is English. Presented here is a clear case of being able to speak the common language of the United States to advance in society, become educated, independent and be able to become a more productive member of American society. By allowing the catering to another language and not being more steadfast in influencing the desire to learn English we are ultimately hurting the United Stated and more obviously failing the youngest and newest within our society. A stand must be made to counter the bilingual America. Instead, guide immigrants to learn English and become Americans that are more productive. References Chapultepec, Inc. (1999-2006). Theodore Roosevelt, quotes, sayings, and aphorisms Retrieved February 18, 2008 from theodore-roosevelt.com/trquotes.html Institute of Education Sciences. (2000). Drop out rates in the United States: 2000. Retrieved March 10, 2008 from nces.ed.gov/pubs2002/droppub_2001/ Jacoby, J. (2002). Bilingual education’s voluminous failure. Retrieved March 09, 2008 from capmag.com/article.asp?ID=1925 Latin Know. (2006) The Latino marketing report. Retrieved March 09, 2008 from latin-know.typepad.com/latin_know_the_latino_mar/2006/02/index.html La voz de Aztlan. (Volume IV. Issue 28. March, 09 2008). Fidel Castro Ruz says US should return Aztlan back to Mexico. Retrieved March 09, 2008 from aztlan.net/castroaztlan.htm Mount, S. (2006). The U.S. Constitution Online. Official language legislation. Retrieved February 18, 2008 from usconstitution.net/consttop_lang.html Migration Policy Institute. (2007). Migration statistics for the United States. Retrieved March 09, 2008 from migrationinformation.org/datahub/charts/fb.1.shtml National Virtual Translation Center. (2007). Languages spoken in the United States. Retrieved February 18, 2008 from nvtc.gov/lotw/months/november/USlanguages.html Oxford Analytica. (2006). Spanish on the rise. Retrieved Sunday, March 09, 2008 from snurl.com/21d1l .forbes.com Pro-english language advocates. (2002). Teach our children English. Retrieved March 09, 2008 from proenglish.org/issues/education/bestatus.html Turbak, G. (2008). The Social Contract Press. The campaign against English. Retrieved February 18, 2008 from thesocialcontract.com/artman2/publish/tsc0403/article_347.shtml Tancredo, T. (2006) Treason lobby electing new (Spanish-Speaking) people in Denver Retrieved March 09, 2008 from buchanan.org/blog/?p=81", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 03:53:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "", 
        "reply": "MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 04:15:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again. All Good.", 
        "intTime": 20090323, 
        "postID": 23, 
        "quote": "Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "reply": " All Good.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 04:27:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 24, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": "The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost  There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 06:06:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "Originally posted by greywolfghost: The following is a post of mine from another thread which discussed similar ideas to the posts I had here that disappeared. My stance on this topic is that America will eventually shatter along \"bilingual/multi-lingual\" lines just like Czechoslovakia and Yugoslavia if no major effort is made. Yet Academic Elites and Politicians, being heavily influences by minority and liberal activists, have labeled \"Melting Pot\", \"Assimilation\" and \"Americanization\" as filthy un-American terms that must be replaced with \"bilingual/multi-lingual\" and \"diversity.\" If that continues, America as we know it is dead, because it is a \"common language\" to clearly communicate laws, ideas, culture, and history. As that evaporates, there will be more and more who refuse to take part saying, \"That is YOUR laws, ideas, culture, and history! Not MINE!!\" And the United States will be dead! greywolfghost quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time...", 
        "reply": " SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 07:08:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "EOCRon"
    }, 
    {
        "content": "There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "", 
        "reply": "There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 09:05:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again. You've been bad Kit! Now bend over and grab your ankles....", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "Originally posted by stillkit: MOD HAT ON To others who had posted in this thread before: It's disappearance was my fault and I apologize to everyone who had responded to it. It was my intention to delete just the OP for copyright infringement, but the whole thread disappeared. In any case, there was no violation of the TOS as carsleyt wrote it himself and I jumped to a wildly erroneous conclusion. It will not happen again.", 
        "reply": " You've been bad Kit! Now bend over and grab your ankles....", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 10:59:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I agree Bergy.", 
        "intTime": 20090323, 
        "postID": 28, 
        "quote": "", 
        "reply": "I agree Bergy.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 11:00:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Personally I'd love to learn a second language and Spanish would be my choice. That doesn't mean I'd abandon English. Nor does it mean I think the language of The USA will ever be Spanish. Some years ago I went to Austria. I was in a position to meet a lot of the Austrians and was shocked and embarrassed by the crowds of people who conversed with me in English. I'm not only speaking of \"educated\" adults. I'm speaking also of children maybe seven or eight. Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. Check out this URL \"http://en.wikipedia.org/wiki/Bilingualism_in_Canada\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 29, 
        "quote": "Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment!", 
        "reply": " Personally I'd love to learn a second language and Spanish would be my choice. That doesn't mean I'd abandon English. Nor does it mean I think the language of The USA will ever be Spanish. Some years ago I went to Austria. I was in a position to meet a lot of the Austrians and was shocked and embarrassed by the crowds of people who conversed with me in English. I'm not only speaking of \"educated\" adults. I'm speaking also of children maybe seven or eight. Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. Check out this URL \"http://en.wikipedia.org/wiki/Bilingualism_in_Canada\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 11:44:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions", 
        "intTime": 20090323, 
        "postID": 30, 
        "quote": "Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well.", 
        "reply": " +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 12:00:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Knele"
    }, 
    {
        "content": "Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same... Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 31, 
        "quote": "", 
        "reply": "Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same... Wandering and Wondering", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 12:05:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same... The research Mr. Carsley did was addressing two specific areas. \"This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion.\" He did not, directly address the question of illegals in the country. Even with that said, if one were to remove the illegals, there would still be the fact that the fastest segment of population growth in America is Hispanic. The desirably of having Spanish as a second language still exists. It will happen eventually. It's only a matter of taking a longer time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 32, 
        "quote": "Originally posted by greywolfghost: Does Canada have a continual influx of French trying to reoccupy the country they want back? As many as 10 million illegal aliens from south of the border are in America now, let alone those legally here - - The circumstances are not the same...", 
        "reply": " The research Mr. Carsley did was addressing two specific areas. \"This research is going to limit too simply two matters, the research for this essay goes into these directions: unity through language and advancing education through English immersion.\" He did not, directly address the question of illegals in the country. Even with that said, if one were to remove the illegals, there would still be the fact that the fastest segment of population growth in America is Hispanic. The desirably of having Spanish as a second language still exists. It will happen eventually. It's only a matter of taking a longer time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 12:40:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Look, America has just about run the 2-300 year course that most Nations and/or Empires have ever managed to keep from crumbling. Most (Example: The Soviet Union) seldom even come close to that. With all the economic/political/military problems America is facing right now, it could be at or past the tipping point. I'm just telling you America has very little \"National Glue\" to hold it together. Because each State is a miniature Republic with its own Constitution, etc., there is no reason to believe America could not fracture into regions very easily. It has abandoned any attempt to hold together as a \"Christian Nation with a Manifest Destiny,\" and that rips away a good portion of its \"Traditional and Cultural\" glue. The \"Economy/Trade\" glue is dissolving right now, especially when the credit card bubble blows up. So, about the only things left to hold it together is its Federal/Constitutional Law glue and it Language glue. That's about all the Soviet Union had, just before it crumbled. Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 33, 
        "quote": "", 
        "reply": "Look, America has just about run the 2-300 year course that most Nations and/or Empires have ever managed to keep from crumbling. Most (Example: The Soviet Union) seldom even come close to that. With all the economic/political/military problems America is facing right now, it could be at or past the tipping point. I'm just telling you America has very little \"National Glue\" to hold it together. Because each State is a miniature Republic with its own Constitution, etc., there is no reason to believe America could not fracture into regions very easily. It has abandoned any attempt to hold together as a \"Christian Nation with a Manifest Destiny,\" and that rips away a good portion of its \"Traditional and Cultural\" glue. The \"Economy/Trade\" glue is dissolving right now, especially when the credit card bubble blows up. So, about the only things left to hold it together is its Federal/Constitutional Law glue and it Language glue. That's about all the Soviet Union had, just before it crumbled. Wandering and Wondering", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 13:06:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment! Exactly, the point is that not pushing to learn English is hurting people, with 2 for Spanish, all signs, packaging, having to know spanish to get a teaching job....all that is wrong headed. At home, people can speak whatever they want, I don't care. My own home is bilingual. If I could find people of other languages to hang out with my kids I'd be happy to add others to their abilities. But thinking that it is ok to not bother to learn English, that America should change for them, it silly. Every generation coming here has had to learn English, now, all of a sudden it's an issue.", 
        "intTime": 20090323, 
        "postID": 34, 
        "quote": "Originally posted by Bergy46: There is no problem with bilingualism as long as they speak English when conducting business in an English speaking establishment!", 
        "reply": " Exactly, the point is that not pushing to learn English is hurting people, with 2 for Spanish, all signs, packaging, having to know spanish to get a teaching job....all that is wrong headed. At home, people can speak whatever they want, I don't care. My own home is bilingual. If I could find people of other languages to hang out with my kids I'd be happy to add others to their abilities. But thinking that it is ok to not bother to learn English, that America should change for them, it silly. Every generation coming here has had to learn English, now, all of a sudden it's an issue.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 15:07:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions Really, you mean like Quebec always trying to break away?", 
        "intTime": 20090323, 
        "postID": 35, 
        "quote": "Originally posted by Knele: quote: Originally posted by Vicdude: Let's say America did go bilingual? I honestly don't see the harm in it. One only has to look to the north and see Canada which is officially bilingual and is doing quite well. +http://en.wikipedia.org/wiki/List_of_multilingual_countries_and_regions", 
        "reply": " Really, you mean like Quebec always trying to break away?", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 15:11:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "carsleyt"
    }, 
    {
        "content": "I think it is great to speak more than one language. I am learning Spanish with Rosetta and at my age it is not that easy. I have sympathy for others who come here and shy away from learning English. I do think that people who want to come here and be American should want to learn English and embrace that as much as their native language. I don't think we should change our language to Spanish or any other language.", 
        "intTime": 20090323, 
        "postID": 36, 
        "quote": "", 
        "reply": "I think it is great to speak more than one language. I am learning Spanish with Rosetta and at my age it is not that easy. I have sympathy for others who come here and shy away from learning English. I do think that people who want to come here and be American should want to learn English and embrace that as much as their native language. I don't think we should change our language to Spanish or any other language.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 18:04:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles.... As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that!", 
        "intTime": 20090323, 
        "postID": 37, 
        "quote": "Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles....", 
        "reply": " As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that!", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 19:01:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stillkit"
    }, 
    {
        "content": "Don't y'all understand? Language isn't the issue which \"threatens\" America as we've known it. It's demographics. The inescapable fact is that immigrants coming to America now are not coming from Europe. They're coming from Latin America, southwest Asia and the Pacific Islands. That means a totally different majority looms in the future, which will mean fundamental changes to America IF the Constitution remains as it's guiding instrument. One of those changes will most likely be the dominant language, whether anybody likes it or not. The real issue which will determine America's future is whether or not white, Protestant descendents of Western European's will peacefully transfer power to the new brown and Catholic/Muslim/other/none majority. We've been the political power now for over 200 years, but that's changing and we will become less and less powerful as time goes by. Those \"new\" American's will become more and more powerful as they outnumber us. That means they'll have the votes and the power to change anything they like about this country. This will not be an immediate process. It will take a generation or more, but we are already nearly a minority to those other groups. All this talk about illegals and Mexican's and Muslim's and the English language is just the opening salvos of the struggle for political dominance, a struggle we white, Protestant Europeans are bound to lose eventually. If we lose gracefully and peacefully, America will survive just fine, but it will be radically different from the America we're used to. If we don't, we could see the end of our great experiment in representative democracy.", 
        "intTime": 20090323, 
        "postID": 38, 
        "quote": "", 
        "reply": "Don't y'all understand? Language isn't the issue which \"threatens\" America as we've known it. It's demographics. The inescapable fact is that immigrants coming to America now are not coming from Europe. They're coming from Latin America, southwest Asia and the Pacific Islands. That means a totally different majority looms in the future, which will mean fundamental changes to America IF the Constitution remains as it's guiding instrument. One of those changes will most likely be the dominant language, whether anybody likes it or not. The real issue which will determine America's future is whether or not white, Protestant descendents of Western European's will peacefully transfer power to the new brown and Catholic/Muslim/other/none majority. We've been the political power now for over 200 years, but that's changing and we will become less and less powerful as time goes by. Those \"new\" American's will become more and more powerful as they outnumber us. That means they'll have the votes and the power to change anything they like about this country. This will not be an immediate process. It will take a generation or more, but we are already nearly a minority to those other groups. All this talk about illegals and Mexican's and Muslim's and the English language is just the opening salvos of the struggle for political dominance, a struggle we white, Protestant Europeans are bound to lose eventually. If we lose gracefully and peacefully, America will survive just fine, but it will be radically different from the America we're used to. If we don't, we could see the end of our great experiment in representative democracy.", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 19:10:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: quote: Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles.... As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that! Now why the hell do you think I had whips (the closet thing available for a spanking) instead of something else????? Trust me, I don't go that way either.... LOL", 
        "intTime": 20090323, 
        "postID": 39, 
        "quote": "Originally posted by stillkit: quote: Originally posted by Woody_in_La: You've been bad Kit! Now bend over and grab your ankles.... As long as it's just a paddlin' I'm bendin' over for, I'll take it. If it's somethin' else? Uh....Kit don't go for that!", 
        "reply": " Now why the hell do you think I had whips (the closet thing available for a spanking) instead of something else????? Trust me, I don't go that way either.... LOL", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-23 19:25:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "I took Spanish lessons in high school I failed it, I admire those who speak spanish AND English most Hispanics speak both. Some of the people I know speak 3 languages. I'm SO stupid I speak Enlish only", 
        "intTime": 20090324, 
        "postID": 40, 
        "quote": "", 
        "reply": "I took Spanish lessons in high school I failed it, I admire those who speak spanish AND English most Hispanics speak both. Some of the people I know speak 3 languages. I'm SO stupid I speak Enlish only", 
        "threadID": "5291911282_4530036812001", 
        "time": "2009-03-24 07:23:00", 
        "title": "Bilingualism, keeping people uneducated, poor and unassimilated.", 
        "userID": "stormer73"
    }
]