[
    {
        "content": "Emailed to me some time ago. Author Unknown. The Differential Theory of US Armed Forces (Snake Model) upon encountering a snake in the Area of Operations (AO). (ORSA model developed on contract) INFANTRY: Snake smells them, leaves area. AIRBORNE: Lands on and kills the snake. ARMOR: Runs over snake, laughs, and looks for more snakes. AVIATION: Has Global Positioning Satellite coordinates to snake. Can't find snake. Returns to base for refuel, crew rest and manicure. RANGER: Plays with snake, then eats it. FIELD ARTILLERY: Kills snake with massive Time On Target barrage with three Forward Artillery Brigades in support. Kills several hundred civilians as unavoidable collateral damage. Mission is considered a success and all participants (i.e., cooks, mechanics and clerks) are awarded Silver Stars. SPECIAL FORCES: Makes contact with snake, ignores all State Department directives and Theater Commander Rules of Engagement by building rapport with snake and winning its heart and mind. Trains it to kill other snakes. Files enormous travel settlement upon return. COMBAT ENGINEER: Studies snake. Prepares in-depth doctrinal thesis in obscure 5 series Field Manual about how to defeat snake using counter mobility assets. Complains that maneuver forces don't understand how to properly conduct doctrinal counter-snake ops. NAVY SEAL: Expends all ammunition and calls for naval gunfire support in failed attempt to kill snake. Snake bites SEAL and retreats to safety. Hollywood makes fantasy film in which SEALS kill Muslim extremist snakes. NAVY: Fires off 50 cruise missiles from various types of ships, kills snake and makes presentation to Senate propriations Committee on how Naval forces are the most cost-effective means of anti-snake force projection. MARINE: Kills snake by accident while looking for souvenirs. Local civilians demand removal of all US forces from Area of Operations. MARINE RECON: Follows snake, gets lost. COMBAT CONTROLLERS: Guides snake elsewhere. PARA-RESCUE JUMPER: Wounds snake in initial encounter, then works feverishly to save snake's life. SUPPLY: (Notice: Your anti-snake equipment is on backorder.) TRANSPORT PILOT: Receives call for anti-snake equipment, delivers two weeks after due date. F-15 PILOT: Mis-identifies snake as enemy Mil-24 Hind helicopter and engages with missiles. Crew chief paints snake kill on aircraft. F-16 PILOT: Finds snake, drops two CBU-87 cluster bombs, and misses snake target, but get direct hit on Embassy 100 KM East of snake due to weather (too hot also too cold, was clear but too overcast, too dry with rain, unlimited ceiling with low cloud cover etc.) Claims that purchasing multi-million dollar, high-tech snake-killing device will enable it in the future to kill all snakes and achieve a revolution in military affairs. AH-64 APACHE PILOT: Unable to locate snake, snakes don't show well on infra-red. Infrared only operable in desert AO's without power lines or SAM's. UH-60 BLACKHAWK PILOT: Finds snake on fourth pass after snake builds bonfire, pops smoke, lays out VS 17 to mark Landing Zone. Rotor wash blows snake into fire. B-52 PILOT: Pulls ARCLIGHT mission on snake, kills snake and every other living thing within two miles of target. MISSILE CREW: Lays in target coordinates to snake in 20 seconds, but can't receive authorization from National Command Authority to use nuclear weapons. INTELLIGENCE OFFICER: Snake? What snake? Only four of 35 indicators of snake activity are currently active. We assess the potential for snake activity as LOW. JUDGE ADVOCATE GENERAL (JAG): Snake declines to bite, citing grounds of professional courtesy. FIELD PSYCHIATRIST: Assume the snake is dead.... How do you feel about that?", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "Emailed to me some time ago. Author Unknown. The Differential Theory of US Armed Forces (Snake Model) upon encountering a snake in the Area of Operations (AO). (ORSA model developed on contract) INFANTRY: Snake smells them, leaves area. AIRBORNE: Lands on and kills the snake. ARMOR: Runs over snake, laughs, and looks for more snakes. AVIATION: Has Global Positioning Satellite coordinates to snake. Can't find snake. Returns to base for refuel, crew rest and manicure. RANGER: Plays with snake, then eats it. FIELD ARTILLERY: Kills snake with massive Time On Target barrage with three Forward Artillery Brigades in support. Kills several hundred civilians as unavoidable collateral damage. Mission is considered a success and all participants (i.e., cooks, mechanics and clerks) are awarded Silver Stars. SPECIAL FORCES: Makes contact with snake, ignores all State Department directives and Theater Commander Rules of Engagement by building rapport with snake and winning its heart and mind. Trains it to kill other snakes. Files enormous travel settlement upon return. COMBAT ENGINEER: Studies snake. Prepares in-depth doctrinal thesis in obscure 5 series Field Manual about how to defeat snake using counter mobility assets. Complains that maneuver forces don't understand how to properly conduct doctrinal counter-snake ops. NAVY SEAL: Expends all ammunition and calls for naval gunfire support in failed attempt to kill snake. Snake bites SEAL and retreats to safety. Hollywood makes fantasy film in which SEALS kill Muslim extremist snakes. NAVY: Fires off 50 cruise missiles from various types of ships, kills snake and makes presentation to Senate propriations Committee on how Naval forces are the most cost-effective means of anti-snake force projection. MARINE: Kills snake by accident while looking for souvenirs. Local civilians demand removal of all US forces from Area of Operations. MARINE RECON: Follows snake, gets lost. COMBAT CONTROLLERS: Guides snake elsewhere. PARA-RESCUE JUMPER: Wounds snake in initial encounter, then works feverishly to save snake's life. SUPPLY: (Notice: Your anti-snake equipment is on backorder.) TRANSPORT PILOT: Receives call for anti-snake equipment, delivers two weeks after due date. F-15 PILOT: Mis-identifies snake as enemy Mil-24 Hind helicopter and engages with missiles. Crew chief paints snake kill on aircraft. F-16 PILOT: Finds snake, drops two CBU-87 cluster bombs, and misses snake target, but get direct hit on Embassy 100 KM East of snake due to weather (too hot also too cold, was clear but too overcast, too dry with rain, unlimited ceiling with low cloud cover etc.) Claims that purchasing multi-million dollar, high-tech snake-killing device will enable it in the future to kill all snakes and achieve a revolution in military affairs. AH-64 APACHE PILOT: Unable to locate snake, snakes don't show well on infra-red. Infrared only operable in desert AO's without power lines or SAM's. UH-60 BLACKHAWK PILOT: Finds snake on fourth pass after snake builds bonfire, pops smoke, lays out VS 17 to mark Landing Zone. Rotor wash blows snake into fire. B-52 PILOT: Pulls ARCLIGHT mission on snake, kills snake and every other living thing within two miles of target. MISSILE CREW: Lays in target coordinates to snake in 20 seconds, but can't receive authorization from National Command Authority to use nuclear weapons. INTELLIGENCE OFFICER: Snake? What snake? Only four of 35 indicators of snake activity are currently active. We assess the potential for snake activity as LOW. JUDGE ADVOCATE GENERAL (JAG): Snake declines to bite, citing grounds of professional courtesy. FIELD PSYCHIATRIST: Assume the snake is dead.... How do you feel about that?", 
        "threadID": "5291911282_2060096812001", 
        "time": "2009-03-23 17:50:00", 
        "title": "Greatest threat to American Security", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: Originally posted by carsleyt: Emailed to me some time ago. Author Unknown. The Differential Theory of US Armed Forces (Snake Model) upon encountering a snake in the Area of Operations (AO). (ORSA model developed on contract) SPECIAL FORCES: Makes contact with snake, ignores all State Department directives and Theater Commander Rules of Engagement by building rapport with snake and winning its heart and mind. Trains it to kill other snakes. Files enormous travel settlement upon return.", 
        "intTime": 20090324, 
        "postID": 2, 
        "quote": "Originally posted by carsleyt: Emailed to me some time ago. Author Unknown. The Differential Theory of US Armed Forces (Snake Model) upon encountering a snake in the Area of Operations (AO). (ORSA model developed on contract) SPECIAL FORCES: Makes contact with snake, ignores all State Department directives and Theater Commander Rules of Engagement by building rapport with snake and winning its heart and mind. Trains it to kill other snakes. Files enormous travel settlement upon return.", 
        "reply": "", 
        "threadID": "5291911282_2060096812001", 
        "time": "2009-03-24 18:42:00", 
        "title": "Greatest threat to American Security", 
        "userID": "Ruanne"
    }
]