[
    {
        "content": "I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:15 PM", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "", 
        "reply": "I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:15 PM", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 10:41:00", 
        "title": "Do I need the Military?", 
        "userID": "18264929"
    }, 
    {
        "content": "where do they come from? Nigerian scams scaled down. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "where do they come from? Nigerian scams scaled down. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 10:49:00", 
        "title": "Do I need the Military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Has the wire caught another one?", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "", 
        "reply": "Has the wire caught another one?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 11:02:00", 
        "title": "Do I need the Military?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "While I do realize that this guy is most likely a one hit wonder... GED classes are available through the military (I specificially know of the Army, not sure about the other branches). The cost of the GED can come out of your pay from drills. I'd suggest speaking with a recruiter again. The only concern that I have is if you were put on probation, would the crime you committed be a disqualification... but, again, you need to talk to your local recruiter. Good Luck", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "", 
        "reply": "While I do realize that this guy is most likely a one hit wonder... GED classes are available through the military (I specificially know of the Army, not sure about the other branches). The cost of the GED can come out of your pay from drills. I'd suggest speaking with a recruiter again. The only concern that I have is if you were put on probation, would the crime you committed be a disqualification... but, again, you need to talk to your local recruiter. Good Luck", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 11:23:00", 
        "title": "Do I need the Military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Has the wire caught another one? Yeh, 'pears so.", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "Originally posted by busnrete8: Has the wire caught another one?", 
        "reply": " Yeh, 'pears so.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 12:09:00", 
        "title": "Do I need the Military?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "This has got to be a joke, right? Maybe the guy could make money writing tall tales?", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "", 
        "reply": "This has got to be a joke, right? Maybe the guy could make money writing tall tales?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 12:41:00", 
        "title": "Do I need the Military?", 
        "userID": "Jcpgep"
    }, 
    {
        "content": "quote: Originally posted by 18264929: I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. Hell, party 'til you drop. We'll remember you well.", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "Originally posted by 18264929: I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you.", 
        "reply": " Hell, party 'til you drop. We'll remember you well.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:28:00", 
        "title": "Do I need the Military?", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "Walking down the street one day…. I met up with a stranger…. Said he’d make a man of me.... Everyone feel free to join in, you know the words!", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "", 
        "reply": "Walking down the street one day…. I met up with a stranger…. Said he’d make a man of me.... Everyone feel free to join in, you know the words!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:47:00", 
        "title": "Do I need the Military?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Do I need the Military? It's more of a question of does the Military need You. How about you stay in the Boy Scouts or run away from home. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "", 
        "reply": "Do I need the Military? It's more of a question of does the Military need You. How about you stay in the Boy Scouts or run away from home. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:51:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Mikey I have to agree. The military does not in most cases need someone that has to come asking such a question of people they do not know. I know it seems like a BS topic but it is common among the young people in this country.", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "", 
        "reply": "Mikey I have to agree. The military does not in most cases need someone that has to come asking such a question of people they do not know. I know it seems like a BS topic but it is common among the young people in this country.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 16:20:00", 
        "title": "Do I need the Military?", 
        "userID": "Usamp27"
    }, 
    {
        "content": "Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "", 
        "reply": "Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 16:41:00", 
        "title": "Do I need the Military?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand. Didn't think about that one Hoffy. Maybe a chalk board warrior for Mr. Rodgers or a BOZO the clown Trainee. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "Originally posted by Hoffy1951: Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "reply": " Didn't think about that one Hoffy. Maybe a chalk board warrior for Mr. Rodgers or a BOZO the clown Trainee. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 17:01:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Me want to join usa military..I am tired of my lifestyle as rock and roll party gouy. When can I join?? I am tired of beutifull wimmin and alkeehol...pleeze help?? Where do we get such trolls?", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "", 
        "reply": "Me want to join usa military..I am tired of my lifestyle as rock and roll party gouy. When can I join?? I am tired of beutifull wimmin and alkeehol...pleeze help?? Where do we get such trolls?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:16:00", 
        "title": "Do I need the Military?", 
        "userID": "Jer_Pil"
    }, 
    {
        "content": "Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 14, 
        "quote": "", 
        "reply": "Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:29:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 15, 
        "quote": "I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated!", 
        "reply": " Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! Wandering and Wondering", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:44:00", 
        "title": "Do I need the Military?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. My apology about the BSA. I spent along time as a Scout as did my Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 16, 
        "quote": "Originally posted by MM2_ss_Lewis: Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do.", 
        "reply": " My apology about the BSA. I spent along time as a Scout as did my Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:48:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "The military might make a man out of Junior, but the BSA makes a kid INTO Junior. Proud Eagle scout, troop 26, Brotherhood member OA lodge 224. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 17, 
        "quote": "", 
        "reply": "The military might make a man out of Junior, but the BSA makes a kid INTO Junior. Proud Eagle scout, troop 26, Brotherhood member OA lodge 224. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:49:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! From what he's posted and his current bearing, I don't think he'd ever be ready for Military Service GW. Combat Arms? No way. I was a Draftee and ran across many Zero's in the 60's and 70's. This be one. IMO. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 18, 
        "quote": "Originally posted by greywolfghost: quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!!", 
        "reply": " From what he's posted and his current bearing, I don't think he'd ever be ready for Military Service GW. Combat Arms? No way. I was a Draftee and ran across many Zero's in the 60's and 70's. This be one. IMO. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:59:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "No knock on the Scouts, cuz I loved the 50 mile hikes and such (wasn't big on merit badges, though); but my first day in Basic Training, the Drill Sergeant said, \"Are there any Eagle Scouts here?\" Several guys energetically raised their hands. \"All you step forward and report to the Mess Hall for KP!\" he said. \"So much for Eagle Scout meaning !~@#$@#$! around here!\" he said. I thought that was kinda interesting because I had heard from everyone involved in Scouting that Eagle would mean positions of leadership in the Military, but I always thought the chase for the badge was more politics and parental pushing than the kid's commitment. I got a 1st Class Badge, and that was enough... I was Platoon Guide and Honor Graduate in both Basic and AIT - - Hmmmmmmmm! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 19, 
        "quote": "", 
        "reply": "No knock on the Scouts, cuz I loved the 50 mile hikes and such (wasn't big on merit badges, though); but my first day in Basic Training, the Drill Sergeant said, \"Are there any Eagle Scouts here?\" Several guys energetically raised their hands. \"All you step forward and report to the Mess Hall for KP!\" he said. \"So much for Eagle Scout meaning !~@#$@#$! around here!\" he said. I thought that was kinda interesting because I had heard from everyone involved in Scouting that Eagle would mean positions of leadership in the Military, but I always thought the chase for the badge was more politics and parental pushing than the kid's commitment. I got a 1st Class Badge, and that was enough... I was Platoon Guide and Honor Graduate in both Basic and AIT - - Hmmmmmmmm! Wandering and Wondering", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 19:07:00", 
        "title": "Do I need the Military?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Eagle scout is one of two things, parents pushing the kids, or the kids wanting to do it. I still visit my Eagle project and keep it in shape, just a bit of pride I guess. I never got any flack over being an Eagle when I went to basic. I do stand by my \"Top Brain\" award in the division though. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 20, 
        "quote": "", 
        "reply": "Eagle scout is one of two things, parents pushing the kids, or the kids wanting to do it. I still visit my Eagle project and keep it in shape, just a bit of pride I guess. I never got any flack over being an Eagle when I went to basic. I do stand by my \"Top Brain\" award in the division though. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 19:12:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:15 PM", 
        "intTime": 20090527, 
        "postID": 21, 
        "quote": "", 
        "reply": "I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:15 PM", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 10:41:00", 
        "title": "Do I need the Military?", 
        "userID": "18264929"
    }, 
    {
        "content": "where do they come from? Nigerian scams scaled down. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090527, 
        "postID": 22, 
        "quote": "", 
        "reply": "where do they come from? Nigerian scams scaled down. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 10:49:00", 
        "title": "Do I need the Military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Has the wire caught another one?", 
        "intTime": 20090527, 
        "postID": 23, 
        "quote": "", 
        "reply": "Has the wire caught another one?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 11:02:00", 
        "title": "Do I need the Military?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "While I do realize that this guy is most likely a one hit wonder... GED classes are available through the military (I specificially know of the Army, not sure about the other branches). The cost of the GED can come out of your pay from drills. I'd suggest speaking with a recruiter again. The only concern that I have is if you were put on probation, would the crime you committed be a disqualification... but, again, you need to talk to your local recruiter. Good Luck", 
        "intTime": 20090527, 
        "postID": 24, 
        "quote": "", 
        "reply": "While I do realize that this guy is most likely a one hit wonder... GED classes are available through the military (I specificially know of the Army, not sure about the other branches). The cost of the GED can come out of your pay from drills. I'd suggest speaking with a recruiter again. The only concern that I have is if you were put on probation, would the crime you committed be a disqualification... but, again, you need to talk to your local recruiter. Good Luck", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 11:23:00", 
        "title": "Do I need the Military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Has the wire caught another one? Yeh, 'pears so.", 
        "intTime": 20090527, 
        "postID": 25, 
        "quote": "Originally posted by busnrete8: Has the wire caught another one?", 
        "reply": " Yeh, 'pears so.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 12:09:00", 
        "title": "Do I need the Military?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "This has got to be a joke, right? Maybe the guy could make money writing tall tales?", 
        "intTime": 20090527, 
        "postID": 26, 
        "quote": "", 
        "reply": "This has got to be a joke, right? Maybe the guy could make money writing tall tales?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 12:41:00", 
        "title": "Do I need the Military?", 
        "userID": "Jcpgep"
    }, 
    {
        "content": "quote: Originally posted by 18264929: I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. Hell, party 'til you drop. We'll remember you well.", 
        "intTime": 20090527, 
        "postID": 27, 
        "quote": "Originally posted by 18264929: I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you.", 
        "reply": " Hell, party 'til you drop. We'll remember you well.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:28:00", 
        "title": "Do I need the Military?", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "Walking down the street one day…. I met up with a stranger…. Said he’d make a man of me.... Everyone feel free to join in, you know the words!", 
        "intTime": 20090527, 
        "postID": 28, 
        "quote": "", 
        "reply": "Walking down the street one day…. I met up with a stranger…. Said he’d make a man of me.... Everyone feel free to join in, you know the words!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:47:00", 
        "title": "Do I need the Military?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Do I need the Military? It's more of a question of does the Military need You. How about you stay in the Boy Scouts or run away from home. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 29, 
        "quote": "", 
        "reply": "Do I need the Military? It's more of a question of does the Military need You. How about you stay in the Boy Scouts or run away from home. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:51:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Mikey I have to agree. The military does not in most cases need someone that has to come asking such a question of people they do not know. I know it seems like a BS topic but it is common among the young people in this country.", 
        "intTime": 20090527, 
        "postID": 30, 
        "quote": "", 
        "reply": "Mikey I have to agree. The military does not in most cases need someone that has to come asking such a question of people they do not know. I know it seems like a BS topic but it is common among the young people in this country.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 16:20:00", 
        "title": "Do I need the Military?", 
        "userID": "Usamp27"
    }, 
    {
        "content": "Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "intTime": 20090527, 
        "postID": 31, 
        "quote": "", 
        "reply": "Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 16:41:00", 
        "title": "Do I need the Military?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand. Didn't think about that one Hoffy. Maybe a chalk board warrior for Mr. Rodgers or a BOZO the clown Trainee. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 32, 
        "quote": "Originally posted by Hoffy1951: Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "reply": " Didn't think about that one Hoffy. Maybe a chalk board warrior for Mr. Rodgers or a BOZO the clown Trainee. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 17:01:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Me want to join usa military..I am tired of my lifestyle as rock and roll party gouy. When can I join?? I am tired of beutifull wimmin and alkeehol...pleeze help?? Where do we get such trolls?", 
        "intTime": 20090527, 
        "postID": 33, 
        "quote": "", 
        "reply": "Me want to join usa military..I am tired of my lifestyle as rock and roll party gouy. When can I join?? I am tired of beutifull wimmin and alkeehol...pleeze help?? Where do we get such trolls?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:16:00", 
        "title": "Do I need the Military?", 
        "userID": "Jer_Pil"
    }, 
    {
        "content": "Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 34, 
        "quote": "", 
        "reply": "Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:29:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 35, 
        "quote": "I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated!", 
        "reply": " Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! Wandering and Wondering", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:44:00", 
        "title": "Do I need the Military?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. My apology about the BSA. I spent along time as a Scout as did my Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 36, 
        "quote": "Originally posted by MM2_ss_Lewis: Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do.", 
        "reply": " My apology about the BSA. I spent along time as a Scout as did my Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:48:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "The military might make a man out of Junior, but the BSA makes a kid INTO Junior. Proud Eagle scout, troop 26, Brotherhood member OA lodge 224. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 37, 
        "quote": "", 
        "reply": "The military might make a man out of Junior, but the BSA makes a kid INTO Junior. Proud Eagle scout, troop 26, Brotherhood member OA lodge 224. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:49:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! From what he's posted and his current bearing, I don't think he'd ever be ready for Military Service GW. Combat Arms? No way. I was a Draftee and ran across many Zero's in the 60's and 70's. This be one. IMO. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 38, 
        "quote": "Originally posted by greywolfghost: quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!!", 
        "reply": " From what he's posted and his current bearing, I don't think he'd ever be ready for Military Service GW. Combat Arms? No way. I was a Draftee and ran across many Zero's in the 60's and 70's. This be one. IMO. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:59:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "No knock on the Scouts, cuz I loved the 50 mile hikes and such (wasn't big on merit badges, though); but my first day in Basic Training, the Drill Sergeant said, \"Are there any Eagle Scouts here?\" Several guys energetically raised their hands. \"All you step forward and report to the Mess Hall for KP!\" he said. \"So much for Eagle Scout meaning !~@#$@#$! around here!\" he said. I thought that was kinda interesting because I had heard from everyone involved in Scouting that Eagle would mean positions of leadership in the Military, but I always thought the chase for the badge was more politics and parental pushing than the kid's commitment. I got a 1st Class Badge, and that was enough... I was Platoon Guide and Honor Graduate in both Basic and AIT - - Hmmmmmmmm! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 39, 
        "quote": "", 
        "reply": "No knock on the Scouts, cuz I loved the 50 mile hikes and such (wasn't big on merit badges, though); but my first day in Basic Training, the Drill Sergeant said, \"Are there any Eagle Scouts here?\" Several guys energetically raised their hands. \"All you step forward and report to the Mess Hall for KP!\" he said. \"So much for Eagle Scout meaning !~@#$@#$! around here!\" he said. I thought that was kinda interesting because I had heard from everyone involved in Scouting that Eagle would mean positions of leadership in the Military, but I always thought the chase for the badge was more politics and parental pushing than the kid's commitment. I got a 1st Class Badge, and that was enough... I was Platoon Guide and Honor Graduate in both Basic and AIT - - Hmmmmmmmm! Wandering and Wondering", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 19:07:00", 
        "title": "Do I need the Military?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Eagle scout is one of two things, parents pushing the kids, or the kids wanting to do it. I still visit my Eagle project and keep it in shape, just a bit of pride I guess. I never got any flack over being an Eagle when I went to basic. I do stand by my \"Top Brain\" award in the division though. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 40, 
        "quote": "", 
        "reply": "Eagle scout is one of two things, parents pushing the kids, or the kids wanting to do it. I still visit my Eagle project and keep it in shape, just a bit of pride I guess. I never got any flack over being an Eagle when I went to basic. I do stand by my \"Top Brain\" award in the division though. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 19:12:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:15 PM", 
        "intTime": 20090527, 
        "postID": 41, 
        "quote": "", 
        "reply": "I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:15 PM", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 10:41:00", 
        "title": "Do I need the Military?", 
        "userID": "18264929"
    }, 
    {
        "content": "where do they come from? Nigerian scams scaled down. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090527, 
        "postID": 42, 
        "quote": "", 
        "reply": "where do they come from? Nigerian scams scaled down. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 10:49:00", 
        "title": "Do I need the Military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Has the wire caught another one?", 
        "intTime": 20090527, 
        "postID": 43, 
        "quote": "", 
        "reply": "Has the wire caught another one?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 11:02:00", 
        "title": "Do I need the Military?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "While I do realize that this guy is most likely a one hit wonder... GED classes are available through the military (I specificially know of the Army, not sure about the other branches). The cost of the GED can come out of your pay from drills. I'd suggest speaking with a recruiter again. The only concern that I have is if you were put on probation, would the crime you committed be a disqualification... but, again, you need to talk to your local recruiter. Good Luck", 
        "intTime": 20090527, 
        "postID": 44, 
        "quote": "", 
        "reply": "While I do realize that this guy is most likely a one hit wonder... GED classes are available through the military (I specificially know of the Army, not sure about the other branches). The cost of the GED can come out of your pay from drills. I'd suggest speaking with a recruiter again. The only concern that I have is if you were put on probation, would the crime you committed be a disqualification... but, again, you need to talk to your local recruiter. Good Luck", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 11:23:00", 
        "title": "Do I need the Military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Has the wire caught another one? Yeh, 'pears so.", 
        "intTime": 20090527, 
        "postID": 45, 
        "quote": "Originally posted by busnrete8: Has the wire caught another one?", 
        "reply": " Yeh, 'pears so.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 12:09:00", 
        "title": "Do I need the Military?", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "This has got to be a joke, right? Maybe the guy could make money writing tall tales?", 
        "intTime": 20090527, 
        "postID": 46, 
        "quote": "", 
        "reply": "This has got to be a joke, right? Maybe the guy could make money writing tall tales?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 12:41:00", 
        "title": "Do I need the Military?", 
        "userID": "Jcpgep"
    }, 
    {
        "content": "quote: Originally posted by 18264929: I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you. Hell, party 'til you drop. We'll remember you well.", 
        "intTime": 20090527, 
        "postID": 47, 
        "quote": "Originally posted by 18264929: I have a bit of a pickel. Torn between life styles of the compleat oppisite nature. On one hand I have no education what so ever. I got kicked out of high school my Sr. year with few credits to graduate. When I got kicked out of high school I got put on probation for 4 years. I did nothing but work full time to pay my probation and fines off. When I got off of the probation after the four years I moved to St. Croix U.S.V.I. Sence then I have been doing nothing but partying and living life moving all over America. Now I am stuck back in Michigan with no money to my name, but still living the lifestyle of a rockstar. Here it is really hard for me to get motivated and do anything because I can not find work, and I have no drivers license. For any normal person this would be a dead end wall, where you couldnt do anything because you have no money. But I have been such well connected her in MI the bars I get into free, drinks are bought for me by the bar tenders and the girls that beg me to come and hang out with them. I am surounded by beautiful women that want to party with me and pay for me all the time. Sounds like a dream come true I know. But on the other hand, I know where this path will get me in the end. No where. I have no money to start my own life, and no disipline to keep me motivated. I went out on mimorial day weekend with a few of my girls, and a few guys they knew. One of them was a Ex Army Ranger, and at the age of 24 has done more then me in his life. And I find that really hard to do. He didn't talk much about he had done over seas but he did talk about how it was the most amazing thing he could of ever done. The other guy I didnt know was also in the army, I am unsure of his rank. He told me about some of his adventures. He even was stop lost, and he still said it was worth going into. I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! contact me at personal contact number are not authorized. Thank you.", 
        "reply": " Hell, party 'til you drop. We'll remember you well.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:28:00", 
        "title": "Do I need the Military?", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "Walking down the street one day…. I met up with a stranger…. Said he’d make a man of me.... Everyone feel free to join in, you know the words!", 
        "intTime": 20090527, 
        "postID": 48, 
        "quote": "", 
        "reply": "Walking down the street one day…. I met up with a stranger…. Said he’d make a man of me.... Everyone feel free to join in, you know the words!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:47:00", 
        "title": "Do I need the Military?", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Do I need the Military? It's more of a question of does the Military need You. How about you stay in the Boy Scouts or run away from home. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 49, 
        "quote": "", 
        "reply": "Do I need the Military? It's more of a question of does the Military need You. How about you stay in the Boy Scouts or run away from home. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 15:51:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Mikey I have to agree. The military does not in most cases need someone that has to come asking such a question of people they do not know. I know it seems like a BS topic but it is common among the young people in this country.", 
        "intTime": 20090527, 
        "postID": 50, 
        "quote": "", 
        "reply": "Mikey I have to agree. The military does not in most cases need someone that has to come asking such a question of people they do not know. I know it seems like a BS topic but it is common among the young people in this country.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 16:20:00", 
        "title": "Do I need the Military?", 
        "userID": "Usamp27"
    }, 
    {
        "content": "Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "intTime": 20090527, 
        "postID": 51, 
        "quote": "", 
        "reply": "Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 16:41:00", 
        "title": "Do I need the Military?", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand. Didn't think about that one Hoffy. Maybe a chalk board warrior for Mr. Rodgers or a BOZO the clown Trainee. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 52, 
        "quote": "Originally posted by Hoffy1951: Hey Mikey! Cut the Boy Scouts a huss! We don't want nearly 100 years of Honor and Tradition to go down the crapper if we let 'Skippy' go in their camp... Keep him embedded with Ranger Rikkie and His Recondo Regurgitated Super Secret Underarm Support Regiment...his duties as Kitchen Police Pots and Pan Cleaning NCOIC are in high demand.", 
        "reply": " Didn't think about that one Hoffy. Maybe a chalk board warrior for Mr. Rodgers or a BOZO the clown Trainee. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 17:01:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Me want to join usa military..I am tired of my lifestyle as rock and roll party gouy. When can I join?? I am tired of beutifull wimmin and alkeehol...pleeze help?? Where do we get such trolls?", 
        "intTime": 20090527, 
        "postID": 53, 
        "quote": "", 
        "reply": "Me want to join usa military..I am tired of my lifestyle as rock and roll party gouy. When can I join?? I am tired of beutifull wimmin and alkeehol...pleeze help?? Where do we get such trolls?", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:16:00", 
        "title": "Do I need the Military?", 
        "userID": "Jer_Pil"
    }, 
    {
        "content": "Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 54, 
        "quote": "", 
        "reply": "Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:29:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 55, 
        "quote": "I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated!", 
        "reply": " Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! Wandering and Wondering", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:44:00", 
        "title": "Do I need the Military?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do. My apology about the BSA. I spent along time as a Scout as did my Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 56, 
        "quote": "Originally posted by MM2_ss_Lewis: Wow...just wow... What ever happened to the quality control people at the troll production factory? And don't bring the BSA into this guys, they do good things, hell they kept me out of trouble in school, something I was convinced would take a divine being to do.", 
        "reply": " My apology about the BSA. I spent along time as a Scout as did my Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:48:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "The military might make a man out of Junior, but the BSA makes a kid INTO Junior. Proud Eagle scout, troop 26, Brotherhood member OA lodge 224. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 57, 
        "quote": "", 
        "reply": "The military might make a man out of Junior, but the BSA makes a kid INTO Junior. Proud Eagle scout, troop 26, Brotherhood member OA lodge 224. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:49:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!! From what he's posted and his current bearing, I don't think he'd ever be ready for Military Service GW. Combat Arms? No way. I was a Draftee and ran across many Zero's in the 60's and 70's. This be one. IMO. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090527, 
        "postID": 58, 
        "quote": "Originally posted by greywolfghost: quote: I really want to join the army and see where my life of adventure could go from there. But I have a problem, no money or education. I was told by my recruiter, a long time ago when I was going to join to get of probation, that I must have at least a GED. Every GED class costs pretty close to 200 dollars a time taking the test. What Should I do? What can I do? What life should I chose? Please if anyone can give me some good advice it will be greatly appreciated! Turning your life around can be done in the Military. I've seen kids do it. I've seen kids go off the deep end there, too. You've got to bring some self-discipline to the table - a quality you don't seem to have in any quantity. Get some. Set some goals and achieve them. The first would be GROW UP!! The second would be FINISH HIGH SCHOOL!! The third would be PROPERLY FINISH YOUR PROBATION!! Then go to your recruiter, if you've got the spine, and sign up for combat arms... Then stay with it through thick and thin and make something worthwhile of yourself, like the Young Men you met. Time for teenage childhood to end!!", 
        "reply": " From what he's posted and his current bearing, I don't think he'd ever be ready for Military Service GW. Combat Arms? No way. I was a Draftee and ran across many Zero's in the 60's and 70's. This be one. IMO. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 18:59:00", 
        "title": "Do I need the Military?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "No knock on the Scouts, cuz I loved the 50 mile hikes and such (wasn't big on merit badges, though); but my first day in Basic Training, the Drill Sergeant said, \"Are there any Eagle Scouts here?\" Several guys energetically raised their hands. \"All you step forward and report to the Mess Hall for KP!\" he said. \"So much for Eagle Scout meaning !~@#$@#$! around here!\" he said. I thought that was kinda interesting because I had heard from everyone involved in Scouting that Eagle would mean positions of leadership in the Military, but I always thought the chase for the badge was more politics and parental pushing than the kid's commitment. I got a 1st Class Badge, and that was enough... I was Platoon Guide and Honor Graduate in both Basic and AIT - - Hmmmmmmmm! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 59, 
        "quote": "", 
        "reply": "No knock on the Scouts, cuz I loved the 50 mile hikes and such (wasn't big on merit badges, though); but my first day in Basic Training, the Drill Sergeant said, \"Are there any Eagle Scouts here?\" Several guys energetically raised their hands. \"All you step forward and report to the Mess Hall for KP!\" he said. \"So much for Eagle Scout meaning !~@#$@#$! around here!\" he said. I thought that was kinda interesting because I had heard from everyone involved in Scouting that Eagle would mean positions of leadership in the Military, but I always thought the chase for the badge was more politics and parental pushing than the kid's commitment. I got a 1st Class Badge, and that was enough... I was Platoon Guide and Honor Graduate in both Basic and AIT - - Hmmmmmmmm! Wandering and Wondering", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 19:07:00", 
        "title": "Do I need the Military?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Eagle scout is one of two things, parents pushing the kids, or the kids wanting to do it. I still visit my Eagle project and keep it in shape, just a bit of pride I guess. I never got any flack over being an Eagle when I went to basic. I do stand by my \"Top Brain\" award in the division though. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090527, 
        "postID": 60, 
        "quote": "", 
        "reply": "Eagle scout is one of two things, parents pushing the kids, or the kids wanting to do it. I still visit my Eagle project and keep it in shape, just a bit of pride I guess. I never got any flack over being an Eagle when I went to basic. I do stand by my \"Top Brain\" award in the division though. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_7350014422001", 
        "time": "2009-05-27 19:12:00", 
        "title": "Do I need the Military?", 
        "userID": "MM2_ss_Lewis"
    }
]