[
    {
        "content": "maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "", 
        "reply": "maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 15:56:00", 
        "title": "No respect!?!?", 
        "userID": "ajmccarty"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? IMO, NOOOOOOOOOOO Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " IMO, NOOOOOOOOOOO Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:00:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090505, 
        "postID": 3, 
        "quote": "", 
        "reply": "Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:10:00", 
        "title": "No respect!?!?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? Sounds like you may have \"Rodney Dangerfield\" syndrome. Immediately slap yourself. I agree, you earned the degree... you earned the rank thereby... but to those who earned their rank the hard way or who went through the ranks aren't going to agree with you until you earn their respect,imo.", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " Sounds like you may have \"Rodney Dangerfield\" syndrome. Immediately slap yourself. I agree, you earned the degree... you earned the rank thereby... but to those who earned their rank the hard way or who went through the ranks aren't going to agree with you until you earn their respect,imo.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:10:00", 
        "title": "No respect!?!?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: BFD... The only respect you get at the enlisted level is EARNED by how far you can hump your ruck fully loaded, how straight you can shoot at distance, how good you are in hand to hand combat (including how many of your barracks mates you can whip in fist-fights after hours back in my day), how high you score on the PT Test, how good you are at leading a squad in night ambush training etc etc etc. Your degree may work as toilet paper, and it may even get you into OCS, so you can come back and still have to earn your respect by all of the above - but other than that - - WHO CARES!!! I was going to post a prime example but my left hand ran off this evening. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 5, 
        "quote": "Originally posted by greywolfghost: BFD... The only respect you get at the enlisted level is EARNED by how far you can hump your ruck fully loaded, how straight you can shoot at distance, how good you are in hand to hand combat (including how many of your barracks mates you can whip in fist-fights after hours back in my day), how high you score on the PT Test, how good you are at leading a squad in night ambush training etc etc etc. Your degree may work as toilet paper, and it may even get you into OCS, so you can come back and still have to earn your respect by all of the above - but other than that - - WHO CARES!!!", 
        "reply": " I was going to post a prime example but my left hand ran off this evening. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:11:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "intTime": 20090505, 
        "postID": 6, 
        "quote": "", 
        "reply": "E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:12:00", 
        "title": "No respect!?!?", 
        "userID": "azmax64"
    }, 
    {
        "content": "SPC-4's are ASL's in the Infantry - I was a SL. How can you be trusted with a squad's leadership when you haven't served day one with them? Or busted your hump for 2.5 years like the rest of us? In the Infantry, you EARN every ounce of respect you get. I had more than my Plt Ldr, who couldn't read a compass well enough to hump a single klick without putting us all in God-knows-where. My squad trusted me with everything they had on the line: not just their lives, but those of their families. It isn't the rank, bro. It never has been. Don't take it personally. But no one with a Blue Rope is going to respect you until you prove that you can hump it not only like the rest of us, but BETTER than the rest of us. Nothing you did in college makes you worth that rank - just some staff weenie recruiter gave it to you while the rest of us had to earn it. Give it your all, and give it some months. Your people will grow into you. Again, don't take it personally, bro. You're still valued as a member of the team. But just like we tease staff weenies and REMFs, you'll get the same ribbing until you've convinced everyone that you can hack it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 7, 
        "quote": "", 
        "reply": "SPC-4's are ASL's in the Infantry - I was a SL. How can you be trusted with a squad's leadership when you haven't served day one with them? Or busted your hump for 2.5 years like the rest of us? In the Infantry, you EARN every ounce of respect you get. I had more than my Plt Ldr, who couldn't read a compass well enough to hump a single klick without putting us all in God-knows-where. My squad trusted me with everything they had on the line: not just their lives, but those of their families. It isn't the rank, bro. It never has been. Don't take it personally. But no one with a Blue Rope is going to respect you until you prove that you can hump it not only like the rest of us, but BETTER than the rest of us. Nothing you did in college makes you worth that rank - just some staff weenie recruiter gave it to you while the rest of us had to earn it. Give it your all, and give it some months. Your people will grow into you. Again, don't take it personally, bro. You're still valued as a member of the team. But just like we tease staff weenies and REMFs, you'll get the same ribbing until you've convinced everyone that you can hack it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:15:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Seriously, dude! With that attitude, you'll likely have your azz handed to you! Most (not all) junior enlisted don't go to college prior to enlisting and, by some odd quirk of fate, have little respect for those that did and even less for condescending over-edumacated idjits! If you want their respect, earn it! They'll respect the rank automatically, but rapidly lose respect for the person sporting it on his lapel! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090505, 
        "postID": 8, 
        "quote": "", 
        "reply": "Seriously, dude! With that attitude, you'll likely have your azz handed to you! Most (not all) junior enlisted don't go to college prior to enlisting and, by some odd quirk of fate, have little respect for those that did and even less for condescending over-edumacated idjits! If you want their respect, earn it! They'll respect the rank automatically, but rapidly lose respect for the person sporting it on his lapel! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:17:00", 
        "title": "No respect!?!?", 
        "userID": "KJ1110"
    }, 
    {
        "content": "I know I'll probably get a lock flak for saying this as a senior enlisted person, but here goes... I don't commission source or education is a predictor of future success as an officer. I have met many Ring Knockers who I would follow thru a hurricane in a canoe. Likewise, I have met prior enlisted officers who I would like to personally pitch off a bridge somewhere. It's not education or source of commission. It's your attitude toward people and how well you do your job.", 
        "intTime": 20090505, 
        "postID": 9, 
        "quote": "", 
        "reply": "I know I'll probably get a lock flak for saying this as a senior enlisted person, but here goes... I don't commission source or education is a predictor of future success as an officer. I have met many Ring Knockers who I would follow thru a hurricane in a canoe. Likewise, I have met prior enlisted officers who I would like to personally pitch off a bridge somewhere. It's not education or source of commission. It's your attitude toward people and how well you do your job.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:18:00", 
        "title": "No respect!?!?", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Degree is in Underwater Basket-Weaving and (lack of)Communications > Health and PE Major most likely - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 10, 
        "quote": "Originally posted by sargeant_green: Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills?", 
        "reply": " Degree is in Underwater Basket-Weaving and (lack of)Communications > Health and PE Major most likely - - Wandering and Wondering", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:20:00", 
        "title": "No respect!?!?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want? TIG AND TIS is gonna kill him. Only one can be waived. Professional Specialist for a while! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 11, 
        "quote": "Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "reply": " TIG AND TIS is gonna kill him. Only one can be waived. Professional Specialist for a while! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:21:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want? Funny, my entire squad completely respected me when I was serving in an E-5 position. And I am half any man's size. But I didn't just do, I led. And I led by example. In the Infantry, it's what you do, not what you wear. I guess it all boils down to people. But if I dropped you, you'd damn sure knock 'em out for me, E4 or below, you talked to me at parade rest like any other NCO, and in the field I could Summary 15 you if I wanted to - all with the blessing of my PLsgt. I just never had to. They followed me because they trusted me, even though I was a lowly Spc. Yeah, some of us get respect. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 12, 
        "quote": "Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "reply": " Funny, my entire squad completely respected me when I was serving in an E-5 position. And I am half any man's size. But I didn't just do, I led. And I led by example. In the Infantry, it's what you do, not what you wear. I guess it all boils down to people. But if I dropped you, you'd damn sure knock 'em out for me, E4 or below, you talked to me at parade rest like any other NCO, and in the field I could Summary 15 you if I wanted to - all with the blessing of my PLsgt. I just never had to. They followed me because they trusted me, even though I was a lowly Spc. Yeah, some of us get respect. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:27:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "intTime": 20090505, 
        "postID": 13, 
        "quote": "", 
        "reply": "degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:33:00", 
        "title": "No respect!?!?", 
        "userID": "ajmccarty"
    }, 
    {
        "content": "Moderator Hat Off I really respected this army E4. I don't ever remember him complaining about not getting respect. He didn't have a college degree, he didn't live long enough to get one. Please note the date in red. STEPHEN ALLISON ALLSOPP SP4 - E4 - Army - Selective Service 1st Log Command Length of service 1 years His tour began on Jan 2, 1968 Casualty was on May 6, 1968 In BINH DINH, SOUTH VIETNAM HOSTILE, GROUND CASUALTY OTHER EXPLOSIVE DEVICE Body was recovered Panel 55E - Line 38 God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "", 
        "reply": "Moderator Hat Off I really respected this army E4. I don't ever remember him complaining about not getting respect. He didn't have a college degree, he didn't live long enough to get one. Please note the date in red. STEPHEN ALLISON ALLSOPP SP4 - E4 - Army - Selective Service 1st Log Command Length of service 1 years His tour began on Jan 2, 1968 Casualty was on May 6, 1968 In BINH DINH, SOUTH VIETNAM HOSTILE, GROUND CASUALTY OTHER EXPLOSIVE DEVICE Body was recovered Panel 55E - Line 38 God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:35:00", 
        "title": "No respect!?!?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "reply": " You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:45:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "3 months!? There's your answer right there. I had over 6 years TIG as an E-4. Give it time. Most places you have to reach (Old Timers) status beofre much respect is shown.", 
        "intTime": 20090505, 
        "postID": 16, 
        "quote": "", 
        "reply": "3 months!? There's your answer right there. I had over 6 years TIG as an E-4. Give it time. Most places you have to reach (Old Timers) status beofre much respect is shown.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:45:00", 
        "title": "No respect!?!?", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 17, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving!", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:50:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "as before, moderator's hat off. I knew this guy back in 1956 I can't remember if he got any respect or not. I know he was a section leader of 15 men in a combat engineer battalion. If they didn't respect him they would have kicked his teeth in. He still had all of his teeth when he came home 18 months later. If memory services me right, he got $96.00 a month and that's all that really mattered. PS: He was an 8th dropout without a GED at that time. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090505, 
        "postID": 18, 
        "quote": "", 
        "reply": "as before, moderator's hat off. I knew this guy back in 1956 I can't remember if he got any respect or not. I know he was a section leader of 15 men in a combat engineer battalion. If they didn't respect him they would have kicked his teeth in. He still had all of his teeth when he came home 18 months later. If memory services me right, he got $96.00 a month and that's all that really mattered. PS: He was an 8th dropout without a GED at that time. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:01:00", 
        "title": "No respect!?!?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? sounds like you have a big head.... that might be one of your problems. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090505, 
        "postID": 19, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " sounds like you have a big head.... that might be one of your problems. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:06:00", 
        "title": "No respect!?!?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. I'm not going to hurl insults, but let me ask a sensitive question. How valuable do you really think a CJ degree is? The only reason why I have a BS Degree in CJ/Behavioral Science is because it was the easiest cirriculum my school had. I didn't even buy most of the textbooks. I earned C's and B's without studying.", 
        "intTime": 20090505, 
        "postID": 20, 
        "quote": "Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "reply": " I'm not going to hurl insults, but let me ask a sensitive question. How valuable do you really think a CJ degree is? The only reason why I have a BS Degree in CJ/Behavioral Science is because it was the easiest cirriculum my school had. I didn't even buy most of the textbooks. I earned C's and B's without studying.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:49:00", 
        "title": "No respect!?!?", 
        "userID": "scpd3045"
    }, 
    {
        "content": "maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "intTime": 20090505, 
        "postID": 21, 
        "quote": "", 
        "reply": "maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 15:56:00", 
        "title": "No respect!?!?", 
        "userID": "ajmccarty"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? IMO, NOOOOOOOOOOO Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 22, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " IMO, NOOOOOOOOOOO Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:00:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090505, 
        "postID": 23, 
        "quote": "", 
        "reply": "Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:10:00", 
        "title": "No respect!?!?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? Sounds like you may have \"Rodney Dangerfield\" syndrome. Immediately slap yourself. I agree, you earned the degree... you earned the rank thereby... but to those who earned their rank the hard way or who went through the ranks aren't going to agree with you until you earn their respect,imo.", 
        "intTime": 20090505, 
        "postID": 24, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " Sounds like you may have \"Rodney Dangerfield\" syndrome. Immediately slap yourself. I agree, you earned the degree... you earned the rank thereby... but to those who earned their rank the hard way or who went through the ranks aren't going to agree with you until you earn their respect,imo.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:10:00", 
        "title": "No respect!?!?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: BFD... The only respect you get at the enlisted level is EARNED by how far you can hump your ruck fully loaded, how straight you can shoot at distance, how good you are in hand to hand combat (including how many of your barracks mates you can whip in fist-fights after hours back in my day), how high you score on the PT Test, how good you are at leading a squad in night ambush training etc etc etc. Your degree may work as toilet paper, and it may even get you into OCS, so you can come back and still have to earn your respect by all of the above - but other than that - - WHO CARES!!! I was going to post a prime example but my left hand ran off this evening. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 25, 
        "quote": "Originally posted by greywolfghost: BFD... The only respect you get at the enlisted level is EARNED by how far you can hump your ruck fully loaded, how straight you can shoot at distance, how good you are in hand to hand combat (including how many of your barracks mates you can whip in fist-fights after hours back in my day), how high you score on the PT Test, how good you are at leading a squad in night ambush training etc etc etc. Your degree may work as toilet paper, and it may even get you into OCS, so you can come back and still have to earn your respect by all of the above - but other than that - - WHO CARES!!!", 
        "reply": " I was going to post a prime example but my left hand ran off this evening. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:11:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "intTime": 20090505, 
        "postID": 26, 
        "quote": "", 
        "reply": "E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:12:00", 
        "title": "No respect!?!?", 
        "userID": "azmax64"
    }, 
    {
        "content": "SPC-4's are ASL's in the Infantry - I was a SL. How can you be trusted with a squad's leadership when you haven't served day one with them? Or busted your hump for 2.5 years like the rest of us? In the Infantry, you EARN every ounce of respect you get. I had more than my Plt Ldr, who couldn't read a compass well enough to hump a single klick without putting us all in God-knows-where. My squad trusted me with everything they had on the line: not just their lives, but those of their families. It isn't the rank, bro. It never has been. Don't take it personally. But no one with a Blue Rope is going to respect you until you prove that you can hump it not only like the rest of us, but BETTER than the rest of us. Nothing you did in college makes you worth that rank - just some staff weenie recruiter gave it to you while the rest of us had to earn it. Give it your all, and give it some months. Your people will grow into you. Again, don't take it personally, bro. You're still valued as a member of the team. But just like we tease staff weenies and REMFs, you'll get the same ribbing until you've convinced everyone that you can hack it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 27, 
        "quote": "", 
        "reply": "SPC-4's are ASL's in the Infantry - I was a SL. How can you be trusted with a squad's leadership when you haven't served day one with them? Or busted your hump for 2.5 years like the rest of us? In the Infantry, you EARN every ounce of respect you get. I had more than my Plt Ldr, who couldn't read a compass well enough to hump a single klick without putting us all in God-knows-where. My squad trusted me with everything they had on the line: not just their lives, but those of their families. It isn't the rank, bro. It never has been. Don't take it personally. But no one with a Blue Rope is going to respect you until you prove that you can hump it not only like the rest of us, but BETTER than the rest of us. Nothing you did in college makes you worth that rank - just some staff weenie recruiter gave it to you while the rest of us had to earn it. Give it your all, and give it some months. Your people will grow into you. Again, don't take it personally, bro. You're still valued as a member of the team. But just like we tease staff weenies and REMFs, you'll get the same ribbing until you've convinced everyone that you can hack it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:15:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Seriously, dude! With that attitude, you'll likely have your azz handed to you! Most (not all) junior enlisted don't go to college prior to enlisting and, by some odd quirk of fate, have little respect for those that did and even less for condescending over-edumacated idjits! If you want their respect, earn it! They'll respect the rank automatically, but rapidly lose respect for the person sporting it on his lapel! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090505, 
        "postID": 28, 
        "quote": "", 
        "reply": "Seriously, dude! With that attitude, you'll likely have your azz handed to you! Most (not all) junior enlisted don't go to college prior to enlisting and, by some odd quirk of fate, have little respect for those that did and even less for condescending over-edumacated idjits! If you want their respect, earn it! They'll respect the rank automatically, but rapidly lose respect for the person sporting it on his lapel! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:17:00", 
        "title": "No respect!?!?", 
        "userID": "KJ1110"
    }, 
    {
        "content": "I know I'll probably get a lock flak for saying this as a senior enlisted person, but here goes... I don't commission source or education is a predictor of future success as an officer. I have met many Ring Knockers who I would follow thru a hurricane in a canoe. Likewise, I have met prior enlisted officers who I would like to personally pitch off a bridge somewhere. It's not education or source of commission. It's your attitude toward people and how well you do your job.", 
        "intTime": 20090505, 
        "postID": 29, 
        "quote": "", 
        "reply": "I know I'll probably get a lock flak for saying this as a senior enlisted person, but here goes... I don't commission source or education is a predictor of future success as an officer. I have met many Ring Knockers who I would follow thru a hurricane in a canoe. Likewise, I have met prior enlisted officers who I would like to personally pitch off a bridge somewhere. It's not education or source of commission. It's your attitude toward people and how well you do your job.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:18:00", 
        "title": "No respect!?!?", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Degree is in Underwater Basket-Weaving and (lack of)Communications > Health and PE Major most likely - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 30, 
        "quote": "Originally posted by sargeant_green: Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills?", 
        "reply": " Degree is in Underwater Basket-Weaving and (lack of)Communications > Health and PE Major most likely - - Wandering and Wondering", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:20:00", 
        "title": "No respect!?!?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want? TIG AND TIS is gonna kill him. Only one can be waived. Professional Specialist for a while! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 31, 
        "quote": "Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "reply": " TIG AND TIS is gonna kill him. Only one can be waived. Professional Specialist for a while! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:21:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want? Funny, my entire squad completely respected me when I was serving in an E-5 position. And I am half any man's size. But I didn't just do, I led. And I led by example. In the Infantry, it's what you do, not what you wear. I guess it all boils down to people. But if I dropped you, you'd damn sure knock 'em out for me, E4 or below, you talked to me at parade rest like any other NCO, and in the field I could Summary 15 you if I wanted to - all with the blessing of my PLsgt. I just never had to. They followed me because they trusted me, even though I was a lowly Spc. Yeah, some of us get respect. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 32, 
        "quote": "Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "reply": " Funny, my entire squad completely respected me when I was serving in an E-5 position. And I am half any man's size. But I didn't just do, I led. And I led by example. In the Infantry, it's what you do, not what you wear. I guess it all boils down to people. But if I dropped you, you'd damn sure knock 'em out for me, E4 or below, you talked to me at parade rest like any other NCO, and in the field I could Summary 15 you if I wanted to - all with the blessing of my PLsgt. I just never had to. They followed me because they trusted me, even though I was a lowly Spc. Yeah, some of us get respect. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:27:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "intTime": 20090505, 
        "postID": 33, 
        "quote": "", 
        "reply": "degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:33:00", 
        "title": "No respect!?!?", 
        "userID": "ajmccarty"
    }, 
    {
        "content": "Moderator Hat Off I really respected this army E4. I don't ever remember him complaining about not getting respect. He didn't have a college degree, he didn't live long enough to get one. Please note the date in red. STEPHEN ALLISON ALLSOPP SP4 - E4 - Army - Selective Service 1st Log Command Length of service 1 years His tour began on Jan 2, 1968 Casualty was on May 6, 1968 In BINH DINH, SOUTH VIETNAM HOSTILE, GROUND CASUALTY OTHER EXPLOSIVE DEVICE Body was recovered Panel 55E - Line 38 God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090505, 
        "postID": 34, 
        "quote": "", 
        "reply": "Moderator Hat Off I really respected this army E4. I don't ever remember him complaining about not getting respect. He didn't have a college degree, he didn't live long enough to get one. Please note the date in red. STEPHEN ALLISON ALLSOPP SP4 - E4 - Army - Selective Service 1st Log Command Length of service 1 years His tour began on Jan 2, 1968 Casualty was on May 6, 1968 In BINH DINH, SOUTH VIETNAM HOSTILE, GROUND CASUALTY OTHER EXPLOSIVE DEVICE Body was recovered Panel 55E - Line 38 God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:35:00", 
        "title": "No respect!?!?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 35, 
        "quote": "Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "reply": " You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:45:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "3 months!? There's your answer right there. I had over 6 years TIG as an E-4. Give it time. Most places you have to reach (Old Timers) status beofre much respect is shown.", 
        "intTime": 20090505, 
        "postID": 36, 
        "quote": "", 
        "reply": "3 months!? There's your answer right there. I had over 6 years TIG as an E-4. Give it time. Most places you have to reach (Old Timers) status beofre much respect is shown.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:45:00", 
        "title": "No respect!?!?", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 37, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving!", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:50:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "as before, moderator's hat off. I knew this guy back in 1956 I can't remember if he got any respect or not. I know he was a section leader of 15 men in a combat engineer battalion. If they didn't respect him they would have kicked his teeth in. He still had all of his teeth when he came home 18 months later. If memory services me right, he got $96.00 a month and that's all that really mattered. PS: He was an 8th dropout without a GED at that time. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090505, 
        "postID": 38, 
        "quote": "", 
        "reply": "as before, moderator's hat off. I knew this guy back in 1956 I can't remember if he got any respect or not. I know he was a section leader of 15 men in a combat engineer battalion. If they didn't respect him they would have kicked his teeth in. He still had all of his teeth when he came home 18 months later. If memory services me right, he got $96.00 a month and that's all that really mattered. PS: He was an 8th dropout without a GED at that time. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:01:00", 
        "title": "No respect!?!?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? sounds like you have a big head.... that might be one of your problems. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090505, 
        "postID": 39, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " sounds like you have a big head.... that might be one of your problems. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:06:00", 
        "title": "No respect!?!?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. I'm not going to hurl insults, but let me ask a sensitive question. How valuable do you really think a CJ degree is? The only reason why I have a BS Degree in CJ/Behavioral Science is because it was the easiest cirriculum my school had. I didn't even buy most of the textbooks. I earned C's and B's without studying.", 
        "intTime": 20090505, 
        "postID": 40, 
        "quote": "Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "reply": " I'm not going to hurl insults, but let me ask a sensitive question. How valuable do you really think a CJ degree is? The only reason why I have a BS Degree in CJ/Behavioral Science is because it was the easiest cirriculum my school had. I didn't even buy most of the textbooks. I earned C's and B's without studying.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:49:00", 
        "title": "No respect!?!?", 
        "userID": "scpd3045"
    }, 
    {
        "content": "maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "intTime": 20090505, 
        "postID": 41, 
        "quote": "", 
        "reply": "maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 15:56:00", 
        "title": "No respect!?!?", 
        "userID": "ajmccarty"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? IMO, NOOOOOOOOOOO Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 42, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " IMO, NOOOOOOOOOOO Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:00:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090505, 
        "postID": 43, 
        "quote": "", 
        "reply": "Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:10:00", 
        "title": "No respect!?!?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? Sounds like you may have \"Rodney Dangerfield\" syndrome. Immediately slap yourself. I agree, you earned the degree... you earned the rank thereby... but to those who earned their rank the hard way or who went through the ranks aren't going to agree with you until you earn their respect,imo.", 
        "intTime": 20090505, 
        "postID": 44, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " Sounds like you may have \"Rodney Dangerfield\" syndrome. Immediately slap yourself. I agree, you earned the degree... you earned the rank thereby... but to those who earned their rank the hard way or who went through the ranks aren't going to agree with you until you earn their respect,imo.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:10:00", 
        "title": "No respect!?!?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: BFD... The only respect you get at the enlisted level is EARNED by how far you can hump your ruck fully loaded, how straight you can shoot at distance, how good you are in hand to hand combat (including how many of your barracks mates you can whip in fist-fights after hours back in my day), how high you score on the PT Test, how good you are at leading a squad in night ambush training etc etc etc. Your degree may work as toilet paper, and it may even get you into OCS, so you can come back and still have to earn your respect by all of the above - but other than that - - WHO CARES!!! I was going to post a prime example but my left hand ran off this evening. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 45, 
        "quote": "Originally posted by greywolfghost: BFD... The only respect you get at the enlisted level is EARNED by how far you can hump your ruck fully loaded, how straight you can shoot at distance, how good you are in hand to hand combat (including how many of your barracks mates you can whip in fist-fights after hours back in my day), how high you score on the PT Test, how good you are at leading a squad in night ambush training etc etc etc. Your degree may work as toilet paper, and it may even get you into OCS, so you can come back and still have to earn your respect by all of the above - but other than that - - WHO CARES!!!", 
        "reply": " I was going to post a prime example but my left hand ran off this evening. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:11:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "intTime": 20090505, 
        "postID": 46, 
        "quote": "", 
        "reply": "E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:12:00", 
        "title": "No respect!?!?", 
        "userID": "azmax64"
    }, 
    {
        "content": "SPC-4's are ASL's in the Infantry - I was a SL. How can you be trusted with a squad's leadership when you haven't served day one with them? Or busted your hump for 2.5 years like the rest of us? In the Infantry, you EARN every ounce of respect you get. I had more than my Plt Ldr, who couldn't read a compass well enough to hump a single klick without putting us all in God-knows-where. My squad trusted me with everything they had on the line: not just their lives, but those of their families. It isn't the rank, bro. It never has been. Don't take it personally. But no one with a Blue Rope is going to respect you until you prove that you can hump it not only like the rest of us, but BETTER than the rest of us. Nothing you did in college makes you worth that rank - just some staff weenie recruiter gave it to you while the rest of us had to earn it. Give it your all, and give it some months. Your people will grow into you. Again, don't take it personally, bro. You're still valued as a member of the team. But just like we tease staff weenies and REMFs, you'll get the same ribbing until you've convinced everyone that you can hack it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 47, 
        "quote": "", 
        "reply": "SPC-4's are ASL's in the Infantry - I was a SL. How can you be trusted with a squad's leadership when you haven't served day one with them? Or busted your hump for 2.5 years like the rest of us? In the Infantry, you EARN every ounce of respect you get. I had more than my Plt Ldr, who couldn't read a compass well enough to hump a single klick without putting us all in God-knows-where. My squad trusted me with everything they had on the line: not just their lives, but those of their families. It isn't the rank, bro. It never has been. Don't take it personally. But no one with a Blue Rope is going to respect you until you prove that you can hump it not only like the rest of us, but BETTER than the rest of us. Nothing you did in college makes you worth that rank - just some staff weenie recruiter gave it to you while the rest of us had to earn it. Give it your all, and give it some months. Your people will grow into you. Again, don't take it personally, bro. You're still valued as a member of the team. But just like we tease staff weenies and REMFs, you'll get the same ribbing until you've convinced everyone that you can hack it. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:15:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Seriously, dude! With that attitude, you'll likely have your azz handed to you! Most (not all) junior enlisted don't go to college prior to enlisting and, by some odd quirk of fate, have little respect for those that did and even less for condescending over-edumacated idjits! If you want their respect, earn it! They'll respect the rank automatically, but rapidly lose respect for the person sporting it on his lapel! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090505, 
        "postID": 48, 
        "quote": "", 
        "reply": "Seriously, dude! With that attitude, you'll likely have your azz handed to you! Most (not all) junior enlisted don't go to college prior to enlisting and, by some odd quirk of fate, have little respect for those that did and even less for condescending over-edumacated idjits! If you want their respect, earn it! They'll respect the rank automatically, but rapidly lose respect for the person sporting it on his lapel! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:17:00", 
        "title": "No respect!?!?", 
        "userID": "KJ1110"
    }, 
    {
        "content": "I know I'll probably get a lock flak for saying this as a senior enlisted person, but here goes... I don't commission source or education is a predictor of future success as an officer. I have met many Ring Knockers who I would follow thru a hurricane in a canoe. Likewise, I have met prior enlisted officers who I would like to personally pitch off a bridge somewhere. It's not education or source of commission. It's your attitude toward people and how well you do your job.", 
        "intTime": 20090505, 
        "postID": 49, 
        "quote": "", 
        "reply": "I know I'll probably get a lock flak for saying this as a senior enlisted person, but here goes... I don't commission source or education is a predictor of future success as an officer. I have met many Ring Knockers who I would follow thru a hurricane in a canoe. Likewise, I have met prior enlisted officers who I would like to personally pitch off a bridge somewhere. It's not education or source of commission. It's your attitude toward people and how well you do your job.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:18:00", 
        "title": "No respect!?!?", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills? Degree is in Underwater Basket-Weaving and (lack of)Communications > Health and PE Major most likely - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 50, 
        "quote": "Originally posted by sargeant_green: Go To OCS and shut them up. If you \"mustang\" they'll have all the respect in the world for you. Go Figure... Oh and Mr. \"all i here is\" got a bachelors degree, how the he11 did you graduate with those spelling skills?", 
        "reply": " Degree is in Underwater Basket-Weaving and (lack of)Communications > Health and PE Major most likely - - Wandering and Wondering", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:20:00", 
        "title": "No respect!?!?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want? TIG AND TIS is gonna kill him. Only one can be waived. Professional Specialist for a while! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 51, 
        "quote": "Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "reply": " TIG AND TIS is gonna kill him. Only one can be waived. Professional Specialist for a while! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:21:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want? Funny, my entire squad completely respected me when I was serving in an E-5 position. And I am half any man's size. But I didn't just do, I led. And I led by example. In the Infantry, it's what you do, not what you wear. I guess it all boils down to people. But if I dropped you, you'd damn sure knock 'em out for me, E4 or below, you talked to me at parade rest like any other NCO, and in the field I could Summary 15 you if I wanted to - all with the blessing of my PLsgt. I just never had to. They followed me because they trusted me, even though I was a lowly Spc. Yeah, some of us get respect. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 52, 
        "quote": "Originally posted by azmax64: E-4s get respect? Since when? You get just as much respect for that college degree as you get in the civilian world. Your ahead of the curve, you should make E-5 and more easily, when it comes to promotion points. What more do you want?", 
        "reply": " Funny, my entire squad completely respected me when I was serving in an E-5 position. And I am half any man's size. But I didn't just do, I led. And I led by example. In the Infantry, it's what you do, not what you wear. I guess it all boils down to people. But if I dropped you, you'd damn sure knock 'em out for me, E4 or below, you talked to me at parade rest like any other NCO, and in the field I could Summary 15 you if I wanted to - all with the blessing of my PLsgt. I just never had to. They followed me because they trusted me, even though I was a lowly Spc. Yeah, some of us get respect. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:27:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "intTime": 20090505, 
        "postID": 53, 
        "quote": "", 
        "reply": "degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:33:00", 
        "title": "No respect!?!?", 
        "userID": "ajmccarty"
    }, 
    {
        "content": "Moderator Hat Off I really respected this army E4. I don't ever remember him complaining about not getting respect. He didn't have a college degree, he didn't live long enough to get one. Please note the date in red. STEPHEN ALLISON ALLSOPP SP4 - E4 - Army - Selective Service 1st Log Command Length of service 1 years His tour began on Jan 2, 1968 Casualty was on May 6, 1968 In BINH DINH, SOUTH VIETNAM HOSTILE, GROUND CASUALTY OTHER EXPLOSIVE DEVICE Body was recovered Panel 55E - Line 38 God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090505, 
        "postID": 54, 
        "quote": "", 
        "reply": "Moderator Hat Off I really respected this army E4. I don't ever remember him complaining about not getting respect. He didn't have a college degree, he didn't live long enough to get one. Please note the date in red. STEPHEN ALLISON ALLSOPP SP4 - E4 - Army - Selective Service 1st Log Command Length of service 1 years His tour began on Jan 2, 1968 Casualty was on May 6, 1968 In BINH DINH, SOUTH VIETNAM HOSTILE, GROUND CASUALTY OTHER EXPLOSIVE DEVICE Body was recovered Panel 55E - Line 38 God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:35:00", 
        "title": "No respect!?!?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090505, 
        "postID": 55, 
        "quote": "Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "reply": " You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:45:00", 
        "title": "No respect!?!?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "3 months!? There's your answer right there. I had over 6 years TIG as an E-4. Give it time. Most places you have to reach (Old Timers) status beofre much respect is shown.", 
        "intTime": 20090505, 
        "postID": 56, 
        "quote": "", 
        "reply": "3 months!? There's your answer right there. I had over 6 years TIG as an E-4. Give it time. Most places you have to reach (Old Timers) status beofre much respect is shown.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:45:00", 
        "title": "No respect!?!?", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090505, 
        "postID": 57, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. You're close bro. It depends on your MOS. In the Infantry, the respect was for the man, the rules were for the rank. I used to drink with several E6 and E7's on a constant basis, and we had some wild times together. But that was after COB formation. Once duty formation started, I was the squad leader, they were the sergeants. And I locked up at parade rest just as sure as any Private did when I addressed them. Respecting the rank is easy - you Bravo Sierra through whatever they have to say. Respecting the man behind that rank takes time; and if you're sincere, you'll get there, bro. 3 months in is NOTHING. You're still the Private in many eyes. If you want the respect of a TL SPC, then learn to earn it (as we used to say). Get your land nav squared away, treat your people with dignity, and never take any flak unless it is meant in good sport. Never ask anyone to do anything they've never seen you do before, never talk down your chain of command, and never let anyone make you feel like they are better than you. Pick your fights, but when you do, make damn sure you picked the right one. Treat your people right, and they'll treat you right. But understand that right now, you're a lowly E1 with E4 pinned to your collar by a staff weenie. They'll respect you as an E4, but not as a man. That you'll have to earn. But you'll get there, bro. You seem squared away enough to WANT to get there, so you will. But nothing in this man's Army is given freely. I wish you the very best, and thank you for serving!", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 16:50:00", 
        "title": "No respect!?!?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "as before, moderator's hat off. I knew this guy back in 1956 I can't remember if he got any respect or not. I know he was a section leader of 15 men in a combat engineer battalion. If they didn't respect him they would have kicked his teeth in. He still had all of his teeth when he came home 18 months later. If memory services me right, he got $96.00 a month and that's all that really mattered. PS: He was an 8th dropout without a GED at that time. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090505, 
        "postID": 58, 
        "quote": "", 
        "reply": "as before, moderator's hat off. I knew this guy back in 1956 I can't remember if he got any respect or not. I know he was a section leader of 15 men in a combat engineer battalion. If they didn't respect him they would have kicked his teeth in. He still had all of his teeth when he came home 18 months later. If memory services me right, he got $96.00 a month and that's all that really mattered. PS: He was an 8th dropout without a GED at that time. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:01:00", 
        "title": "No respect!?!?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO??? sounds like you have a big head.... that might be one of your problems. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090505, 
        "postID": 59, 
        "quote": "Originally posted by ajmccarty: maybe light can be shed... why is it that people who enter the military with a college degree get no respect? I came in with a Bachelor's, which gave me a SPC rank (i didn't opt for OCS in contract), and it seems like all i here is...\"oh a shake 'n' bake\" or \"wtf...this guy didn't even earn his rank\" The way I see it is, I earned my degree, my degree means I'm a SPC, therefore I earned my rank. NO???", 
        "reply": " sounds like you have a big head.... that might be one of your problems. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:06:00", 
        "title": "No respect!?!?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way. I'm not going to hurl insults, but let me ask a sensitive question. How valuable do you really think a CJ degree is? The only reason why I have a BS Degree in CJ/Behavioral Science is because it was the easiest cirriculum my school had. I didn't even buy most of the textbooks. I earned C's and B's without studying.", 
        "intTime": 20090505, 
        "postID": 60, 
        "quote": "Originally posted by ajmccarty: degree-Criminal Justice I thought it was respect the rank, not the man. 3 months in...already have been a team leader (albeit for a few days); in-line to be company Arms Room NCOIC; going to WLC in the near future. It's cool though. I appreciate all the comments, and will continue to work hard and lead the way.", 
        "reply": " I'm not going to hurl insults, but let me ask a sensitive question. How valuable do you really think a CJ degree is? The only reason why I have a BS Degree in CJ/Behavioral Science is because it was the easiest cirriculum my school had. I didn't even buy most of the textbooks. I earned C's and B's without studying.", 
        "threadID": "5291911282_2380065222001", 
        "time": "2009-05-05 17:49:00", 
        "title": "No respect!?!?", 
        "userID": "scpd3045"
    }
]