[
    {
        "content": "I put this together two years ago it is permanently on display in our home owners' club house. The M16 and bayonet are plastic models - but they look real. I bought the display case the boots and flag are mine the purple heart and helmet are my brother's. The the toughest part was designing a way for the M16 to stand and hold the weight of the helmet. My total cost was about $150.00. The back of the display case is mirrored. The one tag on the left upper side is the first of now 12 memorial plates with names, service and date of death of GIs who died of combat wounds. It only cost $5.00 to make each memorial plate. Of the 12 names they range from WWI to Iraq. I have transported it several about a dozen times to different clubs and churches for veterans' memorial services. It just fits in the back of my pick-up. All donations go directly to the Veterans Center in St. Petersburg. I never request or suggest donations. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090329, 
        "postID": 1, 
        "quote": "", 
        "reply": "I put this together two years ago it is permanently on display in our home owners' club house. The M16 and bayonet are plastic models - but they look real. I bought the display case the boots and flag are mine the purple heart and helmet are my brother's. The the toughest part was designing a way for the M16 to stand and hold the weight of the helmet. My total cost was about $150.00. The back of the display case is mirrored. The one tag on the left upper side is the first of now 12 memorial plates with names, service and date of death of GIs who died of combat wounds. It only cost $5.00 to make each memorial plate. Of the 12 names they range from WWI to Iraq. I have transported it several about a dozen times to different clubs and churches for veterans' memorial services. It just fits in the back of my pick-up. All donations go directly to the Veterans Center in St. Petersburg. I never request or suggest donations. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-29 20:17:00", 
        "title": "Soldier's Cross Display", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Looking good Bruce, ya done yerself proud! Bruce Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090329, 
        "postID": 2, 
        "quote": "", 
        "reply": "Looking good Bruce, ya done yerself proud! Bruce Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-29 20:28:00", 
        "title": "Soldier's Cross Display", 
        "userID": "Bergy46"
    }, 
    {
        "content": "COOOOOL!!!!!! Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090329, 
        "postID": 3, 
        "quote": "", 
        "reply": "COOOOOL!!!!!! Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-29 20:34:00", 
        "title": "Soldier's Cross Display", 
        "userID": "DSTremf"
    }, 
    {
        "content": "Hey DST, about yer tagline, I like it, Is It Legal? Heck If it was legal it wouldn't be any fun! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090329, 
        "postID": 4, 
        "quote": "", 
        "reply": "Hey DST, about yer tagline, I like it, Is It Legal? Heck If it was legal it wouldn't be any fun! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-29 20:51:00", 
        "title": "Soldier's Cross Display", 
        "userID": "Bergy46"
    }, 
    {
        "content": "OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their.", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "", 
        "reply": "OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their.", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-30 04:06:00", 
        "title": "Soldier's Cross Display", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their. Duster, I've been there, cried there and prayer there, Awesome is, I believe the best way that I can express it. there are a few of places that in spire the awe like that: The Tomb of the Unknowns and all of Arlington , The Punchbowl in Hawaii, the Hall of Heroes in DC and the D-Day beaches in France. Lots of awe, tears and prayers. My little memorial is only a speck of dust when compare to the places named above. You're a good man Duster and the nest time I'm in the area I'll but the A&Ws OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their.", 
        "reply": " Duster, I've been there, cried there and prayer there, Awesome is, I believe the best way that I can express it. there are a few of places that in spire the awe like that: The Tomb of the Unknowns and all of Arlington , The Punchbowl in Hawaii, the Hall of Heroes in DC and the D-Day beaches in France. Lots of awe, tears and prayers. My little memorial is only a speck of dust when compare to the places named above. You're a good man Duster and the nest time I'm in the area I'll but the A&Ws OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-30 05:06:00", 
        "title": "Soldier's Cross Display", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by Duster6: OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their. Please elaborate, I've lived here in F-Ville since 93 and don't know a bit about what you're speaking of. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090330, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their.", 
        "reply": " Please elaborate, I've lived here in F-Ville since 93 and don't know a bit about what you're speaking of. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-30 07:04:00", 
        "title": "Soldier's Cross Display", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Duster6: OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their. Please elaborate, I've lived here in F-Ville since 93 and don't know a bit about what you're speaking of. Vicdude; The Special Forces Association has their National Headquarters located off Doc Bennet Road which is off the Fayetteville Airport. They have a chapel, Team House, and cemetery on the grounds. Many deceased members are buried their or their ashes spread there. There are pictures, newspaper clippings, and just about everything else there. It is a mini museum that honors past and present members. You can ask any SF Member to take you out there when they are open or be invited by an Officer of the Chapter. The next time I go to a meeting there if you would like to see it I will send you an email and we can meet somewhere in Fayetteville and I would be happy to show you around.", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Duster6: OldArmyLove; If you are ever in the Fayetteville NC area send me a warning order and I will show you the SF Team House and ground out by the Fayetteville Airport. Talk about some sentimental things to honor our fallen. Wow. Few people get to see it or know that it is even their. Please elaborate, I've lived here in F-Ville since 93 and don't know a bit about what you're speaking of.", 
        "reply": " Vicdude; The Special Forces Association has their National Headquarters located off Doc Bennet Road which is off the Fayetteville Airport. They have a chapel, Team House, and cemetery on the grounds. Many deceased members are buried their or their ashes spread there. There are pictures, newspaper clippings, and just about everything else there. It is a mini museum that honors past and present members. You can ask any SF Member to take you out there when they are open or be invited by an Officer of the Chapter. The next time I go to a meeting there if you would like to see it I will send you an email and we can meet somewhere in Fayetteville and I would be happy to show you around.", 
        "threadID": "5291911282_2230003912001", 
        "time": "2009-03-30 16:29:00", 
        "title": "Soldier's Cross Display", 
        "userID": "Duster6"
    }
]