[
    {
        "content": "so my future and ultimate goal is to become a deputy sheriff in san bernardino county, ca, usa. I looked at the navy, air force and army. I am looking for a job as a military police officer, but am confused what branch i should join. any suggestions? i want to join the branch most closely related to being a regular police officer. i appreciate your help", 
        "intTime": 20090502, 
        "postID": 1, 
        "quote": "", 
        "reply": "so my future and ultimate goal is to become a deputy sheriff in san bernardino county, ca, usa. I looked at the navy, air force and army. I am looking for a job as a military police officer, but am confused what branch i should join. any suggestions? i want to join the branch most closely related to being a regular police officer. i appreciate your help", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-02 21:20:00", 
        "title": "military police jobs question", 
        "userID": "future_mp_pace"
    }, 
    {
        "content": "Welcome aboard. I find it refreshing to see an ambitious young person who is focused. The route you're speaking of is the same as I took. Every police agency has needs that are found in other than former M/P positions. Computer skills, chemistry, teaching, second languages, accounting, etc., can be more valuable than what you suggested. There's plenty of needs to encourage you to do what you like. Please do not dismiss college. Most LE agencies are very competitive. You will be cheating yourself by not getting a degree. It will be lots easier now to accomplish than later. Did you know the Army has a helicopter pilot program that only requires a HS diploma? Good luck. This message has been edited. Last edited by: scpd3045, Sun 03 May 2009 01:02 PM", 
        "intTime": 20090503, 
        "postID": 2, 
        "quote": "", 
        "reply": "Welcome aboard. I find it refreshing to see an ambitious young person who is focused. The route you're speaking of is the same as I took. Every police agency has needs that are found in other than former M/P positions. Computer skills, chemistry, teaching, second languages, accounting, etc., can be more valuable than what you suggested. There's plenty of needs to encourage you to do what you like. Please do not dismiss college. Most LE agencies are very competitive. You will be cheating yourself by not getting a degree. It will be lots easier now to accomplish than later. Did you know the Army has a helicopter pilot program that only requires a HS diploma? Good luck. This message has been edited. Last edited by: scpd3045, Sun 03 May 2009 01:02 PM", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 05:39:00", 
        "title": "military police jobs question", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by scpd3045: Welcome aboard. I find it refreshing to see an ambitious young person who is focused. The route you're speaking of is the same as I took. Every police agency has needs that are found in other than former M/P positions. Computer skills, chemistry, teaching, second languages, acounting, etc., can be more valuable than what you suggested. There's plenty of needs to encourage you to do what you like. Please do not dismiss college. Most LE agencies are very competitive. You will be cheating yourself by not getting a degree. It will be lots easier now to accomplish than later. Did you know the Army has a helicopter pilot program that only requires a HS diploma? Good luck. Some of the Florida State and Local agencies I knew required a two year degree to make LT and a four yr degree to make Capt. Did the Army ever back up those commericials about going from HS to the CWO program? I called them on it back in 1982 and they said, \"Well, we really want two years of college.\" Don", 
        "intTime": 20090503, 
        "postID": 3, 
        "quote": "Originally posted by scpd3045: Welcome aboard. I find it refreshing to see an ambitious young person who is focused. The route you're speaking of is the same as I took. Every police agency has needs that are found in other than former M/P positions. Computer skills, chemistry, teaching, second languages, acounting, etc., can be more valuable than what you suggested. There's plenty of needs to encourage you to do what you like. Please do not dismiss college. Most LE agencies are very competitive. You will be cheating yourself by not getting a degree. It will be lots easier now to accomplish than later. Did you know the Army has a helicopter pilot program that only requires a HS diploma? Good luck.", 
        "reply": " Some of the Florida State and Local agencies I knew required a two year degree to make LT and a four yr degree to make Capt. Did the Army ever back up those commericials about going from HS to the CWO program? I called them on it back in 1982 and they said, \"Well, we really want two years of college.\" Don", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 06:19:00", 
        "title": "military police jobs question", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by future_mp_pace: so my future and ultimate goal is to become a deputy sheriff in san bernardino county, ca, usa. I looked at the navy, air force and army. I am looking for a job as a military police officer, but am confused what branch i should join. any suggestions? i want to join the branch most closely related to being a regular police officer. i appreciate your help I'm prior Coast Guard and don't really care if the USCG is not your thing. Heck, it didn't bother me one bit when my son chose the Marine Corps. But......just to give you another idea, if you go Coast Guard, all that experience you might get as a Boarding Officer or Boarding Team Member could be useful in getting a job with a Sheriff's Office. Arrests, seizures, searching for compartments and drugs, evidence custody, reports, testifying in court, etc. My six years in the Coast Guard was the only reason I was later hired to run boats for U.S. Customs. Did that for 17 yrs before I had to retire as a GS-12 for a Disability. I know nothing about San Bernadino but if they have a Marine Unit, all the better for you if you were a Coast Guard Coxswain/Boarding Officer....that is, if you have the slightest interest in boats. Your call, whatever makes you the happiest. Good luck, Don", 
        "intTime": 20090503, 
        "postID": 4, 
        "quote": "Originally posted by future_mp_pace: so my future and ultimate goal is to become a deputy sheriff in san bernardino county, ca, usa. I looked at the navy, air force and army. I am looking for a job as a military police officer, but am confused what branch i should join. any suggestions? i want to join the branch most closely related to being a regular police officer. i appreciate your help", 
        "reply": " I'm prior Coast Guard and don't really care if the USCG is not your thing. Heck, it didn't bother me one bit when my son chose the Marine Corps. But......just to give you another idea, if you go Coast Guard, all that experience you might get as a Boarding Officer or Boarding Team Member could be useful in getting a job with a Sheriff's Office. Arrests, seizures, searching for compartments and drugs, evidence custody, reports, testifying in court, etc. My six years in the Coast Guard was the only reason I was later hired to run boats for U.S. Customs. Did that for 17 yrs before I had to retire as a GS-12 for a Disability. I know nothing about San Bernadino but if they have a Marine Unit, all the better for you if you were a Coast Guard Coxswain/Boarding Officer....that is, if you have the slightest interest in boats. Your call, whatever makes you the happiest. Good luck, Don", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 06:29:00", 
        "title": "military police jobs question", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Whatever you decide, I wish you well! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090503, 
        "postID": 5, 
        "quote": "", 
        "reply": "Whatever you decide, I wish you well! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 07:02:00", 
        "title": "military police jobs question", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Becoming an MP Officer in the Army is the best way to go. My Son had a chance to become an Officer in the MPs but turned it down because he was in charge of a section of young MPs when assigned to the 82nd MP Company. He had three years of college and made E-8 in 14 years. Not too bad IMO. He really liked it from the enlisted side and knew that if he became an Officer he would be stuck behind a desk and he did not want that.", 
        "intTime": 20090503, 
        "postID": 6, 
        "quote": "", 
        "reply": "Becoming an MP Officer in the Army is the best way to go. My Son had a chance to become an Officer in the MPs but turned it down because he was in charge of a section of young MPs when assigned to the 82nd MP Company. He had three years of college and made E-8 in 14 years. Not too bad IMO. He really liked it from the enlisted side and knew that if he became an Officer he would be stuck behind a desk and he did not want that.", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 07:08:00", 
        "title": "military police jobs question", 
        "userID": "Duster6"
    }, 
    {
        "content": "The marine bureau is an often sought job within a police department. We have plenty of guys with boating skills who apply, but you know who got the job easy? It was a cop who's a master mechanic. They want someone who can rip off the cowling and jumpstart a dead endine, particularly in the freezing weather. His mechanical skills were more important than someone possessing a PHD in Criminal Justice.", 
        "intTime": 20090503, 
        "postID": 7, 
        "quote": "", 
        "reply": "The marine bureau is an often sought job within a police department. We have plenty of guys with boating skills who apply, but you know who got the job easy? It was a cop who's a master mechanic. They want someone who can rip off the cowling and jumpstart a dead endine, particularly in the freezing weather. His mechanical skills were more important than someone possessing a PHD in Criminal Justice.", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 13:07:00", 
        "title": "military police jobs question", 
        "userID": "scpd3045"
    }, 
    {
        "content": "21yrsCG, often neglected is pilot openings in Army Guard or Reserve outfits. They were taking HS grads recently. The competition is hit & miss.", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "", 
        "reply": "21yrsCG, often neglected is pilot openings in Army Guard or Reserve outfits. They were taking HS grads recently. The competition is hit & miss.", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 13:09:00", 
        "title": "military police jobs question", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Go Armor: The Tip of the Spear!! - MPs always held the traffic while we rolled to the border on Alerts and such! ! (Duck for Cover!! In-Coming!!) Actually, my youngest Son in a Policeman. Many MPs and SPs step directly into civilian life with all that experience/training - - My boy - - Wasn't too much call for my Tank Gunner Skills in Civilian Life - - Wandering and Wondering", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "", 
        "reply": "Go Armor: The Tip of the Spear!! - MPs always held the traffic while we rolled to the border on Alerts and such! ! (Duck for Cover!! In-Coming!!) Actually, my youngest Son in a Policeman. Many MPs and SPs step directly into civilian life with all that experience/training - - My boy - - Wasn't too much call for my Tank Gunner Skills in Civilian Life - - Wandering and Wondering", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-03 13:46:00", 
        "title": "military police jobs question", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Where did the lad go; one post wonder?", 
        "intTime": 20090504, 
        "postID": 10, 
        "quote": "", 
        "reply": "Where did the lad go; one post wonder?", 
        "threadID": "5291911282_2420073222001", 
        "time": "2009-05-04 18:50:00", 
        "title": "military police jobs question", 
        "userID": "scpd3045"
    }
]