[
    {
        "content": "I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "intTime": 20090314, 
        "postID": 1, 
        "quote": "", 
        "reply": "I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:17:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Van, your right , this is wrong,but money is the root of all evil.. Pizzes me off that they cater to people of different languages. I know a little Spanish, had to learn it for I lived in the Southwest for a while.The primary language should be English,learn all the other languages you want, should you visit another COUNTRY!!!!!", 
        "intTime": 20090314, 
        "postID": 2, 
        "quote": "", 
        "reply": "Van, your right , this is wrong,but money is the root of all evil.. Pizzes me off that they cater to people of different languages. I know a little Spanish, had to learn it for I lived in the Southwest for a while.The primary language should be English,learn all the other languages you want, should you visit another COUNTRY!!!!!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:23:00", 
        "title": "Walmart", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090314, 
        "postID": 3, 
        "quote": "", 
        "reply": "Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:25:00", 
        "title": "Walmart", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090314, 
        "postID": 4, 
        "quote": "Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU", 
        "reply": " It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 17:22:00", 
        "title": "Walmart", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong? Wal(China)mart could care less - - Wandering and Wondering", 
        "intTime": 20090314, 
        "postID": 5, 
        "quote": "Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "reply": " Wal(China)mart could care less - - Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 18:46:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I live in southern california so lots of places here have both english and spanish signs. I do believe that english should be the main language here and we should promote that. Not to say that it would be a bad thing for us to learn spanish or other languages as well. I think that just makes us more well rounded and more competitive in the world market. As for people not speaking english here...I find the younger hispanic generation learn english pretty fast as they know it relates to money and income. The older generation have a harder time with it and I can't say I blame them. I am trying to learn spanish now at 44 and it is just not coming that easy for me. They say it is much easier to learn as a child because you don't have that mental block.", 
        "intTime": 20090314, 
        "postID": 6, 
        "quote": "", 
        "reply": "I live in southern california so lots of places here have both english and spanish signs. I do believe that english should be the main language here and we should promote that. Not to say that it would be a bad thing for us to learn spanish or other languages as well. I think that just makes us more well rounded and more competitive in the world market. As for people not speaking english here...I find the younger hispanic generation learn english pretty fast as they know it relates to money and income. The older generation have a harder time with it and I can't say I blame them. I am trying to learn spanish now at 44 and it is just not coming that easy for me. They say it is much easier to learn as a child because you don't have that mental block.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 19:26:00", 
        "title": "Walmart", 
        "userID": "usa_girl"
    }, 
    {
        "content": "What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "intTime": 20090315, 
        "postID": 7, 
        "quote": "", 
        "reply": "What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 03:37:00", 
        "title": "Walmart", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "For me, it’s the fact that it’s being forced upon me! Every where I go, i.e. wallyworld, gas stations, movies, home depot…etc. I get to try to understand the bigger than life signs in Spanish. I’m not against speaking the language of the host nation when I was stationed there, but here at home…we speak English! Why should I conform to speak another language here at home? I grew up in Hawai’i, I spoke what is called “Pigeon English”. A mix of Hawaiian, English, Samoan, Philipino, Chinese, Japanese… I have to learn another language because 12 million illegals have moved to my, OUR country…? The governor here is supporting a bill to let the kids of illegals get free education. I can’t afford to send my Son to College… I just want the people we elect to office to uphold that office and start taking care of Americans! Isn’t that what we hired them to do? Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090315, 
        "postID": 8, 
        "quote": "", 
        "reply": "For me, it’s the fact that it’s being forced upon me! Every where I go, i.e. wallyworld, gas stations, movies, home depot…etc. I get to try to understand the bigger than life signs in Spanish. I’m not against speaking the language of the host nation when I was stationed there, but here at home…we speak English! Why should I conform to speak another language here at home? I grew up in Hawai’i, I spoke what is called “Pigeon English”. A mix of Hawaiian, English, Samoan, Philipino, Chinese, Japanese… I have to learn another language because 12 million illegals have moved to my, OUR country…? The governor here is supporting a bill to let the kids of illegals get free education. I can’t afford to send my Son to College… I just want the people we elect to office to uphold that office and start taking care of Americans! Isn’t that what we hired them to do? Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 04:16:00", 
        "title": "Walmart", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong? I think it was sometime around the late 90's. A mall was built near the Miami, FL airport that targeted Hispanics. I never went (lived in the Keys) but from what I was told, the signs were in Spanish. It might be \"The Dolphin Mall\" but I am not sure. Anyone know? Don", 
        "intTime": 20090315, 
        "postID": 9, 
        "quote": "Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "reply": " I think it was sometime around the late 90's. A mall was built near the Miami, FL airport that targeted Hispanics. I never went (lived in the Keys) but from what I was told, the signs were in Spanish. It might be \"The Dolphin Mall\" but I am not sure. Anyone know? Don", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 06:15:00", 
        "title": "Walmart", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I think that if I was to build a store anywhere, I would cater to my expected customer base for that store. It's just good business. Shockey", 
        "intTime": 20090315, 
        "postID": 10, 
        "quote": "", 
        "reply": "I think that if I was to build a store anywhere, I would cater to my expected customer base for that store. It's just good business. Shockey", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 06:31:00", 
        "title": "Walmart", 
        "userID": "shockey"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 11, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": " There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:13:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What I am trying to say here is I believe that WalMart should be promoting Americanism and not encouraging people to retain their ideals, values, language and products from their old country. Is that why those people came to America just so they can keep everything from their old country? If that is what they want then they can jump back across the border. When someone comes to this country they should start to assimilate into this culture. Learn our language, live the way that we do, teach their kids how to be Americans. America is not their old country. If they want to speak the language from their old country then that is okay but don't expect me to learn their language just so I can converse with them. When I was in Europe I had to learn some of the language of the country where I traveled. They didn't learn English just to please me. I believe that WalMart is not promoting Americanism by catering to Hispanics and illegal aliens. Yes, it all about money but then again just how much money does Walmart really need?", 
        "intTime": 20090315, 
        "postID": 12, 
        "quote": "", 
        "reply": "What I am trying to say here is I believe that WalMart should be promoting Americanism and not encouraging people to retain their ideals, values, language and products from their old country. Is that why those people came to America just so they can keep everything from their old country? If that is what they want then they can jump back across the border. When someone comes to this country they should start to assimilate into this culture. Learn our language, live the way that we do, teach their kids how to be Americans. America is not their old country. If they want to speak the language from their old country then that is okay but don't expect me to learn their language just so I can converse with them. When I was in Europe I had to learn some of the language of the country where I traveled. They didn't learn English just to please me. I believe that WalMart is not promoting Americanism by catering to Hispanics and illegal aliens. Yes, it all about money but then again just how much money does Walmart really need?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:21:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: WalMart should be promoting Americanism I personally do NOT shop at Walmart. I’ve yet to find anything in there that’s made in America; that and the ones in my area go from shinny and new to rundown ‘armpits-of-a-store’ in no time flat!! (Wolfhound made that point when he witnessed someone spit on the store floor!!) I look at the labels when I shop. Walmart imports frozen vegetables from China. Just an example BUT WHY is America importing cauliflower? Convenience or not; I don’t do Walmart. . .that’s one store I have the least respect for!! choose joy each day", 
        "intTime": 20090315, 
        "postID": 13, 
        "quote": "WalMart should be promoting Americanism", 
        "reply": " I personally do NOT shop at Walmart. I’ve yet to find anything in there that’s made in America; that and the ones in my area go from shinny and new to rundown ‘armpits-of-a-store’ in no time flat!! (Wolfhound made that point when he witnessed someone spit on the store floor!!) I look at the labels when I shop. Walmart imports frozen vegetables from China. Just an example BUT WHY is America importing cauliflower? Convenience or not; I don’t do Walmart. . .that’s one store I have the least respect for!! choose joy each day", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:39:00", 
        "title": "Walmart", 
        "userID": "MissU2"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "intTime": 20090315, 
        "postID": 14, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": " Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:45:00", 
        "title": "Walmart", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 15, 
        "quote": "", 
        "reply": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 08:12:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "intTime": 20090315, 
        "postID": 16, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "reply": " Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 09:16:00", 
        "title": "Walmart", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU This is what I was talking about last week, in the caf'e Renne thread, when I got my butt chewed out by my boss. Imagine haveingspoken thai, indian and Burmees languages where you work. I t would help if there was common language, say english. Having multiple languages in a society or work place does not pull people together. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090315, 
        "postID": 17, 
        "quote": "Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU", 
        "reply": " This is what I was talking about last week, in the caf'e Renne thread, when I got my butt chewed out by my boss. Imagine haveingspoken thai, indian and Burmees languages where you work. I t would help if there was common language, say english. Having multiple languages in a society or work place does not pull people together. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 11:21:00", 
        "title": "Walmart", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time. For information I do speak a little bit of Spanish that I took in high school. But I will be darned if I am going to sit around and talk in Spanish with the illegal aliens! This is my country and here I speak English. If a person from a foreign country is visiting here in this country then I will make every attempt to converse with them in whatever language that they speak (or use sign language if necessary). But to have someone sneak across the border into this country and try to change my culture, my language or my way of living then I must protest loudly and with emphasis! Learn my language as I attempt to learn your language when I travel to your country. I will not come (sneak)into your country and fly your flag upside down, I will not march in your streets demanding the you give me welfare, a free education, free medical care and all of the rights and freedoms that your citizens have. I just ask that you do the same if you come into this country. Do it legally and we will go from there. No cider alpha we don't mind learning another language we just don't want another language forced onto us!", 
        "intTime": 20090315, 
        "postID": 18, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "reply": " For information I do speak a little bit of Spanish that I took in high school. But I will be darned if I am going to sit around and talk in Spanish with the illegal aliens! This is my country and here I speak English. If a person from a foreign country is visiting here in this country then I will make every attempt to converse with them in whatever language that they speak (or use sign language if necessary). But to have someone sneak across the border into this country and try to change my culture, my language or my way of living then I must protest loudly and with emphasis! Learn my language as I attempt to learn your language when I travel to your country. I will not come (sneak)into your country and fly your flag upside down, I will not march in your streets demanding the you give me welfare, a free education, free medical care and all of the rights and freedoms that your citizens have. I just ask that you do the same if you come into this country. Do it legally and we will go from there. No cider alpha we don't mind learning another language we just don't want another language forced onto us!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:20:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "For one thing, it might help if we quit calling the language \"English.\" The British will be the First to tell you we Americans don't speak or write \"English.\" The old joke that we are two nations separated by the \"English\" language is more true than ever. We have American Literature and American language, and we should refer to our written and spoken Language as \"American.\" If we did that, the stigma and feeling of dependence that comes with the term \"English\" might vanish - - I know whereof I speak, having degrees in English Literature and English History. We don't call our leader \"king\" or \"prime minister\", and we don't call our government \"Parliament, House of Lords, and House of Commons,\" even though we pretty much copied the functions of them all. We assigned our own names, while making near carbon copies. The same should be done with the language: American Language! Then require everyone who wishes to reside here to learn it and use it.... Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 19, 
        "quote": "", 
        "reply": "For one thing, it might help if we quit calling the language \"English.\" The British will be the First to tell you we Americans don't speak or write \"English.\" The old joke that we are two nations separated by the \"English\" language is more true than ever. We have American Literature and American language, and we should refer to our written and spoken Language as \"American.\" If we did that, the stigma and feeling of dependence that comes with the term \"English\" might vanish - - I know whereof I speak, having degrees in English Literature and English History. We don't call our leader \"king\" or \"prime minister\", and we don't call our government \"Parliament, House of Lords, and House of Commons,\" even though we pretty much copied the functions of them all. We assigned our own names, while making near carbon copies. The same should be done with the language: American Language! Then require everyone who wishes to reside here to learn it and use it.... Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:36:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. Their front line employees, those who do the real work, whom are the reason WM has the income it does, are paid minimum wage, some make a little more, depending on their position, perhaps a front line supervisor or someone who has worked there for more than a year! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090315, 
        "postID": 20, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it.", 
        "reply": " Their front line employees, those who do the real work, whom are the reason WM has the income it does, are paid minimum wage, some make a little more, depending on their position, perhaps a front line supervisor or someone who has worked there for more than a year! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:37:00", 
        "title": "Walmart", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "intTime": 20090314, 
        "postID": 21, 
        "quote": "", 
        "reply": "I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:17:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Van, your right , this is wrong,but money is the root of all evil.. Pizzes me off that they cater to people of different languages. I know a little Spanish, had to learn it for I lived in the Southwest for a while.The primary language should be English,learn all the other languages you want, should you visit another COUNTRY!!!!!", 
        "intTime": 20090314, 
        "postID": 22, 
        "quote": "", 
        "reply": "Van, your right , this is wrong,but money is the root of all evil.. Pizzes me off that they cater to people of different languages. I know a little Spanish, had to learn it for I lived in the Southwest for a while.The primary language should be English,learn all the other languages you want, should you visit another COUNTRY!!!!!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:23:00", 
        "title": "Walmart", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090314, 
        "postID": 23, 
        "quote": "", 
        "reply": "Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:25:00", 
        "title": "Walmart", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090314, 
        "postID": 24, 
        "quote": "Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU", 
        "reply": " It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 17:22:00", 
        "title": "Walmart", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong? Wal(China)mart could care less - - Wandering and Wondering", 
        "intTime": 20090314, 
        "postID": 25, 
        "quote": "Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "reply": " Wal(China)mart could care less - - Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 18:46:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I live in southern california so lots of places here have both english and spanish signs. I do believe that english should be the main language here and we should promote that. Not to say that it would be a bad thing for us to learn spanish or other languages as well. I think that just makes us more well rounded and more competitive in the world market. As for people not speaking english here...I find the younger hispanic generation learn english pretty fast as they know it relates to money and income. The older generation have a harder time with it and I can't say I blame them. I am trying to learn spanish now at 44 and it is just not coming that easy for me. They say it is much easier to learn as a child because you don't have that mental block.", 
        "intTime": 20090314, 
        "postID": 26, 
        "quote": "", 
        "reply": "I live in southern california so lots of places here have both english and spanish signs. I do believe that english should be the main language here and we should promote that. Not to say that it would be a bad thing for us to learn spanish or other languages as well. I think that just makes us more well rounded and more competitive in the world market. As for people not speaking english here...I find the younger hispanic generation learn english pretty fast as they know it relates to money and income. The older generation have a harder time with it and I can't say I blame them. I am trying to learn spanish now at 44 and it is just not coming that easy for me. They say it is much easier to learn as a child because you don't have that mental block.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 19:26:00", 
        "title": "Walmart", 
        "userID": "usa_girl"
    }, 
    {
        "content": "What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "intTime": 20090315, 
        "postID": 27, 
        "quote": "", 
        "reply": "What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 03:37:00", 
        "title": "Walmart", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "For me, it’s the fact that it’s being forced upon me! Every where I go, i.e. wallyworld, gas stations, movies, home depot…etc. I get to try to understand the bigger than life signs in Spanish. I’m not against speaking the language of the host nation when I was stationed there, but here at home…we speak English! Why should I conform to speak another language here at home? I grew up in Hawai’i, I spoke what is called “Pigeon English”. A mix of Hawaiian, English, Samoan, Philipino, Chinese, Japanese… I have to learn another language because 12 million illegals have moved to my, OUR country…? The governor here is supporting a bill to let the kids of illegals get free education. I can’t afford to send my Son to College… I just want the people we elect to office to uphold that office and start taking care of Americans! Isn’t that what we hired them to do? Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090315, 
        "postID": 28, 
        "quote": "", 
        "reply": "For me, it’s the fact that it’s being forced upon me! Every where I go, i.e. wallyworld, gas stations, movies, home depot…etc. I get to try to understand the bigger than life signs in Spanish. I’m not against speaking the language of the host nation when I was stationed there, but here at home…we speak English! Why should I conform to speak another language here at home? I grew up in Hawai’i, I spoke what is called “Pigeon English”. A mix of Hawaiian, English, Samoan, Philipino, Chinese, Japanese… I have to learn another language because 12 million illegals have moved to my, OUR country…? The governor here is supporting a bill to let the kids of illegals get free education. I can’t afford to send my Son to College… I just want the people we elect to office to uphold that office and start taking care of Americans! Isn’t that what we hired them to do? Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 04:16:00", 
        "title": "Walmart", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong? I think it was sometime around the late 90's. A mall was built near the Miami, FL airport that targeted Hispanics. I never went (lived in the Keys) but from what I was told, the signs were in Spanish. It might be \"The Dolphin Mall\" but I am not sure. Anyone know? Don", 
        "intTime": 20090315, 
        "postID": 29, 
        "quote": "Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "reply": " I think it was sometime around the late 90's. A mall was built near the Miami, FL airport that targeted Hispanics. I never went (lived in the Keys) but from what I was told, the signs were in Spanish. It might be \"The Dolphin Mall\" but I am not sure. Anyone know? Don", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 06:15:00", 
        "title": "Walmart", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I think that if I was to build a store anywhere, I would cater to my expected customer base for that store. It's just good business. Shockey", 
        "intTime": 20090315, 
        "postID": 30, 
        "quote": "", 
        "reply": "I think that if I was to build a store anywhere, I would cater to my expected customer base for that store. It's just good business. Shockey", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 06:31:00", 
        "title": "Walmart", 
        "userID": "shockey"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 31, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": " There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:13:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What I am trying to say here is I believe that WalMart should be promoting Americanism and not encouraging people to retain their ideals, values, language and products from their old country. Is that why those people came to America just so they can keep everything from their old country? If that is what they want then they can jump back across the border. When someone comes to this country they should start to assimilate into this culture. Learn our language, live the way that we do, teach their kids how to be Americans. America is not their old country. If they want to speak the language from their old country then that is okay but don't expect me to learn their language just so I can converse with them. When I was in Europe I had to learn some of the language of the country where I traveled. They didn't learn English just to please me. I believe that WalMart is not promoting Americanism by catering to Hispanics and illegal aliens. Yes, it all about money but then again just how much money does Walmart really need?", 
        "intTime": 20090315, 
        "postID": 32, 
        "quote": "", 
        "reply": "What I am trying to say here is I believe that WalMart should be promoting Americanism and not encouraging people to retain their ideals, values, language and products from their old country. Is that why those people came to America just so they can keep everything from their old country? If that is what they want then they can jump back across the border. When someone comes to this country they should start to assimilate into this culture. Learn our language, live the way that we do, teach their kids how to be Americans. America is not their old country. If they want to speak the language from their old country then that is okay but don't expect me to learn their language just so I can converse with them. When I was in Europe I had to learn some of the language of the country where I traveled. They didn't learn English just to please me. I believe that WalMart is not promoting Americanism by catering to Hispanics and illegal aliens. Yes, it all about money but then again just how much money does Walmart really need?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:21:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: WalMart should be promoting Americanism I personally do NOT shop at Walmart. I’ve yet to find anything in there that’s made in America; that and the ones in my area go from shinny and new to rundown ‘armpits-of-a-store’ in no time flat!! (Wolfhound made that point when he witnessed someone spit on the store floor!!) I look at the labels when I shop. Walmart imports frozen vegetables from China. Just an example BUT WHY is America importing cauliflower? Convenience or not; I don’t do Walmart. . .that’s one store I have the least respect for!! choose joy each day", 
        "intTime": 20090315, 
        "postID": 33, 
        "quote": "WalMart should be promoting Americanism", 
        "reply": " I personally do NOT shop at Walmart. I’ve yet to find anything in there that’s made in America; that and the ones in my area go from shinny and new to rundown ‘armpits-of-a-store’ in no time flat!! (Wolfhound made that point when he witnessed someone spit on the store floor!!) I look at the labels when I shop. Walmart imports frozen vegetables from China. Just an example BUT WHY is America importing cauliflower? Convenience or not; I don’t do Walmart. . .that’s one store I have the least respect for!! choose joy each day", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:39:00", 
        "title": "Walmart", 
        "userID": "MissU2"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "intTime": 20090315, 
        "postID": 34, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": " Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:45:00", 
        "title": "Walmart", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 35, 
        "quote": "", 
        "reply": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 08:12:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "intTime": 20090315, 
        "postID": 36, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "reply": " Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 09:16:00", 
        "title": "Walmart", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU This is what I was talking about last week, in the caf'e Renne thread, when I got my butt chewed out by my boss. Imagine haveingspoken thai, indian and Burmees languages where you work. I t would help if there was common language, say english. Having multiple languages in a society or work place does not pull people together. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090315, 
        "postID": 37, 
        "quote": "Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU", 
        "reply": " This is what I was talking about last week, in the caf'e Renne thread, when I got my butt chewed out by my boss. Imagine haveingspoken thai, indian and Burmees languages where you work. I t would help if there was common language, say english. Having multiple languages in a society or work place does not pull people together. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 11:21:00", 
        "title": "Walmart", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time. For information I do speak a little bit of Spanish that I took in high school. But I will be darned if I am going to sit around and talk in Spanish with the illegal aliens! This is my country and here I speak English. If a person from a foreign country is visiting here in this country then I will make every attempt to converse with them in whatever language that they speak (or use sign language if necessary). But to have someone sneak across the border into this country and try to change my culture, my language or my way of living then I must protest loudly and with emphasis! Learn my language as I attempt to learn your language when I travel to your country. I will not come (sneak)into your country and fly your flag upside down, I will not march in your streets demanding the you give me welfare, a free education, free medical care and all of the rights and freedoms that your citizens have. I just ask that you do the same if you come into this country. Do it legally and we will go from there. No cider alpha we don't mind learning another language we just don't want another language forced onto us!", 
        "intTime": 20090315, 
        "postID": 38, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "reply": " For information I do speak a little bit of Spanish that I took in high school. But I will be darned if I am going to sit around and talk in Spanish with the illegal aliens! This is my country and here I speak English. If a person from a foreign country is visiting here in this country then I will make every attempt to converse with them in whatever language that they speak (or use sign language if necessary). But to have someone sneak across the border into this country and try to change my culture, my language or my way of living then I must protest loudly and with emphasis! Learn my language as I attempt to learn your language when I travel to your country. I will not come (sneak)into your country and fly your flag upside down, I will not march in your streets demanding the you give me welfare, a free education, free medical care and all of the rights and freedoms that your citizens have. I just ask that you do the same if you come into this country. Do it legally and we will go from there. No cider alpha we don't mind learning another language we just don't want another language forced onto us!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:20:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "For one thing, it might help if we quit calling the language \"English.\" The British will be the First to tell you we Americans don't speak or write \"English.\" The old joke that we are two nations separated by the \"English\" language is more true than ever. We have American Literature and American language, and we should refer to our written and spoken Language as \"American.\" If we did that, the stigma and feeling of dependence that comes with the term \"English\" might vanish - - I know whereof I speak, having degrees in English Literature and English History. We don't call our leader \"king\" or \"prime minister\", and we don't call our government \"Parliament, House of Lords, and House of Commons,\" even though we pretty much copied the functions of them all. We assigned our own names, while making near carbon copies. The same should be done with the language: American Language! Then require everyone who wishes to reside here to learn it and use it.... Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 39, 
        "quote": "", 
        "reply": "For one thing, it might help if we quit calling the language \"English.\" The British will be the First to tell you we Americans don't speak or write \"English.\" The old joke that we are two nations separated by the \"English\" language is more true than ever. We have American Literature and American language, and we should refer to our written and spoken Language as \"American.\" If we did that, the stigma and feeling of dependence that comes with the term \"English\" might vanish - - I know whereof I speak, having degrees in English Literature and English History. We don't call our leader \"king\" or \"prime minister\", and we don't call our government \"Parliament, House of Lords, and House of Commons,\" even though we pretty much copied the functions of them all. We assigned our own names, while making near carbon copies. The same should be done with the language: American Language! Then require everyone who wishes to reside here to learn it and use it.... Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:36:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. Their front line employees, those who do the real work, whom are the reason WM has the income it does, are paid minimum wage, some make a little more, depending on their position, perhaps a front line supervisor or someone who has worked there for more than a year! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090315, 
        "postID": 40, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it.", 
        "reply": " Their front line employees, those who do the real work, whom are the reason WM has the income it does, are paid minimum wage, some make a little more, depending on their position, perhaps a front line supervisor or someone who has worked there for more than a year! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:37:00", 
        "title": "Walmart", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "intTime": 20090314, 
        "postID": 41, 
        "quote": "", 
        "reply": "I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:17:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Van, your right , this is wrong,but money is the root of all evil.. Pizzes me off that they cater to people of different languages. I know a little Spanish, had to learn it for I lived in the Southwest for a while.The primary language should be English,learn all the other languages you want, should you visit another COUNTRY!!!!!", 
        "intTime": 20090314, 
        "postID": 42, 
        "quote": "", 
        "reply": "Van, your right , this is wrong,but money is the root of all evil.. Pizzes me off that they cater to people of different languages. I know a little Spanish, had to learn it for I lived in the Southwest for a while.The primary language should be English,learn all the other languages you want, should you visit another COUNTRY!!!!!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:23:00", 
        "title": "Walmart", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090314, 
        "postID": 43, 
        "quote": "", 
        "reply": "Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 16:25:00", 
        "title": "Walmart", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090314, 
        "postID": 44, 
        "quote": "Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU", 
        "reply": " It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 17:22:00", 
        "title": "Walmart", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong? Wal(China)mart could care less - - Wandering and Wondering", 
        "intTime": 20090314, 
        "postID": 45, 
        "quote": "Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "reply": " Wal(China)mart could care less - - Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 18:46:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I live in southern california so lots of places here have both english and spanish signs. I do believe that english should be the main language here and we should promote that. Not to say that it would be a bad thing for us to learn spanish or other languages as well. I think that just makes us more well rounded and more competitive in the world market. As for people not speaking english here...I find the younger hispanic generation learn english pretty fast as they know it relates to money and income. The older generation have a harder time with it and I can't say I blame them. I am trying to learn spanish now at 44 and it is just not coming that easy for me. They say it is much easier to learn as a child because you don't have that mental block.", 
        "intTime": 20090314, 
        "postID": 46, 
        "quote": "", 
        "reply": "I live in southern california so lots of places here have both english and spanish signs. I do believe that english should be the main language here and we should promote that. Not to say that it would be a bad thing for us to learn spanish or other languages as well. I think that just makes us more well rounded and more competitive in the world market. As for people not speaking english here...I find the younger hispanic generation learn english pretty fast as they know it relates to money and income. The older generation have a harder time with it and I can't say I blame them. I am trying to learn spanish now at 44 and it is just not coming that easy for me. They say it is much easier to learn as a child because you don't have that mental block.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-14 19:26:00", 
        "title": "Walmart", 
        "userID": "usa_girl"
    }, 
    {
        "content": "What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "intTime": 20090315, 
        "postID": 47, 
        "quote": "", 
        "reply": "What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 03:37:00", 
        "title": "Walmart", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "For me, it’s the fact that it’s being forced upon me! Every where I go, i.e. wallyworld, gas stations, movies, home depot…etc. I get to try to understand the bigger than life signs in Spanish. I’m not against speaking the language of the host nation when I was stationed there, but here at home…we speak English! Why should I conform to speak another language here at home? I grew up in Hawai’i, I spoke what is called “Pigeon English”. A mix of Hawaiian, English, Samoan, Philipino, Chinese, Japanese… I have to learn another language because 12 million illegals have moved to my, OUR country…? The governor here is supporting a bill to let the kids of illegals get free education. I can’t afford to send my Son to College… I just want the people we elect to office to uphold that office and start taking care of Americans! Isn’t that what we hired them to do? Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090315, 
        "postID": 48, 
        "quote": "", 
        "reply": "For me, it’s the fact that it’s being forced upon me! Every where I go, i.e. wallyworld, gas stations, movies, home depot…etc. I get to try to understand the bigger than life signs in Spanish. I’m not against speaking the language of the host nation when I was stationed there, but here at home…we speak English! Why should I conform to speak another language here at home? I grew up in Hawai’i, I spoke what is called “Pigeon English”. A mix of Hawaiian, English, Samoan, Philipino, Chinese, Japanese… I have to learn another language because 12 million illegals have moved to my, OUR country…? The governor here is supporting a bill to let the kids of illegals get free education. I can’t afford to send my Son to College… I just want the people we elect to office to uphold that office and start taking care of Americans! Isn’t that what we hired them to do? Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 04:16:00", 
        "title": "Walmart", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong? I think it was sometime around the late 90's. A mall was built near the Miami, FL airport that targeted Hispanics. I never went (lived in the Keys) but from what I was told, the signs were in Spanish. It might be \"The Dolphin Mall\" but I am not sure. Anyone know? Don", 
        "intTime": 20090315, 
        "postID": 49, 
        "quote": "Originally posted by Vanir97: I saw on the news that Walmart is now going to open a store in Texas and another in Arizona that will target mexicans and Hispanics. Signs will be in Spanish and they will have merchandise that is primarily geared toward Mexicans and hispanics. This sounds wrong to me. Instead of helping America encourage hispanics to become American by promoting the american language , offering products that are printed in english and encourage people to become part of America they instead are promoting the spanish language. I guess those twelve million illegal aliens need a place to shop also. Maybe it's okay but it just strikes me as wrong. The dollar is more powerful than the American Idealism. Am I wrong?", 
        "reply": " I think it was sometime around the late 90's. A mall was built near the Miami, FL airport that targeted Hispanics. I never went (lived in the Keys) but from what I was told, the signs were in Spanish. It might be \"The Dolphin Mall\" but I am not sure. Anyone know? Don", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 06:15:00", 
        "title": "Walmart", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I think that if I was to build a store anywhere, I would cater to my expected customer base for that store. It's just good business. Shockey", 
        "intTime": 20090315, 
        "postID": 50, 
        "quote": "", 
        "reply": "I think that if I was to build a store anywhere, I would cater to my expected customer base for that store. It's just good business. Shockey", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 06:31:00", 
        "title": "Walmart", 
        "userID": "shockey"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 51, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": " There are several things that hold a Nation or Empire together: Common Politics/Laws, Common History/Traditions, Common Culture/Trade, Common Language, Common Religion, and Common Race. The more of these Common Denominators a Nation has, the longer it will remain in one piece. China and Japan have all pretty much in hand, and that is why they look back thousands of years without much of a break... Except for the earliest years, America has become a \"melting pot\" of mostly European races, so one of the Commonalities - Race - became less important, but for a long time - up until at least the 1950s - all the other Commonalities: Politics/Laws, History/Traditions, Culture/Trade, Language, Religion - were distinctly driven by England's parentage. The British heritage - especially about Honor, Christian Work Ethic, Loyalty, Enterprise, Representative Politics/LAw, and Language - has been the glue that held this Nation together. For the first two centuries, new immigrants getting the \"Ellis Island - Statue of Liberty Experience\" and movement towards Citizenship were pushed sternly towards Assimilation and \"Americanization\", which meant learning about, and becoming part of the American Commonalities. At least through World War II, this was considered a good idea/process. The Public Schools taught many of the Commonalities across the Nation to keep the \"glue\" fresh and strong - - But now, \"assimilation\" and \"Americanization\" are dirty words, considered by academic elitists and politicians, often swayed by very vocal minority lobbyists, as being now Un-American! People coming from Mexico are not getting the \"Ellis Island - Statue of Liberty Experience\", and care nothing for the American Commonalities. Their attitude is, \"That is YOUR History/Language, not MINE and I don't want it! This land is rightfully MINE. I'm just back here to get MY share!\" In the last 10 years of teaching High School here in the West, I saw all too much of that attitude... Now, I'm not going to take sides with this, because I probably won't live long enough to see it all play out - But the more the Commonalities are eroded, the weaker the glue becomes, and eventual Bifurcation or Collapse of the Nation/Empire MUST take place. It's that simple. The only things that can hold this Nation together, because of its Traditions of Freedom in other areas are: Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. Which are you going to throw out and expect this Nation to remain one piece? Compare us to the Roman or British Empires - what held them together so long? Common Politics/LAw, Common History/Traditions, Common Culture/Trade and Common Language. They took those things to the World around them and thrived. The first thing to break down was their ability to maintain their furthest borders... The \"Barbarians\" with their vast variety of languages and traditions poured in without assimilation, and the Empires collapse into Dark Ages - Medieval Times and World Wars I and II - - History does repeat itself - - - every time... Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:13:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What I am trying to say here is I believe that WalMart should be promoting Americanism and not encouraging people to retain their ideals, values, language and products from their old country. Is that why those people came to America just so they can keep everything from their old country? If that is what they want then they can jump back across the border. When someone comes to this country they should start to assimilate into this culture. Learn our language, live the way that we do, teach their kids how to be Americans. America is not their old country. If they want to speak the language from their old country then that is okay but don't expect me to learn their language just so I can converse with them. When I was in Europe I had to learn some of the language of the country where I traveled. They didn't learn English just to please me. I believe that WalMart is not promoting Americanism by catering to Hispanics and illegal aliens. Yes, it all about money but then again just how much money does Walmart really need?", 
        "intTime": 20090315, 
        "postID": 52, 
        "quote": "", 
        "reply": "What I am trying to say here is I believe that WalMart should be promoting Americanism and not encouraging people to retain their ideals, values, language and products from their old country. Is that why those people came to America just so they can keep everything from their old country? If that is what they want then they can jump back across the border. When someone comes to this country they should start to assimilate into this culture. Learn our language, live the way that we do, teach their kids how to be Americans. America is not their old country. If they want to speak the language from their old country then that is okay but don't expect me to learn their language just so I can converse with them. When I was in Europe I had to learn some of the language of the country where I traveled. They didn't learn English just to please me. I believe that WalMart is not promoting Americanism by catering to Hispanics and illegal aliens. Yes, it all about money but then again just how much money does Walmart really need?", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:21:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: WalMart should be promoting Americanism I personally do NOT shop at Walmart. I’ve yet to find anything in there that’s made in America; that and the ones in my area go from shinny and new to rundown ‘armpits-of-a-store’ in no time flat!! (Wolfhound made that point when he witnessed someone spit on the store floor!!) I look at the labels when I shop. Walmart imports frozen vegetables from China. Just an example BUT WHY is America importing cauliflower? Convenience or not; I don’t do Walmart. . .that’s one store I have the least respect for!! choose joy each day", 
        "intTime": 20090315, 
        "postID": 53, 
        "quote": "WalMart should be promoting Americanism", 
        "reply": " I personally do NOT shop at Walmart. I’ve yet to find anything in there that’s made in America; that and the ones in my area go from shinny and new to rundown ‘armpits-of-a-store’ in no time flat!! (Wolfhound made that point when he witnessed someone spit on the store floor!!) I look at the labels when I shop. Walmart imports frozen vegetables from China. Just an example BUT WHY is America importing cauliflower? Convenience or not; I don’t do Walmart. . .that’s one store I have the least respect for!! choose joy each day", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:39:00", 
        "title": "Walmart", 
        "userID": "MissU2"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "intTime": 20090315, 
        "postID": 54, 
        "quote": "Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair.", 
        "reply": " Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 07:45:00", 
        "title": "Walmart", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 55, 
        "quote": "", 
        "reply": "The only flag Walmart is loyal to - - Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 08:12:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "intTime": 20090315, 
        "postID": 56, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don", 
        "reply": " Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 09:16:00", 
        "title": "Walmart", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU This is what I was talking about last week, in the caf'e Renne thread, when I got my butt chewed out by my boss. Imagine haveingspoken thai, indian and Burmees languages where you work. I t would help if there was common language, say english. Having multiple languages in a society or work place does not pull people together. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090315, 
        "postID": 57, 
        "quote": "Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU", 
        "reply": " This is what I was talking about last week, in the caf'e Renne thread, when I got my butt chewed out by my boss. Imagine haveingspoken thai, indian and Burmees languages where you work. I t would help if there was common language, say english. Having multiple languages in a society or work place does not pull people together. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 11:21:00", 
        "title": "Walmart", 
        "userID": "DSTremf"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time. For information I do speak a little bit of Spanish that I took in high school. But I will be darned if I am going to sit around and talk in Spanish with the illegal aliens! This is my country and here I speak English. If a person from a foreign country is visiting here in this country then I will make every attempt to converse with them in whatever language that they speak (or use sign language if necessary). But to have someone sneak across the border into this country and try to change my culture, my language or my way of living then I must protest loudly and with emphasis! Learn my language as I attempt to learn your language when I travel to your country. I will not come (sneak)into your country and fly your flag upside down, I will not march in your streets demanding the you give me welfare, a free education, free medical care and all of the rights and freedoms that your citizens have. I just ask that you do the same if you come into this country. Do it legally and we will go from there. No cider alpha we don't mind learning another language we just don't want another language forced onto us!", 
        "intTime": 20090315, 
        "postID": 58, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Cider33_Alpha: What is this stupid resistance to learning another language that so many Americans have? In Europe, Asia, Africa, even the more industrialized areas of South America, the majority of the populations speak a second language - usually English. Somehow, that doesn't equate to a personal threat or a perceived attack against their individual nationalities. Are we really so smug, so superior to the rest of the world that we can't learn another language without fear of being thought of as less than patriotic? Honestly, sometimes the ways of my fellow countrymen drive me to despair. Well if I ever plan on visiting another country, sure, I would make the effort to learn their language. Why should I have to learn their language so they can be comfortable here in the U.S.? If we cater to their needs, what would motivate them to learn to speak English so we can deal with them one on one here in the U.S.? It sounds like your idea is that we need to learn their language to make things easier for them here in the U.S., and not put the burden on them. Afterall, it was their decision to leave their country and come to the U.S., was it not? Look at all the immigrants that come here from so many different countries. What's easier...we learn all of their different languages or they learn ours? Don Not everyone who sets foot in the US, as a foreigner, is an immigrant. Just as it is a major relief to hear a Spaniard or Pole speak to me in English when I'm in Spain or Poland, think how great it would be for someone from Europe or Asia to hear his/her native language in an effort to make that person feel welcome. My point is that many Americans equate learning another language with giving aid and comfort to some unnamed and amorphous enemy - the \"not us.\" Language programs in public schools - French, German, Japanese, Chinese, Spanish, even Latin for pete's sake - are in terrible shape. Americans don't know their own language, let alone a second one. Those whose families (parents, other relatives, in-laws) speak more than one language, and so grow up or become bilingual or trilingual, are extremely fortunate. They are more employable in a global market and promote their businesses in a positive way. My point is that xenophobia gets us nowhere fast, and in fact puts us in reverse. I don't support giving illegal aliens anything but a fast return trip to wherever they came from, BUT that is not the same thing as playing to the ethnic market in your area. I don't care for WalMart or the crap it sells, but I don't know many who would argue with its business success. New York City has had \"Little Italy,\" \"Little Russia,\" Jewish sections, Caribbean sections and so on for decades, if not centuries. Somehow, despite having native-language stores, newspapers, restaurants and the like, people manage to become \"American\" in time.", 
        "reply": " For information I do speak a little bit of Spanish that I took in high school. But I will be darned if I am going to sit around and talk in Spanish with the illegal aliens! This is my country and here I speak English. If a person from a foreign country is visiting here in this country then I will make every attempt to converse with them in whatever language that they speak (or use sign language if necessary). But to have someone sneak across the border into this country and try to change my culture, my language or my way of living then I must protest loudly and with emphasis! Learn my language as I attempt to learn your language when I travel to your country. I will not come (sneak)into your country and fly your flag upside down, I will not march in your streets demanding the you give me welfare, a free education, free medical care and all of the rights and freedoms that your citizens have. I just ask that you do the same if you come into this country. Do it legally and we will go from there. No cider alpha we don't mind learning another language we just don't want another language forced onto us!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:20:00", 
        "title": "Walmart", 
        "userID": "Vanir97"
    }, 
    {
        "content": "For one thing, it might help if we quit calling the language \"English.\" The British will be the First to tell you we Americans don't speak or write \"English.\" The old joke that we are two nations separated by the \"English\" language is more true than ever. We have American Literature and American language, and we should refer to our written and spoken Language as \"American.\" If we did that, the stigma and feeling of dependence that comes with the term \"English\" might vanish - - I know whereof I speak, having degrees in English Literature and English History. We don't call our leader \"king\" or \"prime minister\", and we don't call our government \"Parliament, House of Lords, and House of Commons,\" even though we pretty much copied the functions of them all. We assigned our own names, while making near carbon copies. The same should be done with the language: American Language! Then require everyone who wishes to reside here to learn it and use it.... Wandering and Wondering", 
        "intTime": 20090315, 
        "postID": 59, 
        "quote": "", 
        "reply": "For one thing, it might help if we quit calling the language \"English.\" The British will be the First to tell you we Americans don't speak or write \"English.\" The old joke that we are two nations separated by the \"English\" language is more true than ever. We have American Literature and American language, and we should refer to our written and spoken Language as \"American.\" If we did that, the stigma and feeling of dependence that comes with the term \"English\" might vanish - - I know whereof I speak, having degrees in English Literature and English History. We don't call our leader \"king\" or \"prime minister\", and we don't call our government \"Parliament, House of Lords, and House of Commons,\" even though we pretty much copied the functions of them all. We assigned our own names, while making near carbon copies. The same should be done with the language: American Language! Then require everyone who wishes to reside here to learn it and use it.... Wandering and Wondering", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:36:00", 
        "title": "Walmart", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it. Their front line employees, those who do the real work, whom are the reason WM has the income it does, are paid minimum wage, some make a little more, depending on their position, perhaps a front line supervisor or someone who has worked there for more than a year! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090315, 
        "postID": 60, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Bergy46: Richard, you are not wrong! Once again we Americans are expected to take a step backward and bow to others. We can thank the libs, dems and freaking ACLU. It's time for those who feel the way we do to stand up and tell our fearless leaders to say \"THAT'S ENOUGH, WE ARE TAKING OUR COUNTRY BACK! Get off your butts and do your job and don't worry about being, \"politically correct\" and SCREW the ACLU It's all about the almighty buck. Wally World doesn't care where it's coming from as long as they can get their hands on it.", 
        "reply": " Their front line employees, those who do the real work, whom are the reason WM has the income it does, are paid minimum wage, some make a little more, depending on their position, perhaps a front line supervisor or someone who has worked there for more than a year! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4350078712001", 
        "time": "2009-03-15 13:37:00", 
        "title": "Walmart", 
        "userID": "Bergy46"
    }
]