[
    {
        "content": "the GF and i like and keep snakes. we have been doing so for two years. had an arrangement with the landlord, and all was good. but. a month ago HER supervisors made a walk through checking fire suppression, and ordered us to get rid of the snakes, or be evicted. we complied, but are very unhappy about having to do it we had a deal, and the manager lied about \"not knowing\" so... as we are looking for a new place, we tell people we have reptiles. but as soon as they find out they are snakes, they say \"no\" we are asked if they are \"poisonous\" t which we tell them \"no, they are not VENOMOUS. we have pythons, and boas, and a couple of collubrids. why are people sop afraid of snakes? is it deeply ingrained that snakes are evil? (genesis) or is it that they are afraid we'll feed their kids to the animals. it is irritating that fear precludes us from being renters, and that DESPITE all the education available, and the internet, people still do not WANT to know the truth? our \"eviction notice\" came at the heels of Fox news' \"python invasion of Florida\" segment that was worded in a way that opened doors to mass extermination of Burmese pythons. the VERY next day there was a \"complaint\" and without asking US what was up, we were ordered to evict our animals. now, Izzy and i do outreaches to local schools, and local events educating people about snakes. two weeks ago we did an outreach at the Pacific Science Center in Seattle, where THOUSANDS of people came through, and were allowed to handle the critters. we also rescue mistreated Snakes, and heal them up for rehoming/adoption purposes. we do good work, but we get punished over it by ignorant scared people. now.. i am done belly aching... any comments?", 
        "intTime": 20090427, 
        "postID": 1, 
        "quote": "", 
        "reply": "the GF and i like and keep snakes. we have been doing so for two years. had an arrangement with the landlord, and all was good. but. a month ago HER supervisors made a walk through checking fire suppression, and ordered us to get rid of the snakes, or be evicted. we complied, but are very unhappy about having to do it we had a deal, and the manager lied about \"not knowing\" so... as we are looking for a new place, we tell people we have reptiles. but as soon as they find out they are snakes, they say \"no\" we are asked if they are \"poisonous\" t which we tell them \"no, they are not VENOMOUS. we have pythons, and boas, and a couple of collubrids. why are people sop afraid of snakes? is it deeply ingrained that snakes are evil? (genesis) or is it that they are afraid we'll feed their kids to the animals. it is irritating that fear precludes us from being renters, and that DESPITE all the education available, and the internet, people still do not WANT to know the truth? our \"eviction notice\" came at the heels of Fox news' \"python invasion of Florida\" segment that was worded in a way that opened doors to mass extermination of Burmese pythons. the VERY next day there was a \"complaint\" and without asking US what was up, we were ordered to evict our animals. now, Izzy and i do outreaches to local schools, and local events educating people about snakes. two weeks ago we did an outreach at the Pacific Science Center in Seattle, where THOUSANDS of people came through, and were allowed to handle the critters. we also rescue mistreated Snakes, and heal them up for rehoming/adoption purposes. we do good work, but we get punished over it by ignorant scared people. now.. i am done belly aching... any comments?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 09:53:00", 
        "title": "rent and Snakes", 
        "userID": "Elesso"
    }, 
    {
        "content": "So were your critters caged?", 
        "intTime": 20090427, 
        "postID": 2, 
        "quote": "", 
        "reply": "So were your critters caged?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 09:59:00", 
        "title": "rent and Snakes", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Originally posted by Elesso: now.. i am done belly aching... any comments? I have the solution for you....... eat them, theys tasty.... lots of pepper and salt.. if you have a habatchi you can even make it a romantic dinner out of it. Oh, and white wine. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090427, 
        "postID": 3, 
        "quote": "Originally posted by Elesso: now.. i am done belly aching... any comments?", 
        "reply": " I have the solution for you....... eat them, theys tasty.... lots of pepper and salt.. if you have a habatchi you can even make it a romantic dinner out of it. Oh, and white wine. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:27:00", 
        "title": "rent and Snakes", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If you are able to rent, why not buy a home and then you won't have to worry about all of this.", 
        "intTime": 20090427, 
        "postID": 4, 
        "quote": "", 
        "reply": "If you are able to rent, why not buy a home and then you won't have to worry about all of this.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:45:00", 
        "title": "rent and Snakes", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "Elesso, you said it yourself: all the education in the world will not eliminate IRRATIONAL fears - because they are not rational and do not respond to rational thinking. I'm not fond of snakes and will go out of my way to avoid them, but have handled them just to get that particular phobia out of my head. (This was during an in-service education class I had presented to my staff in the middle of the ICU/CCU/MICU at Fort Carson - THAT was interesting to explain to my Chief Nurse, but we had had a snake-bite victim [rattler] in the unit the week before, so I was able to connect the dots convincingly enough, whew.) You're probably going to have to search long and hard to find a landlord who will rent to you - and it won't be in an apartment or condo complex, I'll bet dollars to doughnuts. Some homeowners' associations don't allow them (snakes) as pets for owners OR renters. I sympathize with your plight, but what are the chances of buying a home - especially with prices so depressed these days? Might be the only permanent solution you'll find. Good luck.", 
        "intTime": 20090427, 
        "postID": 5, 
        "quote": "", 
        "reply": "Elesso, you said it yourself: all the education in the world will not eliminate IRRATIONAL fears - because they are not rational and do not respond to rational thinking. I'm not fond of snakes and will go out of my way to avoid them, but have handled them just to get that particular phobia out of my head. (This was during an in-service education class I had presented to my staff in the middle of the ICU/CCU/MICU at Fort Carson - THAT was interesting to explain to my Chief Nurse, but we had had a snake-bite victim [rattler] in the unit the week before, so I was able to connect the dots convincingly enough, whew.) You're probably going to have to search long and hard to find a landlord who will rent to you - and it won't be in an apartment or condo complex, I'll bet dollars to doughnuts. Some homeowners' associations don't allow them (snakes) as pets for owners OR renters. I sympathize with your plight, but what are the chances of buying a home - especially with prices so depressed these days? Might be the only permanent solution you'll find. Good luck.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:48:00", 
        "title": "rent and Snakes", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too.", 
        "intTime": 20090427, 
        "postID": 6, 
        "quote": "", 
        "reply": "I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:53:00", 
        "title": "rent and Snakes", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "I don't get it. When I was doing property management, I had zero concerns about caged animals, be they snakes, birds or fish. I didn't know anyone who refused renting due solely to owning reptiles. The idea of denying animals is to keep the carpet and walls from getting torn up in the unit itself, and it is meant to keep the common areas clean from animal feces, dead birds, and etc. I have no idea where you live, but property managers there must be light years different than the ones in Phoenix. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090427, 
        "postID": 7, 
        "quote": "", 
        "reply": "I don't get it. When I was doing property management, I had zero concerns about caged animals, be they snakes, birds or fish. I didn't know anyone who refused renting due solely to owning reptiles. The idea of denying animals is to keep the carpet and walls from getting torn up in the unit itself, and it is meant to keep the common areas clean from animal feces, dead birds, and etc. I have no idea where you live, but property managers there must be light years different than the ones in Phoenix. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:57:00", 
        "title": "rent and Snakes", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too. Road runner... If he catches you your through... I have been very very fortunate in the respect that I have since a young age managed to avoid being bitten by any snakes. I have spent a considerable amount of time in the deserts and mountainous areas were Rattlers are abundant. Caught a few, killed a few, ate a few. Never been bit. My daughter has a ??Blond Boa??? and my grandsons seem to enjoy watching it feed. I would probably address the issue by running it past an attorney first. If the snakes are kept in a cage then they are as harmless as a goldfish. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090427, 
        "postID": 8, 
        "quote": "Originally posted by RetiredMarineWife: I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too.", 
        "reply": " Road runner... If he catches you your through... I have been very very fortunate in the respect that I have since a young age managed to avoid being bitten by any snakes. I have spent a considerable amount of time in the deserts and mountainous areas were Rattlers are abundant. Caught a few, killed a few, ate a few. Never been bit. My daughter has a ??Blond Boa??? and my grandsons seem to enjoy watching it feed. I would probably address the issue by running it past an attorney first. If the snakes are kept in a cage then they are as harmless as a goldfish. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 11:50:00", 
        "title": "rent and Snakes", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Can remember a instance when a woman in an apartment complex went into her bathroom and found a large python or boa in her toilet. It had evidently used the sewer system as an avenue of approach from the apartment above. Of course there have been instances where large \"pet\" snakes have crawled into cribs and killed toddlers. One instance I know of personally took place down in Florida while I was stationed there with the Air Force at Tyndall AFB. An old lady kept calling into the local police station that there was a large snake terrorizing her and her pets, and it was living under her house. Because snakes are common there (we had a small one of some kind that occasionally appeared out of a hole in the far corner of our back yard), the police weren't in any hurry to check it out. She finally called and said they needed to do something about it because it had just killed the neighbor's dog - - Well, that finally got them to show up, but they were still pretty skeptical. Because of the content of her call, the local TV station decided to tag along, so it was on the evening news. One of the officers/animal control people crawled down under the house, which was built on about 2 foot high pylons with slat skirting to keep critters out, but there was a large gap torn out. Suddenly the officer started yelling that he needed help, and 3 or 4 more crawled down in... After a moment, they came out dragging a Python that was very well 20 feet or longer and several hundred pound! It's head looked to me as big as a small football, and in the center of the critter's body was a very large bulge that was most likely the neighbor's dog - - Incidents like these might have something to do with why people are leery about you have reptiles about - - Wandering and Wondering", 
        "intTime": 20090427, 
        "postID": 9, 
        "quote": "", 
        "reply": "Can remember a instance when a woman in an apartment complex went into her bathroom and found a large python or boa in her toilet. It had evidently used the sewer system as an avenue of approach from the apartment above. Of course there have been instances where large \"pet\" snakes have crawled into cribs and killed toddlers. One instance I know of personally took place down in Florida while I was stationed there with the Air Force at Tyndall AFB. An old lady kept calling into the local police station that there was a large snake terrorizing her and her pets, and it was living under her house. Because snakes are common there (we had a small one of some kind that occasionally appeared out of a hole in the far corner of our back yard), the police weren't in any hurry to check it out. She finally called and said they needed to do something about it because it had just killed the neighbor's dog - - Well, that finally got them to show up, but they were still pretty skeptical. Because of the content of her call, the local TV station decided to tag along, so it was on the evening news. One of the officers/animal control people crawled down under the house, which was built on about 2 foot high pylons with slat skirting to keep critters out, but there was a large gap torn out. Suddenly the officer started yelling that he needed help, and 3 or 4 more crawled down in... After a moment, they came out dragging a Python that was very well 20 feet or longer and several hundred pound! It's head looked to me as big as a small football, and in the center of the critter's body was a very large bulge that was most likely the neighbor's dog - - Incidents like these might have something to do with why people are leery about you have reptiles about - - Wandering and Wondering", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 12:00:00", 
        "title": "rent and Snakes", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States.", 
        "intTime": 20090427, 
        "postID": 10, 
        "quote": "", 
        "reply": "Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 12:37:00", 
        "title": "rent and Snakes", 
        "userID": "Duster6"
    }, 
    {
        "content": "What's all this talk about rentin' snakes?!?", 
        "intTime": 20090427, 
        "postID": 11, 
        "quote": "", 
        "reply": "What's all this talk about rentin' snakes?!?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 13:15:00", 
        "title": "rent and Snakes", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States. Well, I do understand that certain snakes can be a danger, such as Water Moccasins. But, honestly, where is the harm in a renter having a snake in a cage? There is a chance of it escaping, sure. But doesn't that same variable occur with a dog that may bite a child or a cat that may scratch one? Why allow cats and dogs that can just run out the door and run away and deny a caged animal? That's what I am not getting. If Elesso was applying for an apartment from me -- given, of course, that I was still in property management -- and I asked about pets, I would be inquiring about animals that could damage the unit or deface the common areas. A caged snake is no threat to the tenants, nor can it be destructive. I would simply tell him, within our contract, that they must remain caged. \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. My Kia: It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090427, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States.", 
        "reply": " Well, I do understand that certain snakes can be a danger, such as Water Moccasins. But, honestly, where is the harm in a renter having a snake in a cage? There is a chance of it escaping, sure. But doesn't that same variable occur with a dog that may bite a child or a cat that may scratch one? Why allow cats and dogs that can just run out the door and run away and deny a caged animal? That's what I am not getting. If Elesso was applying for an apartment from me -- given, of course, that I was still in property management -- and I asked about pets, I would be inquiring about animals that could damage the unit or deface the common areas. A caged snake is no threat to the tenants, nor can it be destructive. I would simply tell him, within our contract, that they must remain caged. \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. My Kia: It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 13:19:00", 
        "title": "rent and Snakes", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: What's all this talk about rentin' snakes?!? $10.00 a piece!! You need some? Real chick-pleasers!! Early bird gets the worm!! Wandering and Wondering", 
        "intTime": 20090427, 
        "postID": 13, 
        "quote": "Originally posted by 67NOV: What's all this talk about rentin' snakes?!?", 
        "reply": " $10.00 a piece!! You need some? Real chick-pleasers!! Early bird gets the worm!! Wandering and Wondering", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 13:34:00", 
        "title": "rent and Snakes", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090428, 
        "postID": 14, 
        "quote": "\"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten.", 
        "reply": " I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 06:25:00", 
        "title": "rent and Snakes", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them. Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090428, 
        "postID": 15, 
        "quote": "Originally posted by Vicdude: quote: \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them.", 
        "reply": " Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 06:56:00", 
        "title": "rent and Snakes", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I lived in Floida for many winters we had an RV. The didge's in FL are full of snakes,when a tornado comes if they come advice is \"to get into a didge I DON'T LIKE SNAKES OF ANY KIND we my family lived in Norco CA when I was about 7 and I saw snakes all over the place rattlesnaks and many other snakes, I HATE SNAKES a friend of mine had a cage full the friend covered the cage when I went into her house.", 
        "intTime": 20090428, 
        "postID": 16, 
        "quote": "", 
        "reply": "I lived in Floida for many winters we had an RV. The didge's in FL are full of snakes,when a tornado comes if they come advice is \"to get into a didge I DON'T LIKE SNAKES OF ANY KIND we my family lived in Norco CA when I was about 7 and I saw snakes all over the place rattlesnaks and many other snakes, I HATE SNAKES a friend of mine had a cage full the friend covered the cage when I went into her house.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:15:00", 
        "title": "rent and Snakes", 
        "userID": "stormer73"
    }, 
    {
        "content": "Snakes have their place...as long as it's not in my yard. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090428, 
        "postID": 17, 
        "quote": "", 
        "reply": "Snakes have their place...as long as it's not in my yard. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:30:00", 
        "title": "rent and Snakes", 
        "userID": "Bergy46"
    }, 
    {
        "content": "we'd buy a house if we could get the finnancing. I have no credit score as i have paid off all my debt and owe zilch to anyone (after shooting my credit down with a howitzer) My Gf only qualifies for 110 grand (which is about 200 grand less than any houses in the greater Seattle area. trhe snakes are all caged. lerssee... we have 5 Australian Carpet Pythons , one red tail Boa, 5 ball pythons, 2 gopher snakes and 2 irianjiah pythons. as far as rescues, we have one red tail boa with cigarette burns and half its weight, covered in mites, and we have 2 ball pythons that are 3 years old each and only weih 100 grams each, they should weigh more than 2 kilos each. we put out an ad in craig's list and have recieved several replies This message has been edited. Last edited by: Elesso, Wed 29 April 2009 06:44 AM", 
        "intTime": 20090428, 
        "postID": 18, 
        "quote": "", 
        "reply": "we'd buy a house if we could get the finnancing. I have no credit score as i have paid off all my debt and owe zilch to anyone (after shooting my credit down with a howitzer) My Gf only qualifies for 110 grand (which is about 200 grand less than any houses in the greater Seattle area. trhe snakes are all caged. lerssee... we have 5 Australian Carpet Pythons , one red tail Boa, 5 ball pythons, 2 gopher snakes and 2 irianjiah pythons. as far as rescues, we have one red tail boa with cigarette burns and half its weight, covered in mites, and we have 2 ball pythons that are 3 years old each and only weih 100 grams each, they should weigh more than 2 kilos each. we put out an ad in craig's list and have recieved several replies This message has been edited. Last edited by: Elesso, Wed 29 April 2009 06:44 AM", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:32:00", 
        "title": "rent and Snakes", 
        "userID": "Elesso"
    }, 
    {
        "content": "Both of my parents were/are quick to kill snakes. I'm not. They were raised in times and under conditions where the territory of the Wild and the territory of the Civilized was still in dispute. Stories of snakes - both dangerous and maybe not - coming into rude 1920s homes through cracks in walls or up through knot holes in the flooring, causing shock, fright, and terror are pretty common in their lore. Finding themselves in close proximity with \"joe no-shoulders\" while working in a field, walking a path to the out-house, or some other circumstance, created a certain sense of instant panic and immediate reaction that meant only one thing - survival. They had cats to get rid of vermin, so the snake any snake, had to go, for the sake of the safety of the family. Here are three typical stories to illustrate their fears and reasons: Dad was a cowboy in the 1920s. Automobiles were not even in use in southern Utah yet. He was riding along in a gully looking for stray cattle. The bank of the gully was about 3 or 4 feet high. He felt something brushing back and forth on his boot, looked down, and a large rattler was hanging by its fangs from his pant-leg, it venom trickling down the side of his boot. He reached down quickly and threw it off, then emptied his .44 pistol into it. He also had a Bulldog called \"Mugsie\" which often tangled with rattlers. It would circle the snake until the reptile would try to crawl away, then it would dive in an shake the serpent to pieces. They kept the dog around the younger children to protect them from snakes, and it was bit several times, often getting very sick. Eventually, it died from a bite. They often turned pigs loose, because pigs would eat snakes. Then the ranchers would hunt and eat the pigs - so it went. Snakes are somewhat scare there now... Mom tells a story of going outside to check on my older sisters at play and found the oldest sister, about 4 at the time, sitting on the ground watching a rattler that was coiled not too far away. The ever-present irrigation shovel went into full gear! I have had several very close calls with rattlers. One came up behind me out of a beaver lodge I was standing on while fishing, and started buzzing - thank goodness. I had to jump in the water to get away from it. Friends with me killed it... I have killed numerous rattlers, but I have saved a few too. The reason? One I killed on the desert had three mice inside when I skinned it... A time later, I saw a very large one slowly crossing a well-traveled dirt road out in the desert, so I decided to stop, get out my walking stick, pick it up, and get it to the bushes on the side. It buzzed angrily at me through the whole process, but never struck. Just as I finished, a huge truck came through which would certainly have run over it - - As I get much older, I am less comfortable with taking the life of almost anything, because anything trying to survive these days probably has the right to go on trying - - Here is a poem I wrote a long, long time ago - - 13 March 82 - - - -The End of March - - - - I walked along and looked down, And he looked back at me; He used his comical yellow eye, And he rustled the grass As he went down the bank. Then he stopped at the water’s edge; His head turned ‘round, And he said to me - - “You were young once. Your eyes were bright one time.” I heard his small whispering voice Coming up to me from that Flickering tongue, those tight lips; And I went down to talk to him. But he only laughed And smiled a shiny, plated smile. I picked him up in my hand, But he had said his say. His yellow eye mocked me; Like a mean little boy, He stuck his tongue out at me - - I smiled and dropped him Into the creek as I would have Any mischievous friend, And he swam quickly away. But he had the last laugh; He stopped on the far bank And turned back with a prideful look; Then he said to me - - “You are old now! You should do the things Old ones do.” I tried to answer, But he did not wait for me - - I climbed back up to the road And walked slow back to town. Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 19, 
        "quote": "", 
        "reply": "Both of my parents were/are quick to kill snakes. I'm not. They were raised in times and under conditions where the territory of the Wild and the territory of the Civilized was still in dispute. Stories of snakes - both dangerous and maybe not - coming into rude 1920s homes through cracks in walls or up through knot holes in the flooring, causing shock, fright, and terror are pretty common in their lore. Finding themselves in close proximity with \"joe no-shoulders\" while working in a field, walking a path to the out-house, or some other circumstance, created a certain sense of instant panic and immediate reaction that meant only one thing - survival. They had cats to get rid of vermin, so the snake any snake, had to go, for the sake of the safety of the family. Here are three typical stories to illustrate their fears and reasons: Dad was a cowboy in the 1920s. Automobiles were not even in use in southern Utah yet. He was riding along in a gully looking for stray cattle. The bank of the gully was about 3 or 4 feet high. He felt something brushing back and forth on his boot, looked down, and a large rattler was hanging by its fangs from his pant-leg, it venom trickling down the side of his boot. He reached down quickly and threw it off, then emptied his .44 pistol into it. He also had a Bulldog called \"Mugsie\" which often tangled with rattlers. It would circle the snake until the reptile would try to crawl away, then it would dive in an shake the serpent to pieces. They kept the dog around the younger children to protect them from snakes, and it was bit several times, often getting very sick. Eventually, it died from a bite. They often turned pigs loose, because pigs would eat snakes. Then the ranchers would hunt and eat the pigs - so it went. Snakes are somewhat scare there now... Mom tells a story of going outside to check on my older sisters at play and found the oldest sister, about 4 at the time, sitting on the ground watching a rattler that was coiled not too far away. The ever-present irrigation shovel went into full gear! I have had several very close calls with rattlers. One came up behind me out of a beaver lodge I was standing on while fishing, and started buzzing - thank goodness. I had to jump in the water to get away from it. Friends with me killed it... I have killed numerous rattlers, but I have saved a few too. The reason? One I killed on the desert had three mice inside when I skinned it... A time later, I saw a very large one slowly crossing a well-traveled dirt road out in the desert, so I decided to stop, get out my walking stick, pick it up, and get it to the bushes on the side. It buzzed angrily at me through the whole process, but never struck. Just as I finished, a huge truck came through which would certainly have run over it - - As I get much older, I am less comfortable with taking the life of almost anything, because anything trying to survive these days probably has the right to go on trying - - Here is a poem I wrote a long, long time ago - - 13 March 82 - - - -The End of March - - - - I walked along and looked down, And he looked back at me; He used his comical yellow eye, And he rustled the grass As he went down the bank. Then he stopped at the water’s edge; His head turned ‘round, And he said to me - - “You were young once. Your eyes were bright one time.” I heard his small whispering voice Coming up to me from that Flickering tongue, those tight lips; And I went down to talk to him. But he only laughed And smiled a shiny, plated smile. I picked him up in my hand, But he had said his say. His yellow eye mocked me; Like a mean little boy, He stuck his tongue out at me - - I smiled and dropped him Into the creek as I would have Any mischievous friend, And he swam quickly away. But he had the last laugh; He stopped on the far bank And turned back with a prideful look; Then he said to me - - “You are old now! You should do the things Old ones do.” I tried to answer, But he did not wait for me - - I climbed back up to the road And walked slow back to town. Wandering and Wondering", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:35:00", 
        "title": "rent and Snakes", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed. the converse is true too... Ignorant Curiosity can be a dangerous thing too.. as a child i was taught that if you and a snake cross paths, the snake has the right of way. if i see one, i call out \"SNAKE\" and stop, or turn around. they want to bite us as much as we want to bite them. **Fast forward to FTX Basic training, in McGregor Range N.M. (fort Bliss, TX)*** i was the guide On Bearer walking point in the desert when i come upon a rattler. Naturally, i stopped, and followed with \"snake\" now you'd SAY that the rest of the platoon would stop and get away... WRONG.. they crouded around this creature to get a closer look... i am amazed this creature did not freak out and tag one of them... the old addage that says \"god loves children and fools\" held true that day...", 
        "intTime": 20090429, 
        "postID": 20, 
        "quote": "Originally posted by FollowMeInfantry: Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed.", 
        "reply": " the converse is true too... Ignorant Curiosity can be a dangerous thing too.. as a child i was taught that if you and a snake cross paths, the snake has the right of way. if i see one, i call out \"SNAKE\" and stop, or turn around. they want to bite us as much as we want to bite them. **Fast forward to FTX Basic training, in McGregor Range N.M. (fort Bliss, TX)*** i was the guide On Bearer walking point in the desert when i come upon a rattler. Naturally, i stopped, and followed with \"snake\" now you'd SAY that the rest of the platoon would stop and get away... WRONG.. they crouded around this creature to get a closer look... i am amazed this creature did not freak out and tag one of them... the old addage that says \"god loves children and fools\" held true that day...", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-29 06:53:00", 
        "title": "rent and Snakes", 
        "userID": "Elesso"
    }, 
    {
        "content": "the GF and i like and keep snakes. we have been doing so for two years. had an arrangement with the landlord, and all was good. but. a month ago HER supervisors made a walk through checking fire suppression, and ordered us to get rid of the snakes, or be evicted. we complied, but are very unhappy about having to do it we had a deal, and the manager lied about \"not knowing\" so... as we are looking for a new place, we tell people we have reptiles. but as soon as they find out they are snakes, they say \"no\" we are asked if they are \"poisonous\" t which we tell them \"no, they are not VENOMOUS. we have pythons, and boas, and a couple of collubrids. why are people sop afraid of snakes? is it deeply ingrained that snakes are evil? (genesis) or is it that they are afraid we'll feed their kids to the animals. it is irritating that fear precludes us from being renters, and that DESPITE all the education available, and the internet, people still do not WANT to know the truth? our \"eviction notice\" came at the heels of Fox news' \"python invasion of Florida\" segment that was worded in a way that opened doors to mass extermination of Burmese pythons. the VERY next day there was a \"complaint\" and without asking US what was up, we were ordered to evict our animals. now, Izzy and i do outreaches to local schools, and local events educating people about snakes. two weeks ago we did an outreach at the Pacific Science Center in Seattle, where THOUSANDS of people came through, and were allowed to handle the critters. we also rescue mistreated Snakes, and heal them up for rehoming/adoption purposes. we do good work, but we get punished over it by ignorant scared people. now.. i am done belly aching... any comments?", 
        "intTime": 20090427, 
        "postID": 21, 
        "quote": "", 
        "reply": "the GF and i like and keep snakes. we have been doing so for two years. had an arrangement with the landlord, and all was good. but. a month ago HER supervisors made a walk through checking fire suppression, and ordered us to get rid of the snakes, or be evicted. we complied, but are very unhappy about having to do it we had a deal, and the manager lied about \"not knowing\" so... as we are looking for a new place, we tell people we have reptiles. but as soon as they find out they are snakes, they say \"no\" we are asked if they are \"poisonous\" t which we tell them \"no, they are not VENOMOUS. we have pythons, and boas, and a couple of collubrids. why are people sop afraid of snakes? is it deeply ingrained that snakes are evil? (genesis) or is it that they are afraid we'll feed their kids to the animals. it is irritating that fear precludes us from being renters, and that DESPITE all the education available, and the internet, people still do not WANT to know the truth? our \"eviction notice\" came at the heels of Fox news' \"python invasion of Florida\" segment that was worded in a way that opened doors to mass extermination of Burmese pythons. the VERY next day there was a \"complaint\" and without asking US what was up, we were ordered to evict our animals. now, Izzy and i do outreaches to local schools, and local events educating people about snakes. two weeks ago we did an outreach at the Pacific Science Center in Seattle, where THOUSANDS of people came through, and were allowed to handle the critters. we also rescue mistreated Snakes, and heal them up for rehoming/adoption purposes. we do good work, but we get punished over it by ignorant scared people. now.. i am done belly aching... any comments?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 09:53:00", 
        "title": "rent and Snakes", 
        "userID": "Elesso"
    }, 
    {
        "content": "So were your critters caged?", 
        "intTime": 20090427, 
        "postID": 22, 
        "quote": "", 
        "reply": "So were your critters caged?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 09:59:00", 
        "title": "rent and Snakes", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Originally posted by Elesso: now.. i am done belly aching... any comments? I have the solution for you....... eat them, theys tasty.... lots of pepper and salt.. if you have a habatchi you can even make it a romantic dinner out of it. Oh, and white wine. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090427, 
        "postID": 23, 
        "quote": "Originally posted by Elesso: now.. i am done belly aching... any comments?", 
        "reply": " I have the solution for you....... eat them, theys tasty.... lots of pepper and salt.. if you have a habatchi you can even make it a romantic dinner out of it. Oh, and white wine. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:27:00", 
        "title": "rent and Snakes", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If you are able to rent, why not buy a home and then you won't have to worry about all of this.", 
        "intTime": 20090427, 
        "postID": 24, 
        "quote": "", 
        "reply": "If you are able to rent, why not buy a home and then you won't have to worry about all of this.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:45:00", 
        "title": "rent and Snakes", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "Elesso, you said it yourself: all the education in the world will not eliminate IRRATIONAL fears - because they are not rational and do not respond to rational thinking. I'm not fond of snakes and will go out of my way to avoid them, but have handled them just to get that particular phobia out of my head. (This was during an in-service education class I had presented to my staff in the middle of the ICU/CCU/MICU at Fort Carson - THAT was interesting to explain to my Chief Nurse, but we had had a snake-bite victim [rattler] in the unit the week before, so I was able to connect the dots convincingly enough, whew.) You're probably going to have to search long and hard to find a landlord who will rent to you - and it won't be in an apartment or condo complex, I'll bet dollars to doughnuts. Some homeowners' associations don't allow them (snakes) as pets for owners OR renters. I sympathize with your plight, but what are the chances of buying a home - especially with prices so depressed these days? Might be the only permanent solution you'll find. Good luck.", 
        "intTime": 20090427, 
        "postID": 25, 
        "quote": "", 
        "reply": "Elesso, you said it yourself: all the education in the world will not eliminate IRRATIONAL fears - because they are not rational and do not respond to rational thinking. I'm not fond of snakes and will go out of my way to avoid them, but have handled them just to get that particular phobia out of my head. (This was during an in-service education class I had presented to my staff in the middle of the ICU/CCU/MICU at Fort Carson - THAT was interesting to explain to my Chief Nurse, but we had had a snake-bite victim [rattler] in the unit the week before, so I was able to connect the dots convincingly enough, whew.) You're probably going to have to search long and hard to find a landlord who will rent to you - and it won't be in an apartment or condo complex, I'll bet dollars to doughnuts. Some homeowners' associations don't allow them (snakes) as pets for owners OR renters. I sympathize with your plight, but what are the chances of buying a home - especially with prices so depressed these days? Might be the only permanent solution you'll find. Good luck.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:48:00", 
        "title": "rent and Snakes", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too.", 
        "intTime": 20090427, 
        "postID": 26, 
        "quote": "", 
        "reply": "I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:53:00", 
        "title": "rent and Snakes", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "I don't get it. When I was doing property management, I had zero concerns about caged animals, be they snakes, birds or fish. I didn't know anyone who refused renting due solely to owning reptiles. The idea of denying animals is to keep the carpet and walls from getting torn up in the unit itself, and it is meant to keep the common areas clean from animal feces, dead birds, and etc. I have no idea where you live, but property managers there must be light years different than the ones in Phoenix. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090427, 
        "postID": 27, 
        "quote": "", 
        "reply": "I don't get it. When I was doing property management, I had zero concerns about caged animals, be they snakes, birds or fish. I didn't know anyone who refused renting due solely to owning reptiles. The idea of denying animals is to keep the carpet and walls from getting torn up in the unit itself, and it is meant to keep the common areas clean from animal feces, dead birds, and etc. I have no idea where you live, but property managers there must be light years different than the ones in Phoenix. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 10:57:00", 
        "title": "rent and Snakes", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too. Road runner... If he catches you your through... I have been very very fortunate in the respect that I have since a young age managed to avoid being bitten by any snakes. I have spent a considerable amount of time in the deserts and mountainous areas were Rattlers are abundant. Caught a few, killed a few, ate a few. Never been bit. My daughter has a ??Blond Boa??? and my grandsons seem to enjoy watching it feed. I would probably address the issue by running it past an attorney first. If the snakes are kept in a cage then they are as harmless as a goldfish. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090427, 
        "postID": 28, 
        "quote": "Originally posted by RetiredMarineWife: I got bit by a young copperhead about 13 years ago. Went to the ER, my ex took the snake with him, after he killed it. The shots in the ER were more painful than the snake bite. I got my wedding band off just in time too, lol. I am not afraid of snakes anymore, I got tuff... Infact, found a little one in the house one night. Picked it up and put it outside, grass snake, lol. We have a road runner out here all the time too.", 
        "reply": " Road runner... If he catches you your through... I have been very very fortunate in the respect that I have since a young age managed to avoid being bitten by any snakes. I have spent a considerable amount of time in the deserts and mountainous areas were Rattlers are abundant. Caught a few, killed a few, ate a few. Never been bit. My daughter has a ??Blond Boa??? and my grandsons seem to enjoy watching it feed. I would probably address the issue by running it past an attorney first. If the snakes are kept in a cage then they are as harmless as a goldfish. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 11:50:00", 
        "title": "rent and Snakes", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Can remember a instance when a woman in an apartment complex went into her bathroom and found a large python or boa in her toilet. It had evidently used the sewer system as an avenue of approach from the apartment above. Of course there have been instances where large \"pet\" snakes have crawled into cribs and killed toddlers. One instance I know of personally took place down in Florida while I was stationed there with the Air Force at Tyndall AFB. An old lady kept calling into the local police station that there was a large snake terrorizing her and her pets, and it was living under her house. Because snakes are common there (we had a small one of some kind that occasionally appeared out of a hole in the far corner of our back yard), the police weren't in any hurry to check it out. She finally called and said they needed to do something about it because it had just killed the neighbor's dog - - Well, that finally got them to show up, but they were still pretty skeptical. Because of the content of her call, the local TV station decided to tag along, so it was on the evening news. One of the officers/animal control people crawled down under the house, which was built on about 2 foot high pylons with slat skirting to keep critters out, but there was a large gap torn out. Suddenly the officer started yelling that he needed help, and 3 or 4 more crawled down in... After a moment, they came out dragging a Python that was very well 20 feet or longer and several hundred pound! It's head looked to me as big as a small football, and in the center of the critter's body was a very large bulge that was most likely the neighbor's dog - - Incidents like these might have something to do with why people are leery about you have reptiles about - - Wandering and Wondering", 
        "intTime": 20090427, 
        "postID": 29, 
        "quote": "", 
        "reply": "Can remember a instance when a woman in an apartment complex went into her bathroom and found a large python or boa in her toilet. It had evidently used the sewer system as an avenue of approach from the apartment above. Of course there have been instances where large \"pet\" snakes have crawled into cribs and killed toddlers. One instance I know of personally took place down in Florida while I was stationed there with the Air Force at Tyndall AFB. An old lady kept calling into the local police station that there was a large snake terrorizing her and her pets, and it was living under her house. Because snakes are common there (we had a small one of some kind that occasionally appeared out of a hole in the far corner of our back yard), the police weren't in any hurry to check it out. She finally called and said they needed to do something about it because it had just killed the neighbor's dog - - Well, that finally got them to show up, but they were still pretty skeptical. Because of the content of her call, the local TV station decided to tag along, so it was on the evening news. One of the officers/animal control people crawled down under the house, which was built on about 2 foot high pylons with slat skirting to keep critters out, but there was a large gap torn out. Suddenly the officer started yelling that he needed help, and 3 or 4 more crawled down in... After a moment, they came out dragging a Python that was very well 20 feet or longer and several hundred pound! It's head looked to me as big as a small football, and in the center of the critter's body was a very large bulge that was most likely the neighbor's dog - - Incidents like these might have something to do with why people are leery about you have reptiles about - - Wandering and Wondering", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 12:00:00", 
        "title": "rent and Snakes", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States.", 
        "intTime": 20090427, 
        "postID": 30, 
        "quote": "", 
        "reply": "Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 12:37:00", 
        "title": "rent and Snakes", 
        "userID": "Duster6"
    }, 
    {
        "content": "What's all this talk about rentin' snakes?!?", 
        "intTime": 20090427, 
        "postID": 31, 
        "quote": "", 
        "reply": "What's all this talk about rentin' snakes?!?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 13:15:00", 
        "title": "rent and Snakes", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States. Well, I do understand that certain snakes can be a danger, such as Water Moccasins. But, honestly, where is the harm in a renter having a snake in a cage? There is a chance of it escaping, sure. But doesn't that same variable occur with a dog that may bite a child or a cat that may scratch one? Why allow cats and dogs that can just run out the door and run away and deny a caged animal? That's what I am not getting. If Elesso was applying for an apartment from me -- given, of course, that I was still in property management -- and I asked about pets, I would be inquiring about animals that could damage the unit or deface the common areas. A caged snake is no threat to the tenants, nor can it be destructive. I would simply tell him, within our contract, that they must remain caged. \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. My Kia: It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090427, 
        "postID": 32, 
        "quote": "Originally posted by Duster6: Every year I find one or two snakes somewhere in my yard or garage. Mostly little pigmy rattlesnakes. We also have very big snakes out in our woods but I never go out there in the summer time. If you live in a neighborhood with kids, my advice to everyone is to kill the snake first then ask if it was poisonous second. I have a friend who has 1800 acres of land here on the East coast on NC and the record so far on his property is 93 water moccasins killed in one day. I believe that the only good snake is a dead one. Except if one lives in India, Africa, Asia or anywhere else outside of the United States.", 
        "reply": " Well, I do understand that certain snakes can be a danger, such as Water Moccasins. But, honestly, where is the harm in a renter having a snake in a cage? There is a chance of it escaping, sure. But doesn't that same variable occur with a dog that may bite a child or a cat that may scratch one? Why allow cats and dogs that can just run out the door and run away and deny a caged animal? That's what I am not getting. If Elesso was applying for an apartment from me -- given, of course, that I was still in property management -- and I asked about pets, I would be inquiring about animals that could damage the unit or deface the common areas. A caged snake is no threat to the tenants, nor can it be destructive. I would simply tell him, within our contract, that they must remain caged. \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. My Kia: It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 13:19:00", 
        "title": "rent and Snakes", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: What's all this talk about rentin' snakes?!? $10.00 a piece!! You need some? Real chick-pleasers!! Early bird gets the worm!! Wandering and Wondering", 
        "intTime": 20090427, 
        "postID": 33, 
        "quote": "Originally posted by 67NOV: What's all this talk about rentin' snakes?!?", 
        "reply": " $10.00 a piece!! You need some? Real chick-pleasers!! Early bird gets the worm!! Wandering and Wondering", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-27 13:34:00", 
        "title": "rent and Snakes", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090428, 
        "postID": 34, 
        "quote": "\"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten.", 
        "reply": " I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 06:25:00", 
        "title": "rent and Snakes", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them. Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090428, 
        "postID": 35, 
        "quote": "Originally posted by Vicdude: quote: \"Any good snake is a dead snake\" is a misnomer. Snakes, like everything on this planet, are symbiotic to everything that survives and thrives here. And they do make good pets - I had a Kia Corn (Albino) that loved being on my neck and watched hockey with me. It got along with my dogs and basically ate mice, slept, and entertained the kids my children would bring home. Sure, she bit me a few times; but they were always my fault, such as handling her when she was hungry or had just eaten. I'm always amazed at people that feel they have to kill any snake they come across. Actually not only snakes but all sorts of critters. When I lived in upstate NY I had several skunks and a fox that I fed at my back door. I had to keep it secret because if my neighbors found out there were skunks and a fox around they would have hunted them down and killed them.", 
        "reply": " Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 06:56:00", 
        "title": "rent and Snakes", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I lived in Floida for many winters we had an RV. The didge's in FL are full of snakes,when a tornado comes if they come advice is \"to get into a didge I DON'T LIKE SNAKES OF ANY KIND we my family lived in Norco CA when I was about 7 and I saw snakes all over the place rattlesnaks and many other snakes, I HATE SNAKES a friend of mine had a cage full the friend covered the cage when I went into her house.", 
        "intTime": 20090428, 
        "postID": 36, 
        "quote": "", 
        "reply": "I lived in Floida for many winters we had an RV. The didge's in FL are full of snakes,when a tornado comes if they come advice is \"to get into a didge I DON'T LIKE SNAKES OF ANY KIND we my family lived in Norco CA when I was about 7 and I saw snakes all over the place rattlesnaks and many other snakes, I HATE SNAKES a friend of mine had a cage full the friend covered the cage when I went into her house.", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:15:00", 
        "title": "rent and Snakes", 
        "userID": "stormer73"
    }, 
    {
        "content": "Snakes have their place...as long as it's not in my yard. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090428, 
        "postID": 37, 
        "quote": "", 
        "reply": "Snakes have their place...as long as it's not in my yard. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:30:00", 
        "title": "rent and Snakes", 
        "userID": "Bergy46"
    }, 
    {
        "content": "we'd buy a house if we could get the finnancing. I have no credit score as i have paid off all my debt and owe zilch to anyone (after shooting my credit down with a howitzer) My Gf only qualifies for 110 grand (which is about 200 grand less than any houses in the greater Seattle area. trhe snakes are all caged. lerssee... we have 5 Australian Carpet Pythons , one red tail Boa, 5 ball pythons, 2 gopher snakes and 2 irianjiah pythons. as far as rescues, we have one red tail boa with cigarette burns and half its weight, covered in mites, and we have 2 ball pythons that are 3 years old each and only weih 100 grams each, they should weigh more than 2 kilos each. we put out an ad in craig's list and have recieved several replies This message has been edited. Last edited by: Elesso, Wed 29 April 2009 06:44 AM", 
        "intTime": 20090428, 
        "postID": 38, 
        "quote": "", 
        "reply": "we'd buy a house if we could get the finnancing. I have no credit score as i have paid off all my debt and owe zilch to anyone (after shooting my credit down with a howitzer) My Gf only qualifies for 110 grand (which is about 200 grand less than any houses in the greater Seattle area. trhe snakes are all caged. lerssee... we have 5 Australian Carpet Pythons , one red tail Boa, 5 ball pythons, 2 gopher snakes and 2 irianjiah pythons. as far as rescues, we have one red tail boa with cigarette burns and half its weight, covered in mites, and we have 2 ball pythons that are 3 years old each and only weih 100 grams each, they should weigh more than 2 kilos each. we put out an ad in craig's list and have recieved several replies This message has been edited. Last edited by: Elesso, Wed 29 April 2009 06:44 AM", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:32:00", 
        "title": "rent and Snakes", 
        "userID": "Elesso"
    }, 
    {
        "content": "Both of my parents were/are quick to kill snakes. I'm not. They were raised in times and under conditions where the territory of the Wild and the territory of the Civilized was still in dispute. Stories of snakes - both dangerous and maybe not - coming into rude 1920s homes through cracks in walls or up through knot holes in the flooring, causing shock, fright, and terror are pretty common in their lore. Finding themselves in close proximity with \"joe no-shoulders\" while working in a field, walking a path to the out-house, or some other circumstance, created a certain sense of instant panic and immediate reaction that meant only one thing - survival. They had cats to get rid of vermin, so the snake any snake, had to go, for the sake of the safety of the family. Here are three typical stories to illustrate their fears and reasons: Dad was a cowboy in the 1920s. Automobiles were not even in use in southern Utah yet. He was riding along in a gully looking for stray cattle. The bank of the gully was about 3 or 4 feet high. He felt something brushing back and forth on his boot, looked down, and a large rattler was hanging by its fangs from his pant-leg, it venom trickling down the side of his boot. He reached down quickly and threw it off, then emptied his .44 pistol into it. He also had a Bulldog called \"Mugsie\" which often tangled with rattlers. It would circle the snake until the reptile would try to crawl away, then it would dive in an shake the serpent to pieces. They kept the dog around the younger children to protect them from snakes, and it was bit several times, often getting very sick. Eventually, it died from a bite. They often turned pigs loose, because pigs would eat snakes. Then the ranchers would hunt and eat the pigs - so it went. Snakes are somewhat scare there now... Mom tells a story of going outside to check on my older sisters at play and found the oldest sister, about 4 at the time, sitting on the ground watching a rattler that was coiled not too far away. The ever-present irrigation shovel went into full gear! I have had several very close calls with rattlers. One came up behind me out of a beaver lodge I was standing on while fishing, and started buzzing - thank goodness. I had to jump in the water to get away from it. Friends with me killed it... I have killed numerous rattlers, but I have saved a few too. The reason? One I killed on the desert had three mice inside when I skinned it... A time later, I saw a very large one slowly crossing a well-traveled dirt road out in the desert, so I decided to stop, get out my walking stick, pick it up, and get it to the bushes on the side. It buzzed angrily at me through the whole process, but never struck. Just as I finished, a huge truck came through which would certainly have run over it - - As I get much older, I am less comfortable with taking the life of almost anything, because anything trying to survive these days probably has the right to go on trying - - Here is a poem I wrote a long, long time ago - - 13 March 82 - - - -The End of March - - - - I walked along and looked down, And he looked back at me; He used his comical yellow eye, And he rustled the grass As he went down the bank. Then he stopped at the water’s edge; His head turned ‘round, And he said to me - - “You were young once. Your eyes were bright one time.” I heard his small whispering voice Coming up to me from that Flickering tongue, those tight lips; And I went down to talk to him. But he only laughed And smiled a shiny, plated smile. I picked him up in my hand, But he had said his say. His yellow eye mocked me; Like a mean little boy, He stuck his tongue out at me - - I smiled and dropped him Into the creek as I would have Any mischievous friend, And he swam quickly away. But he had the last laugh; He stopped on the far bank And turned back with a prideful look; Then he said to me - - “You are old now! You should do the things Old ones do.” I tried to answer, But he did not wait for me - - I climbed back up to the road And walked slow back to town. Wandering and Wondering", 
        "intTime": 20090428, 
        "postID": 39, 
        "quote": "", 
        "reply": "Both of my parents were/are quick to kill snakes. I'm not. They were raised in times and under conditions where the territory of the Wild and the territory of the Civilized was still in dispute. Stories of snakes - both dangerous and maybe not - coming into rude 1920s homes through cracks in walls or up through knot holes in the flooring, causing shock, fright, and terror are pretty common in their lore. Finding themselves in close proximity with \"joe no-shoulders\" while working in a field, walking a path to the out-house, or some other circumstance, created a certain sense of instant panic and immediate reaction that meant only one thing - survival. They had cats to get rid of vermin, so the snake any snake, had to go, for the sake of the safety of the family. Here are three typical stories to illustrate their fears and reasons: Dad was a cowboy in the 1920s. Automobiles were not even in use in southern Utah yet. He was riding along in a gully looking for stray cattle. The bank of the gully was about 3 or 4 feet high. He felt something brushing back and forth on his boot, looked down, and a large rattler was hanging by its fangs from his pant-leg, it venom trickling down the side of his boot. He reached down quickly and threw it off, then emptied his .44 pistol into it. He also had a Bulldog called \"Mugsie\" which often tangled with rattlers. It would circle the snake until the reptile would try to crawl away, then it would dive in an shake the serpent to pieces. They kept the dog around the younger children to protect them from snakes, and it was bit several times, often getting very sick. Eventually, it died from a bite. They often turned pigs loose, because pigs would eat snakes. Then the ranchers would hunt and eat the pigs - so it went. Snakes are somewhat scare there now... Mom tells a story of going outside to check on my older sisters at play and found the oldest sister, about 4 at the time, sitting on the ground watching a rattler that was coiled not too far away. The ever-present irrigation shovel went into full gear! I have had several very close calls with rattlers. One came up behind me out of a beaver lodge I was standing on while fishing, and started buzzing - thank goodness. I had to jump in the water to get away from it. Friends with me killed it... I have killed numerous rattlers, but I have saved a few too. The reason? One I killed on the desert had three mice inside when I skinned it... A time later, I saw a very large one slowly crossing a well-traveled dirt road out in the desert, so I decided to stop, get out my walking stick, pick it up, and get it to the bushes on the side. It buzzed angrily at me through the whole process, but never struck. Just as I finished, a huge truck came through which would certainly have run over it - - As I get much older, I am less comfortable with taking the life of almost anything, because anything trying to survive these days probably has the right to go on trying - - Here is a poem I wrote a long, long time ago - - 13 March 82 - - - -The End of March - - - - I walked along and looked down, And he looked back at me; He used his comical yellow eye, And he rustled the grass As he went down the bank. Then he stopped at the water’s edge; His head turned ‘round, And he said to me - - “You were young once. Your eyes were bright one time.” I heard his small whispering voice Coming up to me from that Flickering tongue, those tight lips; And I went down to talk to him. But he only laughed And smiled a shiny, plated smile. I picked him up in my hand, But he had said his say. His yellow eye mocked me; Like a mean little boy, He stuck his tongue out at me - - I smiled and dropped him Into the creek as I would have Any mischievous friend, And he swam quickly away. But he had the last laugh; He stopped on the far bank And turned back with a prideful look; Then he said to me - - “You are old now! You should do the things Old ones do.” I tried to answer, But he did not wait for me - - I climbed back up to the road And walked slow back to town. Wandering and Wondering", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-28 07:35:00", 
        "title": "rent and Snakes", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed. the converse is true too... Ignorant Curiosity can be a dangerous thing too.. as a child i was taught that if you and a snake cross paths, the snake has the right of way. if i see one, i call out \"SNAKE\" and stop, or turn around. they want to bite us as much as we want to bite them. **Fast forward to FTX Basic training, in McGregor Range N.M. (fort Bliss, TX)*** i was the guide On Bearer walking point in the desert when i come upon a rattler. Naturally, i stopped, and followed with \"snake\" now you'd SAY that the rest of the platoon would stop and get away... WRONG.. they crouded around this creature to get a closer look... i am amazed this creature did not freak out and tag one of them... the old addage that says \"god loves children and fools\" held true that day...", 
        "intTime": 20090429, 
        "postID": 40, 
        "quote": "Originally posted by FollowMeInfantry: Ignorance is bliss? I went fishing with my then-wife and kids one time, when my middle daughter, Tonia, came-a-runnin' and yelling that she found a snake. I grabbed my camera and went to snap a picture of it, only to be horrified that someone (not my kids) had bashed it with a big rock right in the middle - it could move its head, but nothing below about half-way down. I sent the kiddos and Camy away and finished the deed so it wouldn't suffer any more. It was a pure black rat snake, maybe 3 or 4 feet long. It couldn't hurt you if you wanted it to. Needless to say, surrounding it was a bunch of litter (trash) mostly consisting of beer cans. I put a knife through its head and threw it in the river to feed the fish, and had my kids come back to that spot and clean up the mess left by the drunks. They asked me where the snake was, and I was honest in telling them that it was suffering and I had to kill it so it wouldn't die an agonizing death. But that we needed to clean the area so other wildlife could enjoy it. I think they learned something that day - I hope they did, anyway. Troy, Camy's boy, asked me why anyone would do such a thing. I had no answer for him sans to state that some people are bullies and pick on things smaller than them to make them feel tough. He concurred and said it was like the bullies at his school that targeted the smallest kids to pick on. So I know that at least he got it. We cleaned up the area, all of us (took us 3 full trash bags, IIRC). I hope that the jerks who did that to the snake and left it to suffer drowned in the river. Seriously, people pizz me off. Anyone controlled by fear is not in control of themselves. I fear for what my kids have to grow up surrounded by. But torturing an innocent animal? Man, that is the cruelest brutality of vanity I have ever witnessed.", 
        "reply": " the converse is true too... Ignorant Curiosity can be a dangerous thing too.. as a child i was taught that if you and a snake cross paths, the snake has the right of way. if i see one, i call out \"SNAKE\" and stop, or turn around. they want to bite us as much as we want to bite them. **Fast forward to FTX Basic training, in McGregor Range N.M. (fort Bliss, TX)*** i was the guide On Bearer walking point in the desert when i come upon a rattler. Naturally, i stopped, and followed with \"snake\" now you'd SAY that the rest of the platoon would stop and get away... WRONG.. they crouded around this creature to get a closer look... i am amazed this creature did not freak out and tag one of them... the old addage that says \"god loves children and fools\" held true that day...", 
        "threadID": "5291911282_4780078122001", 
        "time": "2009-04-29 06:53:00", 
        "title": "rent and Snakes", 
        "userID": "Elesso"
    }
]