[
    {
        "content": "do you think that people who ignore someone who is in need of help, show signs of depression, ask for help directly, or anythings along the lines of them possibly hurting themselves or another individual... should be held partly responsible for assisted suicide / homicide?", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "do you think that people who ignore someone who is in need of help, show signs of depression, ask for help directly, or anythings along the lines of them possibly hurting themselves or another individual... should be held partly responsible for assisted suicide / homicide?", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 15:41:00", 
        "title": "taking responsibility..", 
        "userID": "88miker"
    }, 
    {
        "content": "Man, that's a tough one. After my tagteam divorce/severe accident in '04 followed by having to retire from a job I loved, I went into a four year self pity party and stayed in my cave for most of that time. My dad, mom, best friend, etc would call and I would not answer the phone. On the worst of times, I wouldn't even answer if I saw it was one of my sons. It wasn't out of anger towards any of them. I just wanted to be left alone. It was pretty pittiful looking back on it. Both my dad and my buddy Gary told me many times they were close to calling the police to check on me. It was wrong to put them through that but it's simply the way I was back then. Thank God my family didn't give up on me and I would have to say the turning point was late in '07 when by friend Gary kept on me to buy a motorcycle. We use to ride together all the time back in our high school days. I finally bought a couple of old Yamaha's from a guy on Ebay. I'll tell ya, that's what finally got me out of my shell. I guess I was just ready. The time I spent restoring them built my enthusiasm to be outside again and working on a project. Here's the end result for the first one. Still working on the second. Now, to answer your question as to if you feel they may hurt others, I'd have to say DEFINITELY get involved. I guess that goes for threatening to hurt themselves as well. I had the advantage of knowing that I didn't feel that way towards myself. I just wanted things to be back the way they were, me working a great job and feeling like I was doing something important. Don", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "Man, that's a tough one. After my tagteam divorce/severe accident in '04 followed by having to retire from a job I loved, I went into a four year self pity party and stayed in my cave for most of that time. My dad, mom, best friend, etc would call and I would not answer the phone. On the worst of times, I wouldn't even answer if I saw it was one of my sons. It wasn't out of anger towards any of them. I just wanted to be left alone. It was pretty pittiful looking back on it. Both my dad and my buddy Gary told me many times they were close to calling the police to check on me. It was wrong to put them through that but it's simply the way I was back then. Thank God my family didn't give up on me and I would have to say the turning point was late in '07 when by friend Gary kept on me to buy a motorcycle. We use to ride together all the time back in our high school days. I finally bought a couple of old Yamaha's from a guy on Ebay. I'll tell ya, that's what finally got me out of my shell. I guess I was just ready. The time I spent restoring them built my enthusiasm to be outside again and working on a project. Here's the end result for the first one. Still working on the second. Now, to answer your question as to if you feel they may hurt others, I'd have to say DEFINITELY get involved. I guess that goes for threatening to hurt themselves as well. I had the advantage of knowing that I didn't feel that way towards myself. I just wanted things to be back the way they were, me working a great job and feeling like I was doing something important. Don", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 15:57:00", 
        "title": "taking responsibility..", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 88miker: do you think that people who ignore someone who is in need of help, show signs of depression, ask for help directly, or anythings along the lines of them possibly hurting themselves or another individual... should be held partly responsible for assisted suicide / homicide? I believe that it would be necessary to show malice! If the \"victim\" is underage, and the person ignoring them is their caretaker, that's an entirely different can of worms, however! THAT is already outlined in the law! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "Originally posted by 88miker: do you think that people who ignore someone who is in need of help, show signs of depression, ask for help directly, or anythings along the lines of them possibly hurting themselves or another individual... should be held partly responsible for assisted suicide / homicide?", 
        "reply": " I believe that it would be necessary to show malice! If the \"victim\" is underage, and the person ignoring them is their caretaker, that's an entirely different can of worms, however! THAT is already outlined in the law! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 15:59:00", 
        "title": "taking responsibility..", 
        "userID": "KJ1110"
    }, 
    {
        "content": "No! Not by any law of man. There are too many possible reasons unless they are a licensed practitioner such as medical, law enforcement, minister or a few others, It is between individual and their own conscience. But it might come up in eternity. Some states have “Good Samaritan” laws that will hold the person harmless if they assist in an emergency as long as what they did was within their ability and what was prudent under the circumstances. But some states will make the person who provides the assistance prove they were with justified in their actions. When you offer help you better know the law in the area. Florida has a “Good Samaritan” laws: *http://www.floridamalpractice.com/stat768.13.htm If you do a search on the internet for Good Samaritan laws you will find lots of information. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "", 
        "reply": "No! Not by any law of man. There are too many possible reasons unless they are a licensed practitioner such as medical, law enforcement, minister or a few others, It is between individual and their own conscience. But it might come up in eternity. Some states have “Good Samaritan” laws that will hold the person harmless if they assist in an emergency as long as what they did was within their ability and what was prudent under the circumstances. But some states will make the person who provides the assistance prove they were with justified in their actions. When you offer help you better know the law in the area. Florida has a “Good Samaritan” laws: *http://www.floridamalpractice.com/stat768.13.htm If you do a search on the internet for Good Samaritan laws you will find lots of information. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 16:12:00", 
        "title": "taking responsibility..", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "im not saying i am for or against. everything however is circumstantial. this was just a question to get some feedback. ive seen alot of people in my area asking for help, one was given help then sadly took his own life. i asked my partner in crime at work what he thought and he said it was a tough one. you can always tell when im working cus theres a crapload of posts in a 24 hour period", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "", 
        "reply": "im not saying i am for or against. everything however is circumstantial. this was just a question to get some feedback. ive seen alot of people in my area asking for help, one was given help then sadly took his own life. i asked my partner in crime at work what he thought and he said it was a tough one. you can always tell when im working cus theres a crapload of posts in a 24 hour period", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 16:17:00", 
        "title": "taking responsibility..", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by OldArmyWOPA: No! Not by any law of man. There are too many possible reasons unless they are a licensed practitioner such as medical, law enforcement, minister or a few others, It is between individual and their own conscience. But it might come up in eternity. Some states have “Good Samaritan” laws that will hold the person harmless if they assist in an emergency as long as what they did was within their ability and what was prudent under the circumstances. But some states will make the person who provides the assistance prove they were with justified in their actions. When you offer help you better know the law in the area. Florida has a “Good Samaritan” laws: *http://www.floridamalpractice.com/stat768.13.htm If you do a search on the internet for Good Samaritan laws you will find lots of information. Michigan, too! Also, as a trained LEO/First Responder/Firefighter/EMT, so long as you act within the limitations of your training, you're covered, but you'd best not step beyond that training and screw up! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "Originally posted by OldArmyWOPA: No! Not by any law of man. There are too many possible reasons unless they are a licensed practitioner such as medical, law enforcement, minister or a few others, It is between individual and their own conscience. But it might come up in eternity. Some states have “Good Samaritan” laws that will hold the person harmless if they assist in an emergency as long as what they did was within their ability and what was prudent under the circumstances. But some states will make the person who provides the assistance prove they were with justified in their actions. When you offer help you better know the law in the area. Florida has a “Good Samaritan” laws: *http://www.floridamalpractice.com/stat768.13.htm If you do a search on the internet for Good Samaritan laws you will find lots of information.", 
        "reply": " Michigan, too! Also, as a trained LEO/First Responder/Firefighter/EMT, so long as you act within the limitations of your training, you're covered, but you'd best not step beyond that training and screw up! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 16:20:00", 
        "title": "taking responsibility..", 
        "userID": "KJ1110"
    }, 
    {
        "content": "The trouble is that most people don't want to get involved because they are afraid. Afraid of a lawsuit, afraid of being taken advantage of, afraid of becoming a victim etc I say we all have a responsibility to get back involved, don't you? Of course, you can lead a horse to water but you can't make them drink, can you? But if you keep putting water out, maybe the horse will drink when it is thirsty?", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "", 
        "reply": "The trouble is that most people don't want to get involved because they are afraid. Afraid of a lawsuit, afraid of being taken advantage of, afraid of becoming a victim etc I say we all have a responsibility to get back involved, don't you? Of course, you can lead a horse to water but you can't make them drink, can you? But if you keep putting water out, maybe the horse will drink when it is thirsty?", 
        "threadID": "5291911282_3300040712001", 
        "time": "2009-03-05 18:48:00", 
        "title": "taking responsibility..", 
        "userID": "usa_girl"
    }
]