[
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by jasfcar: Also, this might be your ideal weapon of \"reverse fratricide.\" Since that if it does explode in their faces the first people they may well blame would be their suppliers. Also, if any \"innocents\" were killed it could be easily be inferred that the insurgents got careless with their handling of the explosives. I like to see this....people here in the U.S. who are spending time thinking of ways to help our troops instead of worrying about who's in first place in the NBA or who won an Oscar for best actor/actress. Glad to see the safety of our troops are what's on your mind. Don Proud father of a US Marine Thank you for your kind reply. I DO care a great deal and greatly appreciate the efforts of your son and all the other of our soldiers serving over there. I don't know if you've heard of Eric Egland, (Air Force reservist and Republican activist) but he's the kind of person that's got the right ideas. You can get info on him here: *http://www.sourcewatch.org/index.php?title=Eric_Egland as well as here: *http://www.troopsneedyou.com/ It gets me pretty darn irritated (to put it mildly) when I hear about our troops being attacked by those IED's. I know darn well that there has to be a better way for US to mitigate that threat. For those of US on the home front we are obligated to watch their backs moreso now than ever given the current political climate in DC. Hot links are prohibited - this time I just turned them off. Please understand, the next time there will be an official warning. This message has been edited. Last edited by: OldArmyLove, Thu 12 March 2009 01:05 PM", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by jasfcar: Also, this might be your ideal weapon of \"reverse fratricide.\" Since that if it does explode in their faces the first people they may well blame would be their suppliers. Also, if any \"innocents\" were killed it could be easily be inferred that the insurgents got careless with their handling of the explosives. I like to see this....people here in the U.S. who are spending time thinking of ways to help our troops instead of worrying about who's in first place in the NBA or who won an Oscar for best actor/actress. Glad to see the safety of our troops are what's on your mind. Don Proud father of a US Marine", 
        "reply": " Thank you for your kind reply. I DO care a great deal and greatly appreciate the efforts of your son and all the other of our soldiers serving over there. I don't know if you've heard of Eric Egland, (Air Force reservist and Republican activist) but he's the kind of person that's got the right ideas. You can get info on him here: *http://www.sourcewatch.org/index.php?title=Eric_Egland as well as here: *http://www.troopsneedyou.com/ It gets me pretty darn irritated (to put it mildly) when I hear about our troops being attacked by those IED's. I know darn well that there has to be a better way for US to mitigate that threat. For those of US on the home front we are obligated to watch their backs moreso now than ever given the current political climate in DC. Hot links are prohibited - this time I just turned them off. Please understand, the next time there will be an official warning. This message has been edited. Last edited by: OldArmyLove, Thu 12 March 2009 01:05 PM", 
        "threadID": "5291911282_5350001612001", 
        "time": "2009-03-12 00:05:00", 
        "title": "REIED's (Reverse-Engineered IED's)", 
        "userID": "jasfcar"
    }
]