[
    {
        "content": "I find that the older that I get the easier I get annoyed with things that go on around me. As an instance I get totally annoyed with politicians. They never bothered me when I was younger I just went about my life and got drunk. Now that I am older I want to fire them all and hire a new bunch that think more like I do. I can't believe that they can be so stupid and so selfish. They don't remember the people that elected them until it come time for re -election. This boondogle with the bank failure is a prime example. These elected officials were aware of what was going on but didn't do anything to stop it until it was too late. Now they just sit back and point fingers at the other guy. Our country is going downhill and we are losing ground daily. There seem to be nothing that we the common dude can do. We complain to our elected representatives to no avail. anyone with an idea as to what to do with this mess? Well, I will climb down from the soap box and give someone else a place to rant", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "", 
        "reply": "I find that the older that I get the easier I get annoyed with things that go on around me. As an instance I get totally annoyed with politicians. They never bothered me when I was younger I just went about my life and got drunk. Now that I am older I want to fire them all and hire a new bunch that think more like I do. I can't believe that they can be so stupid and so selfish. They don't remember the people that elected them until it come time for re -election. This boondogle with the bank failure is a prime example. These elected officials were aware of what was going on but didn't do anything to stop it until it was too late. Now they just sit back and point fingers at the other guy. Our country is going downhill and we are losing ground daily. There seem to be nothing that we the common dude can do. We complain to our elected representatives to no avail. anyone with an idea as to what to do with this mess? Well, I will climb down from the soap box and give someone else a place to rant", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 16:39:00", 
        "title": "Age", 
        "userID": "Vanir97"
    }, 
    {
        "content": "I only get annoyed when I can't shoot stuff - - Wandering and Wondering", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "", 
        "reply": "I only get annoyed when I can't shoot stuff - - Wandering and Wondering", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 17:17:00", 
        "title": "Age", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Politicians have short term memories it comes to what they say they will do and what they really do. They should be like the rest of us, if you can't do your job, you are fired!!! No four year terms, no terms period. A regular 9 to 5 job is all they get! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "", 
        "reply": "Politicians have short term memories it comes to what they say they will do and what they really do. They should be like the rest of us, if you can't do your job, you are fired!!! No four year terms, no terms period. A regular 9 to 5 job is all they get! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 20:00:00", 
        "title": "Age", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Politicians have short term memories it comes to what they say they will do and what they really do. They should be like the rest of us, if you can't do your job, you are fired!!! No four year terms, no terms period. A regular 9 to 5 job is all they get! If you look at the countries that have presidential replacements coming and going usually have a civil war coming down the pike as well. No matter how much we dislike this guy the best thing we can do is make sure that he knows how we really feel about his policies and honor his term unless something comes up that disqualifies him from that term. It's up to him to decide if he wants the people to like him or hate him. 3 years 9 months and counting. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "Originally posted by Bergy46: Politicians have short term memories it comes to what they say they will do and what they really do. They should be like the rest of us, if you can't do your job, you are fired!!! No four year terms, no terms period. A regular 9 to 5 job is all they get!", 
        "reply": " If you look at the countries that have presidential replacements coming and going usually have a civil war coming down the pike as well. No matter how much we dislike this guy the best thing we can do is make sure that he knows how we really feel about his policies and honor his term unless something comes up that disqualifies him from that term. It's up to him to decide if he wants the people to like him or hate him. 3 years 9 months and counting. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 20:06:00", 
        "title": "Age", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "The next presidential election I can see the campaign posters. “We can’t afford another 4 years of Obama.” Man that sounds sorta familiar !", 
        "intTime": 20090327, 
        "postID": 5, 
        "quote": "", 
        "reply": "The next presidential election I can see the campaign posters. “We can’t afford another 4 years of Obama.” Man that sounds sorta familiar !", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 20:36:00", 
        "title": "Age", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: The next presidential election I can see the campaign posters. “We can’t afford another 4 years of Obama.” Man that sounds sorta familiar ! I wonder how long it will be before we hear that. Obabma has already stepped on some toes, One the comment about vets paying for their meds. Another, an off handed remark about the Special Olympics! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090327, 
        "postID": 6, 
        "quote": "Originally posted by Wolfhound_1968: The next presidential election I can see the campaign posters. “We can’t afford another 4 years of Obama.” Man that sounds sorta familiar !", 
        "reply": " I wonder how long it will be before we hear that. Obabma has already stepped on some toes, One the comment about vets paying for their meds. Another, an off handed remark about the Special Olympics! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 20:44:00", 
        "title": "Age", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by Wolfhound_1968: The next presidential election I can see the campaign posters. “We can’t afford another 4 years of Obama.” Man that sounds sorta familiar ! I wonder how long it will be before we hear that. Obabma has already stepped on some toes, One the comment about vets paying for their meds. Another, an off handed remark about the Special Olympics! Was that a typo or crack at obama? What about oBOBma? hehehehe Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090327, 
        "postID": 7, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by Wolfhound_1968: The next presidential election I can see the campaign posters. “We can’t afford another 4 years of Obama.” Man that sounds sorta familiar ! I wonder how long it will be before we hear that. Obabma has already stepped on some toes, One the comment about vets paying for their meds. Another, an off handed remark about the Special Olympics!", 
        "reply": " Was that a typo or crack at obama? What about oBOBma? hehehehe Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_3850021912001", 
        "time": "2009-03-27 20:47:00", 
        "title": "Age", 
        "userID": "sargeant_green"
    }
]