[
    {
        "content": "In the nation in human trafficking. Does the Liberal Nature of this city breed this kind of Activity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "", 
        "reply": "In the nation in human trafficking. Does the Liberal Nature of this city breed this kind of Activity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-19 22:05:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "What are you talking about? Is there a news item about it somewhere? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "What are you talking about? Is there a news item about it somewhere? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 00:33:00", 
        "title": "Portland Oregon - #2", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Yeah! It's all over the News here in PORTLAND OREGON. Turn on your news... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "Yeah! It's all over the News here in PORTLAND OREGON. Turn on your news... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 07:02:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "http://www.kgw.com/video/video-index.html?nvid=363314 Satisfied? Now you can hear all the grizzly details. Unfortunately when I played the news article I heared what I didn't hear the first time around. Half of the children used for sex slaves in this country are being brought through Portland. I am PIZZED! To think that some young children are being used in this disgusting practice and in the neighborhoods I go through everyday! I always knew there was something wrong with this place and now I know, the culture of this place breeds people like that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "", 
        "reply": "http://www.kgw.com/video/video-index.html?nvid=363314 Satisfied? Now you can hear all the grizzly details. Unfortunately when I played the news article I heared what I didn't hear the first time around. Half of the children used for sex slaves in this country are being brought through Portland. I am PIZZED! To think that some young children are being used in this disgusting practice and in the neighborhoods I go through everyday! I always knew there was something wrong with this place and now I know, the culture of this place breeds people like that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 07:19:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I think it's more of an entry point then a stopping point. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. And if you're that disappointed with your perception of the city there's always the option of leaving? Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "", 
        "reply": "I think it's more of an entry point then a stopping point. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. And if you're that disappointed with your perception of the city there's always the option of leaving? Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 10:17:00", 
        "title": "Portland Oregon - #2", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. At any point it's wrong and should be stopped immediately. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. And if you're that disappointed with your perception of the city there's always the option of leaving? I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. I can show you where you can go in San Fransisco to find the garbage I'm referring to. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! GO BEAVS!!! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "Originally posted by mmulder67: I think it's more of an entry point then a stopping point. At any point it's wrong and should be stopped immediately. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. And if you're that disappointed with your perception of the city there's always the option of leaving? I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. I can show you where you can go in San Fransisco to find the garbage I'm referring to. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS!", 
        "reply": " GO BEAVS!!! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 13:28:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "The last and only time I was in Portland I was amazed at the amount of drug activity, even in front of children!! Although it was 20-years ago I couldn’t believe how much “some people” just plan didn’t care. Open the front door and throw the trash in the yard. But the drug activity was enough to make me want to leave ~ I rented a van and hit the coast. Beautiful state scenery wise. . . Very sad news story SG ~ they speak of returning those kids to “normal” but that is damage that can’t be undone!! choose joy each day", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "", 
        "reply": "The last and only time I was in Portland I was amazed at the amount of drug activity, even in front of children!! Although it was 20-years ago I couldn’t believe how much “some people” just plan didn’t care. Open the front door and throw the trash in the yard. But the drug activity was enough to make me want to leave ~ I rented a van and hit the coast. Beautiful state scenery wise. . . Very sad news story SG ~ they speak of returning those kids to “normal” but that is damage that can’t be undone!! choose joy each day", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 14:15:00", 
        "title": "Portland Oregon - #2", 
        "userID": "MissU2"
    }, 
    {
        "content": "I believe that all large Cities have their good sides as well as their bad sides. San Francisco has the tenderloin and castro districts . Portland has the downtodw area around second, third and fourth on Yamhill as well as Williams avenue. I used to live just off of Lombard in North Portland. Lots of Pimps and prostitutes in that area. Had to sell my house and move to get away from that area.", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "", 
        "reply": "I believe that all large Cities have their good sides as well as their bad sides. San Francisco has the tenderloin and castro districts . Portland has the downtodw area around second, third and fourth on Yamhill as well as Williams avenue. I used to live just off of Lombard in North Portland. Lots of Pimps and prostitutes in that area. Had to sell my house and move to get away from that area.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 15:40:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "We are getting a lot of the East Coasts \"wretched refuse\". My Mom is from Brooklyn and I've heard that accent putting the squeeze on folks in recent weeks. They are surprised when the few good people stand in and stop them. I've heard a few Eastern European accent involved in scuffles on the train platforms. Portland's not all bad and the folks here just have to get excited about this place not tendering a safe haven for the scum that feel they can cause others pain for their own profit. From the political conversations I hear the majority of people are programmed to listen to certain venues and all others are taboo. Actually studying the issues and making an informed decision is rare here. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "", 
        "reply": "We are getting a lot of the East Coasts \"wretched refuse\". My Mom is from Brooklyn and I've heard that accent putting the squeeze on folks in recent weeks. They are surprised when the few good people stand in and stop them. I've heard a few Eastern European accent involved in scuffles on the train platforms. Portland's not all bad and the folks here just have to get excited about this place not tendering a safe haven for the scum that feel they can cause others pain for their own profit. From the political conversations I hear the majority of people are programmed to listen to certain venues and all others are taboo. Actually studying the issues and making an informed decision is rare here. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 15:49:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Well, with mayors like Vera Katz, Potter, and Sam Adams in charge it's no wonder. Liberalism has been prevalent in Portland. It is also known as a sancuary city. I found many things about Portland to be from very nice to great. Some excellent restaurants and parks (rose park, japanese gardens etc.) Janzen Beach was also lots of fun when it was an amusement park Had a world class swimming pool, ballroom dance hall and a fun roller coaster. So one has to take the good with the bad. We alone cannot change a city.", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "", 
        "reply": "Well, with mayors like Vera Katz, Potter, and Sam Adams in charge it's no wonder. Liberalism has been prevalent in Portland. It is also known as a sancuary city. I found many things about Portland to be from very nice to great. Some excellent restaurants and parks (rose park, japanese gardens etc.) Janzen Beach was also lots of fun when it was an amusement park Had a world class swimming pool, ballroom dance hall and a fun roller coaster. So one has to take the good with the bad. We alone cannot change a city.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 16:04:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "", 
        "reply": "Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 18:39:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "Originally posted by mmulder67: I think it's more of an entry point then a stopping point.", 
        "reply": " quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 01:30:00", 
        "title": "Portland Oregon - #2", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!.... My years previous to the last few here in Portland were in Salem (23 years) just South of the City of Portland. In the hub of the Political events and aware of the ludicrous behavior coming out of Portland. You say your between Gresham and Sandy so you get to see the kind of stuff that happens in the \"living room\" on your local news. You missed this story though, Oh well, maybe you'll catch it later. As I said I periodically leave, to get out of the mess this city is. However I will attend events like the recent \"tea bag\" event in Pioneer Courthouse Square. So I guess you could retract the accusation that I am \"running away\". Not having the necessary details about my life to make that assumption that I am \"running away\" is kind of lacking in logic. Wyoming is too windy for me, no Thanks. The fact is that I am an observer of life and people and have been in those areas on business . You are a little too quick to judge me without the necessary information to make such a decision about my mindset. I don't go into those areas for whatever you have in your mind. Regardless of your perception of the comparison you made I don't get it. Maybe a metaphor that is pictured with some modicum of logic would suffice. I am unhappy with ANY civil servant that wastes my money and doesn't get the job done that they were paid for. Recent events that have occurred in my neighborhood have brought this deficiency in my own LEO community to my attention. I believe you are in the same county as myself so you should be concerned as well. Let just say that when an adult calls my grandson a name that is racially hateful and that LEO community wants to ignore that then yes I will become active in my protests. I have and will continue to complain as long as the civil servants in my \"tax base\" don't give a 110%. NO YOU SUC!!! This message has been edited. Last edited by: sargeant_green, Thu 21 May 2009 10:09 AM Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!....", 
        "reply": " My years previous to the last few here in Portland were in Salem (23 years) just South of the City of Portland. In the hub of the Political events and aware of the ludicrous behavior coming out of Portland. You say your between Gresham and Sandy so you get to see the kind of stuff that happens in the \"living room\" on your local news. You missed this story though, Oh well, maybe you'll catch it later. As I said I periodically leave, to get out of the mess this city is. However I will attend events like the recent \"tea bag\" event in Pioneer Courthouse Square. So I guess you could retract the accusation that I am \"running away\". Not having the necessary details about my life to make that assumption that I am \"running away\" is kind of lacking in logic. Wyoming is too windy for me, no Thanks. The fact is that I am an observer of life and people and have been in those areas on business . You are a little too quick to judge me without the necessary information to make such a decision about my mindset. I don't go into those areas for whatever you have in your mind. Regardless of your perception of the comparison you made I don't get it. Maybe a metaphor that is pictured with some modicum of logic would suffice. I am unhappy with ANY civil servant that wastes my money and doesn't get the job done that they were paid for. Recent events that have occurred in my neighborhood have brought this deficiency in my own LEO community to my attention. I believe you are in the same county as myself so you should be concerned as well. Let just say that when an adult calls my grandson a name that is racially hateful and that LEO community wants to ignore that then yes I will become active in my protests. I have and will continue to complain as long as the civil servants in my \"tax base\" don't give a 110%. NO YOU SUC!!! This message has been edited. Last edited by: sargeant_green, Thu 21 May 2009 10:09 AM Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 09:48:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway? Wasn't Neil Goldsmith the other pediphile? 2004 was a busy year for me in Portland. I had a heart Attack on Feb 29, then followed that up with a stroke on July 28. Then my best friend who was living with me ( I was taking care of him)died of Emphysema so I had him cremated and his ashes buried up at Willamet National Cemetery. Then I sold me house and left town. Happiness was seeing Portland in the rear view mirror. Portland is a beautiful city with many super nice people and the view of Mt Hood is awesome, it's just too bad that there are so many liberals living there. What is the name of those bike riders that block traffic once a month? (critical mass or something like that?)", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by sargeant_green: Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway?", 
        "reply": " Wasn't Neil Goldsmith the other pediphile? 2004 was a busy year for me in Portland. I had a heart Attack on Feb 29, then followed that up with a stroke on July 28. Then my best friend who was living with me ( I was taking care of him)died of Emphysema so I had him cremated and his ashes buried up at Willamet National Cemetery. Then I sold me house and left town. Happiness was seeing Portland in the rear view mirror. Portland is a beautiful city with many super nice people and the view of Mt Hood is awesome, it's just too bad that there are so many liberals living there. What is the name of those bike riders that block traffic once a month? (critical mass or something like that?)", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 16:47:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "ding ding ding! You win the prize! Neil Goldschmidt was the \"other Pedophile\" now living in France with all the other puzzies. His longtime buddie and the \"hose man\" for his wife, Bernie Guisto is now reinstated as the Multnomah County Sheriff. Bernie was also the \"pimp\" who drove the underage Miss to and from the Governors Mansion in Salem when the \"guv\" put on his \"Glove\". This state is sooo messed up in the sexual scandals that Blinton's folly is a JOKE. And people wonder why I am sooo disgusted with the local LEO community. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "", 
        "reply": "ding ding ding! You win the prize! Neil Goldschmidt was the \"other Pedophile\" now living in France with all the other puzzies. His longtime buddie and the \"hose man\" for his wife, Bernie Guisto is now reinstated as the Multnomah County Sheriff. Bernie was also the \"pimp\" who drove the underage Miss to and from the Governors Mansion in Salem when the \"guv\" put on his \"Glove\". This state is sooo messed up in the sexual scandals that Blinton's folly is a JOKE. And people wonder why I am sooo disgusted with the local LEO community. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 20:44:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Portland Oregon - #2 I thought you was gona say something about it being like in kindergarten where, if ya had to go, ya had to hold up one finger for #1 and two fingers for #2 - - Wandering and Wondering", 
        "intTime": 20090522, 
        "postID": 16, 
        "quote": "Portland Oregon - #2", 
        "reply": " I thought you was gona say something about it being like in kindergarten where, if ya had to go, ya had to hold up one finger for #1 and two fingers for #2 - - Wandering and Wondering", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-22 12:04:00", 
        "title": "Portland Oregon - #2", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Wasn't it Portland, wher at teh 'Peace rally\" a few years back, they burned a soldier in effigy? Yeah, nice place they got there.", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "", 
        "reply": "Wasn't it Portland, wher at teh 'Peace rally\" a few years back, they burned a soldier in effigy? Yeah, nice place they got there.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-22 12:57:00", 
        "title": "Portland Oregon - #2", 
        "userID": "billdawg24"
    }, 
    {
        "content": "BillDawg, Sleep tight knowing the \"Secret Skqwerel is in PORTLAND and causing dysfunction to the lunatic machine here in the \"City of Nutz\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090522, 
        "postID": 18, 
        "quote": "", 
        "reply": "BillDawg, Sleep tight knowing the \"Secret Skqwerel is in PORTLAND and causing dysfunction to the lunatic machine here in the \"City of Nutz\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-22 23:04:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Be assured that it is not only Portland that is screwed up. Most of the large Cities are in essence the same as Portland. Liberalism is taking over this country. The old adage of \"if it feels good, do it\" seems to apply more and more each day. I don't believe that our courts are handing out the punishments that they should be doing. Instead they check the criminals background and make a judgement based on whether the person had a good childhood rather than focusing on the crime that the person has committed. That is just an example of course the list could be almost endless. So enjoy those parts of Portland and Oregon that you can and try to stay away from the rat infested areas.", 
        "intTime": 20090523, 
        "postID": 19, 
        "quote": "", 
        "reply": "Be assured that it is not only Portland that is screwed up. Most of the large Cities are in essence the same as Portland. Liberalism is taking over this country. The old adage of \"if it feels good, do it\" seems to apply more and more each day. I don't believe that our courts are handing out the punishments that they should be doing. Instead they check the criminals background and make a judgement based on whether the person had a good childhood rather than focusing on the crime that the person has committed. That is just an example of course the list could be almost endless. So enjoy those parts of Portland and Oregon that you can and try to stay away from the rat infested areas.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-23 06:31:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "I agree with Vanir! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 20, 
        "quote": "", 
        "reply": "I agree with Vanir! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-23 07:28:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Bergy46"
    }, 
    {
        "content": "In the nation in human trafficking. Does the Liberal Nature of this city breed this kind of Activity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "", 
        "reply": "In the nation in human trafficking. Does the Liberal Nature of this city breed this kind of Activity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-19 22:05:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "What are you talking about? Is there a news item about it somewhere? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "", 
        "reply": "What are you talking about? Is there a news item about it somewhere? Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 00:33:00", 
        "title": "Portland Oregon - #2", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Yeah! It's all over the News here in PORTLAND OREGON. Turn on your news... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 23, 
        "quote": "", 
        "reply": "Yeah! It's all over the News here in PORTLAND OREGON. Turn on your news... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 07:02:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "http://www.kgw.com/video/video-index.html?nvid=363314 Satisfied? Now you can hear all the grizzly details. Unfortunately when I played the news article I heared what I didn't hear the first time around. Half of the children used for sex slaves in this country are being brought through Portland. I am PIZZED! To think that some young children are being used in this disgusting practice and in the neighborhoods I go through everyday! I always knew there was something wrong with this place and now I know, the culture of this place breeds people like that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 24, 
        "quote": "", 
        "reply": "http://www.kgw.com/video/video-index.html?nvid=363314 Satisfied? Now you can hear all the grizzly details. Unfortunately when I played the news article I heared what I didn't hear the first time around. Half of the children used for sex slaves in this country are being brought through Portland. I am PIZZED! To think that some young children are being used in this disgusting practice and in the neighborhoods I go through everyday! I always knew there was something wrong with this place and now I know, the culture of this place breeds people like that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 07:19:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I think it's more of an entry point then a stopping point. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. And if you're that disappointed with your perception of the city there's always the option of leaving? Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090520, 
        "postID": 25, 
        "quote": "", 
        "reply": "I think it's more of an entry point then a stopping point. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. And if you're that disappointed with your perception of the city there's always the option of leaving? Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 10:17:00", 
        "title": "Portland Oregon - #2", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. At any point it's wrong and should be stopped immediately. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. And if you're that disappointed with your perception of the city there's always the option of leaving? I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. I can show you where you can go in San Fransisco to find the garbage I'm referring to. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! GO BEAVS!!! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 26, 
        "quote": "Originally posted by mmulder67: I think it's more of an entry point then a stopping point. At any point it's wrong and should be stopped immediately. I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. And if you're that disappointed with your perception of the city there's always the option of leaving? I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. I can show you where you can go in San Fransisco to find the garbage I'm referring to. Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS!", 
        "reply": " GO BEAVS!!! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 13:28:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "The last and only time I was in Portland I was amazed at the amount of drug activity, even in front of children!! Although it was 20-years ago I couldn’t believe how much “some people” just plan didn’t care. Open the front door and throw the trash in the yard. But the drug activity was enough to make me want to leave ~ I rented a van and hit the coast. Beautiful state scenery wise. . . Very sad news story SG ~ they speak of returning those kids to “normal” but that is damage that can’t be undone!! choose joy each day", 
        "intTime": 20090520, 
        "postID": 27, 
        "quote": "", 
        "reply": "The last and only time I was in Portland I was amazed at the amount of drug activity, even in front of children!! Although it was 20-years ago I couldn’t believe how much “some people” just plan didn’t care. Open the front door and throw the trash in the yard. But the drug activity was enough to make me want to leave ~ I rented a van and hit the coast. Beautiful state scenery wise. . . Very sad news story SG ~ they speak of returning those kids to “normal” but that is damage that can’t be undone!! choose joy each day", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 14:15:00", 
        "title": "Portland Oregon - #2", 
        "userID": "MissU2"
    }, 
    {
        "content": "I believe that all large Cities have their good sides as well as their bad sides. San Francisco has the tenderloin and castro districts . Portland has the downtodw area around second, third and fourth on Yamhill as well as Williams avenue. I used to live just off of Lombard in North Portland. Lots of Pimps and prostitutes in that area. Had to sell my house and move to get away from that area.", 
        "intTime": 20090520, 
        "postID": 28, 
        "quote": "", 
        "reply": "I believe that all large Cities have their good sides as well as their bad sides. San Francisco has the tenderloin and castro districts . Portland has the downtodw area around second, third and fourth on Yamhill as well as Williams avenue. I used to live just off of Lombard in North Portland. Lots of Pimps and prostitutes in that area. Had to sell my house and move to get away from that area.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 15:40:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "We are getting a lot of the East Coasts \"wretched refuse\". My Mom is from Brooklyn and I've heard that accent putting the squeeze on folks in recent weeks. They are surprised when the few good people stand in and stop them. I've heard a few Eastern European accent involved in scuffles on the train platforms. Portland's not all bad and the folks here just have to get excited about this place not tendering a safe haven for the scum that feel they can cause others pain for their own profit. From the political conversations I hear the majority of people are programmed to listen to certain venues and all others are taboo. Actually studying the issues and making an informed decision is rare here. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 29, 
        "quote": "", 
        "reply": "We are getting a lot of the East Coasts \"wretched refuse\". My Mom is from Brooklyn and I've heard that accent putting the squeeze on folks in recent weeks. They are surprised when the few good people stand in and stop them. I've heard a few Eastern European accent involved in scuffles on the train platforms. Portland's not all bad and the folks here just have to get excited about this place not tendering a safe haven for the scum that feel they can cause others pain for their own profit. From the political conversations I hear the majority of people are programmed to listen to certain venues and all others are taboo. Actually studying the issues and making an informed decision is rare here. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 15:49:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Well, with mayors like Vera Katz, Potter, and Sam Adams in charge it's no wonder. Liberalism has been prevalent in Portland. It is also known as a sancuary city. I found many things about Portland to be from very nice to great. Some excellent restaurants and parks (rose park, japanese gardens etc.) Janzen Beach was also lots of fun when it was an amusement park Had a world class swimming pool, ballroom dance hall and a fun roller coaster. So one has to take the good with the bad. We alone cannot change a city.", 
        "intTime": 20090520, 
        "postID": 30, 
        "quote": "", 
        "reply": "Well, with mayors like Vera Katz, Potter, and Sam Adams in charge it's no wonder. Liberalism has been prevalent in Portland. It is also known as a sancuary city. I found many things about Portland to be from very nice to great. Some excellent restaurants and parks (rose park, japanese gardens etc.) Janzen Beach was also lots of fun when it was an amusement park Had a world class swimming pool, ballroom dance hall and a fun roller coaster. So one has to take the good with the bad. We alone cannot change a city.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 16:04:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090520, 
        "postID": 31, 
        "quote": "", 
        "reply": "Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-20 18:39:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "Originally posted by mmulder67: I think it's more of an entry point then a stopping point.", 
        "reply": " quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!.... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 01:30:00", 
        "title": "Portland Oregon - #2", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!.... My years previous to the last few here in Portland were in Salem (23 years) just South of the City of Portland. In the hub of the Political events and aware of the ludicrous behavior coming out of Portland. You say your between Gresham and Sandy so you get to see the kind of stuff that happens in the \"living room\" on your local news. You missed this story though, Oh well, maybe you'll catch it later. As I said I periodically leave, to get out of the mess this city is. However I will attend events like the recent \"tea bag\" event in Pioneer Courthouse Square. So I guess you could retract the accusation that I am \"running away\". Not having the necessary details about my life to make that assumption that I am \"running away\" is kind of lacking in logic. Wyoming is too windy for me, no Thanks. The fact is that I am an observer of life and people and have been in those areas on business . You are a little too quick to judge me without the necessary information to make such a decision about my mindset. I don't go into those areas for whatever you have in your mind. Regardless of your perception of the comparison you made I don't get it. Maybe a metaphor that is pictured with some modicum of logic would suffice. I am unhappy with ANY civil servant that wastes my money and doesn't get the job done that they were paid for. Recent events that have occurred in my neighborhood have brought this deficiency in my own LEO community to my attention. I believe you are in the same county as myself so you should be concerned as well. Let just say that when an adult calls my grandson a name that is racially hateful and that LEO community wants to ignore that then yes I will become active in my protests. I have and will continue to complain as long as the civil servants in my \"tax base\" don't give a 110%. NO YOU SUC!!! This message has been edited. Last edited by: sargeant_green, Thu 21 May 2009 10:09 AM Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "Originally posted by mmulder67: quote: Originally posted by mmulder67: I think it's more of an entry point then a stopping point. quote: Originally posted by sargeant_green: At any point it's wrong and should be stopped immediately. I agree! quote: Originally posted by mmulder67: I didn't see anything on KOIN 6 or FOX 12 regarding this but I don't always catch the news. As for the culture of this place...I doubt that is the cause of perverted sicko's. quote: Originally posted by sargeant_green: Having been here for the last 13 years I can say it has evolved to a IMMORAL PLACE IMO. Having been here for the last 27 years I can say that every place has it's less then desirable sections. Portland has not become any worse (or better) then any other city of similar or larger size. Maybe the influx of people from the state due south (and farther?) has led to your current disappointment? (I live out between Gresham and Sandy, but I have lived in Portland.) quote: Originally posted by mmulder67: And if you're that disappointed with your perception of the city there's always the option of leaving? quote: Originally posted by sargeant_green: I do leave and stay away as long as I can and I do hope to move from the area some day. Circumstances prevent me from moving now. Yeah, because running away from the problem will fix everything?! How about doing the best you can and not letting yourself get to wrapped up in things like that? I doubt anywhere except Wyoming is going to satisfy your living evironment standards. quote: Originally posted by mmulder67: Wonder why the \"culture\" of San Fran doesn't breed people like that? Because that isn't the cause. quote: Originally posted by sargeant_green: I can show you where you can go in San Fransisco to find the garbage I'm referring to. And the fact that you have, do or will look for that is indicative of your mindset. Unless it's because your actively trying to combat it then I could see why you would know where to find that? quote: Originally posted by mmulder67: Portland just happens to unfortunate enough to be the \"choice\" of entry for this disgusting issue and the people of Portland aren't any more responsible for that then the people of Washington are responsible for Mt. St. Helens erupting. quote: Originally posted by sargeant_green: Your comparison sucs, An criminal act vs. an act of GOD? It's a choice because the liberal views that pervade this city also make it a sanctuary city. That condition makes it a desirable port of entry for the scumbags that do this crime. Of course the Police around here are more concerned with \"who's driving around the city or walking through the neighborhoods\" rather than who's committing the real crime that effects the citizens and those who aren't yet and are in our country illegally. LEO's here are the micro-managers of the law enforcement world. I'm really surprised at the amount of crime that just goes un-investigated because their too damn lazy. A really sad part of this whole mess is that the criminals are probably being expedited by the local LEO's. My comparison is relevant in that God gave us free will and that is how some men exercise their free will and the rest of us have no control over that. Do I detect a slight unhappiness with the POPO? I can sympathize as they all seem to have an agenda and \"law enforcement\" doesn't seem to be part of that agenda. However, being a good citizen doesn't mean you have to tolerate it. File complaints. Write to your representatives. quote: Originally posted by mmulder67: I sympathize with your outrage but I think it's slightly misplaced. GO DUCKS! quote: Originally posted by sargeant_green: GO BEAVS!!! You suck!....", 
        "reply": " My years previous to the last few here in Portland were in Salem (23 years) just South of the City of Portland. In the hub of the Political events and aware of the ludicrous behavior coming out of Portland. You say your between Gresham and Sandy so you get to see the kind of stuff that happens in the \"living room\" on your local news. You missed this story though, Oh well, maybe you'll catch it later. As I said I periodically leave, to get out of the mess this city is. However I will attend events like the recent \"tea bag\" event in Pioneer Courthouse Square. So I guess you could retract the accusation that I am \"running away\". Not having the necessary details about my life to make that assumption that I am \"running away\" is kind of lacking in logic. Wyoming is too windy for me, no Thanks. The fact is that I am an observer of life and people and have been in those areas on business . You are a little too quick to judge me without the necessary information to make such a decision about my mindset. I don't go into those areas for whatever you have in your mind. Regardless of your perception of the comparison you made I don't get it. Maybe a metaphor that is pictured with some modicum of logic would suffice. I am unhappy with ANY civil servant that wastes my money and doesn't get the job done that they were paid for. Recent events that have occurred in my neighborhood have brought this deficiency in my own LEO community to my attention. I believe you are in the same county as myself so you should be concerned as well. Let just say that when an adult calls my grandson a name that is racially hateful and that LEO community wants to ignore that then yes I will become active in my protests. I have and will continue to complain as long as the civil servants in my \"tax base\" don't give a 110%. NO YOU SUC!!! This message has been edited. Last edited by: sargeant_green, Thu 21 May 2009 10:09 AM Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 09:48:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway? Wasn't Neil Goldsmith the other pediphile? 2004 was a busy year for me in Portland. I had a heart Attack on Feb 29, then followed that up with a stroke on July 28. Then my best friend who was living with me ( I was taking care of him)died of Emphysema so I had him cremated and his ashes buried up at Willamet National Cemetery. Then I sold me house and left town. Happiness was seeing Portland in the rear view mirror. Portland is a beautiful city with many super nice people and the view of Mt Hood is awesome, it's just too bad that there are so many liberals living there. What is the name of those bike riders that block traffic once a month? (critical mass or something like that?)", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "Originally posted by sargeant_green: Jansten beach's Roller Coaster went out with the cowboy hat in Portland around the sixties or seventies. The Rose Garden and the Japanese Garden are older attractions created by another generation. When Vera came on the scene I saw the trouble coming. President of the Senate in the Oregon House. She fostered a lot of the recent liberal policy in this state. And the real kicker is she's from New York! Sam Adams the pedophile Mayor (Only the 2nd to hold this title while in office) will continue to laugh at the gullible morons he calls constituents and his conquest will write a book and make money. When did you leave Portland anyway?", 
        "reply": " Wasn't Neil Goldsmith the other pediphile? 2004 was a busy year for me in Portland. I had a heart Attack on Feb 29, then followed that up with a stroke on July 28. Then my best friend who was living with me ( I was taking care of him)died of Emphysema so I had him cremated and his ashes buried up at Willamet National Cemetery. Then I sold me house and left town. Happiness was seeing Portland in the rear view mirror. Portland is a beautiful city with many super nice people and the view of Mt Hood is awesome, it's just too bad that there are so many liberals living there. What is the name of those bike riders that block traffic once a month? (critical mass or something like that?)", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 16:47:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "ding ding ding! You win the prize! Neil Goldschmidt was the \"other Pedophile\" now living in France with all the other puzzies. His longtime buddie and the \"hose man\" for his wife, Bernie Guisto is now reinstated as the Multnomah County Sheriff. Bernie was also the \"pimp\" who drove the underage Miss to and from the Governors Mansion in Salem when the \"guv\" put on his \"Glove\". This state is sooo messed up in the sexual scandals that Blinton's folly is a JOKE. And people wonder why I am sooo disgusted with the local LEO community. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "", 
        "reply": "ding ding ding! You win the prize! Neil Goldschmidt was the \"other Pedophile\" now living in France with all the other puzzies. His longtime buddie and the \"hose man\" for his wife, Bernie Guisto is now reinstated as the Multnomah County Sheriff. Bernie was also the \"pimp\" who drove the underage Miss to and from the Governors Mansion in Salem when the \"guv\" put on his \"Glove\". This state is sooo messed up in the sexual scandals that Blinton's folly is a JOKE. And people wonder why I am sooo disgusted with the local LEO community. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-21 20:44:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Portland Oregon - #2 I thought you was gona say something about it being like in kindergarten where, if ya had to go, ya had to hold up one finger for #1 and two fingers for #2 - - Wandering and Wondering", 
        "intTime": 20090522, 
        "postID": 36, 
        "quote": "Portland Oregon - #2", 
        "reply": " I thought you was gona say something about it being like in kindergarten where, if ya had to go, ya had to hold up one finger for #1 and two fingers for #2 - - Wandering and Wondering", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-22 12:04:00", 
        "title": "Portland Oregon - #2", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Wasn't it Portland, wher at teh 'Peace rally\" a few years back, they burned a soldier in effigy? Yeah, nice place they got there.", 
        "intTime": 20090522, 
        "postID": 37, 
        "quote": "", 
        "reply": "Wasn't it Portland, wher at teh 'Peace rally\" a few years back, they burned a soldier in effigy? Yeah, nice place they got there.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-22 12:57:00", 
        "title": "Portland Oregon - #2", 
        "userID": "billdawg24"
    }, 
    {
        "content": "BillDawg, Sleep tight knowing the \"Secret Skqwerel is in PORTLAND and causing dysfunction to the lunatic machine here in the \"City of Nutz\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090522, 
        "postID": 38, 
        "quote": "", 
        "reply": "BillDawg, Sleep tight knowing the \"Secret Skqwerel is in PORTLAND and causing dysfunction to the lunatic machine here in the \"City of Nutz\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-22 23:04:00", 
        "title": "Portland Oregon - #2", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Be assured that it is not only Portland that is screwed up. Most of the large Cities are in essence the same as Portland. Liberalism is taking over this country. The old adage of \"if it feels good, do it\" seems to apply more and more each day. I don't believe that our courts are handing out the punishments that they should be doing. Instead they check the criminals background and make a judgement based on whether the person had a good childhood rather than focusing on the crime that the person has committed. That is just an example of course the list could be almost endless. So enjoy those parts of Portland and Oregon that you can and try to stay away from the rat infested areas.", 
        "intTime": 20090523, 
        "postID": 39, 
        "quote": "", 
        "reply": "Be assured that it is not only Portland that is screwed up. Most of the large Cities are in essence the same as Portland. Liberalism is taking over this country. The old adage of \"if it feels good, do it\" seems to apply more and more each day. I don't believe that our courts are handing out the punishments that they should be doing. Instead they check the criminals background and make a judgement based on whether the person had a good childhood rather than focusing on the crime that the person has committed. That is just an example of course the list could be almost endless. So enjoy those parts of Portland and Oregon that you can and try to stay away from the rat infested areas.", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-23 06:31:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Vanir97"
    }, 
    {
        "content": "I agree with Vanir! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 40, 
        "quote": "", 
        "reply": "I agree with Vanir! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6810037322001", 
        "time": "2009-05-23 07:28:00", 
        "title": "Portland Oregon - #2", 
        "userID": "Bergy46"
    }
]