[
    {
        "content": "Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm?", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "", 
        "reply": "Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm?", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 13:49:00", 
        "title": "Obama was right all along.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Seeing as our goverment has \"given away\" billions of dollars and can not specifically account for it , I'd say \"someones\" decided to spend some of that cash, get in low, sell high.", 
        "intTime": 20090504, 
        "postID": 2, 
        "quote": "", 
        "reply": "Seeing as our goverment has \"given away\" billions of dollars and can not specifically account for it , I'd say \"someones\" decided to spend some of that cash, get in low, sell high.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 13:58:00", 
        "title": "Obama was right all along.", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm? I hope it is the real thing, but I feel it is just an illusion, or the calm as you say.", 
        "intTime": 20090504, 
        "postID": 3, 
        "quote": "Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm?", 
        "reply": " I hope it is the real thing, but I feel it is just an illusion, or the calm as you say.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 14:24:00", 
        "title": "Obama was right all along.", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm? I hope it is the real thing, but I feel it is just an illusion, or the calm as you say. The markets are like yo-yos. not a reliable gauge of anything. One needs to look at the big picture over time to learn the truth. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 4, 
        "quote": "Originally posted by sw614: quote: Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm? I hope it is the real thing, but I feel it is just an illusion, or the calm as you say.", 
        "reply": " The markets are like yo-yos. not a reliable gauge of anything. One needs to look at the big picture over time to learn the truth. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 14:42:00", 
        "title": "Obama was right all along.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Still on the downhill in Florida, state lawmakers just voted to cut pay by 2% for state employees making over $45,000 a year. Not a good time to get pulled over by a state trooper in Florida .", 
        "intTime": 20090504, 
        "postID": 5, 
        "quote": "", 
        "reply": "Still on the downhill in Florida, state lawmakers just voted to cut pay by 2% for state employees making over $45,000 a year. Not a good time to get pulled over by a state trooper in Florida .", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 17:40:00", 
        "title": "Obama was right all along.", 
        "userID": "Warrior7d"
    }, 
    {
        "content": "If you think the State Lawmakers are gonna cut their pay or that of the top execs in the state gov., I have a bridge I'll sell to you! BTW, Warrior, that was not sarcasm directed at you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090504, 
        "postID": 6, 
        "quote": "", 
        "reply": "If you think the State Lawmakers are gonna cut their pay or that of the top execs in the state gov., I have a bridge I'll sell to you! BTW, Warrior, that was not sarcasm directed at you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 17:51:00", 
        "title": "Obama was right all along.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "We were discussing the same thing at work today. Doubt it includes them.", 
        "intTime": 20090504, 
        "postID": 7, 
        "quote": "", 
        "reply": "We were discussing the same thing at work today. Doubt it includes them.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 17:54:00", 
        "title": "Obama was right all along.", 
        "userID": "Warrior7d"
    }, 
    {
        "content": "Moderator hat off: The Florida State Trooper are already among the lowest paid police officers in the state. FHP, hasn't been the same since they fired (oh excuse me, retired at the request of the governor) my first cousin Eldridge Beach as director, commander, FHP. Now, that I aired the family's dirty laundry, let me see if I understand the situation, A state employee makes $45,000.00 a year takes a pay cut of $900.00 (2%), new salary of $44,100. But a state employee making $44,900.00 take no pay cut. Now he makes more money than the previous guy. A Florida boy, born, raised, resides there-in, and here I will be buried. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090504, 
        "postID": 8, 
        "quote": "", 
        "reply": "Moderator hat off: The Florida State Trooper are already among the lowest paid police officers in the state. FHP, hasn't been the same since they fired (oh excuse me, retired at the request of the governor) my first cousin Eldridge Beach as director, commander, FHP. Now, that I aired the family's dirty laundry, let me see if I understand the situation, A state employee makes $45,000.00 a year takes a pay cut of $900.00 (2%), new salary of $44,100. But a state employee making $44,900.00 take no pay cut. Now he makes more money than the previous guy. A Florida boy, born, raised, resides there-in, and here I will be buried. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 19:21:00", 
        "title": "Obama was right all along.", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "The problem exists in government and the private sector, they are top heavy. Governments and private sectors could realize substantial cost reductions by trimming the fat at the top. The large percentage of the fat at the top are totally unnecessary. The people in the trenches are those who make the companies or the governments effective Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090504, 
        "postID": 9, 
        "quote": "", 
        "reply": "The problem exists in government and the private sector, they are top heavy. Governments and private sectors could realize substantial cost reductions by trimming the fat at the top. The large percentage of the fat at the top are totally unnecessary. The people in the trenches are those who make the companies or the governments effective Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 19:40:00", 
        "title": "Obama was right all along.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm? The only reason people are doing a lot of resent buying is that they wish they had got in when the stocks were way down below 7000. So they think the market is rising and they are all jumping in, causing a false rise. But if manufacturing doesn't see a turn-around, and one of the car companies takes another big hit, the housing market will crumple further, more banks will fold, and the bottom will fall right out, because the government has shot its wad, thrown in all its cards, and got nothing left of our money to throw away - - Wandering and Wondering", 
        "intTime": 20090504, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm?", 
        "reply": " The only reason people are doing a lot of resent buying is that they wish they had got in when the stocks were way down below 7000. So they think the market is rising and they are all jumping in, causing a false rise. But if manufacturing doesn't see a turn-around, and one of the car companies takes another big hit, the housing market will crumple further, more banks will fold, and the bottom will fall right out, because the government has shot its wad, thrown in all its cards, and got nothing left of our money to throw away - - Wandering and Wondering", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 20:28:00", 
        "title": "Obama was right all along.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Hang on boy's and girls, the ride is just getting started. 100 plus day's and counting, you ain't seen nothin yet! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090504, 
        "postID": 11, 
        "quote": "", 
        "reply": "Hang on boy's and girls, the ride is just getting started. 100 plus day's and counting, you ain't seen nothin yet! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 20:53:00", 
        "title": "Obama was right all along.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "the stock market is not the economy.", 
        "intTime": 20090504, 
        "postID": 12, 
        "quote": "", 
        "reply": "the stock market is not the economy.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 23:22:00", 
        "title": "Obama was right all along.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: the stock market is not the economy What world are you really living in????? Companies are publically traded on the stock market and when their stock tanks, so do they.", 
        "intTime": 20090504, 
        "postID": 13, 
        "quote": "the stock market is not the economy", 
        "reply": " What world are you really living in????? Companies are publically traded on the stock market and when their stock tanks, so do they.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-04 23:50:00", 
        "title": "Obama was right all along.", 
        "userID": "dhd123"
    }, 
    {
        "content": "quote: What world are you really living in????? reality. try it some time. quote: Companies are publically traded on the stock market and when their stock tanks, so do they. ok....and? The stock market is NOT the united states economy. When the stock market goes up that does NOT mean they economy is going up/doing good. same when it goes down. The stock market effects the economy and vice versa. But they are NOT the same thing. But mostly its the stock market that reacts to the economy.", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "What world are you really living in?????", 
        "reply": " reality. try it some time. quote: Companies are publically traded on the stock market and when their stock tanks, so do they. ok....and? The stock market is NOT the united states economy. When the stock market goes up that does NOT mean they economy is going up/doing good. same when it goes down. The stock market effects the economy and vice versa. But they are NOT the same thing. But mostly its the stock market that reacts to the economy.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 00:11:00", 
        "title": "Obama was right all along.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: But mostly its the stock market that reacts to the economy. That's partially true. More often though, investors are acting on what they believe will happen in the future.", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "But mostly its the stock market that reacts to the economy.", 
        "reply": " That's partially true. More often though, investors are acting on what they believe will happen in the future.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 00:57:00", 
        "title": "Obama was right all along.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: More often though, investors are acting on what they believe will happen in the future. that's what I was getting at(sorta) but you said it way better than I did.", 
        "intTime": 20090505, 
        "postID": 16, 
        "quote": "More often though, investors are acting on what they believe will happen in the future.", 
        "reply": " that's what I was getting at(sorta) but you said it way better than I did.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 01:05:00", 
        "title": "Obama was right all along.", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by sw614: quote: Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm? I hope it is the real thing, but I feel it is just an illusion, or the calm as you say. The markets are like yo-yos. not a reliable gauge of anything. One needs to look at the big picture over time to learn the truth. Yep, we will have to see where they are at 6 - 12 - 18 months from now when a trend can be determined.", 
        "intTime": 20090505, 
        "postID": 17, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by sw614: quote: Originally posted by Duster6: Stocks surge; S&P 500 joins Nasdaq in green for 2009. This is the headline on the usatoday.com newspaper. Is everything OK or is this just the quiet before the storm? I hope it is the real thing, but I feel it is just an illusion, or the calm as you say. The markets are like yo-yos. not a reliable gauge of anything. One needs to look at the big picture over time to learn the truth.", 
        "reply": " Yep, we will have to see where they are at 6 - 12 - 18 months from now when a trend can be determined.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 08:10:00", 
        "title": "Obama was right all along.", 
        "userID": "sw614"
    }, 
    {
        "content": "One thing Obama was right about, he said, change is coming. It is and most is not good! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090505, 
        "postID": 18, 
        "quote": "", 
        "reply": "One thing Obama was right about, he said, change is coming. It is and most is not good! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 09:08:00", 
        "title": "Obama was right all along.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "time will tell", 
        "intTime": 20090505, 
        "postID": 19, 
        "quote": "", 
        "reply": "time will tell", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 20:46:00", 
        "title": "Obama was right all along.", 
        "userID": "5727609"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: One thing Obama was right about, he said, change is coming. It is and most is not good! Have you seen the email about Obama funding 20.3 million to the victims of Gaza. That's right he is helped to fund bringing Hamas people to the UNITED STATES! Below is a copy of an email I received and checked it out. You be the judge! This guy needs to be impeached now! Subject: FW: Very Important Notice: Now we know why he got so much campaign money from the middle east! SCARY STUFF HAPPENING - Whether you are an Obama fan, or not, EVERYONE IN THE U. S. Needs to know.... Something happened... H.R. 1388 was passed yesterday, behind our backs. You may want to read about it. It wasn't mentioned on the news... Just went by on the ticker tape at the bottom of the CNN screen. Obama funds $20M in tax payer dollars to immigrate Hamas Refugees to the USA. This is the news that didn't make the headlines... By executive order, President Barack Obama has ordered the expenditure of $20.3 million in \"migration assistance\" to the Palestinian refugees and \"conflict victims\" in Gaza. The \"presidential determination\", which allows hundreds of thousands of Palestinians with ties to Hamas to resettle in the United States, was signed on January 27 and appeared in the Federal Register on February 4. Few on Capitol Hill, or in the media, took note that the order provides a free ticket replete with housing and food allowances to individuals who have displayed their overwhelming support to the Islamic Resistance Movement (Hamas) in the parliamentary election of January 2006. Let's review...itemized list of some of Barack Obama's most recent actions since his inauguration: His first call to any head of state, as president, was to Mahmoud Abbas, leader of Fatah party in the Palestinian territory. His first one-on-one television interview with any news organization was with Al Arabia television. His first executive order was to fund/facilitate abortion(s) not just here within the U. S., but within the world, using U. S. Tax payer funds. He ordered Guantanamo Bay closed and all military trials of detainees halted. He ordered overseas CIA interrogation centers closed. He withdrew all charges against the masterminds behind the USS Cole and the \"terror attack\" on 9/11. Now we learn that he is allowing hundreds of thousands of Palestinian refuges to move to, and live in, the US at American taxpayer expense. These important, and insightful, issues are being \"lost\" in the blinding bail-outs and \"stimulation\" packages. Doubtful? To verify this for yourself: go to the federal register PLEASE PASS THIS ON... AMERICA NEEDS TO KNOW WE are losing this country at a rapid pace.", 
        "intTime": 20090505, 
        "postID": 20, 
        "quote": "Originally posted by Bergy46: One thing Obama was right about, he said, change is coming. It is and most is not good!", 
        "reply": " Have you seen the email about Obama funding 20.3 million to the victims of Gaza. That's right he is helped to fund bringing Hamas people to the UNITED STATES! Below is a copy of an email I received and checked it out. You be the judge! This guy needs to be impeached now! Subject: FW: Very Important Notice: Now we know why he got so much campaign money from the middle east! SCARY STUFF HAPPENING - Whether you are an Obama fan, or not, EVERYONE IN THE U. S. Needs to know.... Something happened... H.R. 1388 was passed yesterday, behind our backs. You may want to read about it. It wasn't mentioned on the news... Just went by on the ticker tape at the bottom of the CNN screen. Obama funds $20M in tax payer dollars to immigrate Hamas Refugees to the USA. This is the news that didn't make the headlines... By executive order, President Barack Obama has ordered the expenditure of $20.3 million in \"migration assistance\" to the Palestinian refugees and \"conflict victims\" in Gaza. The \"presidential determination\", which allows hundreds of thousands of Palestinians with ties to Hamas to resettle in the United States, was signed on January 27 and appeared in the Federal Register on February 4. Few on Capitol Hill, or in the media, took note that the order provides a free ticket replete with housing and food allowances to individuals who have displayed their overwhelming support to the Islamic Resistance Movement (Hamas) in the parliamentary election of January 2006. Let's review...itemized list of some of Barack Obama's most recent actions since his inauguration: His first call to any head of state, as president, was to Mahmoud Abbas, leader of Fatah party in the Palestinian territory. His first one-on-one television interview with any news organization was with Al Arabia television. His first executive order was to fund/facilitate abortion(s) not just here within the U. S., but within the world, using U. S. Tax payer funds. He ordered Guantanamo Bay closed and all military trials of detainees halted. He ordered overseas CIA interrogation centers closed. He withdrew all charges against the masterminds behind the USS Cole and the \"terror attack\" on 9/11. Now we learn that he is allowing hundreds of thousands of Palestinian refuges to move to, and live in, the US at American taxpayer expense. These important, and insightful, issues are being \"lost\" in the blinding bail-outs and \"stimulation\" packages. Doubtful? To verify this for yourself: go to the federal register PLEASE PASS THIS ON... AMERICA NEEDS TO KNOW WE are losing this country at a rapid pace.", 
        "threadID": "5291911282_8810084222001", 
        "time": "2009-05-05 23:00:00", 
        "title": "Obama was right all along.", 
        "userID": "Studframer56"
    }
]