[
    {
        "content": "message removed until further notice from post....per message poster", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "message removed until further notice from post....per message poster", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-04-30 15:04:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "Benspeach99"
    }, 
    {
        "content": "Hmmm, this bs email made it here. You better check with Snopes. Cindy Williams from Laverne and Shirley DID NOT make this statement. Do a bit of fact checking before slandering someone on a public forum!!!!", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hmmm, this bs email made it here. You better check with Snopes. Cindy Williams from Laverne and Shirley DID NOT make this statement. Do a bit of fact checking before slandering someone on a public forum!!!!", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-04-30 15:08:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Ya know I really don't understand HollyWood!!!!! Think commiewood, and it will all become much more clear every time - - Wandering and Wondering", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "Ya know I really don't understand HollyWood!!!!!", 
        "reply": " Think commiewood, and it will all become much more clear every time - - Wandering and Wondering", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-01 20:54:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Ya know I really don't understand HollyWood!!!!! Think commiewood, and it will all become much more clear every time - - Frankly I don't think of Hollywood as having political leanings as much a bunch of slime balls that will suck up to whatever political stance will earn them the most money. That they often hurt the nation doesn't mean a thing to them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "Originally posted by greywolfghost: quote: Ya know I really don't understand HollyWood!!!!! Think commiewood, and it will all become much more clear every time - -", 
        "reply": " Frankly I don't think of Hollywood as having political leanings as much a bunch of slime balls that will suck up to whatever political stance will earn them the most money. That they often hurt the nation doesn't mean a thing to them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-02 06:00:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "It was interesting to see an interview with Kelsey Grammer (Frazier) back during the election about how hard it is to be a Republican in Hollyweird these days. If I ever really do understand Hollyweird, it'll be time to put me in a home. Don", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "", 
        "reply": "It was interesting to see an interview with Kelsey Grammer (Frazier) back during the election about how hard it is to be a Republican in Hollyweird these days. If I ever really do understand Hollyweird, it'll be time to put me in a home. Don", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-02 06:23:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "You'd best thank your lucky stars that you don't understand Hollywierd!! If you DID you would be in SERIOUS need of help, probably the kind of help that no one here is capable of giving you......In fact NOBODY is capable of helping them!!!", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "", 
        "reply": "You'd best thank your lucky stars that you don't understand Hollywierd!! If you DID you would be in SERIOUS need of help, probably the kind of help that no one here is capable of giving you......In fact NOBODY is capable of helping them!!!", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-02 08:43:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "tawodi"
    }, 
    {
        "content": "Those of us who lead decent live's don't understand Hollyweird!!! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "", 
        "reply": "Those of us who lead decent live's don't understand Hollyweird!!! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-02 09:13:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I think Vic hit the nail on the head: ANYTHING FOR A BUCK! Can't really believe they have an agenda, just pushing out any slop that sells. As long as the public keeps scooping it up (and paying for it), they are gonna keep slopping it out. No conscience, no thought, no morals...... sell, sell, sell!", 
        "intTime": 20090504, 
        "postID": 8, 
        "quote": "", 
        "reply": "I think Vic hit the nail on the head: ANYTHING FOR A BUCK! Can't really believe they have an agenda, just pushing out any slop that sells. As long as the public keeps scooping it up (and paying for it), they are gonna keep slopping it out. No conscience, no thought, no morals...... sell, sell, sell!", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-04 09:23:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: I think Vic hit the nail on the head: ANYTHING FOR A BUCK! Can't really believe they have an agenda, just pushing out any slop that sells. As long as the public keeps scooping it up (and paying for it), they are gonna keep slopping it out. No conscience, no thought, no morals...... sell, sell, sell! It's the Demographics that show that females between 13 and 30 drive that economy when it comes to what is sold and created. Everything is geared towards what they want and desire. Too much disposable income for little girls and parents who don't know what their little princess is doing. She is in that r-rated film with her girlfriend who can get them ID's. After she grows up she will get into the biggest and most expensive drama ever created outside of Hollyweird, yet inspired by some 14 year old producer who thinks wearing her underwear on the outside is cool. Maybe if parents control more of what their children are spending money on, then we can get the loons back on track with programming that everyone can enjoy. Another important tool is to just turn off the TV or change the channel when something weird comes on. TV's Parental controls work well in gearing your child towards a successful future and not one lined with posters and hopeless dreams. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090504, 
        "postID": 9, 
        "quote": "Originally posted by fmfdoc451: I think Vic hit the nail on the head: ANYTHING FOR A BUCK! Can't really believe they have an agenda, just pushing out any slop that sells. As long as the public keeps scooping it up (and paying for it), they are gonna keep slopping it out. No conscience, no thought, no morals...... sell, sell, sell!", 
        "reply": " It's the Demographics that show that females between 13 and 30 drive that economy when it comes to what is sold and created. Everything is geared towards what they want and desire. Too much disposable income for little girls and parents who don't know what their little princess is doing. She is in that r-rated film with her girlfriend who can get them ID's. After she grows up she will get into the biggest and most expensive drama ever created outside of Hollyweird, yet inspired by some 14 year old producer who thinks wearing her underwear on the outside is cool. Maybe if parents control more of what their children are spending money on, then we can get the loons back on track with programming that everyone can enjoy. Another important tool is to just turn off the TV or change the channel when something weird comes on. TV's Parental controls work well in gearing your child towards a successful future and not one lined with posters and hopeless dreams. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9990071222001", 
        "time": "2009-05-04 10:37:00", 
        "title": "Ya know I really don't understand HollyWood!!!!!", 
        "userID": "sargeant_green"
    }
]