[
    {
        "content": "quote: Originally posted by DSTremf: I think my favroite episode was when Aunt B. made pickles for the fair. They tasted so awful that Barny called them kerosene cucumbers. That was a good one. Remember when Aunt Bee's freezer broke down and she wouldn't spend the money to fix it? She got Gomer to work on it and afterwords it self destructed? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090301, 
        "postID": 11, 
        "quote": "Originally posted by DSTremf: I think my favroite episode was when Aunt B. made pickles for the fair. They tasted so awful that Barny called them kerosene cucumbers.", 
        "reply": " That was a good one. Remember when Aunt Bee's freezer broke down and she wouldn't spend the money to fix it? She got Gomer to work on it and afterwords it self destructed? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8430023612001", 
        "time": "2009-03-01 09:01:00", 
        "title": "The Andy Griffith Show", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I liked the one where 'Ol Rafe Hollister beat out Barney for the community singing show. Barney sang from the \"light classics\" Cheery Beery Bin and it was \"over the judges heads\"", 
        "intTime": 20090301, 
        "postID": 12, 
        "quote": "", 
        "reply": "I liked the one where 'Ol Rafe Hollister beat out Barney for the community singing show. Barney sang from the \"light classics\" Cheery Beery Bin and it was \"over the judges heads\"", 
        "threadID": "5291911282_8430023612001", 
        "time": "2009-03-01 09:19:00", 
        "title": "The Andy Griffith Show", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "That ol dry country humor on the Andy Griffith Show was good. None of that distasteful sleaze that on tv these day's! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090301, 
        "postID": 13, 
        "quote": "", 
        "reply": "That ol dry country humor on the Andy Griffith Show was good. None of that distasteful sleaze that on tv these day's! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8430023612001", 
        "time": "2009-03-01 15:15:00", 
        "title": "The Andy Griffith Show", 
        "userID": "Bergy46"
    }
]