[
    {
        "content": "I heard from my mother in law about the new announcement about health care for retirees from the military not getting health care any more. she listens to the news fox all day long. that cant happen. my husband was promised FREE health care for the rest of his life and mine. he could have gotten out and gone into business. he stayed 23 yrs and was affected by vietnam war..agent orange and tryethelchlorine...causing tons of problems..not shot ..unseen wounds...affecting his organs.. so...how can our president take away our health care when we fought the wars...and give health care to illegal aliens. how can that happen??? who is thinking up in DC. I think that No One is thinking. we fought a war for our country. He never did. if this happens there will be a war and not in some other land. we have fought for a while about this..first it was suppose to be FREE...we pay now and copays, we will not pay anymore for something that was suppose to be free... watch ..all our freedoms will be gone. when the government takes over, they own you and you are no longer free. has anyone heard this also. what do you think?", 
        "intTime": 20090316, 
        "postID": 1, 
        "quote": "", 
        "reply": "I heard from my mother in law about the new announcement about health care for retirees from the military not getting health care any more. she listens to the news fox all day long. that cant happen. my husband was promised FREE health care for the rest of his life and mine. he could have gotten out and gone into business. he stayed 23 yrs and was affected by vietnam war..agent orange and tryethelchlorine...causing tons of problems..not shot ..unseen wounds...affecting his organs.. so...how can our president take away our health care when we fought the wars...and give health care to illegal aliens. how can that happen??? who is thinking up in DC. I think that No One is thinking. we fought a war for our country. He never did. if this happens there will be a war and not in some other land. we have fought for a while about this..first it was suppose to be FREE...we pay now and copays, we will not pay anymore for something that was suppose to be free... watch ..all our freedoms will be gone. when the government takes over, they own you and you are no longer free. has anyone heard this also. what do you think?", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-16 23:53:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "mouse51"
    }, 
    {
        "content": "The government isn't going to take away our health care, they're just going to make wounded vets and retirees pay for it. \"The World's Finest\"", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "The government isn't going to take away our health care, they're just going to make wounded vets and retirees pay for it. \"The World's Finest\"", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-17 02:45:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Veterans Affairs Secretary Eric Shinseki confirmed Tuesday that the Obama administration is considering a controversial plan to make veterans pay for treatment of service-related injuries with private insurance. “http://www.healthcarebs.com/2009/03/13/obama-wants-wounded-vets-to-pay/” The American Legion Strongly Opposed to President's Plan to Charge Wounded Heroes for Treatment WASHINGTON, March 16 /PRNewswire-USNewswire/ -- The leader of the nation's largest veterans organization says he is \"deeply disappointed and concerned\" after a meeting with President Obama today to discuss a proposal to force private insurance companies to pay for the treatment of military veterans who have suffered service-connected disabilities and injuries. The Obama administration recently revealed a plan to require private insurance carriers to reimburse the Department of Veterans Affairs (VA) in such cases. \"It became apparent during our discussion today that the President intends to move forward with this unreasonable plan,\" said Commander David K. Rehbein of The American Legion. \"He says he is looking to generate $540-million by this method, but refused to hear arguments about the moral and government-avowed obligations that would be compromised by it.\" The Commander, clearly angered as he emerged from the session said, \"This reimbursement plan would be inconsistent with the mandate '... to care for him who shall have borne the battle...' given that the United States government sent members of the armed forces into harm's way, and not private insurance companies. I say again that The American Legion does not and will not support any plan that seeks to bill a veteran for treatment of a service connected disability at the very agency that was created to treat the unique need of America's veterans!\" Commander Rehbein was among a group of senior officials from veterans service organizations joining the President, White House Chief of Staff Rahm Emmanuel, Secretary of Veterans Affairs Eric Shinseki and Steven Kosiak, the overseer of defense spending at the Office of Management and Budget (OMB). The group's early afternoon conversation at The White House was precipitated by a letter of protest presented to the President earlier this month. The letter, co-signed by Commander Rehbein and the heads of ten colleague organizations, read, in part, \" There is simply no logical explanation for billing a veteran's personal insurance for care that the VA has a responsibility to provide. While we understand the fiscal difficulties this country faces right now, placing the burden of those fiscal problems on the men and women who have already sacrificed a great deal for this country is unconscionable.\" Commander Rehbein reiterated points made last week in testimony to both House and Senate Veterans' Affairs Committees. It was stated then that The American Legion believes that the reimbursement plan would be inconsistent with the mandate that VA treat service-connected injuries and disabilities given that the United States government sends members of the armed forces into harm's way, and not private insurance companies. The proposed requirement for these companies to reimburse the VA would not only be unfair, says the Legion, but would have an adverse impact on service-connected disabled veterans and their families. The Legion argues that, depending on the severity of the medical conditions involved, maximum insurance coverage limits could be reached through treatment of the veteran's condition alone. That would leave the rest of the family without health care benefits. The Legion also points out that many health insurance companies require deductibles to be paid before any benefits are covered. Additionally, the Legion is concerned that private insurance premiums would be elevated to cover service-connected disabled veterans and their families, especially if the veterans are self-employed or employed in small businesses unable to negotiate more favorable across-the-board insurance policy pricing. The American Legion also believes that some employers, especially small businesses, would be reluctant to hire veterans with service-connected disabilities due to the negative impact their employment might have on obtaining and financing company health care benefits. \"I got the distinct impression that the only hope of this plan not being enacted,\" said Commander Rehbein, \"is for an alternative plan to be developed that would generate the desired $540-million in revenue. The American Legion has long advocated for Medicare reimbursement to VA for the treatment of veterans. This, we believe, would more easily meet the President's financial goal. We will present that idea in an anticipated conference call with White House Chief of Staff Rahm Emmanuel in the near future. \"I only hope the administration will really listen to us then. This matter has far more serious ramifications than the President is imagining,\" concluded the Commander. “http://sev.prnewswire.com/health-care-hospitals/20090316/DC8455316032009-1.html” Senators slam a disgusting plan for wounded vets to use private insurance. “http://www.thecitizen.com/~citizen0/node/35598” Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "intTime": 20090317, 
        "postID": 3, 
        "quote": "", 
        "reply": "Veterans Affairs Secretary Eric Shinseki confirmed Tuesday that the Obama administration is considering a controversial plan to make veterans pay for treatment of service-related injuries with private insurance. “http://www.healthcarebs.com/2009/03/13/obama-wants-wounded-vets-to-pay/” The American Legion Strongly Opposed to President's Plan to Charge Wounded Heroes for Treatment WASHINGTON, March 16 /PRNewswire-USNewswire/ -- The leader of the nation's largest veterans organization says he is \"deeply disappointed and concerned\" after a meeting with President Obama today to discuss a proposal to force private insurance companies to pay for the treatment of military veterans who have suffered service-connected disabilities and injuries. The Obama administration recently revealed a plan to require private insurance carriers to reimburse the Department of Veterans Affairs (VA) in such cases. \"It became apparent during our discussion today that the President intends to move forward with this unreasonable plan,\" said Commander David K. Rehbein of The American Legion. \"He says he is looking to generate $540-million by this method, but refused to hear arguments about the moral and government-avowed obligations that would be compromised by it.\" The Commander, clearly angered as he emerged from the session said, \"This reimbursement plan would be inconsistent with the mandate '... to care for him who shall have borne the battle...' given that the United States government sent members of the armed forces into harm's way, and not private insurance companies. I say again that The American Legion does not and will not support any plan that seeks to bill a veteran for treatment of a service connected disability at the very agency that was created to treat the unique need of America's veterans!\" Commander Rehbein was among a group of senior officials from veterans service organizations joining the President, White House Chief of Staff Rahm Emmanuel, Secretary of Veterans Affairs Eric Shinseki and Steven Kosiak, the overseer of defense spending at the Office of Management and Budget (OMB). The group's early afternoon conversation at The White House was precipitated by a letter of protest presented to the President earlier this month. The letter, co-signed by Commander Rehbein and the heads of ten colleague organizations, read, in part, \" There is simply no logical explanation for billing a veteran's personal insurance for care that the VA has a responsibility to provide. While we understand the fiscal difficulties this country faces right now, placing the burden of those fiscal problems on the men and women who have already sacrificed a great deal for this country is unconscionable.\" Commander Rehbein reiterated points made last week in testimony to both House and Senate Veterans' Affairs Committees. It was stated then that The American Legion believes that the reimbursement plan would be inconsistent with the mandate that VA treat service-connected injuries and disabilities given that the United States government sends members of the armed forces into harm's way, and not private insurance companies. The proposed requirement for these companies to reimburse the VA would not only be unfair, says the Legion, but would have an adverse impact on service-connected disabled veterans and their families. The Legion argues that, depending on the severity of the medical conditions involved, maximum insurance coverage limits could be reached through treatment of the veteran's condition alone. That would leave the rest of the family without health care benefits. The Legion also points out that many health insurance companies require deductibles to be paid before any benefits are covered. Additionally, the Legion is concerned that private insurance premiums would be elevated to cover service-connected disabled veterans and their families, especially if the veterans are self-employed or employed in small businesses unable to negotiate more favorable across-the-board insurance policy pricing. The American Legion also believes that some employers, especially small businesses, would be reluctant to hire veterans with service-connected disabilities due to the negative impact their employment might have on obtaining and financing company health care benefits. \"I got the distinct impression that the only hope of this plan not being enacted,\" said Commander Rehbein, \"is for an alternative plan to be developed that would generate the desired $540-million in revenue. The American Legion has long advocated for Medicare reimbursement to VA for the treatment of veterans. This, we believe, would more easily meet the President's financial goal. We will present that idea in an anticipated conference call with White House Chief of Staff Rahm Emmanuel in the near future. \"I only hope the administration will really listen to us then. This matter has far more serious ramifications than the President is imagining,\" concluded the Commander. “http://sev.prnewswire.com/health-care-hospitals/20090316/DC8455316032009-1.html” Senators slam a disgusting plan for wounded vets to use private insurance. “http://www.thecitizen.com/~citizen0/node/35598” Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-17 03:51:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "ReaperDoc"
    }, 
    {
        "content": "where do you guys get the great icons on your posts..let me know ok... now for the serious stuff...my father is WWII vet...my husband vietnam and gulf war vet and my two sons are middle east conflict war vets..I want the gov to honor their promises..my father and husband stayed in the military to go into two wars...they stayed because they were told that if they did then their health care and their famileis health care would be taken care of..THE WAY I SEE IT ITS A CONTRACT ..ONCE AGAIN OBAMA TRIES TO BREAK CONTRACTS... he is starting up his own government ...who does he think he is...let me tell you some things i have had to go through..two of my kids had severe problems..one had fungus in his entire body ..he was going to another country as a misisonary and before he could go he had to clear that up..well, my husband had retired by then and tricare was in fullforce...the idiot that took care of my son was civilian dr in kansas state area....he refused to get on the phone and say why my son needed a particular medicine before the gov would pay for it..i had to get on the phone and beg and soft soap that ....I will leave out the explitives..and he finally relented telling me...YOU GET WHAT YOU PAY FOR.... then my other son .by the way I have 5 kids one girl and 4 boys..all are adults and great people..well, my other son had this disease genetically inherited...polynoidal cyts that have to be cut out..one of my sons older than this one had it but I didnt realize it was the same thing as the symptoms were different..theolder one I took to the military in kansas and they recognized it right away and did the surgery and showed me how to care for it and sent me home with the stuff to do it ..it was great I saw a miracle happen..well, the younger son..I had taken him to the kansas hosp several times and was given pain killer for him ..not...and then he was diagnosed with somehting I knew it wasnt..so I went home in disgust and upset and got on my computer and put in his symptoms and bang..it came out with the polynoidal cysts..i realized after reading what it was and how it was treated that my other son had it..so I called a different hospital and asked for a surgeon and told him I wanted surgery on my son who had polynoidal cysts and he said how did i know and who was the referring physician and I said me and my computer....well, he laughed but said come in and i did..so my son had surgery ..after the surgery I was sent home with nohing..I began to wonder what to do becaus this dr did the surgery but sewed up the wound the other one left it open and i changed his gauze 3 times a day and saw it heal from the bottom up ...it was great..but this one said it was his surgery and he sewed it up..when I asked how to care for it that way ..he said....YOU GET WHAT YOU PAY FOR.. to ask his nurse..so she called me later and said...to shave the wound which was about 6-7 inches long every day...every day...and squeeze the wound so old blood would come out..whew... so you can see what I mean... I GET WHAT I PAY FOR...WHAT THE GOV DOES IS PAY ALMOST NOTHING..PRIVATE INSURANCE..PLEASE..WE HAVE THAT ALREADY WITH TRICARE..I HAVE TRICARE PRIME...WE TRIED BLUE CROSS BLUE SHIELD ..ONE FORM OF IT AND IT WAS WORSE...THEY KEPT DENYING PAYMENT..I HAD TO FIGHT THEM AS MUCH... Im a mom who has had to fight continuously a war that one cannot see..i even wrote a poem about it....my father fought in wwII my husband fought in vietnam and my sons fought in the middle east and I seem to be fighting something I cannot quite see and all I look for is just a little peace... anyway...it wont work..they are trying to push the vets away and esp the old..when a socialistic communisitc gov gets started...the old are pushed away adn the deformed....however, obama...lets see..he is wanting FREE HEALTH CARE FOR ILLEGALS..YET HE DOESNT WANT TO TAKE CARE OF PEOPLE WHO HAVE GONE OUT AND RISKED THEIR LIVES FOR THEIR COUNTRY....WHAT IS HAPPENING..READ SOME OF THE OTHER POSTS IN OTHER SITES..ESP THE CONSPIRACY SITES..MIND YOU..POSTINGS GO THERE IF THIS SITE FEELS THERE IS A CONSPIRACY..EVEN WHEN A PERSON DONEST MEAN FOR IT TO BE... I REALIZE HE IS OUR COMMANDER N CHIEF...BUT IM SPEAKING OF HIM AS JUST A REGULAR PRESIDENT...I DONT LIKE SOME OF THE THINGS HE IS DOING AND THE VETS CARE IS ONE...OTHERS HE IS PRO ABORTION AND HE WANTS TO CHANGE OUR MONEY TO REFLECT ..OR NOT HAVE \"IN GOD WE TRUST\"...ON IT...HE WANTS CHANGE BUT HIS CHANGE IS NOT THE KIND WE WANT..AND I DIDNT VOTE FOR HIM...IM PRO LIFE...", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "where do you guys get the great icons on your posts..let me know ok... now for the serious stuff...my father is WWII vet...my husband vietnam and gulf war vet and my two sons are middle east conflict war vets..I want the gov to honor their promises..my father and husband stayed in the military to go into two wars...they stayed because they were told that if they did then their health care and their famileis health care would be taken care of..THE WAY I SEE IT ITS A CONTRACT ..ONCE AGAIN OBAMA TRIES TO BREAK CONTRACTS... he is starting up his own government ...who does he think he is...let me tell you some things i have had to go through..two of my kids had severe problems..one had fungus in his entire body ..he was going to another country as a misisonary and before he could go he had to clear that up..well, my husband had retired by then and tricare was in fullforce...the idiot that took care of my son was civilian dr in kansas state area....he refused to get on the phone and say why my son needed a particular medicine before the gov would pay for it..i had to get on the phone and beg and soft soap that ....I will leave out the explitives..and he finally relented telling me...YOU GET WHAT YOU PAY FOR.... then my other son .by the way I have 5 kids one girl and 4 boys..all are adults and great people..well, my other son had this disease genetically inherited...polynoidal cyts that have to be cut out..one of my sons older than this one had it but I didnt realize it was the same thing as the symptoms were different..theolder one I took to the military in kansas and they recognized it right away and did the surgery and showed me how to care for it and sent me home with the stuff to do it ..it was great I saw a miracle happen..well, the younger son..I had taken him to the kansas hosp several times and was given pain killer for him ..not...and then he was diagnosed with somehting I knew it wasnt..so I went home in disgust and upset and got on my computer and put in his symptoms and bang..it came out with the polynoidal cysts..i realized after reading what it was and how it was treated that my other son had it..so I called a different hospital and asked for a surgeon and told him I wanted surgery on my son who had polynoidal cysts and he said how did i know and who was the referring physician and I said me and my computer....well, he laughed but said come in and i did..so my son had surgery ..after the surgery I was sent home with nohing..I began to wonder what to do becaus this dr did the surgery but sewed up the wound the other one left it open and i changed his gauze 3 times a day and saw it heal from the bottom up ...it was great..but this one said it was his surgery and he sewed it up..when I asked how to care for it that way ..he said....YOU GET WHAT YOU PAY FOR.. to ask his nurse..so she called me later and said...to shave the wound which was about 6-7 inches long every day...every day...and squeeze the wound so old blood would come out..whew... so you can see what I mean... I GET WHAT I PAY FOR...WHAT THE GOV DOES IS PAY ALMOST NOTHING..PRIVATE INSURANCE..PLEASE..WE HAVE THAT ALREADY WITH TRICARE..I HAVE TRICARE PRIME...WE TRIED BLUE CROSS BLUE SHIELD ..ONE FORM OF IT AND IT WAS WORSE...THEY KEPT DENYING PAYMENT..I HAD TO FIGHT THEM AS MUCH... Im a mom who has had to fight continuously a war that one cannot see..i even wrote a poem about it....my father fought in wwII my husband fought in vietnam and my sons fought in the middle east and I seem to be fighting something I cannot quite see and all I look for is just a little peace... anyway...it wont work..they are trying to push the vets away and esp the old..when a socialistic communisitc gov gets started...the old are pushed away adn the deformed....however, obama...lets see..he is wanting FREE HEALTH CARE FOR ILLEGALS..YET HE DOESNT WANT TO TAKE CARE OF PEOPLE WHO HAVE GONE OUT AND RISKED THEIR LIVES FOR THEIR COUNTRY....WHAT IS HAPPENING..READ SOME OF THE OTHER POSTS IN OTHER SITES..ESP THE CONSPIRACY SITES..MIND YOU..POSTINGS GO THERE IF THIS SITE FEELS THERE IS A CONSPIRACY..EVEN WHEN A PERSON DONEST MEAN FOR IT TO BE... I REALIZE HE IS OUR COMMANDER N CHIEF...BUT IM SPEAKING OF HIM AS JUST A REGULAR PRESIDENT...I DONT LIKE SOME OF THE THINGS HE IS DOING AND THE VETS CARE IS ONE...OTHERS HE IS PRO ABORTION AND HE WANTS TO CHANGE OUR MONEY TO REFLECT ..OR NOT HAVE \"IN GOD WE TRUST\"...ON IT...HE WANTS CHANGE BUT HIS CHANGE IS NOT THE KIND WE WANT..AND I DIDNT VOTE FOR HIM...IM PRO LIFE...", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-20 23:07:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "mouse51"
    }, 
    {
        "content": "Wake up, Mouse. Obama is not doing anything new. The notion that there is a binding contract between the government and servicemembers to provide no-cost health care to them and their families was tossed out by nothing less than the US Supreme Court several decades ago (the '70s, if I remember right; maybe the '80s). Such promises were commonly cited in recruiting literature distributed by all the services, but that did not matter to SCOTUS. The decision was that the \"contract,\" such as it was, was only whatever Congress said it was, and could be modified, enhanced, reduced or even eliminated ... LEGALLY. I've been paying premiums for retiree health care since I retired in 1993. Now back on active duty, it's all free again. The fact that those who are actively serving, and their families, still get essentially cost-free health care is a minor miracle these days - though the system has changed radically even in the 15 years since I first retired. And by the way - please stop sharing all the intimate medical details of your family's lives. I'm sure they wouldn't appreciate it, and we certainly don't need to know all that. There's also no such thing as \"polynoidal cyts,\" though I think I know to what you're referring. If you're going to insist on using medical terminology, at least look it up so you can spell it correctly. PS. Reaper - the Administration has dropped the idea of insurers paying for health care related to service-connected disabilities/conditions. They got the message from vets and Congress loud and clear on that one, according to the White House Press Secretary.", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "", 
        "reply": "Wake up, Mouse. Obama is not doing anything new. The notion that there is a binding contract between the government and servicemembers to provide no-cost health care to them and their families was tossed out by nothing less than the US Supreme Court several decades ago (the '70s, if I remember right; maybe the '80s). Such promises were commonly cited in recruiting literature distributed by all the services, but that did not matter to SCOTUS. The decision was that the \"contract,\" such as it was, was only whatever Congress said it was, and could be modified, enhanced, reduced or even eliminated ... LEGALLY. I've been paying premiums for retiree health care since I retired in 1993. Now back on active duty, it's all free again. The fact that those who are actively serving, and their families, still get essentially cost-free health care is a minor miracle these days - though the system has changed radically even in the 15 years since I first retired. And by the way - please stop sharing all the intimate medical details of your family's lives. I'm sure they wouldn't appreciate it, and we certainly don't need to know all that. There's also no such thing as \"polynoidal cyts,\" though I think I know to what you're referring. If you're going to insist on using medical terminology, at least look it up so you can spell it correctly. PS. Reaper - the Administration has dropped the idea of insurers paying for health care related to service-connected disabilities/conditions. They got the message from vets and Congress loud and clear on that one, according to the White House Press Secretary.", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-21 03:22:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Obama's Chief of staff was the one who recommended this notion about Vets paying for their own health care. When it was proposed it lasted one day before it was dropped. Obama knows that if he was to do this on his watch he would never get re-elected. Besides when Murtha first heard about it he almost choked on his 3lb. Lobster stuffed with crab meat and called up Obama and protested. Besides I'm sure if this would have gone forward all the living Medal of Honor recipients would get together and give back their medals with Fox news coving the story.", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "", 
        "reply": "Obama's Chief of staff was the one who recommended this notion about Vets paying for their own health care. When it was proposed it lasted one day before it was dropped. Obama knows that if he was to do this on his watch he would never get re-elected. Besides when Murtha first heard about it he almost choked on his 3lb. Lobster stuffed with crab meat and called up Obama and protested. Besides I'm sure if this would have gone forward all the living Medal of Honor recipients would get together and give back their medals with Fox news coving the story.", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-21 04:09:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "Duster6"
    }, 
    {
        "content": "Good Lord! The amount of mis-information out there is astonishing. And what's even more astonishing is just how readily some people will believe any lie they're told, so long as it's about Barack Obama.", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "", 
        "reply": "Good Lord! The amount of mis-information out there is astonishing. And what's even more astonishing is just how readily some people will believe any lie they're told, so long as it's about Barack Obama.", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-21 06:27:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "stillkit"
    }, 
    {
        "content": "Moderator Hat off. For the last ten or so years Medical Treatment Facilities have been requiring members to provide the name and policy number of any insurance polices that may cover part or all of the treatment or prescriptions. IF you had no such policy then you were required sign a statement saying you had no such policy. At lease that was the policy at Mac Dill AFB FL, Coast Guard Station Clearwater FL, Ft. Stewart GA, the NNMC, and Schofield Barracks HI. At least my wife and had to complete such a form. We felt that it was appropriate for the military claim the insurance payment that would go to any civilian medical facility. OAL I just put the hat back on. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090321, 
        "postID": 8, 
        "quote": "", 
        "reply": "Moderator Hat off. For the last ten or so years Medical Treatment Facilities have been requiring members to provide the name and policy number of any insurance polices that may cover part or all of the treatment or prescriptions. IF you had no such policy then you were required sign a statement saying you had no such policy. At lease that was the policy at Mac Dill AFB FL, Coast Guard Station Clearwater FL, Ft. Stewart GA, the NNMC, and Schofield Barracks HI. At least my wife and had to complete such a form. We felt that it was appropriate for the military claim the insurance payment that would go to any civilian medical facility. OAL I just put the hat back on. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-21 07:22:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Gee Mr. President, Thank you for looking out for the men and women who served our country! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090321, 
        "postID": 9, 
        "quote": "", 
        "reply": "Gee Mr. President, Thank you for looking out for the men and women who served our country! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1060060812001", 
        "time": "2009-03-21 08:19:00", 
        "title": "RETIREE HEALTH CARE", 
        "userID": "Bergy46"
    }
]