[
    {
        "content": "Good idea. A girl in our neighborhood wants to join, her father refuses to take her to the recruiting office and said he won't be coming ot any graduations and it is a waste of her time. My dh said he would take her. What's your opinion? She is also think about the air force as well.", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "Good idea. A girl in our neighborhood wants to join, her father refuses to take her to the recruiting office and said he won't be coming ot any graduations and it is a waste of her time. My dh said he would take her. What's your opinion? She is also think about the air force as well.", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 11:07:00", 
        "title": "Navy for Girls", 
        "userID": "Opalfire"
    }, 
    {
        "content": "quote: Originally posted by Opalfire: Good idea. A girl in our neighborhood wants to join, her father refuses to take her to the recruiting office and said he won't be coming ot any graduations and it is a waste of her time. My dh said he would take her. What's your opinion? She is also think about the air force as well. Is she 18 or older? If not stay away!!!!", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "Originally posted by Opalfire: Good idea. A girl in our neighborhood wants to join, her father refuses to take her to the recruiting office and said he won't be coming ot any graduations and it is a waste of her time. My dh said he would take her. What's your opinion? She is also think about the air force as well.", 
        "reply": " Is she 18 or older? If not stay away!!!!", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 11:17:00", 
        "title": "Navy for Girls", 
        "userID": "BoatsBM1"
    }, 
    {
        "content": "opal......boats pretty much hit it on the head. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "opal......boats pretty much hit it on the head. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 11:39:00", 
        "title": "Navy for Girls", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I've read several of Opals' posts in the past and believe in the OP's credibility, so I post the following in response: I feel sorry for her father that he can't understand or support his daughters' decision. THis just may be the only way out of a dead end existence or way to work towards an education and degree at the same time. THe U.S. Navy provided me a way to develop into a responsible adult, a great education, a fabulous career, and now, retirement money with a new and rewarding career in the defense industry. The U.S. Military (ANY branch) is one of the most rewarding jobs that can be found on the planet. Where else can you interact with people of different ethnic backgrounds and cultures, travel to different parts of the globe, and learn leadership at such an early stage in your life? Whether he was soured on the military himself or never cared for it in the first place, he should at least be man, and father, enough to listen to his daughter in the first place. I guess that maybe I should feel sorry for her that she has a father that won't listen.", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "", 
        "reply": "I've read several of Opals' posts in the past and believe in the OP's credibility, so I post the following in response: I feel sorry for her father that he can't understand or support his daughters' decision. THis just may be the only way out of a dead end existence or way to work towards an education and degree at the same time. THe U.S. Navy provided me a way to develop into a responsible adult, a great education, a fabulous career, and now, retirement money with a new and rewarding career in the defense industry. The U.S. Military (ANY branch) is one of the most rewarding jobs that can be found on the planet. Where else can you interact with people of different ethnic backgrounds and cultures, travel to different parts of the globe, and learn leadership at such an early stage in your life? Whether he was soured on the military himself or never cared for it in the first place, he should at least be man, and father, enough to listen to his daughter in the first place. I guess that maybe I should feel sorry for her that she has a father that won't listen.", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 13:04:00", 
        "title": "Navy for Girls", 
        "userID": "gsuchey"
    }, 
    {
        "content": "Moderator's Hat Off Boats hit on the head. It makes me sad that some parents would place any limit on their love and commitment to their children. It is also sad, when a child, of any age, does things out of site to their parents. I married an AF girl we have a daughter in the Coast Guard and she has one daughter in the CG reserves and one daughter currently in AF BMT. The girls finished the college before they enlisted. My recommendation to teens respect your parents wishes to the fullest extent possible. And my recommendation to parents is trust the child you raised. Finally, do your best not to get caught in the middle of a family fight. That's the way this old solider sees it. This message has been edited. Last edited by: OldArmyLove, Sat 25 April 2009 04:44 PM God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Moderator's Hat Off Boats hit on the head. It makes me sad that some parents would place any limit on their love and commitment to their children. It is also sad, when a child, of any age, does things out of site to their parents. I married an AF girl we have a daughter in the Coast Guard and she has one daughter in the CG reserves and one daughter currently in AF BMT. The girls finished the college before they enlisted. My recommendation to teens respect your parents wishes to the fullest extent possible. And my recommendation to parents is trust the child you raised. Finally, do your best not to get caught in the middle of a family fight. That's the way this old solider sees it. This message has been edited. Last edited by: OldArmyLove, Sat 25 April 2009 04:44 PM God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 13:07:00", 
        "title": "Navy for Girls", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by Opalfire: Good idea. A girl in our neighborhood wants to join, her father refuses to take her to the recruiting office and said he won't be coming ot any graduations and it is a waste of her time. My dh said he would take her. What's your opinion? She is also think about the air force as well. Air Force - Yeah!! I'd be careful about crossing family lines. If the gal gets hurt or killed, who will get blamed?? The uniform of any service sometimes carries a very heavy price tag. Ya gotta be willing and able to pay it all the way - -! Wandering and Wondering", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "Originally posted by Opalfire: Good idea. A girl in our neighborhood wants to join, her father refuses to take her to the recruiting office and said he won't be coming ot any graduations and it is a waste of her time. My dh said he would take her. What's your opinion? She is also think about the air force as well.", 
        "reply": " Air Force - Yeah!! I'd be careful about crossing family lines. If the gal gets hurt or killed, who will get blamed?? The uniform of any service sometimes carries a very heavy price tag. Ya gotta be willing and able to pay it all the way - -! Wandering and Wondering", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 13:41:00", 
        "title": "Navy for Girls", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Some mom's n dad's just can't cut the apron strings. Navy and the AF are good ideas. She should come out with some good technical skills. I had a gf that went AF and they were going to make her an illustrator.", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "", 
        "reply": "Some mom's n dad's just can't cut the apron strings. Navy and the AF are good ideas. She should come out with some good technical skills. I had a gf that went AF and they were going to make her an illustrator.", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 13:59:00", 
        "title": "Navy for Girls", 
        "userID": "azmax64"
    }, 
    {
        "content": "BoatsBM1; quote: Is she 18 or older? If not stay away!!!! I agree 100% otherwise your interfering in a parents authority over their child. let's look at it another way, would you want one of your neighbors to take your child to do something you, as the parent said NO too??? Maybe he would like her to go college--and him pay for it.. Maybe he is afraid she would be sent off to war and would be killed, and doesn't want to lose his daughter so young, or maybe he's reading all the reports of problems women have while in the military and doesn't want her exposed to those things..and he's merely trying to protect her (as a father should protect his daughter--by some people's belief) So maybe before you get involved in taking her any where..you should talk to the father and find out his reasons.. There could be many reasons why a father wouldn't desire his daughter to serve in the military..not all of them necessarily logical, but there could be many reasons..", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "Is she 18 or older? If not stay away!!!!", 
        "reply": "BoatsBM1;  I agree 100% otherwise your interfering in a parents authority over their child. let's look at it another way, would you want one of your neighbors to take your child to do something you, as the parent said NO too??? Maybe he would like her to go college--and him pay for it.. Maybe he is afraid she would be sent off to war and would be killed, and doesn't want to lose his daughter so young, or maybe he's reading all the reports of problems women have while in the military and doesn't want her exposed to those things..and he's merely trying to protect her (as a father should protect his daughter--by some people's belief) So maybe before you get involved in taking her any where..you should talk to the father and find out his reasons.. There could be many reasons why a father wouldn't desire his daughter to serve in the military..not all of them necessarily logical, but there could be many reasons..", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 15:53:00", 
        "title": "Navy for Girls", 
        "userID": "3678131"
    }, 
    {
        "content": "Just have her make a phone call to the Navy recruiter and I'm sure he/she will make a house call. That way you don't have to get involved.", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "", 
        "reply": "Just have her make a phone call to the Navy recruiter and I'm sure he/she will make a house call. That way you don't have to get involved.", 
        "threadID": "5291911282_8750057122001", 
        "time": "2009-04-25 16:35:00", 
        "title": "Navy for Girls", 
        "userID": "Duster6"
    }
]