[
    {
        "content": "Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "", 
        "reply": "Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 15:38:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC? Supply and Demand in a capitalistic society my friend. If your demand stays roughly static after a significant price increase why would you lower your prices and lose revenue. I would speculate that demand for the farmers product is actually the same, price increase or not. Fairness has never been apart of our system", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "reply": " Supply and Demand in a capitalistic society my friend. If your demand stays roughly static after a significant price increase why would you lower your prices and lose revenue. I would speculate that demand for the farmers product is actually the same, price increase or not. Fairness has never been apart of our system", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 15:53:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "nn68"
    }, 
    {
        "content": "Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "", 
        "reply": "Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:03:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC? Farmers gotta take it if they can get it. Try farming and you'll find out why. They borrow money for seed, fertilizer, fuel, equipment, etc etc etc, hoping people will even buy what they plant. If they are REALLY lucky, the bugs and weather and sun don't ruin their crop. But if they have a bumper crop, they gotta hope their neighbor loses everything, or he'll have a bumper crop too - and too much product means the prices will plummet!! Then, he's got to harvest it and ship it to market, getting gouged and screwed at every turn by the haulers and railroads - and again he's got to beat his neighbor to market right at the instant his crop is coming ripe. If he's early, people won't buy because the flavor is wrong. If he's late, his neighbor has the market and his own crop begins to go bad and rot. Even if he gets top dollar, he'll be damned lucky to break even on all his loans and have enough to buy his kids Christmas. Then he has to take out a bunch of loans for seed and fertilizer and fuel, and start all over again - - Not too surprising that most of our fruits and vegetables come from outside the country, as farmers either give up and abandon the land, or subdivide it all up for houses - the final cash crop.... But a glut has even killed that market - - Why do I know this to be true? Because I ranched and farmed all my younger days with grandparents, uncles and a father that pretty much lost it all - hoping the next year would finally pay the bills - - That's why, if you have hundred or thousands of acres of land you're trying to farm, you're \"acre rich, but dirt poor\"! Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "reply": " Farmers gotta take it if they can get it. Try farming and you'll find out why. They borrow money for seed, fertilizer, fuel, equipment, etc etc etc, hoping people will even buy what they plant. If they are REALLY lucky, the bugs and weather and sun don't ruin their crop. But if they have a bumper crop, they gotta hope their neighbor loses everything, or he'll have a bumper crop too - and too much product means the prices will plummet!! Then, he's got to harvest it and ship it to market, getting gouged and screwed at every turn by the haulers and railroads - and again he's got to beat his neighbor to market right at the instant his crop is coming ripe. If he's early, people won't buy because the flavor is wrong. If he's late, his neighbor has the market and his own crop begins to go bad and rot. Even if he gets top dollar, he'll be damned lucky to break even on all his loans and have enough to buy his kids Christmas. Then he has to take out a bunch of loans for seed and fertilizer and fuel, and start all over again - - Not too surprising that most of our fruits and vegetables come from outside the country, as farmers either give up and abandon the land, or subdivide it all up for houses - the final cash crop.... But a glut has even killed that market - - Why do I know this to be true? Because I ranched and farmed all my younger days with grandparents, uncles and a father that pretty much lost it all - hoping the next year would finally pay the bills - - That's why, if you have hundred or thousands of acres of land you're trying to farm, you're \"acre rich, but dirt poor\"! Wandering and Wondering", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:17:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness.", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:34:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Tomatoes. . . $1.50/pd day before yesterday at the grocery store. They were California grown tomatoes, but the lemons on the backyard tree are free. But, you can only eat so many before you turn into a frog.", 
        "intTime": 20090326, 
        "postID": 6, 
        "quote": "", 
        "reply": "Tomatoes. . . $1.50/pd day before yesterday at the grocery store. They were California grown tomatoes, but the lemons on the backyard tree are free. But, you can only eat so many before you turn into a frog.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:41:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness. The only time any of my relatives got a \"subsidy\" is when the Feds showed up on grandad's ranch during the Depression, bought the majority of his cattle at 50 cents a head, drove them out on the desert and shot them all to get them off the market, about 1000 head prime Hereford beef. They called it \"priming the pump.\" Grandad went into a funk which he never quite came out of until he died. Grandma went insane and died just after the War. How close are we to that happening again?? Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 7, 
        "quote": "Originally posted by DCookeUSA1: Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness.", 
        "reply": " The only time any of my relatives got a \"subsidy\" is when the Feds showed up on grandad's ranch during the Depression, bought the majority of his cattle at 50 cents a head, drove them out on the desert and shot them all to get them off the market, about 1000 head prime Hereford beef. They called it \"priming the pump.\" Grandad went into a funk which he never quite came out of until he died. Grandma went insane and died just after the War. How close are we to that happening again?? Wandering and Wondering", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:54:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather. I tried that last year but all the little mexican kids that live in the trailer park stole my maters.", 
        "intTime": 20090326, 
        "postID": 8, 
        "quote": "Originally posted by sargeant_green: Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather.", 
        "reply": " I tried that last year but all the little mexican kids that live in the trailer park stole my maters.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 18:44:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Tomatoes are the easiest thing to grow. Actually, I think potatoes are. So far as I know, they are the only common vegetable grown in all 50 states, though not always in commercial quantities.", 
        "intTime": 20090326, 
        "postID": 9, 
        "quote": "Originally posted by sargeant_green: Tomatoes are the easiest thing to grow.", 
        "reply": " Actually, I think potatoes are. So far as I know, they are the only common vegetable grown in all 50 states, though not always in commercial quantities.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 18:50:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "stillkit"
    }, 
    {
        "content": "GWG, we're at that point right now.", 
        "intTime": 20090326, 
        "postID": 10, 
        "quote": "", 
        "reply": "GWG, we're at that point right now.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 20:30:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes? Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090326, 
        "postID": 11, 
        "quote": "", 
        "reply": "Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes? Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 20:50:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes? The soil will hold in the bucket and you poke your finger in and then the start. You can put enough potting soil in to cover the holes, put in the starts, punch the soil down around the starts from the inside working to hold it in place from the outside. Then fill the bucket two or three inches from the rim. You have to learn the watering technique for yourself. Too much and you can wash out the starts. Hole size is another preference. 1 in. holes work as well as two inch. The size of a tomato stalk is variable but the hole needs to be big enough to let it take water into the stem and not grow to choke itself off. Try painting the buckets a darker color, or get a blue or gray bucket. Dark plastic for the cold months and then take it off in the summer. Just a dark color to warm the soil. You can drape a clear plastic film over the bottom of the bucket to about 1 ft. below the bottom to ward off some frost. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090326, 
        "postID": 12, 
        "quote": "Originally posted by Bergy46: Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes?", 
        "reply": " The soil will hold in the bucket and you poke your finger in and then the start. You can put enough potting soil in to cover the holes, put in the starts, punch the soil down around the starts from the inside working to hold it in place from the outside. Then fill the bucket two or three inches from the rim. You have to learn the watering technique for yourself. Too much and you can wash out the starts. Hole size is another preference. 1 in. holes work as well as two inch. The size of a tomato stalk is variable but the hole needs to be big enough to let it take water into the stem and not grow to choke itself off. Try painting the buckets a darker color, or get a blue or gray bucket. Dark plastic for the cold months and then take it off in the summer. Just a dark color to warm the soil. You can drape a clear plastic film over the bottom of the bucket to about 1 ft. below the bottom to ward off some frost. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 21:46:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "wow all that just to plant some tomatoes. i'm loving it.", 
        "intTime": 20090327, 
        "postID": 13, 
        "quote": "", 
        "reply": "wow all that just to plant some tomatoes. i'm loving it.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 07:41:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "specialist_green"
    }, 
    {
        "content": "I'm waiting to hear from private-green next.", 
        "intTime": 20090327, 
        "postID": 14, 
        "quote": "", 
        "reply": "I'm waiting to hear from private-green next.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:24:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Thanks Sarge, Duster, I heard that Pvt. Green got a field promotion to Lt. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090327, 
        "postID": 15, 
        "quote": "", 
        "reply": "Thanks Sarge, Duster, I heard that Pvt. Green got a field promotion to Lt. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:29:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Lord have Mercy.", 
        "intTime": 20090327, 
        "postID": 16, 
        "quote": "", 
        "reply": "Lord have Mercy.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:50:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090327, 
        "postID": 17, 
        "quote": "Originally posted by Duster6: I'm waiting to hear from private-green next.", 
        "reply": " Specialist_Green used to outrank me but then I got another stripe and the rest is history. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:55:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "A couple more weeks, you can plant your own. I gotta turn over the garden this weekend. Nothing tastes as good, as when you grow it yourself.", 
        "intTime": 20090327, 
        "postID": 18, 
        "quote": "", 
        "reply": "A couple more weeks, you can plant your own. I gotta turn over the garden this weekend. Nothing tastes as good, as when you grow it yourself.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 09:46:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Square that young_green away, there Sgt._green!", 
        "intTime": 20090327, 
        "postID": 19, 
        "quote": "Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history.", 
        "reply": " Square that young_green away, there Sgt._green!", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 09:48:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Square that young_green away, there Sgt._green! Actually he has four years on me. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090327, 
        "postID": 20, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Square that young_green away, there Sgt._green!", 
        "reply": " Actually he has four years on me. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 09:51:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "intTime": 20090326, 
        "postID": 21, 
        "quote": "", 
        "reply": "Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 15:38:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC? Supply and Demand in a capitalistic society my friend. If your demand stays roughly static after a significant price increase why would you lower your prices and lose revenue. I would speculate that demand for the farmers product is actually the same, price increase or not. Fairness has never been apart of our system", 
        "intTime": 20090326, 
        "postID": 22, 
        "quote": "Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "reply": " Supply and Demand in a capitalistic society my friend. If your demand stays roughly static after a significant price increase why would you lower your prices and lose revenue. I would speculate that demand for the farmers product is actually the same, price increase or not. Fairness has never been apart of our system", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 15:53:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "nn68"
    }, 
    {
        "content": "Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090326, 
        "postID": 23, 
        "quote": "", 
        "reply": "Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:03:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC? Farmers gotta take it if they can get it. Try farming and you'll find out why. They borrow money for seed, fertilizer, fuel, equipment, etc etc etc, hoping people will even buy what they plant. If they are REALLY lucky, the bugs and weather and sun don't ruin their crop. But if they have a bumper crop, they gotta hope their neighbor loses everything, or he'll have a bumper crop too - and too much product means the prices will plummet!! Then, he's got to harvest it and ship it to market, getting gouged and screwed at every turn by the haulers and railroads - and again he's got to beat his neighbor to market right at the instant his crop is coming ripe. If he's early, people won't buy because the flavor is wrong. If he's late, his neighbor has the market and his own crop begins to go bad and rot. Even if he gets top dollar, he'll be damned lucky to break even on all his loans and have enough to buy his kids Christmas. Then he has to take out a bunch of loans for seed and fertilizer and fuel, and start all over again - - Not too surprising that most of our fruits and vegetables come from outside the country, as farmers either give up and abandon the land, or subdivide it all up for houses - the final cash crop.... But a glut has even killed that market - - Why do I know this to be true? Because I ranched and farmed all my younger days with grandparents, uncles and a father that pretty much lost it all - hoping the next year would finally pay the bills - - That's why, if you have hundred or thousands of acres of land you're trying to farm, you're \"acre rich, but dirt poor\"! Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 24, 
        "quote": "Originally posted by Duster6: Last year when gas prices hit $4.00/gal., a pound of tomatoes cost $1.99. I asked all the farmers at the markets why so high and they all said because of the high gas prices. Now gas here is selling for $1.90/gal. and the price of tomatoes has stayed the same. Could the greed of our politicians be catching on to our farmers here in NC?", 
        "reply": " Farmers gotta take it if they can get it. Try farming and you'll find out why. They borrow money for seed, fertilizer, fuel, equipment, etc etc etc, hoping people will even buy what they plant. If they are REALLY lucky, the bugs and weather and sun don't ruin their crop. But if they have a bumper crop, they gotta hope their neighbor loses everything, or he'll have a bumper crop too - and too much product means the prices will plummet!! Then, he's got to harvest it and ship it to market, getting gouged and screwed at every turn by the haulers and railroads - and again he's got to beat his neighbor to market right at the instant his crop is coming ripe. If he's early, people won't buy because the flavor is wrong. If he's late, his neighbor has the market and his own crop begins to go bad and rot. Even if he gets top dollar, he'll be damned lucky to break even on all his loans and have enough to buy his kids Christmas. Then he has to take out a bunch of loans for seed and fertilizer and fuel, and start all over again - - Not too surprising that most of our fruits and vegetables come from outside the country, as farmers either give up and abandon the land, or subdivide it all up for houses - the final cash crop.... But a glut has even killed that market - - Why do I know this to be true? Because I ranched and farmed all my younger days with grandparents, uncles and a father that pretty much lost it all - hoping the next year would finally pay the bills - - That's why, if you have hundred or thousands of acres of land you're trying to farm, you're \"acre rich, but dirt poor\"! Wandering and Wondering", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:17:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness.", 
        "intTime": 20090326, 
        "postID": 25, 
        "quote": "", 
        "reply": "Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:34:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Tomatoes. . . $1.50/pd day before yesterday at the grocery store. They were California grown tomatoes, but the lemons on the backyard tree are free. But, you can only eat so many before you turn into a frog.", 
        "intTime": 20090326, 
        "postID": 26, 
        "quote": "", 
        "reply": "Tomatoes. . . $1.50/pd day before yesterday at the grocery store. They were California grown tomatoes, but the lemons on the backyard tree are free. But, you can only eat so many before you turn into a frog.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:41:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Fankhouser"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness. The only time any of my relatives got a \"subsidy\" is when the Feds showed up on grandad's ranch during the Depression, bought the majority of his cattle at 50 cents a head, drove them out on the desert and shot them all to get them off the market, about 1000 head prime Hereford beef. They called it \"priming the pump.\" Grandad went into a funk which he never quite came out of until he died. Grandma went insane and died just after the War. How close are we to that happening again?? Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 27, 
        "quote": "Originally posted by DCookeUSA1: Farm subsidies run amok. Family farms are disappearing as a result - they are not able to compete with large agribusiness.", 
        "reply": " The only time any of my relatives got a \"subsidy\" is when the Feds showed up on grandad's ranch during the Depression, bought the majority of his cattle at 50 cents a head, drove them out on the desert and shot them all to get them off the market, about 1000 head prime Hereford beef. They called it \"priming the pump.\" Grandad went into a funk which he never quite came out of until he died. Grandma went insane and died just after the War. How close are we to that happening again?? Wandering and Wondering", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 16:54:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather. I tried that last year but all the little mexican kids that live in the trailer park stole my maters.", 
        "intTime": 20090326, 
        "postID": 28, 
        "quote": "Originally posted by sargeant_green: Tomatoes are the easiest thing to grow. How come you aren't talking about tomato starts? Drill some 2 in. holes into the bottom of a five gallon bucket, fill the bucket with potting soil. Put tomato starts into the holes in the bucket. Hang the bucket in a sunny spot and water occasionally. You will have pest free tomatoes all throughout the summer and some in the fall depending on the weather.", 
        "reply": " I tried that last year but all the little mexican kids that live in the trailer park stole my maters.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 18:44:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Tomatoes are the easiest thing to grow. Actually, I think potatoes are. So far as I know, they are the only common vegetable grown in all 50 states, though not always in commercial quantities.", 
        "intTime": 20090326, 
        "postID": 29, 
        "quote": "Originally posted by sargeant_green: Tomatoes are the easiest thing to grow.", 
        "reply": " Actually, I think potatoes are. So far as I know, they are the only common vegetable grown in all 50 states, though not always in commercial quantities.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 18:50:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "stillkit"
    }, 
    {
        "content": "GWG, we're at that point right now.", 
        "intTime": 20090326, 
        "postID": 30, 
        "quote": "", 
        "reply": "GWG, we're at that point right now.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 20:30:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes? Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090326, 
        "postID": 31, 
        "quote": "", 
        "reply": "Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes? Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 20:50:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes? The soil will hold in the bucket and you poke your finger in and then the start. You can put enough potting soil in to cover the holes, put in the starts, punch the soil down around the starts from the inside working to hold it in place from the outside. Then fill the bucket two or three inches from the rim. You have to learn the watering technique for yourself. Too much and you can wash out the starts. Hole size is another preference. 1 in. holes work as well as two inch. The size of a tomato stalk is variable but the hole needs to be big enough to let it take water into the stem and not grow to choke itself off. Try painting the buckets a darker color, or get a blue or gray bucket. Dark plastic for the cold months and then take it off in the summer. Just a dark color to warm the soil. You can drape a clear plastic film over the bottom of the bucket to about 1 ft. below the bottom to ward off some frost. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090326, 
        "postID": 32, 
        "quote": "Originally posted by Bergy46: Sarge thanks for the heads up re the tomatoes, I've not had any luck growing tomatoes here. I went from putting them in the veg. garden to 5 gal buckets on the deck next to the house. I figured they'd get more sun and it would be warmer. It didn't help, I've used different varieties of tomatoes. I always used good potting soil and Miracle Grow fertilizer. I'm confused the bucket and the 2 in. holes. You fill the bucket with potting soil, then put the starts in the holes. If the soil is in the bucket, how do you get the starts in the holes?", 
        "reply": " The soil will hold in the bucket and you poke your finger in and then the start. You can put enough potting soil in to cover the holes, put in the starts, punch the soil down around the starts from the inside working to hold it in place from the outside. Then fill the bucket two or three inches from the rim. You have to learn the watering technique for yourself. Too much and you can wash out the starts. Hole size is another preference. 1 in. holes work as well as two inch. The size of a tomato stalk is variable but the hole needs to be big enough to let it take water into the stem and not grow to choke itself off. Try painting the buckets a darker color, or get a blue or gray bucket. Dark plastic for the cold months and then take it off in the summer. Just a dark color to warm the soil. You can drape a clear plastic film over the bottom of the bucket to about 1 ft. below the bottom to ward off some frost. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-26 21:46:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "wow all that just to plant some tomatoes. i'm loving it.", 
        "intTime": 20090327, 
        "postID": 33, 
        "quote": "", 
        "reply": "wow all that just to plant some tomatoes. i'm loving it.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 07:41:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "specialist_green"
    }, 
    {
        "content": "I'm waiting to hear from private-green next.", 
        "intTime": 20090327, 
        "postID": 34, 
        "quote": "", 
        "reply": "I'm waiting to hear from private-green next.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:24:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Thanks Sarge, Duster, I heard that Pvt. Green got a field promotion to Lt. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090327, 
        "postID": 35, 
        "quote": "", 
        "reply": "Thanks Sarge, Duster, I heard that Pvt. Green got a field promotion to Lt. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:29:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Lord have Mercy.", 
        "intTime": 20090327, 
        "postID": 36, 
        "quote": "", 
        "reply": "Lord have Mercy.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:50:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090327, 
        "postID": 37, 
        "quote": "Originally posted by Duster6: I'm waiting to hear from private-green next.", 
        "reply": " Specialist_Green used to outrank me but then I got another stripe and the rest is history. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 08:55:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "A couple more weeks, you can plant your own. I gotta turn over the garden this weekend. Nothing tastes as good, as when you grow it yourself.", 
        "intTime": 20090327, 
        "postID": 38, 
        "quote": "", 
        "reply": "A couple more weeks, you can plant your own. I gotta turn over the garden this weekend. Nothing tastes as good, as when you grow it yourself.", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 09:46:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Square that young_green away, there Sgt._green!", 
        "intTime": 20090327, 
        "postID": 39, 
        "quote": "Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history.", 
        "reply": " Square that young_green away, there Sgt._green!", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 09:48:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Square that young_green away, there Sgt._green! Actually he has four years on me. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090327, 
        "postID": 40, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by sargeant_green: quote: Originally posted by Duster6: I'm waiting to hear from private-green next. Specialist_Green used to outrank me but then I got another stripe and the rest is history. Square that young_green away, there Sgt._green!", 
        "reply": " Actually he has four years on me. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4730010912001", 
        "time": "2009-03-27 09:51:00", 
        "title": "Greed hits farmers in NC.", 
        "userID": "sargeant_green"
    }
]