[
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 4, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 6, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 7, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 8, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 17, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 18, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 20, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 21, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 22, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 23, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 24, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 25, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 26, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 27, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 28, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 29, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 30, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 31, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 32, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 33, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 34, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 35, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 36, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 37, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 38, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 39, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 40, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 41, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 42, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 43, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 44, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 45, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 46, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 47, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 48, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 49, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 50, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 51, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 52, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 53, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 54, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 55, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 56, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 57, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 58, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 59, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 60, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 61, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 62, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 63, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 64, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 65, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 66, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 67, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 68, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 69, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 70, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 71, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 72, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 73, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 74, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 75, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 76, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 77, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 78, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 79, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 80, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 81, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 82, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 83, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 84, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 85, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 86, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 87, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 88, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 89, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 90, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 91, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 92, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 93, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 94, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 95, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 96, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 97, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 98, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 99, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 100, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 101, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 102, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "intTime": 20090414, 
        "postID": 103, 
        "quote": "", 
        "reply": "Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:12:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "VincentRaines"
    }, 
    {
        "content": "Meh. We're all Americans. What difference does it make?", 
        "intTime": 20090414, 
        "postID": 104, 
        "quote": "", 
        "reply": "Meh. We're all Americans. What difference does it make?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 12:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up? I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090414, 
        "postID": 105, 
        "quote": "Originally posted by VincentRaines: Hi, I'm a civilian. One aspect of the military that fascinates me is that many wide-eyed 18 year-olds who have never ventured far from their home town interact with others across the country, and then travel abroad, learning about other cultures, etc. A friend has said the most obnoxious people come from New York and Texas. There are obnoxious people everywhere, but does this comport with personal experiences? Another has said, \"Ah, Texans. Did you know they will draw the lone star state on anything? They will!\" From personal, non-military experiences, this is not super-surprising. People from Texas and New York seem to have strong identities connected to their states. \"I'm tough, I grew up in the Bronx.\" I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Anyway, Texas and New York. Is that an unfair characterization? I'm not trying to start a flame war or peddle nasty stereotypes, but... does that kinda hold up?", 
        "reply": " I'm from Brooklyn and if you say anything about us having attitude I'll pop you one on the side of your dumb head! All kidding aside I guess people from the five Burroughs and North Jersey do have a bit of an attitude. Having been raised in Brooklyn and later North Jersey coming to North Carolina was a real culture shock. My work had taken me over most of the country but one doesn't start noticing things during short visits that one does notice as a resident. I'm not saying the people are bad or anything but they sure take some getting used to . How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:06:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 106, 
        "quote": "", 
        "reply": "MY MOM'S FAMILY IS FROM BROOKLYN AND MY DAD'S FAMILY IS FROM TEXAS! Does that make me doubly obnoxious? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:13:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "intTime": 20090414, 
        "postID": 107, 
        "quote": "", 
        "reply": "I'm from Texas... and WTF do you mean we're obnoxious?!? \"They will draw the lone star state on anything?\" Well I don't know what kind of Texans you've been runnin' into, but true Texans, as in grew up in the boonies ridin' horses and ranchin' cattle, don't draw on things other than paper... we say ma'am and sir and are a hoot to have a few beers with... but don't come talkin' sheet or you'll wind up on your rear-end on the ground. Obnoxious... ha! Maybe some of these \"young bucks\" that think they're hot stuff, but TRUE Texans are nothin' of the sort. Them damned Yankees though....", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:23:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I thought it was just the Cowboys and Longhorns fans!", 
        "intTime": 20090414, 
        "postID": 108, 
        "quote": "", 
        "reply": "I thought it was just the Cowboys and Longhorns fans!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:25:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "azmax64"
    }, 
    {
        "content": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 109, 
        "quote": "", 
        "reply": "Vincent, your are walking a fine line here, many mil.com members are from NY and TX. Not a good way to start as a newbie. You have ticked off many members and some aren't from NY. or TX. We stick up for each other, we are all family here! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 110, 
        "quote": "", 
        "reply": "Born and raised in TEXAS and proud of it!!!!! I think somebody walked in just lookin' for an azz whoopin! Hey Vincent, You posted: I'd say the same seems true for people with a Southern Heritage, which can be jarring to people here on the West Coast, which seems a little more laid back (except in Southern California, where location-status is significantly more intense). Well, is it a fair characterization that most guys in San Francisco are stereotyped as GAY!... does that kinda hold up? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:33:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 111, 
        "quote": "", 
        "reply": "Good retort mom! You are my favorite Texas gal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:41:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090414, 
        "postID": 112, 
        "quote": "", 
        "reply": "Bergy, GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:48:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 113, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Damn Straight!", 
        "intTime": 20090414, 
        "postID": 114, 
        "quote": "", 
        "reply": "Damn Straight!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:54:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Bergy, You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 115, 
        "quote": "Originally posted by peaceforall: Bergy,", 
        "reply": " You betcha mom., yer my favorite Texas gal! Love ya! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 13:56:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 116, 
        "quote": "Originally posted by armywifefigueroa: Damn Straight!", 
        "reply": " Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:00:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "intTime": 20090414, 
        "postID": 117, 
        "quote": "", 
        "reply": "i have lived in both places and yu may be half-right. Spent about a year in san antonio and wichita falls, texas, i never found Texans to be obnoxious at all, at least not any more than anywhere else. Alot of them are very proud of being Texan and see themselves as being a bit more independent than those from the other 49 states, and there is nothing wrong with that. Many residents of New York city on the other hand, can be very obnoxious, rude, and inconsiderate and perhaps it rubs off onto each other more than anyplace else.", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:01:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "marc780"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss! Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "intTime": 20090414, 
        "postID": 118, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by armywifefigueroa: Damn Straight! Hey Army, thanks! I don't think I was mean or rude to the newbie, I just stickin up for my family. Ya start bad mouthin my family you are walkin on the fightin side of me Hoss!", 
        "reply": " Not Mean or Rude at all... and anyone comes talkin' sheet, they're walkin' on the fightin' side of all of us!!!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:03:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "intTime": 20090414, 
        "postID": 119, 
        "quote": "", 
        "reply": "Ohhh Bubba... I think you just got yourself into trouble!", 
        "threadID": "5291911282_7370007022001", 
        "time": "2009-04-14 14:16:00", 
        "title": "Texans and New Yorkers most obnoxious?", 
        "userID": "armywifefigueroa"
    }
]