[
    {
        "content": "I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:30:00", 
        "title": "Area 51 as prison", 
        "userID": "DSTremf"
    }, 
    {
        "content": "Weenies would say it's cruel. Imagine our soldiers currently in Iraq with 110 degree heat wearing armor; or sailors aboard a ship in tight living conditions: There's no Federal Court Judge Jack Weinstien prohibiting double-bunking.", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "", 
        "reply": "Weenies would say it's cruel. Imagine our soldiers currently in Iraq with 110 degree heat wearing armor; or sailors aboard a ship in tight living conditions: There's no Federal Court Judge Jack Weinstien prohibiting double-bunking.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:34:00", 
        "title": "Area 51 as prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Sure, put'em in harry rieds state. He'll go for that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "", 
        "reply": "Sure, put'em in harry rieds state. He'll go for that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:38:00", 
        "title": "Area 51 as prison", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think?", 
        "reply": " Good Idea Husker. We could always blame the Space Aliens when they become missing. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:40:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think?", 
        "reply": " Why not, Minot? Old AF, SAC joke.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:40:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty!", 
        "intTime": 20090511, 
        "postID": 6, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing.", 
        "reply": " Beam them aboard, Scotty!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:41:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Sure, put'em in harry rieds state. He'll go for that. Yep, just think of the money he'd skim off the top of that budget. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 7, 
        "quote": "Originally posted by sargeant_green: Sure, put'em in harry rieds state. He'll go for that.", 
        "reply": " Yep, just think of the money he'd skim off the top of that budget. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:43:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 8, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty!", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:44:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "I think it's a great idea. The area is so difficult they wouldn't have to build fences. If they tried to escape, they would have to walk for days and die from the elements. No sweat off my pretty nose.", 
        "intTime": 20090511, 
        "postID": 9, 
        "quote": "", 
        "reply": "I think it's a great idea. The area is so difficult they wouldn't have to build fences. If they tried to escape, they would have to walk for days and die from the elements. No sweat off my pretty nose.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:48:00", 
        "title": "Area 51 as prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Two problems with this idea. 1.In spite of numorus security personel, the facility is nor secure enough to house prisoners. 2. Every time Ichiro goes after a fly ball prisoners would get in the way! What's this fool talking about? The people of seattle know! \"http://ichirosuzuki.tripod.com/index2.htm\"", 
        "intTime": 20090511, 
        "postID": 10, 
        "quote": "", 
        "reply": "Two problems with this idea. 1.In spite of numorus security personel, the facility is nor secure enough to house prisoners. 2. Every time Ichiro goes after a fly ball prisoners would get in the way! What's this fool talking about? The people of seattle know! \"http://ichirosuzuki.tripod.com/index2.htm\"", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 23:24:00", 
        "title": "Area 51 as prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "alkatraz.......", 
        "intTime": 20090512, 
        "postID": 11, 
        "quote": "", 
        "reply": "alkatraz.......", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 03:36:00", 
        "title": "Area 51 as prison", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "intTime": 20090512, 
        "postID": 12, 
        "quote": "", 
        "reply": "I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 03:56:00", 
        "title": "Area 51 as prison", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090512, 
        "postID": 13, 
        "quote": "Originally posted by RetiredMarineWife: alkatraz.......", 
        "reply": " There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:24:00", 
        "title": "Area 51 as prison", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I agree... Alkatraz would be perfect. Not to mention, can you imagine the number of volunteers from the state of New York to stand guard on them?!? Edited to add: Maybe it would be a good idea to let the citizens of New York decide where the terrorists should go.... This message has been edited. Last edited by: armywifefigueroa, Tue 12 May 2009 02:37 PM", 
        "intTime": 20090512, 
        "postID": 14, 
        "quote": "", 
        "reply": "I agree... Alkatraz would be perfect. Not to mention, can you imagine the number of volunteers from the state of New York to stand guard on them?!? Edited to add: Maybe it would be a good idea to let the citizens of New York decide where the terrorists should go.... This message has been edited. Last edited by: armywifefigueroa, Tue 12 May 2009 02:37 PM", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:37:00", 
        "title": "Area 51 as prison", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring", 
        "intTime": 20090512, 
        "postID": 15, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke.", 
        "reply": " Because i was at Boring Loring", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:48:00", 
        "title": "Area 51 as prison", 
        "userID": "sw614"
    }, 
    {
        "content": "Save a ton of money, hang them from a short rope! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090512, 
        "postID": 16, 
        "quote": "", 
        "reply": "Save a ton of money, hang them from a short rope! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 07:53:00", 
        "title": "Area 51 as prison", 
        "userID": "Bergy46"
    }, 
    {
        "content": "One of our area Pol's wants to bring them up here (UP of Michigan) to one or both of a couple small Max facilities that are at limited usage right now (lack of funding); he figures that the region can make a ton-o-bucks doing this! Personally, I think he's suffering from tunnel-vision, but that's just me! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090512, 
        "postID": 17, 
        "quote": "", 
        "reply": "One of our area Pol's wants to bring them up here (UP of Michigan) to one or both of a couple small Max facilities that are at limited usage right now (lack of funding); he figures that the region can make a ton-o-bucks doing this! Personally, I think he's suffering from tunnel-vision, but that's just me! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 08:03:00", 
        "title": "Area 51 as prison", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry. If the NEW government doesn't BOW to them first...", 
        "intTime": 20090512, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "reply": " If the NEW government doesn't BOW to them first...", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 08:58:00", 
        "title": "Area 51 as prison", 
        "userID": "gsuchey"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. Uh...FMI, Alcatraz is in the middle of the San Francisco Bay...they'd either be looking at Frisco, Oakland, or Alameda dependent upon cell location and whether or not they had a window in that place. BTDT tour, 1989. Did you mean Riker's Island?", 
        "intTime": 20090512, 
        "postID": 19, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness.", 
        "reply": " Uh...FMI, Alcatraz is in the middle of the San Francisco Bay...they'd either be looking at Frisco, Oakland, or Alameda dependent upon cell location and whether or not they had a window in that place. BTDT tour, 1989. Did you mean Riker's Island?", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 09:01:00", 
        "title": "Area 51 as prison", 
        "userID": "gsuchey"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring Why not put them in this crater? Guards would always have the high ground.", 
        "intTime": 20090512, 
        "postID": 20, 
        "quote": "Originally posted by sw614: quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring", 
        "reply": " Why not put them in this crater? Guards would always have the high ground.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 09:08:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090511, 
        "postID": 21, 
        "quote": "", 
        "reply": "I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:30:00", 
        "title": "Area 51 as prison", 
        "userID": "DSTremf"
    }, 
    {
        "content": "Weenies would say it's cruel. Imagine our soldiers currently in Iraq with 110 degree heat wearing armor; or sailors aboard a ship in tight living conditions: There's no Federal Court Judge Jack Weinstien prohibiting double-bunking.", 
        "intTime": 20090511, 
        "postID": 22, 
        "quote": "", 
        "reply": "Weenies would say it's cruel. Imagine our soldiers currently in Iraq with 110 degree heat wearing armor; or sailors aboard a ship in tight living conditions: There's no Federal Court Judge Jack Weinstien prohibiting double-bunking.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:34:00", 
        "title": "Area 51 as prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Sure, put'em in harry rieds state. He'll go for that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090511, 
        "postID": 23, 
        "quote": "", 
        "reply": "Sure, put'em in harry rieds state. He'll go for that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:38:00", 
        "title": "Area 51 as prison", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 24, 
        "quote": "Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think?", 
        "reply": " Good Idea Husker. We could always blame the Space Aliens when they become missing. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:40:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke.", 
        "intTime": 20090511, 
        "postID": 25, 
        "quote": "Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think?", 
        "reply": " Why not, Minot? Old AF, SAC joke.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:40:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty!", 
        "intTime": 20090511, 
        "postID": 26, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing.", 
        "reply": " Beam them aboard, Scotty!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:41:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Sure, put'em in harry rieds state. He'll go for that. Yep, just think of the money he'd skim off the top of that budget. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 27, 
        "quote": "Originally posted by sargeant_green: Sure, put'em in harry rieds state. He'll go for that.", 
        "reply": " Yep, just think of the money he'd skim off the top of that budget. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:43:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 28, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty!", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:44:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "I think it's a great idea. The area is so difficult they wouldn't have to build fences. If they tried to escape, they would have to walk for days and die from the elements. No sweat off my pretty nose.", 
        "intTime": 20090511, 
        "postID": 29, 
        "quote": "", 
        "reply": "I think it's a great idea. The area is so difficult they wouldn't have to build fences. If they tried to escape, they would have to walk for days and die from the elements. No sweat off my pretty nose.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:48:00", 
        "title": "Area 51 as prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Two problems with this idea. 1.In spite of numorus security personel, the facility is nor secure enough to house prisoners. 2. Every time Ichiro goes after a fly ball prisoners would get in the way! What's this fool talking about? The people of seattle know! \"http://ichirosuzuki.tripod.com/index2.htm\"", 
        "intTime": 20090511, 
        "postID": 30, 
        "quote": "", 
        "reply": "Two problems with this idea. 1.In spite of numorus security personel, the facility is nor secure enough to house prisoners. 2. Every time Ichiro goes after a fly ball prisoners would get in the way! What's this fool talking about? The people of seattle know! \"http://ichirosuzuki.tripod.com/index2.htm\"", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 23:24:00", 
        "title": "Area 51 as prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "alkatraz.......", 
        "intTime": 20090512, 
        "postID": 31, 
        "quote": "", 
        "reply": "alkatraz.......", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 03:36:00", 
        "title": "Area 51 as prison", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "intTime": 20090512, 
        "postID": 32, 
        "quote": "", 
        "reply": "I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 03:56:00", 
        "title": "Area 51 as prison", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090512, 
        "postID": 33, 
        "quote": "Originally posted by RetiredMarineWife: alkatraz.......", 
        "reply": " There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:24:00", 
        "title": "Area 51 as prison", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I agree... Alkatraz would be perfect. Not to mention, can you imagine the number of volunteers from the state of New York to stand guard on them?!? Edited to add: Maybe it would be a good idea to let the citizens of New York decide where the terrorists should go.... This message has been edited. Last edited by: armywifefigueroa, Tue 12 May 2009 02:37 PM", 
        "intTime": 20090512, 
        "postID": 34, 
        "quote": "", 
        "reply": "I agree... Alkatraz would be perfect. Not to mention, can you imagine the number of volunteers from the state of New York to stand guard on them?!? Edited to add: Maybe it would be a good idea to let the citizens of New York decide where the terrorists should go.... This message has been edited. Last edited by: armywifefigueroa, Tue 12 May 2009 02:37 PM", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:37:00", 
        "title": "Area 51 as prison", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring", 
        "intTime": 20090512, 
        "postID": 35, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke.", 
        "reply": " Because i was at Boring Loring", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:48:00", 
        "title": "Area 51 as prison", 
        "userID": "sw614"
    }, 
    {
        "content": "Save a ton of money, hang them from a short rope! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090512, 
        "postID": 36, 
        "quote": "", 
        "reply": "Save a ton of money, hang them from a short rope! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 07:53:00", 
        "title": "Area 51 as prison", 
        "userID": "Bergy46"
    }, 
    {
        "content": "One of our area Pol's wants to bring them up here (UP of Michigan) to one or both of a couple small Max facilities that are at limited usage right now (lack of funding); he figures that the region can make a ton-o-bucks doing this! Personally, I think he's suffering from tunnel-vision, but that's just me! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090512, 
        "postID": 37, 
        "quote": "", 
        "reply": "One of our area Pol's wants to bring them up here (UP of Michigan) to one or both of a couple small Max facilities that are at limited usage right now (lack of funding); he figures that the region can make a ton-o-bucks doing this! Personally, I think he's suffering from tunnel-vision, but that's just me! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 08:03:00", 
        "title": "Area 51 as prison", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry. If the NEW government doesn't BOW to them first...", 
        "intTime": 20090512, 
        "postID": 38, 
        "quote": "Originally posted by Duster6: I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "reply": " If the NEW government doesn't BOW to them first...", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 08:58:00", 
        "title": "Area 51 as prison", 
        "userID": "gsuchey"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. Uh...FMI, Alcatraz is in the middle of the San Francisco Bay...they'd either be looking at Frisco, Oakland, or Alameda dependent upon cell location and whether or not they had a window in that place. BTDT tour, 1989. Did you mean Riker's Island?", 
        "intTime": 20090512, 
        "postID": 39, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness.", 
        "reply": " Uh...FMI, Alcatraz is in the middle of the San Francisco Bay...they'd either be looking at Frisco, Oakland, or Alameda dependent upon cell location and whether or not they had a window in that place. BTDT tour, 1989. Did you mean Riker's Island?", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 09:01:00", 
        "title": "Area 51 as prison", 
        "userID": "gsuchey"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring Why not put them in this crater? Guards would always have the high ground.", 
        "intTime": 20090512, 
        "postID": 40, 
        "quote": "Originally posted by sw614: quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring", 
        "reply": " Why not put them in this crater? Guards would always have the high ground.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 09:08:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090511, 
        "postID": 41, 
        "quote": "", 
        "reply": "I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:30:00", 
        "title": "Area 51 as prison", 
        "userID": "DSTremf"
    }, 
    {
        "content": "Weenies would say it's cruel. Imagine our soldiers currently in Iraq with 110 degree heat wearing armor; or sailors aboard a ship in tight living conditions: There's no Federal Court Judge Jack Weinstien prohibiting double-bunking.", 
        "intTime": 20090511, 
        "postID": 42, 
        "quote": "", 
        "reply": "Weenies would say it's cruel. Imagine our soldiers currently in Iraq with 110 degree heat wearing armor; or sailors aboard a ship in tight living conditions: There's no Federal Court Judge Jack Weinstien prohibiting double-bunking.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:34:00", 
        "title": "Area 51 as prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Sure, put'em in harry rieds state. He'll go for that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090511, 
        "postID": 43, 
        "quote": "", 
        "reply": "Sure, put'em in harry rieds state. He'll go for that. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:38:00", 
        "title": "Area 51 as prison", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 44, 
        "quote": "Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think?", 
        "reply": " Good Idea Husker. We could always blame the Space Aliens when they become missing. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:40:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke.", 
        "intTime": 20090511, 
        "postID": 45, 
        "quote": "Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think?", 
        "reply": " Why not, Minot? Old AF, SAC joke.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:40:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty!", 
        "intTime": 20090511, 
        "postID": 46, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing.", 
        "reply": " Beam them aboard, Scotty!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:41:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Sure, put'em in harry rieds state. He'll go for that. Yep, just think of the money he'd skim off the top of that budget. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 47, 
        "quote": "Originally posted by sargeant_green: Sure, put'em in harry rieds state. He'll go for that.", 
        "reply": " Yep, just think of the money he'd skim off the top of that budget. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:43:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090511, 
        "postID": 48, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by mikeyR8: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Good Idea Husker. We could always blame the Space Aliens when they become missing. Beam them aboard, Scotty!", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:44:00", 
        "title": "Area 51 as prison", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "I think it's a great idea. The area is so difficult they wouldn't have to build fences. If they tried to escape, they would have to walk for days and die from the elements. No sweat off my pretty nose.", 
        "intTime": 20090511, 
        "postID": 49, 
        "quote": "", 
        "reply": "I think it's a great idea. The area is so difficult they wouldn't have to build fences. If they tried to escape, they would have to walk for days and die from the elements. No sweat off my pretty nose.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 20:48:00", 
        "title": "Area 51 as prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Two problems with this idea. 1.In spite of numorus security personel, the facility is nor secure enough to house prisoners. 2. Every time Ichiro goes after a fly ball prisoners would get in the way! What's this fool talking about? The people of seattle know! \"http://ichirosuzuki.tripod.com/index2.htm\"", 
        "intTime": 20090511, 
        "postID": 50, 
        "quote": "", 
        "reply": "Two problems with this idea. 1.In spite of numorus security personel, the facility is nor secure enough to house prisoners. 2. Every time Ichiro goes after a fly ball prisoners would get in the way! What's this fool talking about? The people of seattle know! \"http://ichirosuzuki.tripod.com/index2.htm\"", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-11 23:24:00", 
        "title": "Area 51 as prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "alkatraz.......", 
        "intTime": 20090512, 
        "postID": 51, 
        "quote": "", 
        "reply": "alkatraz.......", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 03:36:00", 
        "title": "Area 51 as prison", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "intTime": 20090512, 
        "postID": 52, 
        "quote": "", 
        "reply": "I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 03:56:00", 
        "title": "Area 51 as prison", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090512, 
        "postID": 53, 
        "quote": "Originally posted by RetiredMarineWife: alkatraz.......", 
        "reply": " There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:24:00", 
        "title": "Area 51 as prison", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "I agree... Alkatraz would be perfect. Not to mention, can you imagine the number of volunteers from the state of New York to stand guard on them?!? Edited to add: Maybe it would be a good idea to let the citizens of New York decide where the terrorists should go.... This message has been edited. Last edited by: armywifefigueroa, Tue 12 May 2009 02:37 PM", 
        "intTime": 20090512, 
        "postID": 54, 
        "quote": "", 
        "reply": "I agree... Alkatraz would be perfect. Not to mention, can you imagine the number of volunteers from the state of New York to stand guard on them?!? Edited to add: Maybe it would be a good idea to let the citizens of New York decide where the terrorists should go.... This message has been edited. Last edited by: armywifefigueroa, Tue 12 May 2009 02:37 PM", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:37:00", 
        "title": "Area 51 as prison", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring", 
        "intTime": 20090512, 
        "postID": 55, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke.", 
        "reply": " Because i was at Boring Loring", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 06:48:00", 
        "title": "Area 51 as prison", 
        "userID": "sw614"
    }, 
    {
        "content": "Save a ton of money, hang them from a short rope! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090512, 
        "postID": 56, 
        "quote": "", 
        "reply": "Save a ton of money, hang them from a short rope! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 07:53:00", 
        "title": "Area 51 as prison", 
        "userID": "Bergy46"
    }, 
    {
        "content": "One of our area Pol's wants to bring them up here (UP of Michigan) to one or both of a couple small Max facilities that are at limited usage right now (lack of funding); he figures that the region can make a ton-o-bucks doing this! Personally, I think he's suffering from tunnel-vision, but that's just me! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090512, 
        "postID": 57, 
        "quote": "", 
        "reply": "One of our area Pol's wants to bring them up here (UP of Michigan) to one or both of a couple small Max facilities that are at limited usage right now (lack of funding); he figures that the region can make a ton-o-bucks doing this! Personally, I think he's suffering from tunnel-vision, but that's just me! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 08:03:00", 
        "title": "Area 51 as prison", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry. If the NEW government doesn't BOW to them first...", 
        "intTime": 20090512, 
        "postID": 58, 
        "quote": "Originally posted by Duster6: I would like to see them all released back to their countries. They are costing us money in way of food, medical care, and pay for our troops who are guarding them and not over in A-Stand killing them. Let them go back and start their plans for another attack. That will create more jobs for our Homeland Security and will lower the population of their fellow brothers and sisters. We have a new government now. A government who will not sit around and play war games with these people. This new leadership will act like a Tiger if hungry.", 
        "reply": " If the NEW government doesn't BOW to them first...", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 08:58:00", 
        "title": "Area 51 as prison", 
        "userID": "gsuchey"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness. Uh...FMI, Alcatraz is in the middle of the San Francisco Bay...they'd either be looking at Frisco, Oakland, or Alameda dependent upon cell location and whether or not they had a window in that place. BTDT tour, 1989. Did you mean Riker's Island?", 
        "intTime": 20090512, 
        "postID": 59, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by RetiredMarineWife: alkatraz....... There you go, asked and answered! Fantabulous idea, RMW! You go, gir... err, ma'am! Let them rot with a view of the city that is why they're there! May the Statue of Liberty haunt their every minute there. May New York remind them that America is no child to be played with. Treat them humanely - give them their religious material, such as the Koran, feed them properly, and allow them 1 hour a day for showering and yard time. But let them never forget that they brought their imprisonment on themselves for the insane sake of their god wanting innocent people dead at their hands. Yes, treat them humanely... that would be the ultimate slap in their face as the Statue of Liberty, the moniker of all that is right in the world -- freedom, values and liberty -- looms over their cages that needn't even exist if people would just respect the values she represents and leave other people alone to pursue their personal happiness.", 
        "reply": " Uh...FMI, Alcatraz is in the middle of the San Francisco Bay...they'd either be looking at Frisco, Oakland, or Alameda dependent upon cell location and whether or not they had a window in that place. BTDT tour, 1989. Did you mean Riker's Island?", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 09:01:00", 
        "title": "Area 51 as prison", 
        "userID": "gsuchey"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring Why not put them in this crater? Guards would always have the high ground.", 
        "intTime": 20090512, 
        "postID": 60, 
        "quote": "Originally posted by sw614: quote: Originally posted by VeteranDad78: quote: Originally posted by DSTremf: I had this idea a couple of days ago. Since no one whats the prisoners from Gitmo in their state. Why not just imprison them at area 51. There is extremely high security there. The govt. could do what ever it wanted to, because it has never acknowledge its existence. What do you think? Why not, Minot? Old AF, SAC joke. Because i was at Boring Loring", 
        "reply": " Why not put them in this crater? Guards would always have the high ground.", 
        "threadID": "5291911282_1230080322001", 
        "time": "2009-05-12 09:08:00", 
        "title": "Area 51 as prison", 
        "userID": "VeteranDad78"
    }
]