[
    {
        "content": "I got back from spending yesterday with my son in Valdosta doing a little turkey hunting er searching ! Called a few but none came in; sorta glad too, I just don’t have it in my heart to kill an animal that’s just doing its thing without the means to fight back and isn’t being destructive. I did enjoy the day with my son however. He walked point and stumbled over every vine, root and stump in the woods. I would stop search the surrounding hedge row, the top of trees and the ground about 20 feet in front while listening for anything unusual although I really can’t hear much anymore. I’d then move up and do the same thing. I laughed at my son who’s 33 and said you would have lasted maybe a day in VN because you would surely have walked into something. His retaliation was I should have been dead taking to long to go anywhere. My retaliation was when I walked point we always covered the ground for the day and no one got blown up because I missed a trip vine or wire. Strange how things stay with you after all these years. All you hunters out there we need you for wildlife management but as for myself I’m more into people management, not that it does any good with all the bleeding hearts but that’s a whole nother subject. I did read about the rednecks in NC. It sounds like home to me.", 
        "intTime": 20090322, 
        "postID": 1, 
        "quote": "", 
        "reply": "I got back from spending yesterday with my son in Valdosta doing a little turkey hunting er searching ! Called a few but none came in; sorta glad too, I just don’t have it in my heart to kill an animal that’s just doing its thing without the means to fight back and isn’t being destructive. I did enjoy the day with my son however. He walked point and stumbled over every vine, root and stump in the woods. I would stop search the surrounding hedge row, the top of trees and the ground about 20 feet in front while listening for anything unusual although I really can’t hear much anymore. I’d then move up and do the same thing. I laughed at my son who’s 33 and said you would have lasted maybe a day in VN because you would surely have walked into something. His retaliation was I should have been dead taking to long to go anywhere. My retaliation was when I walked point we always covered the ground for the day and no one got blown up because I missed a trip vine or wire. Strange how things stay with you after all these years. All you hunters out there we need you for wildlife management but as for myself I’m more into people management, not that it does any good with all the bleeding hearts but that’s a whole nother subject. I did read about the rednecks in NC. It sounds like home to me.", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 12:53:00", 
        "title": "Turkey Hunting", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "Hey, I went hunting turkeys with 2 of my sons some years back. W sneaked all over the place as quiet as we could, setting up a decoy and calling, then skulking somewhere else and doing the same - all morning - nothing! So we finally hike back to where the trailer was parked at noon, hoping Mystical would have some lunch for us. As we approached the trailer, I could see Mystical in the window doing all these motions, pointing and such - - We were kinda confused, but looked around... That's when we noticed the trailer was surrounded by about 50 turkeys - - Wandering and Wondering", 
        "intTime": 20090322, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hey, I went hunting turkeys with 2 of my sons some years back. W sneaked all over the place as quiet as we could, setting up a decoy and calling, then skulking somewhere else and doing the same - all morning - nothing! So we finally hike back to where the trailer was parked at noon, hoping Mystical would have some lunch for us. As we approached the trailer, I could see Mystical in the window doing all these motions, pointing and such - - We were kinda confused, but looked around... That's when we noticed the trailer was surrounded by about 50 turkeys - - Wandering and Wondering", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 12:59:00", 
        "title": "Turkey Hunting", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I used to go fishing all the time. I'd get up at 03:00, get the boat gased, water tank filled and make sure the holding tank was empty and so forth. By daylight I was set up and fishing. I'd troll a bit than gig a bit and usually not do all that well. Then one day I made a huge discovery. There...are...stores...that...sell...FISH! I threw out all that nasty bait, stocked the fridge with all sorts of nice food, laid in a supply of liqueur and mixers, partied on the boat all day and all night and bought the darn fish, all nice and cleaned on my way home. There is a lesson in this. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090322, 
        "postID": 3, 
        "quote": "", 
        "reply": "I used to go fishing all the time. I'd get up at 03:00, get the boat gased, water tank filled and make sure the holding tank was empty and so forth. By daylight I was set up and fishing. I'd troll a bit than gig a bit and usually not do all that well. Then one day I made a huge discovery. There...are...stores...that...sell...FISH! I threw out all that nasty bait, stocked the fridge with all sorts of nice food, laid in a supply of liqueur and mixers, partied on the boat all day and all night and bought the darn fish, all nice and cleaned on my way home. There is a lesson in this. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 13:13:00", 
        "title": "Turkey Hunting", 
        "userID": "Vicdude"
    }, 
    {
        "content": "about 7 years ago when I was working (i worked in the mountains) I was doing my thing when all the sudden the hairs on the back of my neck went up and I had this feeling that I was in the \"kill zone\". Well I quit what I was supposed to do and went sniffing around.... and I found a hunters bunker (really, the guy made a bunker).. with fields of fire cleared out and everything, and the place where I got the \"feeling\", was just in the perfect place for him to pop his deer. It was a pretty weird event to happen after so many years. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090322, 
        "postID": 4, 
        "quote": "", 
        "reply": "about 7 years ago when I was working (i worked in the mountains) I was doing my thing when all the sudden the hairs on the back of my neck went up and I had this feeling that I was in the \"kill zone\". Well I quit what I was supposed to do and went sniffing around.... and I found a hunters bunker (really, the guy made a bunker).. with fields of fire cleared out and everything, and the place where I got the \"feeling\", was just in the perfect place for him to pop his deer. It was a pretty weird event to happen after so many years. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 13:21:00", 
        "title": "Turkey Hunting", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "There is some real truth to that - in various ways... Several times, when hunting deer, I go that eerie feeling of being watched. When I stopped and looked around carefully, I usually found deer standing and watching me. Got a few nice bucks that way. Once, when I was a teenager hunting alone, it was a cougar. The thing vanished as soon as I spotted him... That was spooky. But there is something real about that \"sense\" and shouldn't be shrugged off - - Wandering and Wondering", 
        "intTime": 20090322, 
        "postID": 5, 
        "quote": "", 
        "reply": "There is some real truth to that - in various ways... Several times, when hunting deer, I go that eerie feeling of being watched. When I stopped and looked around carefully, I usually found deer standing and watching me. Got a few nice bucks that way. Once, when I was a teenager hunting alone, it was a cougar. The thing vanished as soon as I spotted him... That was spooky. But there is something real about that \"sense\" and shouldn't be shrugged off - - Wandering and Wondering", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 13:34:00", 
        "title": "Turkey Hunting", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I tried turkey hunting once. I was calling an he was calling back. But when he came,he saw me first an beat it. I preferd deer hunting with bow n arrow more. Cammo & pistol belt & doe urine & fox oder on it. Had three stupid does sniffing at my boots as I layed along side the deer trail. So close i coulda touched em, I named curly, mo & shep.", 
        "intTime": 20090322, 
        "postID": 6, 
        "quote": "", 
        "reply": "I tried turkey hunting once. I was calling an he was calling back. But when he came,he saw me first an beat it. I preferd deer hunting with bow n arrow more. Cammo & pistol belt & doe urine & fox oder on it. Had three stupid does sniffing at my boots as I layed along side the deer trail. So close i coulda touched em, I named curly, mo & shep.", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 19:44:00", 
        "title": "Turkey Hunting", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "I don't go into the deep woods any more because of that very thing. Neither do I hunt. No matter how much I enjoy spending time in the forest, I simply cannot let my guard down, can't relax. It got to the point that I couldn't go down in the woods and come back any way but wound up tight as an 8 day clock. And then, there was this incident: Years ago, there were some convicts on the loose around here for a month or so. They killed about a dozen people over that time, from Oklahoma to Alabama, and the cops couldn't find them. The whole area was on lock-down with road-blocks everywhere they were reported to have been seen. My brother and I, also a Vietnam Veteran but not of the Infantry, were in the woods shooting birds during that time when we became aware that someone was following us through the woods. We could easily hear footsteps which stopped when we did, and resumed when we did. I went into immediate combat mode, so rapidly it was astonishing. Being the one with the most direct combat experience, I quickly placed him in a covered and concealed position overlooking a small clearing and started a flanking manuever to flush out whoever was there. This was probably 15 years after I'd come home from the war and it still automatic. I didn't find anyone and we never discovered who was following us, or why, but it scared the hell out of me. Not because it might have been those convicts, but because I was on such a hair-trigger that if I'd stumbled upon a kid or some other innocent, I'd have killed them in an instant, without thinking. After that, my hunting days were over. I went back to the woods a few times, but could never get comfortable with myself, so I just quit going.", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "", 
        "reply": "I don't go into the deep woods any more because of that very thing. Neither do I hunt. No matter how much I enjoy spending time in the forest, I simply cannot let my guard down, can't relax. It got to the point that I couldn't go down in the woods and come back any way but wound up tight as an 8 day clock. And then, there was this incident: Years ago, there were some convicts on the loose around here for a month or so. They killed about a dozen people over that time, from Oklahoma to Alabama, and the cops couldn't find them. The whole area was on lock-down with road-blocks everywhere they were reported to have been seen. My brother and I, also a Vietnam Veteran but not of the Infantry, were in the woods shooting birds during that time when we became aware that someone was following us through the woods. We could easily hear footsteps which stopped when we did, and resumed when we did. I went into immediate combat mode, so rapidly it was astonishing. Being the one with the most direct combat experience, I quickly placed him in a covered and concealed position overlooking a small clearing and started a flanking manuever to flush out whoever was there. This was probably 15 years after I'd come home from the war and it still automatic. I didn't find anyone and we never discovered who was following us, or why, but it scared the hell out of me. Not because it might have been those convicts, but because I was on such a hair-trigger that if I'd stumbled upon a kid or some other innocent, I'd have killed them in an instant, without thinking. After that, my hunting days were over. I went back to the woods a few times, but could never get comfortable with myself, so I just quit going.", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 20:00:00", 
        "title": "Turkey Hunting", 
        "userID": "stillkit"
    }, 
    {
        "content": "GWGT, them turkeys musta been around the trailer, cuz they knew they was safe! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "", 
        "reply": "GWGT, them turkeys musta been around the trailer, cuz they knew they was safe! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 20:18:00", 
        "title": "Turkey Hunting", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: There is some real truth to that - in various ways... Several times, when hunting deer, I go that eerie feeling of being watched. When I stopped and looked around carefully, I usually found deer standing and watching me. Got a few nice bucks that way. Once, when I was a teenager hunting alone, it was a cougar. The thing vanished as soon as I spotted him... That was spooky. But there is something real about that \"sense\" and shouldn't be shrugged off - - Good, I thought I was nuts..", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by greywolfghost: There is some real truth to that - in various ways... Several times, when hunting deer, I go that eerie feeling of being watched. When I stopped and looked around carefully, I usually found deer standing and watching me. Got a few nice bucks that way. Once, when I was a teenager hunting alone, it was a cougar. The thing vanished as soon as I spotted him... That was spooky. But there is something real about that \"sense\" and shouldn't be shrugged off - -", 
        "reply": " Good, I thought I was nuts..", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 21:30:00", 
        "title": "Turkey Hunting", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "Deer aint dumb. It was huntin season an them woods were full of deer killers. Where were the deer? In a copse a trees in a highway divider. : )", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "", 
        "reply": "Deer aint dumb. It was huntin season an them woods were full of deer killers. Where were the deer? In a copse a trees in a highway divider. : )", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-22 22:59:00", 
        "title": "Turkey Hunting", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "quote: Originally posted by stillkit: I don't go into the deep woods any more because of that very thing. Neither do I hunt. No matter how much I enjoy spending time in the forest, I simply cannot let my guard down, can't relax. It got to the point that I couldn't go down in the woods and come back any way but wound up tight as an 8 day clock. And then, there was this incident: Years ago, there were some convicts on the loose around here for a month or so. They killed about a dozen people over that time, from Oklahoma to Alabama, and the cops couldn't find them. The whole area was on lock-down with road-blocks everywhere they were reported to have been seen. My brother and I, also a Vietnam Veteran but not of the Infantry, were in the woods shooting birds during that time when we became aware that someone was following us through the woods. We could easily hear footsteps which stopped when we did, and resumed when we did. I went into immediate combat mode, so rapidly it was astonishing. Being the one with the most direct combat experience, I quickly placed him in a covered and concealed position overlooking a small clearing and started a flanking manuever to flush out whoever was there. This was probably 15 years after I'd come home from the war and it still automatic. I didn't find anyone and we never discovered who was following us, or why, but it scared the hell out of me. Not because it might have been those convicts, but because I was on such a hair-trigger that if I'd stumbled upon a kid or some other innocent, I'd have killed them in an instant, without thinking. After that, my hunting days were over. I went back to the woods a few times, but could never get comfortable with myself, so I just quit going. Because I didn't have any brothers, and Dad was gone shortly after I got out of the Army, I always hunted alone, going deep into the snowy woods and feeling so at peace, always safe - - But as my children grew, I would go hiking with them and feel - uneasy. It dawned on me that the wilds are not a city park, just because I'm hiking with the kids. I started carrying a pistol on such excursions, and the feeling of peace and safety came back. It is knowing you can deal with the unpredictable and keep things under your control that makes the difference - a few dead rattle snakes have proven that - - Wandering and Wondering", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "Originally posted by stillkit: I don't go into the deep woods any more because of that very thing. Neither do I hunt. No matter how much I enjoy spending time in the forest, I simply cannot let my guard down, can't relax. It got to the point that I couldn't go down in the woods and come back any way but wound up tight as an 8 day clock. And then, there was this incident: Years ago, there were some convicts on the loose around here for a month or so. They killed about a dozen people over that time, from Oklahoma to Alabama, and the cops couldn't find them. The whole area was on lock-down with road-blocks everywhere they were reported to have been seen. My brother and I, also a Vietnam Veteran but not of the Infantry, were in the woods shooting birds during that time when we became aware that someone was following us through the woods. We could easily hear footsteps which stopped when we did, and resumed when we did. I went into immediate combat mode, so rapidly it was astonishing. Being the one with the most direct combat experience, I quickly placed him in a covered and concealed position overlooking a small clearing and started a flanking manuever to flush out whoever was there. This was probably 15 years after I'd come home from the war and it still automatic. I didn't find anyone and we never discovered who was following us, or why, but it scared the hell out of me. Not because it might have been those convicts, but because I was on such a hair-trigger that if I'd stumbled upon a kid or some other innocent, I'd have killed them in an instant, without thinking. After that, my hunting days were over. I went back to the woods a few times, but could never get comfortable with myself, so I just quit going.", 
        "reply": " Because I didn't have any brothers, and Dad was gone shortly after I got out of the Army, I always hunted alone, going deep into the snowy woods and feeling so at peace, always safe - - But as my children grew, I would go hiking with them and feel - uneasy. It dawned on me that the wilds are not a city park, just because I'm hiking with the kids. I started carrying a pistol on such excursions, and the feeling of peace and safety came back. It is knowing you can deal with the unpredictable and keep things under your control that makes the difference - a few dead rattle snakes have proven that - - Wandering and Wondering", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-23 06:31:00", 
        "title": "Turkey Hunting", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Thanks for the thread Wolfhound, I know there's a God in heaven, each time I hear a gobbler sound off, before it comes down from its roost! Love spring turkey hunting! Here's a little story about my first turkey hunt. First time I went turkey hunting, my freind set me up near the cabin as he & another guy went off elsewhere. I was doing some calling & got a gobbler answering. Sounded like it was coming straight in! I had a little two foot high camo net set up around with an old stone wall to my back. I was peeping over the wall looking into the woods, doing some light calling, had my shot gun leaning on the wall. I happen to turn around to see a gobbler in full strut, stomping into the field(opposite of where I was looking), my jaw dropped. He must have came in to a certain point, made a bit of a half circle to come into the field off to my left, nearly behind me. I had a jake decoy out. Guess he was pizzed to see a jake making a move on his would-be girlfreind! I had to do this slow motion move, reaching for the shotgun & turning around, while watching him to see when he was distracted to move. Thank goodness, for the jake decoy, he seemed ready to kick the jake's azz. Managed to get the gun up, take the shot & drop him(he was only about 20 yards way). About 15 minutes later, my buddies rolled up. I was sitting on the deck with the bird next to me. I said to them, \"is this how it's done?!?\" They had heard the shot & the one fellow, had said, \"Damn! That sounded like it came from the cabin\". They confessed, me being a rookie, they were afraid I might screw up their hunt. Since then(that was about 14yars ago), I've had some pretty good luck with spring turkey. If I was half as lucky with deer, I'd cll myself a hunter! Next month, we're off to Ohio, to do some spring turkeys over there. Any of guys out that way let me know! This message has been edited. Last edited by: 67NOV, Mon 23 March 2009 06:54 AM", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "", 
        "reply": "Thanks for the thread Wolfhound, I know there's a God in heaven, each time I hear a gobbler sound off, before it comes down from its roost! Love spring turkey hunting! Here's a little story about my first turkey hunt. First time I went turkey hunting, my freind set me up near the cabin as he & another guy went off elsewhere. I was doing some calling & got a gobbler answering. Sounded like it was coming straight in! I had a little two foot high camo net set up around with an old stone wall to my back. I was peeping over the wall looking into the woods, doing some light calling, had my shot gun leaning on the wall. I happen to turn around to see a gobbler in full strut, stomping into the field(opposite of where I was looking), my jaw dropped. He must have came in to a certain point, made a bit of a half circle to come into the field off to my left, nearly behind me. I had a jake decoy out. Guess he was pizzed to see a jake making a move on his would-be girlfreind! I had to do this slow motion move, reaching for the shotgun & turning around, while watching him to see when he was distracted to move. Thank goodness, for the jake decoy, he seemed ready to kick the jake's azz. Managed to get the gun up, take the shot & drop him(he was only about 20 yards way). About 15 minutes later, my buddies rolled up. I was sitting on the deck with the bird next to me. I said to them, \"is this how it's done?!?\" They had heard the shot & the one fellow, had said, \"Damn! That sounded like it came from the cabin\". They confessed, me being a rookie, they were afraid I might screw up their hunt. Since then(that was about 14yars ago), I've had some pretty good luck with spring turkey. If I was half as lucky with deer, I'd cll myself a hunter! Next month, we're off to Ohio, to do some spring turkeys over there. Any of guys out that way let me know! This message has been edited. Last edited by: 67NOV, Mon 23 March 2009 06:54 AM", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-23 06:37:00", 
        "title": "Turkey Hunting", 
        "userID": "67NOV"
    }, 
    {
        "content": "I've often considered turkey hunting, but that's a roundtuit! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "", 
        "reply": "I've often considered turkey hunting, but that's a roundtuit! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5120095812001", 
        "time": "2009-03-23 09:17:00", 
        "title": "Turkey Hunting", 
        "userID": "Bergy46"
    }
]