[
    {
        "content": "I am a single parent of 2 and i am in the process of joining the army. So, if there is anyone out there who can give me advice on what to expect and not to expect, I would greatly appreciate it.", 
        "intTime": 20090329, 
        "postID": 1, 
        "quote": "", 
        "reply": "I am a single parent of 2 and i am in the process of joining the army. So, if there is anyone out there who can give me advice on what to expect and not to expect, I would greatly appreciate it.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 08:34:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "Whose gona take care of the kids when you get shipped to Afghanistan for a year? Wandering and Wondering", 
        "intTime": 20090329, 
        "postID": 2, 
        "quote": "", 
        "reply": "Whose gona take care of the kids when you get shipped to Afghanistan for a year? Wandering and Wondering", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 08:43:00", 
        "title": "Joining the Army", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military", 
        "intTime": 20090329, 
        "postID": 3, 
        "quote": "", 
        "reply": "I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 09:15:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 4, 
        "quote": "", 
        "reply": "you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 09:29:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it.", 
        "intTime": 20090329, 
        "postID": 5, 
        "quote": "", 
        "reply": "It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 11:30:00", 
        "title": "Joining the Army", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following.", 
        "intTime": 20090329, 
        "postID": 6, 
        "quote": "Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from?", 
        "reply": " As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 11:51:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it. Thanks for that input and advice. I really appreciate that", 
        "intTime": 20090329, 
        "postID": 7, 
        "quote": "Originally posted by Ruanne: It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it.", 
        "reply": " Thanks for that input and advice. I really appreciate that", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 11:54:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 8, 
        "quote": "Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following.", 
        "reply": " your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:10:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military May I assume from your comment that you're coming off a bad marriage? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090329, 
        "postID": 9, 
        "quote": "Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military", 
        "reply": " May I assume from your comment that you're coming off a bad marriage? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:27:00", 
        "title": "Joining the Army", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point.", 
        "intTime": 20090329, 
        "postID": 10, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's.", 
        "reply": " thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:29:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point. Anitra, I do not want to be the fly-in-the-soup but I speak from a man who raised his daughter alone from the time she was 18 months old... my life was no longer my own... all that I did was dictated by what was best for my daughter... no more partying, no more tom-cating, even where I lived was determined by her needs, schooling, and safety... if I have sounded harsh it is because of my concern for your children... good luck. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 11, 
        "quote": "Originally posted by anitrawilson: quote: Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point.", 
        "reply": " Anitra, I do not want to be the fly-in-the-soup but I speak from a man who raised his daughter alone from the time she was 18 months old... my life was no longer my own... all that I did was dictated by what was best for my daughter... no more partying, no more tom-cating, even where I lived was determined by her needs, schooling, and safety... if I have sounded harsh it is because of my concern for your children... good luck. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:51:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 12, 
        "quote": "", 
        "reply": "oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:56:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing.", 
        "intTime": 20090329, 
        "postID": 13, 
        "quote": "Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful.", 
        "reply": " No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:14:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military No I am not coming off a bad marriage, I have never been married. May I assume from your comment that you're coming off a bad marriage?", 
        "intTime": 20090329, 
        "postID": 14, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military No I am not coming off a bad marriage, I have never been married. May I assume from your comment that you're coming off a bad marriage?", 
        "reply": "", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:17:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: custody of my kids go to my parents... Once you join, the father will have a strong case. I have a feeling he's a dead-beat though.", 
        "intTime": 20090329, 
        "postID": 15, 
        "quote": "custody of my kids go to my parents...", 
        "reply": " Once you join, the father will have a strong case. I have a feeling he's a dead-beat though.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:30:00", 
        "title": "Joining the Army", 
        "userID": "soscorpio"
    }, 
    {
        "content": "You might want to post this to the Army Thread-- The tender hearts there might help ya chew it a little finer - - http://forums.military.com/eve/forums/a/cfrm/f/56919758 Wandering and Wondering", 
        "intTime": 20090329, 
        "postID": 16, 
        "quote": "", 
        "reply": "You might want to post this to the Army Thread-- The tender hearts there might help ya chew it a little finer - - http://forums.military.com/eve/forums/a/cfrm/f/56919758 Wandering and Wondering", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:33:00", 
        "title": "Joining the Army", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "It's honorable to desire to serve your country! However, your responsiblity is to your children! You may want to consider that, as for pay, you can change that by furthering your your education. that will open more doors for you in the civilian job market. Have a look at this site, baby.lovetoknow.com]www.baby.lovetoknow.com I hope that helps! This message has been edited. Last edited by: <NEMESIS1960>, Sun 29 March 2009 04:09 PM Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090329, 
        "postID": 17, 
        "quote": "", 
        "reply": "It's honorable to desire to serve your country! However, your responsiblity is to your children! You may want to consider that, as for pay, you can change that by furthering your your education. that will open more doors for you in the civilian job market. Have a look at this site, baby.lovetoknow.com]www.baby.lovetoknow.com I hope that helps! This message has been edited. Last edited by: <NEMESIS1960>, Sun 29 March 2009 04:09 PM Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:45:00", 
        "title": "Joining the Army", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy!! No hot links!! You'll get the ax the ax the ax, right in the neck the neck the neck!! Wandering and Wondering", 
        "intTime": 20090329, 
        "postID": 18, 
        "quote": "", 
        "reply": "Bergy!! No hot links!! You'll get the ax the ax the ax, right in the neck the neck the neck!! Wandering and Wondering", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:49:00", 
        "title": "Joining the Army", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing. Custody is more serious than transfering a title to a pickup truck. In most cases it's binding and non-revokeable. The father has a superior right to the children than does your parents. He is in the position to object to this plan and seek sole custody if you voluntarily enlist. If custody is transferred, there is no guarantee you will get them back. The laws of your state take precedence over what a recruiter assures you. Thread carefully and become aware of all consequences. Stop by your local Family Court and seek professional guidance.", 
        "intTime": 20090329, 
        "postID": 19, 
        "quote": "Originally posted by anitrawilson: quote: Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing.", 
        "reply": " Custody is more serious than transfering a title to a pickup truck. In most cases it's binding and non-revokeable. The father has a superior right to the children than does your parents. He is in the position to object to this plan and seek sole custody if you voluntarily enlist. If custody is transferred, there is no guarantee you will get them back. The laws of your state take precedence over what a recruiter assures you. Thread carefully and become aware of all consequences. Stop by your local Family Court and seek professional guidance.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:57:00", 
        "title": "Joining the Army", 
        "userID": "scpd3045"
    }, 
    {
        "content": "You will seriously work your bunz off for the lil bit of $ you get. I was married, with 2 kids on E-4 pay, and never made ends meet. I was an E-4 for 6 years! By the time I made E-5 I was single and actually was making decent $.", 
        "intTime": 20090329, 
        "postID": 20, 
        "quote": "", 
        "reply": "You will seriously work your bunz off for the lil bit of $ you get. I was married, with 2 kids on E-4 pay, and never made ends meet. I was an E-4 for 6 years! By the time I made E-5 I was single and actually was making decent $.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 15:22:00", 
        "title": "Joining the Army", 
        "userID": "azmax64"
    }, 
    {
        "content": "I am a single parent of 2 and i am in the process of joining the army. So, if there is anyone out there who can give me advice on what to expect and not to expect, I would greatly appreciate it.", 
        "intTime": 20090329, 
        "postID": 21, 
        "quote": "", 
        "reply": "I am a single parent of 2 and i am in the process of joining the army. So, if there is anyone out there who can give me advice on what to expect and not to expect, I would greatly appreciate it.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 08:34:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "Whose gona take care of the kids when you get shipped to Afghanistan for a year? Wandering and Wondering", 
        "intTime": 20090329, 
        "postID": 22, 
        "quote": "", 
        "reply": "Whose gona take care of the kids when you get shipped to Afghanistan for a year? Wandering and Wondering", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 08:43:00", 
        "title": "Joining the Army", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military", 
        "intTime": 20090329, 
        "postID": 23, 
        "quote": "", 
        "reply": "I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 09:15:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 24, 
        "quote": "", 
        "reply": "you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 09:29:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it.", 
        "intTime": 20090329, 
        "postID": 25, 
        "quote": "", 
        "reply": "It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 11:30:00", 
        "title": "Joining the Army", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following.", 
        "intTime": 20090329, 
        "postID": 26, 
        "quote": "Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from?", 
        "reply": " As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 11:51:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it. Thanks for that input and advice. I really appreciate that", 
        "intTime": 20090329, 
        "postID": 27, 
        "quote": "Originally posted by Ruanne: It's not easy, if your hours fall outside the normal \"seven to five\" that most child care centers cover. It's also tough when you get CQ or any kind of a field assignment - those can last a few weeks. You'll also have to go to courses lasting a few weeks at various times in your career, to say nothing of deployments. Trying to find childcare to cover all of these situations won't be easy. If you do keep your kids with you, their school will be disrupted if you have to ship them home every time you have a training course lasting just a few weeks. Just so you're aware before you go into it.", 
        "reply": " Thanks for that input and advice. I really appreciate that", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 11:54:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 28, 
        "quote": "Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following.", 
        "reply": " your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:10:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military May I assume from your comment that you're coming off a bad marriage? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090329, 
        "postID": 29, 
        "quote": "Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military", 
        "reply": " May I assume from your comment that you're coming off a bad marriage? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:27:00", 
        "title": "Joining the Army", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point.", 
        "intTime": 20090329, 
        "postID": 30, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's.", 
        "reply": " thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:29:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point. Anitra, I do not want to be the fly-in-the-soup but I speak from a man who raised his daughter alone from the time she was 18 months old... my life was no longer my own... all that I did was dictated by what was best for my daughter... no more partying, no more tom-cating, even where I lived was determined by her needs, schooling, and safety... if I have sounded harsh it is because of my concern for your children... good luck. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 31, 
        "quote": "Originally posted by anitrawilson: quote: Originally posted by m551sheridan: quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: you're a single parent with two kids, joining the military... what do you expect young lady? You'll be a private soldier and with low enlisted pay you expect to be able to care for your children, house and feed yourselves? You have got to be kidding. What are you thinking? If you've done any research at all you would already know all this - what are you running away from? As far as the pay is concerned I already know about the pay that the military receives and it is not much of a difference than what I make now. and as for running away from anything I am not. I have always wanted to go to the military, unlike some people who join just because there is nothing else to do....I am not one of those people. This is an actual dream I am following. your dream is a good one but now its the kids which should dictate which road you walk... most likely your kids will stay behind and that is what I was infering when I said what are you running away from... there is no on-post housing for the lower enlisted (least wise in my time) off post housing available to you will most likely be in the form of cheap mobile home parks and priced to high... noper, you have no business enlisting with the responcibilities you already have - the kids will suffer. Also, like another said here, what are you going to do with the kids when you get called in the middle of the night to report because the on-duty became sick? Or you're an alternate for duty which means ya have to be in the company area... who takes care of the kids? You best rethink your priorities... it's no longer YOUR life... it is THEIR's. thanks for the advice. i really appreciate you giving me the facts on what to expect, I needed that because i am taking everyones advice into consideration and me not knowing you makes it better because its not a bias opinion its neutral and to the point.", 
        "reply": " Anitra, I do not want to be the fly-in-the-soup but I speak from a man who raised his daughter alone from the time she was 18 months old... my life was no longer my own... all that I did was dictated by what was best for my daughter... no more partying, no more tom-cating, even where I lived was determined by her needs, schooling, and safety... if I have sounded harsh it is because of my concern for your children... good luck. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:51:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090329, 
        "postID": 32, 
        "quote": "", 
        "reply": "oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 12:56:00", 
        "title": "Joining the Army", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing.", 
        "intTime": 20090329, 
        "postID": 33, 
        "quote": "Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful.", 
        "reply": " No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:14:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military No I am not coming off a bad marriage, I have never been married. May I assume from your comment that you're coming off a bad marriage?", 
        "intTime": 20090329, 
        "postID": 34, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by anitrawilson: I have the custody thing taking care of as far as the deployment situation is concerned. my main concern is post life, everyone is telling me that being a single parent and working on post and in medical is HELL, because of the lack of childcare for the military No I am not coming off a bad marriage, I have never been married. May I assume from your comment that you're coming off a bad marriage?", 
        "reply": "", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:17:00", 
        "title": "Joining the Army", 
        "userID": "anitrawilson"
    }, 
    {
        "content": "quote: custody of my kids go to my parents... Once you join, the father will have a strong case. I have a feeling he's a dead-beat though.", 
        "intTime": 20090329, 
        "postID": 35, 
        "quote": "custody of my kids go to my parents...", 
        "reply": " Once you join, the father will have a strong case. I have a feeling he's a dead-beat though.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:30:00", 
        "title": "Joining the Army", 
        "userID": "soscorpio"
    }, 
    {
        "content": "You might want to post this to the Army Thread-- The tender hearts there might help ya chew it a little finer - - http://forums.military.com/eve/forums/a/cfrm/f/56919758 Wandering and Wondering", 
        "intTime": 20090329, 
        "postID": 36, 
        "quote": "", 
        "reply": "You might want to post this to the Army Thread-- The tender hearts there might help ya chew it a little finer - - http://forums.military.com/eve/forums/a/cfrm/f/56919758 Wandering and Wondering", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:33:00", 
        "title": "Joining the Army", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "It's honorable to desire to serve your country! However, your responsiblity is to your children! You may want to consider that, as for pay, you can change that by furthering your your education. that will open more doors for you in the civilian job market. Have a look at this site, baby.lovetoknow.com]www.baby.lovetoknow.com I hope that helps! This message has been edited. Last edited by: <NEMESIS1960>, Sun 29 March 2009 04:09 PM Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090329, 
        "postID": 37, 
        "quote": "", 
        "reply": "It's honorable to desire to serve your country! However, your responsiblity is to your children! You may want to consider that, as for pay, you can change that by furthering your your education. that will open more doors for you in the civilian job market. Have a look at this site, baby.lovetoknow.com]www.baby.lovetoknow.com I hope that helps! This message has been edited. Last edited by: <NEMESIS1960>, Sun 29 March 2009 04:09 PM Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:45:00", 
        "title": "Joining the Army", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy!! No hot links!! You'll get the ax the ax the ax, right in the neck the neck the neck!! Wandering and Wondering", 
        "intTime": 20090329, 
        "postID": 38, 
        "quote": "", 
        "reply": "Bergy!! No hot links!! You'll get the ax the ax the ax, right in the neck the neck the neck!! Wandering and Wondering", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:49:00", 
        "title": "Joining the Army", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by anitrawilson: quote: Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing. Custody is more serious than transfering a title to a pickup truck. In most cases it's binding and non-revokeable. The father has a superior right to the children than does your parents. He is in the position to object to this plan and seek sole custody if you voluntarily enlist. If custody is transferred, there is no guarantee you will get them back. The laws of your state take precedence over what a recruiter assures you. Thread carefully and become aware of all consequences. Stop by your local Family Court and seek professional guidance.", 
        "intTime": 20090329, 
        "postID": 39, 
        "quote": "Originally posted by anitrawilson: quote: Originally posted by m551sheridan: oh, and Anitra, if what Vicdude asked is true, and if your ex will be watching the children while you are away you set yourself up for losing the children to him and having to pay him child support..... my sister and her ex had a great agreement until it was his turn to watch the children... then he took her to court and claimed she abandoned the kids.. he got the custody, the money and she wasn't even allowed to visit...... be careful. No what he said is not true while I am gone and if I decide to join, custody of my kids go to my parents...I am not that crazy. They will be the ones to sign the custody forms required to join the military. the only thing my ex will have is visitation rights. I have everything in writing.", 
        "reply": " Custody is more serious than transfering a title to a pickup truck. In most cases it's binding and non-revokeable. The father has a superior right to the children than does your parents. He is in the position to object to this plan and seek sole custody if you voluntarily enlist. If custody is transferred, there is no guarantee you will get them back. The laws of your state take precedence over what a recruiter assures you. Thread carefully and become aware of all consequences. Stop by your local Family Court and seek professional guidance.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 13:57:00", 
        "title": "Joining the Army", 
        "userID": "scpd3045"
    }, 
    {
        "content": "You will seriously work your bunz off for the lil bit of $ you get. I was married, with 2 kids on E-4 pay, and never made ends meet. I was an E-4 for 6 years! By the time I made E-5 I was single and actually was making decent $.", 
        "intTime": 20090329, 
        "postID": 40, 
        "quote": "", 
        "reply": "You will seriously work your bunz off for the lil bit of $ you get. I was married, with 2 kids on E-4 pay, and never made ends meet. I was an E-4 for 6 years! By the time I made E-5 I was single and actually was making decent $.", 
        "threadID": "5291911282_8860042912001", 
        "time": "2009-03-29 15:22:00", 
        "title": "Joining the Army", 
        "userID": "azmax64"
    }
]