[
    {
        "content": "\"A military judge has recommended that five of the seven Fort Bragg soldiers charged in the death of their friend face a court-martial.\" \"http://www.fayobserver.com/article?id=321702\" I wonder if some of you might like to kick this around. It's one of those things that no matter how one looks at it, it's really unfortunate. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"A military judge has recommended that five of the seven Fort Bragg soldiers charged in the death of their friend face a court-martial.\" \"http://www.fayobserver.com/article?id=321702\" I wonder if some of you might like to kick this around. It's one of those things that no matter how one looks at it, it's really unfortunate. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_3730046812001", 
        "time": "2009-03-23 06:56:00", 
        "title": "A military judge has recommended that five of the seven Fort Bragg soldiers charged i", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: http://www.fayobserver.com/article?id=321702 The guy was irrational, I would have left him to his own devices. I will dump an irrational drunk like a cheap date. I don't need that kind of exposure. They could have bound him with some duct tape, dropped him off near the main gate and let him walk it off. There seems to be a lot of choices they could have made. It's sad because Hollywood is gonna make a movie and you know it, They dwell on issues like this. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "http://www.fayobserver.com/article?id=321702", 
        "reply": " The guy was irrational, I would have left him to his own devices. I will dump an irrational drunk like a cheap date. I don't need that kind of exposure. They could have bound him with some duct tape, dropped him off near the main gate and let him walk it off. There seems to be a lot of choices they could have made. It's sad because Hollywood is gonna make a movie and you know it, They dwell on issues like this. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_3730046812001", 
        "time": "2009-03-23 09:08:00", 
        "title": "A military judge has recommended that five of the seven Fort Bragg soldiers charged i", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: http://www.fayobserver.com/article?id=321702 The guy was irrational, I would have left him to his own devices. I will dump an irrational drunk like a cheap date. I don't need that kind of exposure. They could have bound him with some duct tape, dropped him off near the main gate and let him walk it off. There seems to be a lot of choices they could have made. It's sad because Hollywood is gonna make a movie and you know it, They dwell on issues like this. Apparently the guy was as strong as a bull. He tore down a chain link fence trying to get away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "Originally posted by sargeant_green: quote: http://www.fayobserver.com/article?id=321702 The guy was irrational, I would have left him to his own devices. I will dump an irrational drunk like a cheap date. I don't need that kind of exposure. They could have bound him with some duct tape, dropped him off near the main gate and let him walk it off. There seems to be a lot of choices they could have made. It's sad because Hollywood is gonna make a movie and you know it, They dwell on issues like this.", 
        "reply": " Apparently the guy was as strong as a bull. He tore down a chain link fence trying to get away. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_3730046812001", 
        "time": "2009-03-23 11:19:00", 
        "title": "A military judge has recommended that five of the seven Fort Bragg soldiers charged i", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by sargeant_green: quote: http://www.fayobserver.com/article?id=321702 The guy was irrational, I would have left him to his own devices. I will dump an irrational drunk like a cheap date. I don't need that kind of exposure. They could have bound him with some duct tape, dropped him off near the main gate and let him walk it off. There seems to be a lot of choices they could have made. It's sad because Hollywood is gonna make a movie and you know it, They dwell on issues like this. Apparently the guy was as strong as a bull. He tore down a chain link fence trying to get away. Yet, they managed to choke him out? Duct tape bro. If you can get into a position to choke them out them just duct tape'em to a light pole and walk away as a group. My Daughter when all grown up had a party. She assigned a friend to perform the role of 'security\". I was alarmed to say the least that a person would even have to be assigned that kind of title and position. He asked me what I thought after telling me he had been working the last five years as a bouncer. I told him to hold that thought left and came back and handed him a poncho, a roll of duct tape and a bus pass. \"I told him don't hurt anyone just tape'em up (hands) put the poncho over them and stick the bus pass in their pocket and drop them off at the bus stop.\" He was amused and decided it was a pretty good idea. Choking the guy out was a BAD decision. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by sargeant_green: quote: http://www.fayobserver.com/article?id=321702 The guy was irrational, I would have left him to his own devices. I will dump an irrational drunk like a cheap date. I don't need that kind of exposure. They could have bound him with some duct tape, dropped him off near the main gate and let him walk it off. There seems to be a lot of choices they could have made. It's sad because Hollywood is gonna make a movie and you know it, They dwell on issues like this. Apparently the guy was as strong as a bull. He tore down a chain link fence trying to get away.", 
        "reply": " Yet, they managed to choke him out? Duct tape bro. If you can get into a position to choke them out them just duct tape'em to a light pole and walk away as a group. My Daughter when all grown up had a party. She assigned a friend to perform the role of 'security\". I was alarmed to say the least that a person would even have to be assigned that kind of title and position. He asked me what I thought after telling me he had been working the last five years as a bouncer. I told him to hold that thought left and came back and handed him a poncho, a roll of duct tape and a bus pass. \"I told him don't hurt anyone just tape'em up (hands) put the poncho over them and stick the bus pass in their pocket and drop them off at the bus stop.\" He was amused and decided it was a pretty good idea. Choking the guy out was a BAD decision. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_3730046812001", 
        "time": "2009-03-23 11:37:00", 
        "title": "A military judge has recommended that five of the seven Fort Bragg soldiers charged i", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "That situation is a tough one to call... sad all the way around. I suspect that there will be a conviction on a lesser charge somewhere... Although I will not agree with it. I am not familiar with their unit. The 82nd of my day was different... but not in the matter of leaving a soldier behind. As for the bar they were at??? \"Ugly Stick Saloon\" as in \"she is soooo ugly she must have been hit with an Ugly Stick.\" Why the heck would they name a bar like that? And would females actually go if they knew what it meant? But that is an entirely different question... Whatever happened to names like \"The Skyliner Club\" and such? LOL", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "", 
        "reply": "That situation is a tough one to call... sad all the way around. I suspect that there will be a conviction on a lesser charge somewhere... Although I will not agree with it. I am not familiar with their unit. The 82nd of my day was different... but not in the matter of leaving a soldier behind. As for the bar they were at??? \"Ugly Stick Saloon\" as in \"she is soooo ugly she must have been hit with an Ugly Stick.\" Why the heck would they name a bar like that? And would females actually go if they knew what it meant? But that is an entirely different question... Whatever happened to names like \"The Skyliner Club\" and such? LOL", 
        "threadID": "5291911282_3730046812001", 
        "time": "2009-03-23 11:52:00", 
        "title": "A military judge has recommended that five of the seven Fort Bragg soldiers charged i", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Whatever happened to names like \"The Skyliner Club\" and such? They went into the crapper just as did Rick's How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "Whatever happened to names like \"The Skyliner Club\" and such?", 
        "reply": " They went into the crapper just as did Rick's How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_3730046812001", 
        "time": "2009-03-23 12:07:00", 
        "title": "A military judge has recommended that five of the seven Fort Bragg soldiers charged i", 
        "userID": "Vicdude"
    }
]