[
    {
        "content": "I have been reviewing the Law Disqualifications on your site and need some clarification. Do your convictions \"fall off\" after so many years or are they \"forever\" for military consideration? I have several traffic tickets since I was 16, though all are older than 3 years. I also have a DUI that will be 3 years old in July 2010. Thank you!", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "I have been reviewing the Law Disqualifications on your site and need some clarification. Do your convictions \"fall off\" after so many years or are they \"forever\" for military consideration? I have several traffic tickets since I was 16, though all are older than 3 years. I also have a DUI that will be 3 years old in July 2010. Thank you!", 
        "threadID": "5291911282_6040064712001", 
        "time": "2009-03-10 11:54:00", 
        "title": "Disqualifications-Length of Time", 
        "userID": "MDMartin"
    }, 
    {
        "content": "Welcome aboard, First off this bat, this ISN'T an offical DOD or military site, it's a civilain operation. It's but dedicated to connecting the military types. Having said that, we do have real live recruiters that post here : Joining the Military ... . They will give you honest answers to your questions. IN general for most minor infraction you have to at least have any pending court action or penalties cleared up. Also I believe you need permission from a judge if your on any type of a probation. (DON'T QUOTE ME FOR SURE) Good Luck.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Welcome aboard, First off this bat, this ISN'T an offical DOD or military site, it's a civilain operation. It's but dedicated to connecting the military types. Having said that, we do have real live recruiters that post here : Joining the Military ... . They will give you honest answers to your questions. IN general for most minor infraction you have to at least have any pending court action or penalties cleared up. Also I believe you need permission from a judge if your on any type of a probation. (DON'T QUOTE ME FOR SURE) Good Luck.", 
        "threadID": "5291911282_6040064712001", 
        "time": "2009-03-10 12:01:00", 
        "title": "Disqualifications-Length of Time", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by MDMartin: I have been reviewing the Law Disqualifications on your site and need some clarification. Do your convictions \"fall off\" after so many years or are they \"forever\" for military consideration? I have several traffic tickets since I was 16, though all are older than 3 years. I also have a DUI that will be 3 years old in July 2010. Thank you! The longer the Army stays at war, the less they care about stuff like that. If I were you, I would go for it. Ask for a waiver. Just about anything these days can get waived. They need bodies.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "Originally posted by MDMartin: I have been reviewing the Law Disqualifications on your site and need some clarification. Do your convictions \"fall off\" after so many years or are they \"forever\" for military consideration? I have several traffic tickets since I was 16, though all are older than 3 years. I also have a DUI that will be 3 years old in July 2010. Thank you!", 
        "reply": " The longer the Army stays at war, the less they care about stuff like that. If I were you, I would go for it. Ask for a waiver. Just about anything these days can get waived. They need bodies.", 
        "threadID": "5291911282_6040064712001", 
        "time": "2009-03-10 18:31:00", 
        "title": "Disqualifications-Length of Time", 
        "userID": "michigancaptain"
    }
]