[
    {
        "content": "Your definition of terrorism is wholly mistaken. It is the deliberate targetting of non-combatants, and infrastructure with no military purpose or application.", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "", 
        "reply": "Your definition of terrorism is wholly mistaken. It is the deliberate targetting of non-combatants, and infrastructure with no military purpose or application.", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-01 04:44:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: Your definition of terrorism is wholly mistaken. It is the deliberate targetting of non-combatants, and infrastructure with no military purpose or application. Quite frankly I couldn't make heads or tails of his post. Maybe I'm being obtuse? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "Originally posted by M1Lase_n_Blaze: Your definition of terrorism is wholly mistaken. It is the deliberate targetting of non-combatants, and infrastructure with no military purpose or application.", 
        "reply": " Quite frankly I couldn't make heads or tails of his post. Maybe I'm being obtuse? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-02 06:55:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Quite frankly I couldn't make heads or tails of his post. Maybe I'm being obtuse? Oh I caught what he's selling. He's talking about killing millions upon millions. He wants to target everyone, so that no one is safe. How does this bring about World Peace????? It doesn't Definition He's either a KOOK or a TROLL ( six of one, half dozen of the other ) This guy or gal is WACKED Hey Buddy go start with yourself I'm just gonna watch the show", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "Quite frankly I couldn't make heads or tails of his post. Maybe I'm being obtuse?", 
        "reply": " Oh I caught what he's selling. He's talking about killing millions upon millions. He wants to target everyone, so that no one is safe. How does this bring about World Peace????? It doesn't Definition He's either a KOOK or a TROLL ( six of one, half dozen of the other ) This guy or gal is WACKED Hey Buddy go start with yourself I'm just gonna watch the show", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-02 22:24:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "fredette"
    }, 
    {
        "content": "quote: Terrorism that leads to peace YUP! By the Acre - - Wandering and Wondering", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Terrorism that leads to peace", 
        "reply": " YUP! By the Acre - - Wandering and Wondering", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-02 22:33:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck is he/she babbling about? Could we have a troll. No bio, make me suspicious! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "", 
        "reply": "What the heck is he/she babbling about? Could we have a troll. No bio, make me suspicious! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-03 09:09:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "Bergy46"
    }, 
    {
        "content": "World Peace through killing at random? Terrorists for peace? And what's that line at the end... quote: It is the truly educated who can read this, but it is the truly awake who can understand it. I can both read and understand it, but it doesn't make any sense. Killing the people of the world at random will not cause the people of the world to unite on a common front for peace. Fear will not bring world peace. World leaders will blame each other for these attacks on their citizens. There will be countries arguing about how to quell this \"elite\" murderous force where and how to find them and jurisdiction. Nice try, I agree with the whacko view more than troll.", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "It is the truly educated who can read this, but it is the truly awake who can understand it.", 
        "reply": "World Peace through killing at random? Terrorists for peace? And what's that line at the end...  I can both read and understand it, but it doesn't make any sense. Killing the people of the world at random will not cause the people of the world to unite on a common front for peace. Fear will not bring world peace. World leaders will blame each other for these attacks on their citizens. There will be countries arguing about how to quell this \"elite\" murderous force where and how to find them and jurisdiction. Nice try, I agree with the whacko view more than troll.", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-03 10:08:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: World Peace through killing at random? Terrorists for peace? And what's that line at the end... quote: It is the truly educated who can read this, but it is the truly awake who can understand it. I can both read and understand it, but it doesn't make any sense. Killing the people of the world at random will not cause the people of the world to unite on a common front for peace. Fear will not bring world peace. World leaders will blame each other for these attacks on their citizens. There will be countries arguing about how to quell this \"elite\" murderous force where and how to find them and jurisdiction. Nice try, I agree with the whacko view more than troll. -1 post -\"this member\" -Resides in Cal A wacko who moonlights as a troll.", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "Originally posted by ArtyOps: World Peace through killing at random? Terrorists for peace? And what's that line at the end... quote: It is the truly educated who can read this, but it is the truly awake who can understand it. I can both read and understand it, but it doesn't make any sense. Killing the people of the world at random will not cause the people of the world to unite on a common front for peace. Fear will not bring world peace. World leaders will blame each other for these attacks on their citizens. There will be countries arguing about how to quell this \"elite\" murderous force where and how to find them and jurisdiction. Nice try, I agree with the whacko view more than troll.", 
        "reply": " -1 post -\"this member\" -Resides in Cal A wacko who moonlights as a troll.", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-03 10:34:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: quote: It is the truly educated who can read this, but it is the truly awake who can understand it. I think I'd prefer neither. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "quote: It is the truly educated who can read this, but it is the truly awake who can understand it.", 
        "reply": " I think I'd prefer neither. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8740045612001", 
        "time": "2009-03-03 11:55:00", 
        "title": "Terrorism that leads to peace", 
        "userID": "Vicdude"
    }
]