[
    {
        "content": "My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "intTime": 20090303, 
        "postID": 1, 
        "quote": "", 
        "reply": "My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 18:57:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Duster6"
    }, 
    {
        "content": "Gee, the good times are beginning to roll! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 2, 
        "quote": "", 
        "reply": "Gee, the good times are beginning to roll! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:00:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Hiya Mike, Thinkin' about driving to DC in my 22 year-old Jeep and asking Congress to bail me out and stimulate me. I figure 300K would pay off my mortgage, my HELOC and all my credit cards and purchase a little coffee stand for my wife to run now that she's retired. Then every penny I make I could pump back into the economy and further stimulate the economy where it counts...at the consumer's end. Might even buy reservations at Palace Station for the SFA Convention. Nah, give it to the *******s in the limos...they need it worse than I do. I mean, what would the world do without one more Gulfstream?", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hiya Mike, Thinkin' about driving to DC in my 22 year-old Jeep and asking Congress to bail me out and stimulate me. I figure 300K would pay off my mortgage, my HELOC and all my credit cards and purchase a little coffee stand for my wife to run now that she's retired. Then every penny I make I could pump back into the economy and further stimulate the economy where it counts...at the consumer's end. Might even buy reservations at Palace Station for the SFA Convention. Nah, give it to the *******s in the limos...they need it worse than I do. I mean, what would the world do without one more Gulfstream?", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:19:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "Sorry to hear about the job lose.They say 20,000 are lost each day............", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "", 
        "reply": "Sorry to hear about the job lose.They say 20,000 are lost each day............", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:29:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "ENYVTHS"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "reply": " Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:36:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. I'd like to give my thoughts about Obottom, But I've already got in trouble for doin it. Watch out Duster. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "reply": " I'd like to give my thoughts about Obottom, But I've already got in trouble for doin it. Watch out Duster. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:41:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all,", 
        "reply": " OH-oh... incoming. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:43:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming. Like always, you can handle it! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming.", 
        "reply": " Like always, you can handle it! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:48:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "", 
        "reply": "It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:03:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:31:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:32:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too..... Nothin Like a online edumication! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "Originally posted by Woody_in_La: It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "reply": " Nothin Like a online edumication! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:43:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Originally posted by peaceforall:", 
        "reply": " I wonder if \"He \" would consider selling those EARS? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:47:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Come on Mom, We all know he lived at a Holiday Inn Express on the BS trail. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "Originally posted by peaceforall:", 
        "reply": " Come on Mom, We all know he lived at a Holiday Inn Express on the BS trail. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:52:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS? I think he's sayin' WOOOOOOOOOWWWWW, We'll sell America, we'll sell Oil, we'll sell soup, we'll sell everyting except da ears....... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS?", 
        "reply": " I think he's sayin' WOOOOOOOOOWWWWW, We'll sell America, we'll sell Oil, we'll sell soup, we'll sell everyting except da ears....... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:54:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "C.R.", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "", 
        "reply": "C.R.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:02:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "I have cum to save da world......... And I have fambly pictures to proobe it......... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "", 
        "reply": "I have cum to save da world......... And I have fambly pictures to proobe it......... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:05:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by CYCLIC_RUNAWAY: C.R. That's funny..... CR ~ Are you any kin to Colin Powell? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 18, 
        "quote": "Originally posted by CYCLIC_RUNAWAY: C.R.", 
        "reply": " That's funny..... CR ~ Are you any kin to Colin Powell? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:11:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: I have cum to save da world......... And I have fambly pictures to proobe it......... Lets Leave Buckwheat out of this, He wasn't here to vote. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 19, 
        "quote": "Originally posted by peaceforall: I have cum to save da world......... And I have fambly pictures to proobe it.........", 
        "reply": " Lets Leave Buckwheat out of this, He wasn't here to vote. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:18:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "C.R.", 
        "intTime": 20090303, 
        "postID": 20, 
        "quote": "", 
        "reply": "C.R.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:28:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "intTime": 20090303, 
        "postID": 21, 
        "quote": "", 
        "reply": "My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 18:57:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Duster6"
    }, 
    {
        "content": "Gee, the good times are beginning to roll! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 22, 
        "quote": "", 
        "reply": "Gee, the good times are beginning to roll! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:00:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Hiya Mike, Thinkin' about driving to DC in my 22 year-old Jeep and asking Congress to bail me out and stimulate me. I figure 300K would pay off my mortgage, my HELOC and all my credit cards and purchase a little coffee stand for my wife to run now that she's retired. Then every penny I make I could pump back into the economy and further stimulate the economy where it counts...at the consumer's end. Might even buy reservations at Palace Station for the SFA Convention. Nah, give it to the *******s in the limos...they need it worse than I do. I mean, what would the world do without one more Gulfstream?", 
        "intTime": 20090303, 
        "postID": 23, 
        "quote": "", 
        "reply": "Hiya Mike, Thinkin' about driving to DC in my 22 year-old Jeep and asking Congress to bail me out and stimulate me. I figure 300K would pay off my mortgage, my HELOC and all my credit cards and purchase a little coffee stand for my wife to run now that she's retired. Then every penny I make I could pump back into the economy and further stimulate the economy where it counts...at the consumer's end. Might even buy reservations at Palace Station for the SFA Convention. Nah, give it to the *******s in the limos...they need it worse than I do. I mean, what would the world do without one more Gulfstream?", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:19:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "Sorry to hear about the job lose.They say 20,000 are lost each day............", 
        "intTime": 20090303, 
        "postID": 24, 
        "quote": "", 
        "reply": "Sorry to hear about the job lose.They say 20,000 are lost each day............", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:29:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "ENYVTHS"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 25, 
        "quote": "Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "reply": " Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:36:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. I'd like to give my thoughts about Obottom, But I've already got in trouble for doin it. Watch out Duster. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 26, 
        "quote": "Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "reply": " I'd like to give my thoughts about Obottom, But I've already got in trouble for doin it. Watch out Duster. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:41:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 27, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all,", 
        "reply": " OH-oh... incoming. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:43:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming. Like always, you can handle it! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 28, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming.", 
        "reply": " Like always, you can handle it! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:48:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "intTime": 20090303, 
        "postID": 29, 
        "quote": "", 
        "reply": "It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:03:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 30, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:31:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 31, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:32:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too..... Nothin Like a online edumication! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 32, 
        "quote": "Originally posted by Woody_in_La: It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "reply": " Nothin Like a online edumication! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:43:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 33, 
        "quote": "Originally posted by peaceforall:", 
        "reply": " I wonder if \"He \" would consider selling those EARS? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:47:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Come on Mom, We all know he lived at a Holiday Inn Express on the BS trail. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 34, 
        "quote": "Originally posted by peaceforall:", 
        "reply": " Come on Mom, We all know he lived at a Holiday Inn Express on the BS trail. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:52:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS? I think he's sayin' WOOOOOOOOOWWWWW, We'll sell America, we'll sell Oil, we'll sell soup, we'll sell everyting except da ears....... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS?", 
        "reply": " I think he's sayin' WOOOOOOOOOWWWWW, We'll sell America, we'll sell Oil, we'll sell soup, we'll sell everyting except da ears....... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:54:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "C.R.", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "", 
        "reply": "C.R.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:02:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "I have cum to save da world......... And I have fambly pictures to proobe it......... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "", 
        "reply": "I have cum to save da world......... And I have fambly pictures to proobe it......... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:05:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by CYCLIC_RUNAWAY: C.R. That's funny..... CR ~ Are you any kin to Colin Powell? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "Originally posted by CYCLIC_RUNAWAY: C.R.", 
        "reply": " That's funny..... CR ~ Are you any kin to Colin Powell? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:11:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: I have cum to save da world......... And I have fambly pictures to proobe it......... Lets Leave Buckwheat out of this, He wasn't here to vote. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 39, 
        "quote": "Originally posted by peaceforall: I have cum to save da world......... And I have fambly pictures to proobe it.........", 
        "reply": " Lets Leave Buckwheat out of this, He wasn't here to vote. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:18:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "C.R.", 
        "intTime": 20090303, 
        "postID": 40, 
        "quote": "", 
        "reply": "C.R.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:28:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "intTime": 20090303, 
        "postID": 41, 
        "quote": "", 
        "reply": "My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 18:57:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Duster6"
    }, 
    {
        "content": "Gee, the good times are beginning to roll! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 42, 
        "quote": "", 
        "reply": "Gee, the good times are beginning to roll! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:00:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Hiya Mike, Thinkin' about driving to DC in my 22 year-old Jeep and asking Congress to bail me out and stimulate me. I figure 300K would pay off my mortgage, my HELOC and all my credit cards and purchase a little coffee stand for my wife to run now that she's retired. Then every penny I make I could pump back into the economy and further stimulate the economy where it counts...at the consumer's end. Might even buy reservations at Palace Station for the SFA Convention. Nah, give it to the *******s in the limos...they need it worse than I do. I mean, what would the world do without one more Gulfstream?", 
        "intTime": 20090303, 
        "postID": 43, 
        "quote": "", 
        "reply": "Hiya Mike, Thinkin' about driving to DC in my 22 year-old Jeep and asking Congress to bail me out and stimulate me. I figure 300K would pay off my mortgage, my HELOC and all my credit cards and purchase a little coffee stand for my wife to run now that she's retired. Then every penny I make I could pump back into the economy and further stimulate the economy where it counts...at the consumer's end. Might even buy reservations at Palace Station for the SFA Convention. Nah, give it to the *******s in the limos...they need it worse than I do. I mean, what would the world do without one more Gulfstream?", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:19:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "SinePariDonster"
    }, 
    {
        "content": "Sorry to hear about the job lose.They say 20,000 are lost each day............", 
        "intTime": 20090303, 
        "postID": 44, 
        "quote": "", 
        "reply": "Sorry to hear about the job lose.They say 20,000 are lost each day............", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:29:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "ENYVTHS"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 45, 
        "quote": "Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "reply": " Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:36:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. I'd like to give my thoughts about Obottom, But I've already got in trouble for doin it. Watch out Duster. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 46, 
        "quote": "Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right.", 
        "reply": " I'd like to give my thoughts about Obottom, But I've already got in trouble for doin it. Watch out Duster. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:41:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 47, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all,", 
        "reply": " OH-oh... incoming. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:43:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming. Like always, you can handle it! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 48, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: quote: Originally posted by Duster6: My brother voted for Obama and even though I offered him money to vote for Palin he did not take it. He sure isn't like me. Anyway, he just got laid off from his job and has put in for unemployment. I told him it was for the good of the country and that this is the change Obama had in mind. He told me that with his unemployment, food stamps, free college, free medical, low cost section eight housing that he is putting in for and his yearly stimulus checks that he can make just as much by not working as he did when he was working. You know, he's right. Duster, please don't insult our intelligence with that garbage. Like in the short time President Obama has been in office he provided your welfare grabbing butt sitting teat sucking brother with all those wonderful perks? If your bro is that deep in to the welfare system he's spent years working on it. I have found that people will work harder to go on the dole then they'd have to work to earn the same money. Of course now that he's on it he can sit on his butt, find some ho and breed more little welfare meal tickets. It's all, OH-oh... incoming.", 
        "reply": " Like always, you can handle it! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 19:48:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "intTime": 20090303, 
        "postID": 49, 
        "quote": "", 
        "reply": "It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:03:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 50, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:31:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 51, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:32:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too..... Nothin Like a online edumication! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 52, 
        "quote": "Originally posted by Woody_in_La: It is obvious he does not know Duster! LOL How did he say it? He can talk more BS than a VC sgt.... Or something along those lines. Don't worry vicdude, several on here had to edjumencate me about Duster too.....", 
        "reply": " Nothin Like a online edumication! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:43:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 53, 
        "quote": "Originally posted by peaceforall:", 
        "reply": " I wonder if \"He \" would consider selling those EARS? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:47:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: Come on Mom, We all know he lived at a Holiday Inn Express on the BS trail. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 54, 
        "quote": "Originally posted by peaceforall:", 
        "reply": " Come on Mom, We all know he lived at a Holiday Inn Express on the BS trail. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:52:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS? I think he's sayin' WOOOOOOOOOWWWWW, We'll sell America, we'll sell Oil, we'll sell soup, we'll sell everyting except da ears....... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 55, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by peaceforall: I wonder if \"He \" would consider selling those EARS?", 
        "reply": " I think he's sayin' WOOOOOOOOOWWWWW, We'll sell America, we'll sell Oil, we'll sell soup, we'll sell everyting except da ears....... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 20:54:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "C.R.", 
        "intTime": 20090303, 
        "postID": 56, 
        "quote": "", 
        "reply": "C.R.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:02:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "I have cum to save da world......... And I have fambly pictures to proobe it......... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 57, 
        "quote": "", 
        "reply": "I have cum to save da world......... And I have fambly pictures to proobe it......... GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:05:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by CYCLIC_RUNAWAY: C.R. That's funny..... CR ~ Are you any kin to Colin Powell? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090303, 
        "postID": 58, 
        "quote": "Originally posted by CYCLIC_RUNAWAY: C.R.", 
        "reply": " That's funny..... CR ~ Are you any kin to Colin Powell? GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:11:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: Originally posted by peaceforall: I have cum to save da world......... And I have fambly pictures to proobe it......... Lets Leave Buckwheat out of this, He wasn't here to vote. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090303, 
        "postID": 59, 
        "quote": "Originally posted by peaceforall: I have cum to save da world......... And I have fambly pictures to proobe it.........", 
        "reply": " Lets Leave Buckwheat out of this, He wasn't here to vote. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:18:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "C.R.", 
        "intTime": 20090303, 
        "postID": 60, 
        "quote": "", 
        "reply": "C.R.", 
        "threadID": "5291911282_4070048612001", 
        "time": "2009-03-03 21:28:00", 
        "title": "Brother loses job but still loves Obama", 
        "userID": "CYCLIC_RUNAWAY"
    }
]