[
    {
        "content": "I wonder this as I think about the debacle in Washington D.C. and the seeming complacency of the Government to bailout the schemers of the new century. We have \"AIG\" who insured the Banks against foreclosure and then profit greatly from their misfortune. AIG who insures this paper shuffle must get something back right so WE THE PEOPLE must pay. Our taxes go up and the Insurance guys, the sharks that wait in the dark to prey on yet another thing we can't do without in our lives are waiting. Purchasing new item insurance against failure and or damage? Insurance for the BRAND NEW item you just bought and may have even paid cash for. I think this is the most ludicrous insurance premium that has ever been marketed. Why can't we go back to guaranteed for the lifetime of the purchaser? No, now it's designed so that you need to insure it, keep the packaging because you will be sending it back and forth in the mail until it's so old you figure it's time to buy another one. Homeowners Insurance that doesn't cover everything. All the fine print that takes your comfort out of the equation entirely. They will gladly take your premiums and smile and make small talk about the weather and family. When it comes time to make a claim then they become tyrannical and accusing and make you out to be the criminal. And all you did was faithfully pay those premiums and try to make the best of life and raise your family. Be careful who you do business with in this Industry. It can cost you a fortune in Lawyers bills (another topic) and years in court in a monkey suit and tired from stress. These people make their money by denying claims and turning the table son you. If your a Homeowner make sure you have lots of photos and video and it's kept off the premises. The Automobile Insurance Industry has to be the most foul and rotten to the core that any industry has ever fallen to. They have successfully denied the AMERICAN citizen the \"Right to Travel\" with their Insurance LOBBY, on Highways they have paid for in taxes that aren't counted in among the road taxes and fuel taxes. At a critical time in our countries survival a large majority of the masses can't drive either because they can't afford the Insurance because of layoffs or they never learned how because they could never afford it. You can be sure the Illegal Aliens will be driving regardless of their status or experience. Hit somebody? Just cut and run baby. Why stick around for the cops when you can just go down to the corner lot and purchase another taxi for the gang that lives in your apartment. You think your going to find another good paying job without a college education or Legal Car to drive? Pedro and Finn got those jobs because they keep changing names whenever they get caught. This one and the unwillingness for compromise and reform will certainly kill us as a NATION. Did I say the Automotive Industry was the most rotten to the core? I forgot about the Health Insurance Industry. Need I go into this? I think so, because the horrors this Industry has inflicted on the unsuspecting customer is heinous to say the least. The Doctors and the Hospitals and the Patient are all put at odds, that should never be a part of the treatment but seems to be a major part of it,because all the financial arrangements must be made first. Remember the Louis Lamour books where the old western Doc came out to the farm in the buggy and took a chicken or a piglet for payment? I always had to laugh, because those kinds of Doctors although they exist in the most retched parts of the World and in the Poorest of AMERICAN communities, they are for the most part a happy memory. If their Porsche or Mercedes is not running right then they need to see to that right away. And Oh yes, get that Malpractivce Insurance payment right off to the leeches. So has Insurance just become a form of Transparent Taxation? I think it has, it is proved out in the bailout and is so obvious to me I can't even think about it without screaming out loud: \"What is going on in this country?\" We will never see the real cause of all this trouble. It would take an Army of Auditors a hundred years to figure out this mess. Who's paying for it? YOU and YOU. Make sure your premiums are paid up or they may be coming for you. What will it be Income Tax Evasion? or Will it be for \"Living Uninsured\"? I ask you all to take a little test. Take all of your insurance payment per whatever period you choose, month, week, day, year. Add them all up for that period. Add up all of the Taxes, license, certificates, etc... needed for your existence during that same period. I have done this and found that the difference between the two is not that much. What does this all mean to the average citizen? Will this trend continue until we have nothing left to ourselves and then our survival will depend entirely on the Government? Does anybody remember the old video game DOOM? This message has been edited. Last edited by: sargeant_green, Wed 15 April 2009 10:58 AM Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "I wonder this as I think about the debacle in Washington D.C. and the seeming complacency of the Government to bailout the schemers of the new century. We have \"AIG\" who insured the Banks against foreclosure and then profit greatly from their misfortune. AIG who insures this paper shuffle must get something back right so WE THE PEOPLE must pay. Our taxes go up and the Insurance guys, the sharks that wait in the dark to prey on yet another thing we can't do without in our lives are waiting. Purchasing new item insurance against failure and or damage? Insurance for the BRAND NEW item you just bought and may have even paid cash for. I think this is the most ludicrous insurance premium that has ever been marketed. Why can't we go back to guaranteed for the lifetime of the purchaser? No, now it's designed so that you need to insure it, keep the packaging because you will be sending it back and forth in the mail until it's so old you figure it's time to buy another one. Homeowners Insurance that doesn't cover everything. All the fine print that takes your comfort out of the equation entirely. They will gladly take your premiums and smile and make small talk about the weather and family. When it comes time to make a claim then they become tyrannical and accusing and make you out to be the criminal. And all you did was faithfully pay those premiums and try to make the best of life and raise your family. Be careful who you do business with in this Industry. It can cost you a fortune in Lawyers bills (another topic) and years in court in a monkey suit and tired from stress. These people make their money by denying claims and turning the table son you. If your a Homeowner make sure you have lots of photos and video and it's kept off the premises. The Automobile Insurance Industry has to be the most foul and rotten to the core that any industry has ever fallen to. They have successfully denied the AMERICAN citizen the \"Right to Travel\" with their Insurance LOBBY, on Highways they have paid for in taxes that aren't counted in among the road taxes and fuel taxes. At a critical time in our countries survival a large majority of the masses can't drive either because they can't afford the Insurance because of layoffs or they never learned how because they could never afford it. You can be sure the Illegal Aliens will be driving regardless of their status or experience. Hit somebody? Just cut and run baby. Why stick around for the cops when you can just go down to the corner lot and purchase another taxi for the gang that lives in your apartment. You think your going to find another good paying job without a college education or Legal Car to drive? Pedro and Finn got those jobs because they keep changing names whenever they get caught. This one and the unwillingness for compromise and reform will certainly kill us as a NATION. Did I say the Automotive Industry was the most rotten to the core? I forgot about the Health Insurance Industry. Need I go into this? I think so, because the horrors this Industry has inflicted on the unsuspecting customer is heinous to say the least. The Doctors and the Hospitals and the Patient are all put at odds, that should never be a part of the treatment but seems to be a major part of it,because all the financial arrangements must be made first. Remember the Louis Lamour books where the old western Doc came out to the farm in the buggy and took a chicken or a piglet for payment? I always had to laugh, because those kinds of Doctors although they exist in the most retched parts of the World and in the Poorest of AMERICAN communities, they are for the most part a happy memory. If their Porsche or Mercedes is not running right then they need to see to that right away. And Oh yes, get that Malpractivce Insurance payment right off to the leeches. So has Insurance just become a form of Transparent Taxation? I think it has, it is proved out in the bailout and is so obvious to me I can't even think about it without screaming out loud: \"What is going on in this country?\" We will never see the real cause of all this trouble. It would take an Army of Auditors a hundred years to figure out this mess. Who's paying for it? YOU and YOU. Make sure your premiums are paid up or they may be coming for you. What will it be Income Tax Evasion? or Will it be for \"Living Uninsured\"? I ask you all to take a little test. Take all of your insurance payment per whatever period you choose, month, week, day, year. Add them all up for that period. Add up all of the Taxes, license, certificates, etc... needed for your existence during that same period. I have done this and found that the difference between the two is not that much. What does this all mean to the average citizen? Will this trend continue until we have nothing left to ourselves and then our survival will depend entirely on the Government? Does anybody remember the old video game DOOM? This message has been edited. Last edited by: sargeant_green, Wed 15 April 2009 10:58 AM Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-14 12:45:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Sarge, Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sarge, Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-14 16:42:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Judging from the amount of responses I got on this thread I would say a majority of the members here must work in the Insurance Industry. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "", 
        "reply": "Judging from the amount of responses I got on this thread I would say a majority of the members here must work in the Insurance Industry. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-14 20:16:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Sarge! The Insurance Agencies take advantage of the Elderly, IMHO. They figure that Senior Citizens are Visually Impaired or Senile. Example: Last year my mom and dad had the roof collapse on their outbuilding where my dad paints and they store Garden Supplies. The wind had been viscious but there was snow too. So the Home Owners Insurance said \"it was the SNOW\". We will not pay because you could have shoveled snow off the Roof! As is my mom & dad could climb up there. No, it was the Wind (an \"Act of God\") in Insurance Speak. So they never paid for that building even though it was \"covered\" by Insurance. Yeah I remember DOOM! Thanks for the post, Sarge!", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "", 
        "reply": "Sarge! The Insurance Agencies take advantage of the Elderly, IMHO. They figure that Senior Citizens are Visually Impaired or Senile. Example: Last year my mom and dad had the roof collapse on their outbuilding where my dad paints and they store Garden Supplies. The wind had been viscious but there was snow too. So the Home Owners Insurance said \"it was the SNOW\". We will not pay because you could have shoveled snow off the Roof! As is my mom & dad could climb up there. No, it was the Wind (an \"Act of God\") in Insurance Speak. So they never paid for that building even though it was \"covered\" by Insurance. Yeah I remember DOOM! Thanks for the post, Sarge!", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-15 07:42:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "Agent991"
    }, 
    {
        "content": "\"...will our survival depend entirely in the Government\" Sarge, it sure looks that way. IMHO!", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "\"...will our survival depend entirely in the Government\" Sarge, it sure looks that way. IMHO!", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-15 07:46:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "Agent991"
    }, 
    {
        "content": "The insurance companies have been putting the screws to people for too long. It's time for pay back, they, like many organizations are top heavy. They need to cut the fat from the top, ie. fire most of the fat butt CEOs. Have just one CEO, cut hs salary from six figures to five. He/she should have a salary cap. No more than $80K, per year, thats alot of money, if they don't like it...tough! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "The insurance companies have been putting the screws to people for too long. It's time for pay back, they, like many organizations are top heavy. They need to cut the fat from the top, ie. fire most of the fat butt CEOs. Have just one CEO, cut hs salary from six figures to five. He/she should have a salary cap. No more than $80K, per year, thats alot of money, if they don't like it...tough! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-15 08:39:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Sarge! The Insurance Agencies take advantage of the Elderly, IMHO. They figure that Senior Citizens are Visually Impaired or Senile. Example: Last year my mom and dad had the roof collapse on their outbuilding where my dad paints and they store Garden Supplies. The wind had been viscious but there was snow too. So the Home Owners Insurance said \"it was the SNOW\". We will not pay because you could have shoveled snow off the Roof! As is my mom & dad could climb up there. No, it was the Wind (an \"Act of God\") in Insurance Speak. So they never paid for that building even though it was \"covered\" by Insurance. Yeah I remember DOOM! Thanks for the post, Sarge! Agent, We all have our Insurance Company \"switch and deny\" horror stories. Why haven't the politicians asked for an across the board revamp and reform of this terrible system in charge of everything financial it seems. Insurance has caused our country to suffer from even greater problems that anyone is willing to admit. When they were once a novelty for the wealthy to recoup on any losses they may have, has turned into a mandatory item for most of us. We have an Insurance Company that has made millions from us and squandered the money so that now we have to BAIL THEM OUT? Is this crazy or what? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "Originally posted by Agent991: Sarge! The Insurance Agencies take advantage of the Elderly, IMHO. They figure that Senior Citizens are Visually Impaired or Senile. Example: Last year my mom and dad had the roof collapse on their outbuilding where my dad paints and they store Garden Supplies. The wind had been viscious but there was snow too. So the Home Owners Insurance said \"it was the SNOW\". We will not pay because you could have shoveled snow off the Roof! As is my mom & dad could climb up there. No, it was the Wind (an \"Act of God\") in Insurance Speak. So they never paid for that building even though it was \"covered\" by Insurance. Yeah I remember DOOM! Thanks for the post, Sarge!", 
        "reply": " Agent, We all have our Insurance Company \"switch and deny\" horror stories. Why haven't the politicians asked for an across the board revamp and reform of this terrible system in charge of everything financial it seems. Insurance has caused our country to suffer from even greater problems that anyone is willing to admit. When they were once a novelty for the wealthy to recoup on any losses they may have, has turned into a mandatory item for most of us. We have an Insurance Company that has made millions from us and squandered the money so that now we have to BAIL THEM OUT? Is this crazy or what? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-15 10:53:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "What really gets to me is that a citizen can pay their premium and expect it to help them down the road if needed. Since the Disasters that have occurred recently like the hurricanes, the insurance companies are dragging their feet and very often don't even pay those claims. There are no Anti-Trust laws to cover the Insurance Industry. How come? Bill Gates got ripped in Federal Court over these anti-trust issues and yet the Insurance Industry can ride rough shod over the masses with no such laws to restrain them. They just go on doing business like usual and try to keep a good image showing in the commercials we all see on TV, Oh cute lizard!. If someone bad mouths them so what? They do enough business required by law that they can just tell the masses to go to he11. Go ahead and take them to court, they will keep you in court for years all with the help of laws designed for them. All this time while your losing everything because of the legal delays and you have to pay the bills regardless of what your condition is and all the while your expected to pay their premium as well. Isn't that just a kick in the azz. They don't care they make all of their money on denials and interest on YOUR MONEY! In 1945, Congress passed the McCarran-Ferguson Act, a law giving the insurance industry a special exemption (shared only with Major League Baseball) from federal anti-trust laws and giving each state the role of regulating the industry within its borders. CAN YOU BELIEVE THAT? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "", 
        "reply": "What really gets to me is that a citizen can pay their premium and expect it to help them down the road if needed. Since the Disasters that have occurred recently like the hurricanes, the insurance companies are dragging their feet and very often don't even pay those claims. There are no Anti-Trust laws to cover the Insurance Industry. How come? Bill Gates got ripped in Federal Court over these anti-trust issues and yet the Insurance Industry can ride rough shod over the masses with no such laws to restrain them. They just go on doing business like usual and try to keep a good image showing in the commercials we all see on TV, Oh cute lizard!. If someone bad mouths them so what? They do enough business required by law that they can just tell the masses to go to he11. Go ahead and take them to court, they will keep you in court for years all with the help of laws designed for them. All this time while your losing everything because of the legal delays and you have to pay the bills regardless of what your condition is and all the while your expected to pay their premium as well. Isn't that just a kick in the azz. They don't care they make all of their money on denials and interest on YOUR MONEY! In 1945, Congress passed the McCarran-Ferguson Act, a law giving the insurance industry a special exemption (shared only with Major League Baseball) from federal anti-trust laws and giving each state the role of regulating the industry within its borders. CAN YOU BELIEVE THAT? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_5260017022001", 
        "time": "2009-04-15 19:38:00", 
        "title": "Is the Insurance Industry just Transparent Taxation?", 
        "userID": "sargeant_green"
    }
]