[
    {
        "content": "I am looking for people that live or work @ Charleston Airforce Base to start an Armwrestling team. I will be looking for both men, women and children. If anyone is interested please email me at Sorry, private email and phone numbers are violations of TOS. Hang around here and make some friends and you might find the people you're looking for. This message has been edited. Last edited by: OldArmyLove, Wed 08 April 2009 06:42 PM", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "", 
        "reply": "I am looking for people that live or work @ Charleston Airforce Base to start an Armwrestling team. I will be looking for both men, women and children. If anyone is interested please email me at Sorry, private email and phone numbers are violations of TOS. Hang around here and make some friends and you might find the people you're looking for. This message has been edited. Last edited by: OldArmyLove, Wed 08 April 2009 06:42 PM", 
        "threadID": "5291911282_5980002022001", 
        "time": "2009-04-08 18:21:00", 
        "title": "Looking for something new..", 
        "userID": "9262751"
    }, 
    {
        "content": "quote: Originally posted by 9262751: I am looking for people that live or work @ Charleston Airforce Base to start an Armwrestling team. I will be looking for both men, women and children. If anyone is interested please email me at Sorry, private email and phone numbers are violations of TOS. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "Originally posted by 9262751: I am looking for people that live or work @ Charleston Airforce Base to start an Armwrestling team. I will be looking for both men, women and children. If anyone is interested please email me at Sorry, private email and phone numbers are violations of TOS.", 
        "reply": " Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_5980002022001", 
        "time": "2009-04-08 18:40:00", 
        "title": "Looking for something new..", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by 9262751: I am looking for people that live or work @ Charleston Airforce Base to start an Armwrestling team. I will be looking for both men, women and children. If anyone is interested please email me at Sorry, private email and phone numbers are violations of TOS. Hang around here and make some friends and you might find the people you're looking for. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090408, 
        "postID": 3, 
        "quote": "Originally posted by 9262751: I am looking for people that live or work @ Charleston Airforce Base to start an Armwrestling team. I will be looking for both men, women and children. If anyone is interested please email me at Sorry, private email and phone numbers are violations of TOS. Hang around here and make some friends and you might find the people you're looking for.", 
        "reply": " God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_5980002022001", 
        "time": "2009-04-08 19:27:00", 
        "title": "Looking for something new..", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "you know.. arm wrestling is such an awesome sport, its how we settle debates in my country...", 
        "intTime": 20090410, 
        "postID": 4, 
        "quote": "", 
        "reply": "you know.. arm wrestling is such an awesome sport, its how we settle debates in my country...", 
        "threadID": "5291911282_5980002022001", 
        "time": "2009-04-10 08:07:00", 
        "title": "Looking for something new..", 
        "userID": "AceShaw"
    }
]