[
    {
        "content": "My self and another soldier attended a week long home station AT in August of 2008. We were told that the orders would be given when we arrived but not to worry they were approved and granted. We assumed that was the case and before we know it the week is up and no orders but the promise they would still be coming. In the end the orders never came and we were paid with \"ADA\" pay for the days we attended but we were never paid for our travel (gas, lodging, food, etc...). Has anyone been in a situation like this before or know what course we need to take to get our pay.", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "My self and another soldier attended a week long home station AT in August of 2008. We were told that the orders would be given when we arrived but not to worry they were approved and granted. We assumed that was the case and before we know it the week is up and no orders but the promise they would still be coming. In the end the orders never came and we were paid with \"ADA\" pay for the days we attended but we were never paid for our travel (gas, lodging, food, etc...). Has anyone been in a situation like this before or know what course we need to take to get our pay.", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-23 17:59:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "DaRonWallace"
    }, 
    {
        "content": "This sohld be posted here: Army General Discussion God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "", 
        "reply": "This sohld be posted here: Army General Discussion God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-23 19:09:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "I have been in similar situations both in the Reserves and in the Federal Government.... the good news is the monies may come late but they \"will\" eventually come... sit tight, politely remind them occasionally - and when it does come you will find it came at a more fortuitous moment in time... good luck. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "", 
        "reply": "I have been in similar situations both in the Reserves and in the Federal Government.... the good news is the monies may come late but they \"will\" eventually come... sit tight, politely remind them occasionally - and when it does come you will find it came at a more fortuitous moment in time... good luck. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-23 19:29:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: I have been in similar situations both in the Reserves and in the Federal Government.... the good news is the monies may come late but they \"will\" eventually come... sit tight, politely remind them occasionally - and when it does come you will find it came at a more fortuitous moment in time... good luck. I've also been in similar situations and got bent over about it. The money may not come through patient waiting...go through your CoC. Your Command Sergeant Major should help you (Soldier Care is supposedly a big issue for them) I was told that my orders were approved by a Commissioned Officer, apparently that was my fault. I was later told that I never should have left without confirmed orders in my hand listing the exact pay status (AT, ADT, ADSW, AFTP, etc...) they all get paid differently. My argument was that the Officer who told me in effect made it an order, Spoken or Written, What's the Difference? Obey orders of all officers appointed over me. Some reason I remember that from somewhere. Someone, (NOT sure who) made a call to the Inspector General's office on my behalf...and SHAZAAM...money in my account after about nine months. Good luck I've heard cases of family members calling Congress members for resolution, I've never gone that far before...dunno that I'd recommend it.", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "Originally posted by m551sheridan: I have been in similar situations both in the Reserves and in the Federal Government.... the good news is the monies may come late but they \"will\" eventually come... sit tight, politely remind them occasionally - and when it does come you will find it came at a more fortuitous moment in time... good luck.", 
        "reply": " I've also been in similar situations and got bent over about it. The money may not come through patient waiting...go through your CoC. Your Command Sergeant Major should help you (Soldier Care is supposedly a big issue for them) I was told that my orders were approved by a Commissioned Officer, apparently that was my fault. I was later told that I never should have left without confirmed orders in my hand listing the exact pay status (AT, ADT, ADSW, AFTP, etc...) they all get paid differently. My argument was that the Officer who told me in effect made it an order, Spoken or Written, What's the Difference? Obey orders of all officers appointed over me. Some reason I remember that from somewhere. Someone, (NOT sure who) made a call to the Inspector General's office on my behalf...and SHAZAAM...money in my account after about nine months. Good luck I've heard cases of family members calling Congress members for resolution, I've never gone that far before...dunno that I'd recommend it.", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-23 22:10:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "Oh yeah...if you haven't been paid your travel funds and you traveled using a Government Travel Credit Card (GTCC) You are still responsible for payment...I've seen it ruin the Credit of an E7 who was sent to Chile for two months, he had about $14,000 worth of charges. he lost his GTCC, Civilian Credit and all travel orders from there on out his Command had to give him Cash in hand prior to departure, Really sucks cause you gotta save every receipt.", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "", 
        "reply": "Oh yeah...if you haven't been paid your travel funds and you traveled using a Government Travel Credit Card (GTCC) You are still responsible for payment...I've seen it ruin the Credit of an E7 who was sent to Chile for two months, he had about $14,000 worth of charges. he lost his GTCC, Civilian Credit and all travel orders from there on out his Command had to give him Cash in hand prior to departure, Really sucks cause you gotta save every receipt.", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-23 22:15:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "Government travel card is super-stupid. You are responsible for payment, until they get around to re-imbursing the card. There's generally at least a month's gap between the bill being due, and the pay office getting around to paying it. Meanwhile you are on the hook. REALLY sucks if you don't get mail but once every three weeks, so you don't know that you're on your third notice. (Fort Drum has a serious issue with getting mail out to people.) First notice you get is the third notice threatening your credit score. I've had a lot of problems with one TDY trip we were scheduled for. They ran out of seats for our original course, so they rescheduled us for one a month later. Two YEARS later, as I was separating from Active Duty, I received an e-mail stating that I owed for the trip I never went on, I guess because travel pay office never cancelled it. So I did not get my last month's pay, or final pay, just a big fat NO PAY DUE. I challenged this, of course, but it took some time to go through. They said I had debt about four months ago, and this past week they said they cancelled that debt. So now it's time to wait to get re-imbursed for all the money they took out of my paycheck. That might take a while. My basic point is, you need to stay pro-active. This won't necessarily fix itself (although it might.) Bring it up with your chain of command. If you have any kind of documentation, give them a copy. I forwarded EVERY AKO e-mail I received pertaining to both the trip that was re-scheduled, and the trip I went on, to my platoon sergeant. There must have been twenty e-mails, dating back two years.", 
        "intTime": 20090324, 
        "postID": 6, 
        "quote": "", 
        "reply": "Government travel card is super-stupid. You are responsible for payment, until they get around to re-imbursing the card. There's generally at least a month's gap between the bill being due, and the pay office getting around to paying it. Meanwhile you are on the hook. REALLY sucks if you don't get mail but once every three weeks, so you don't know that you're on your third notice. (Fort Drum has a serious issue with getting mail out to people.) First notice you get is the third notice threatening your credit score. I've had a lot of problems with one TDY trip we were scheduled for. They ran out of seats for our original course, so they rescheduled us for one a month later. Two YEARS later, as I was separating from Active Duty, I received an e-mail stating that I owed for the trip I never went on, I guess because travel pay office never cancelled it. So I did not get my last month's pay, or final pay, just a big fat NO PAY DUE. I challenged this, of course, but it took some time to go through. They said I had debt about four months ago, and this past week they said they cancelled that debt. So now it's time to wait to get re-imbursed for all the money they took out of my paycheck. That might take a while. My basic point is, you need to stay pro-active. This won't necessarily fix itself (although it might.) Bring it up with your chain of command. If you have any kind of documentation, give them a copy. I forwarded EVERY AKO e-mail I received pertaining to both the trip that was re-scheduled, and the trip I went on, to my platoon sergeant. There must have been twenty e-mails, dating back two years.", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-24 09:15:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by DaRonWallace: My self and another soldier attended a week long home station AT in August of 2008. We were told that the orders would be given when we arrived but not to worry they were approved and granted. We assumed that was the case and before we know it the week is up and no orders but the promise they would still be coming. In the end the orders never came and we were paid with \"ADA\" pay for the days we attended but we were never paid for our travel (gas, lodging, food, etc...). Has anyone been in a situation like this before or know what course we need to take to get our pay. When I read something like this it maked me wonder if you have taken this up with or informed your chain of command of the problem? I recall several instances when I was a commander and one of my EM’s was having a pay problem with finance they could not solve. Upon learning of these problems I would take the EM and my CSM and we would all three go over to finance (without an appointment) and I would take it straight into the finance OIC or commander. In all cases that solved the problem post haste.", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "Originally posted by DaRonWallace: My self and another soldier attended a week long home station AT in August of 2008. We were told that the orders would be given when we arrived but not to worry they were approved and granted. We assumed that was the case and before we know it the week is up and no orders but the promise they would still be coming. In the end the orders never came and we were paid with \"ADA\" pay for the days we attended but we were never paid for our travel (gas, lodging, food, etc...). Has anyone been in a situation like this before or know what course we need to take to get our pay.", 
        "reply": " When I read something like this it maked me wonder if you have taken this up with or informed your chain of command of the problem? I recall several instances when I was a commander and one of my EM’s was having a pay problem with finance they could not solve. Upon learning of these problems I would take the EM and my CSM and we would all three go over to finance (without an appointment) and I would take it straight into the finance OIC or commander. In all cases that solved the problem post haste.", 
        "threadID": "5291911282_3140007812001", 
        "time": "2009-03-24 12:11:00", 
        "title": "Yet to be Reimbursed for travel pay!!!", 
        "userID": "IHAWKER"
    }
]