[
    {
        "content": "If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:20:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe.", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "reply": " They'd move back to Europe.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:23:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe.", 
        "reply": " how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:28:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Good answer Tank,,,,,I agree.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "", 
        "reply": "Good answer Tank,,,,,I agree.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:33:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets.", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind.", 
        "reply": " Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:40:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "They would reAmericaniz the United States of America. As it was intended to be. Doing away with poltical correctness, all enemies out, If you don't want to assimulate, leave. Do what ever it took to make the USA look like America again. If you have served your country and sent overseas, what country have you ever been to that has mulitiple nationalities in it yet, still it is loud and clear what country you are in. I like that.", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "They would reAmericaniz the United States of America. As it was intended to be. Doing away with poltical correctness, all enemies out, If you don't want to assimulate, leave. Do what ever it took to make the USA look like America again. If you have served your country and sent overseas, what country have you ever been to that has mulitiple nationalities in it yet, still it is loud and clear what country you are in. I like that.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:40:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "I think something along these lines while grabbing the gun from over the fireplace. \"When, in the course of human events, it becomes necessary for one people to dissolve the political bonds which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the laws of nature and of nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their safety and happiness...\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "", 
        "reply": "I think something along these lines while grabbing the gun from over the fireplace. \"When, in the course of human events, it becomes necessary for one people to dissolve the political bonds which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the laws of nature and of nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their safety and happiness...\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:42:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets. or afford the taxes to buy a pack of cigarettes if one chooses to smoke. Some people will encourage and admire a tax on something they choose and decide is not right and it's fine and dandy until something they like or do or want is taxed then it's not ok. This is not toward you what so ever maddog, it is just how I see one reason that has drove us to this point. I only see government as a mediator between the people and what they want, cry and rant for. I think it boils down to we the people have crushed each others rights using the tool of our government and now we the people are angered by that same force we wanted to help resolve our problems. In essence, we the people created and fed this monster over the past decades and are now seeing how out of control it can get. We are getting exactly what we have been asking for have we not? Not we as in us now, but all of it put together over the years.", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "Originally posted by MaddogK: quote: Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets.", 
        "reply": " or afford the taxes to buy a pack of cigarettes if one chooses to smoke. Some people will encourage and admire a tax on something they choose and decide is not right and it's fine and dandy until something they like or do or want is taxed then it's not ok. This is not toward you what so ever maddog, it is just how I see one reason that has drove us to this point. I only see government as a mediator between the people and what they want, cry and rant for. I think it boils down to we the people have crushed each others rights using the tool of our government and now we the people are angered by that same force we wanted to help resolve our problems. In essence, we the people created and fed this monster over the past decades and are now seeing how out of control it can get. We are getting exactly what we have been asking for have we not? Not we as in us now, but all of it put together over the years.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 19:11:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I know one thing for sure...they are spinning in their graves right now! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090415, 
        "postID": 9, 
        "quote": "", 
        "reply": "I know one thing for sure...they are spinning in their graves right now! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 19:29:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "First thing they would do is start heating a pot of TAR... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090415, 
        "postID": 10, 
        "quote": "", 
        "reply": "First thing they would do is start heating a pot of TAR... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 19:42:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: What Would Our Founders Do? Well, I think about half of them would be so off balance not having slave labor around to earn their daily living for them that they'd be hard put do much for a while. The other half would become so enamored with the way banks and big business runs the country at the expense of everyone else that they would slide right in and make themselves at home. They weren't saints, boys and girls; they were lawyers, judges, slave owners, and the big businessmen of the era. And most of what they did in the Constitution was to protect their class and keep the power there. The Bill of Rights did open the way for lower class people to eventually pry their way into the power grid, but that was completely happenstance. A voter had to be a male property-owner 21 and above, and the most he could do was vote for state offices and state representatives. Senators and Presidents were really elected by legislatures and the Electoral College (The Rich Upper Class). I think they would abhor how close we have moved to democracy/mobaucracy, which they detested as being too swayed by emotions. I would also guess that they would be astounded the country is even still around, since it was so loosely nit and lacking in good communications when they were alive. Even after he finished his 8 years as President, Washington was skeptical the country would last, because of the dissension being cause by sectionalism and \"factions\" (Political Parties). We can thank Jefferson and Madison for that - - I doubt they would change much, because they wouldn't have the slightest f#%%!#%ing idea what they would be looking at!! But one caveat: I think George Washington would look this country over from end to end, think about it, suggest we get out of debt and teach ourselves some descent manners (since he was frugal, always kept his debts paid - unlike the debtor Jefferson - and was always insistent on courteous, mannerly behavior in people), and otherwise, be rather pleased - - Wandering and Wondering", 
        "intTime": 20090415, 
        "postID": 11, 
        "quote": "What Would Our Founders Do?", 
        "reply": " Well, I think about half of them would be so off balance not having slave labor around to earn their daily living for them that they'd be hard put do much for a while. The other half would become so enamored with the way banks and big business runs the country at the expense of everyone else that they would slide right in and make themselves at home. They weren't saints, boys and girls; they were lawyers, judges, slave owners, and the big businessmen of the era. And most of what they did in the Constitution was to protect their class and keep the power there. The Bill of Rights did open the way for lower class people to eventually pry their way into the power grid, but that was completely happenstance. A voter had to be a male property-owner 21 and above, and the most he could do was vote for state offices and state representatives. Senators and Presidents were really elected by legislatures and the Electoral College (The Rich Upper Class). I think they would abhor how close we have moved to democracy/mobaucracy, which they detested as being too swayed by emotions. I would also guess that they would be astounded the country is even still around, since it was so loosely nit and lacking in good communications when they were alive. Even after he finished his 8 years as President, Washington was skeptical the country would last, because of the dissension being cause by sectionalism and \"factions\" (Political Parties). We can thank Jefferson and Madison for that - - I doubt they would change much, because they wouldn't have the slightest f#%%!#%ing idea what they would be looking at!! But one caveat: I think George Washington would look this country over from end to end, think about it, suggest we get out of debt and teach ourselves some descent manners (since he was frugal, always kept his debts paid - unlike the debtor Jefferson - and was always insistent on courteous, mannerly behavior in people), and otherwise, be rather pleased - - Wandering and Wondering", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 20:09:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The same thing they did last time this happened.", 
        "intTime": 20090415, 
        "postID": 12, 
        "quote": "", 
        "reply": "The same thing they did last time this happened.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 20:15:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I think I'm going to take it upon myself to disagree with greywolf and agree with 10tenths... Remember in the military how we are taught let focus on a sloution. We recgonize then problem solve. That's how 10tenth sounds. Greywolf to me sounds more like lets, keep talking about the problems or supposed problems and the end result is more talk.", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "", 
        "reply": "I think I'm going to take it upon myself to disagree with greywolf and agree with 10tenths... Remember in the military how we are taught let focus on a sloution. We recgonize then problem solve. That's how 10tenth sounds. Greywolf to me sounds more like lets, keep talking about the problems or supposed problems and the end result is more talk.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-16 15:58:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: The same thing they did last time this happened. It would never happen, the majority of our current population are gutless sheep and will sit idly by as someone does their dirty work for them.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "Originally posted by 10tenths: The same thing they did last time this happened.", 
        "reply": " It would never happen, the majority of our current population are gutless sheep and will sit idly by as someone does their dirty work for them.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-16 16:40:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. Impossible to say. It's a different world. For example, the founding fathers did not believce in a standing army. Very unrealistic in todays world. They supported slavery. Many were slaveowners. If they saw the president, they would freak out. They did not believe women should have the vote. Some believed only land owners should have the vote. Many of the things they would \"fix\" are what few today would consider broken.", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "reply": " Impossible to say. It's a different world. For example, the founding fathers did not believce in a standing army. Very unrealistic in todays world. They supported slavery. Many were slaveowners. If they saw the president, they would freak out. They did not believe women should have the vote. Some believed only land owners should have the vote. Many of the things they would \"fix\" are what few today would consider broken.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 01:29:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "they'd have a heart attack and die the moment they seen a horseless carriage or marilyn manson.", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "", 
        "reply": "they'd have a heart attack and die the moment they seen a horseless carriage or marilyn manson.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 02:06:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Most would be in awe of our technical advances - flight, computers, automobiles, flush toilets, etc. I would imagine Washington would be pleased at our military record, and be eager to review units of our armed forces. Jefferson would be aghast at our lack of appreciation for agrarian matters. Adams and his son would be all over the amendments to the Constitution and Supreme Court rulings, frowning, but with grudging admiration. Hamilton would be gloating over the Federal Reserve System, claiming it was his intent from the beginning. And Franklin? Lost in thought with a bemused look on his face as he walked the halls of the Smithsonian, stopping and nodding at the exhibits in the Air and Space section and laughing quietly at Andy Warhol's work. Later you'd find him in the library, chuckling and shaking his head over Mark Twain's \"Life on the Mississippi\". Sullivan013", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "", 
        "reply": "Most would be in awe of our technical advances - flight, computers, automobiles, flush toilets, etc. I would imagine Washington would be pleased at our military record, and be eager to review units of our armed forces. Jefferson would be aghast at our lack of appreciation for agrarian matters. Adams and his son would be all over the amendments to the Constitution and Supreme Court rulings, frowning, but with grudging admiration. Hamilton would be gloating over the Federal Reserve System, claiming it was his intent from the beginning. And Franklin? Lost in thought with a bemused look on his face as he walked the halls of the Smithsonian, stopping and nodding at the exhibits in the Air and Space section and laughing quietly at Andy Warhol's work. Later you'd find him in the library, chuckling and shaking his head over Mark Twain's \"Life on the Mississippi\". Sullivan013", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 04:46:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Hamilton would be the most pizzed - at how corrupt and idiotic the banking system and wall street is, and how close they have driven this country to self destruction. Though he was a Champion of a central banking system, based on the savings of rich businessmen, his concept was that they would work hard to keep the country strong and growing to protect their investments, and keep them growing too. All this creating of debt and using debt as false wealth to draw more credit is theft be deception: CEOs lining their own pockets, knowing it has to collapse and fail eventually, but sucking as much as they can out of the system before it does - People can be critical of Hamilton if they wish, but he was an extremely hard-working, honest man, and the shady, dishonest nature of the banking and stock systems in this country, and the way they grind the poor to enrich the greedy, would probably put him at the head of any movement - legislative or revolutionary - to put it right, or tear it down!!! He, like Washington, was ALWAYS a fighter for what is right!! Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "", 
        "reply": "Hamilton would be the most pizzed - at how corrupt and idiotic the banking system and wall street is, and how close they have driven this country to self destruction. Though he was a Champion of a central banking system, based on the savings of rich businessmen, his concept was that they would work hard to keep the country strong and growing to protect their investments, and keep them growing too. All this creating of debt and using debt as false wealth to draw more credit is theft be deception: CEOs lining their own pockets, knowing it has to collapse and fail eventually, but sucking as much as they can out of the system before it does - People can be critical of Hamilton if they wish, but he was an extremely hard-working, honest man, and the shady, dishonest nature of the banking and stock systems in this country, and the way they grind the poor to enrich the greedy, would probably put him at the head of any movement - legislative or revolutionary - to put it right, or tear it down!!! He, like Washington, was ALWAYS a fighter for what is right!! Wandering and Wondering", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 08:20:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "As intelligent as he was, Hamilton had his faults, not the least of which was an overweaned sense of self importance and that he was never wrong, be it federalist policy or even adultery. It eventually led to his death, as he couldn't even bring himself to beg pardon for a self-admitted unguarded statement. He wasn't 'always fighting for what was right', he was always fighting because he couldn't concieve himself as ever being wrong. It's a significant difference, and in his case, fatal. Sullivan013", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "", 
        "reply": "As intelligent as he was, Hamilton had his faults, not the least of which was an overweaned sense of self importance and that he was never wrong, be it federalist policy or even adultery. It eventually led to his death, as he couldn't even bring himself to beg pardon for a self-admitted unguarded statement. He wasn't 'always fighting for what was right', he was always fighting because he couldn't concieve himself as ever being wrong. It's a significant difference, and in his case, fatal. Sullivan013", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 10:31:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "And who accused him of adultery through surrogates? Jefferson, the man who was having children by his slave mistress while his wife was dying - There's a real paragon of virture for you. Jefferson also had a very public affair with a French General's wife while acting as America's diplomat in France. He had his daughter with him there at times while carrying on that affair - what a nice fatherly example. As for Hamilton, he all too Publicly admitted to his short moral indiscretion in an essay pamphlet, which he published at his own expense. As for his allegations against Aaron Burr, they were call factual. Aaron Burr was a money-grasping, ladder climbing jerk, and Hamilton had no problem or error in making that public. His error was supporting Burr's attempt to be elected President, not to get him elected, but to block Jefferson, which he almost managed to do. One must understand that Jefferson's surrogate, Madison, had manipulated the Constitution to keep Hamilton from ever running for President. There was only one Founding Father who was under 35 and not Native Born at the Constitutional Convention, and that was Alexander Hamilton - 34 and born in the Caribbean. Don't forget either that Jefferson was the leader of the Anti-Federalist faction that tried to sabotage the Constitution's ratification at every turn, and almost managed it... So it was Jefferson who started rumors that Hamilton had insult Burr, his Vice President, in some way. Jefferson also made and published anonymous allegations that Hamilton was an illegitimate son of a black Carribean prostitute by a white businessman, which may very well have been true, but it showed how racist and low-thinking Jefferson was! Jefferson hated both Burr and Hamilton - New Yorkers - as modernists who would support big business instead of the planters. He festered the wound between them by buying a newspaper an publishing anonymous essays and editorials attacking them both. He was the consummate back-stabber. Burr finally challenged Hamilton to a duel, common for the times, and Hamilton, a courageous Revolutionary War Veteran, would have been labeled a slanderer and a coward had he refused. Hamilton was an excellent shot and could have killed Burr easily, but he delayed the event, hoping Burr would learn he was being duped by Jefferson - and that is when Hamilton published the essay the scrupulously detailed his own indiscretion and sorrow for it. But Burr would not be satisfied because both Jefferson and Madison kept goading him on. It was also during this time that Hamilton's own son accept a duel and was killed, breaking his heart - - Finally, when the day of the duel did arrive and the two men faced each other on a small island outside of New York to avoid local laws against dueling....Hamilton said words to the effect, \"Sir, you are not worthy my bullet!\" He took aim at a nearby tree, and fired his pistol. Burr, either unaware that he could do the same thing and it would all be over, or simply full of vindictive hate - took aim, but was a poor shot. His bullet hit Hamilton in the belly, and it took about 36 hours to die at his home, with his wife and remaining children at his his side as he comforted them, apologizing for all the grief he had brought them, then died. As for Vice President Burr, he fled the country under charges of murder. He engaged in a conspiracy to steal the Western Territories and set up some kind of Monarchy. He was arrested by Andrew Jackson and sent back to Washington to be tried for murder and treason... But Jefferson already had what he wanted. The only person who could really challenge him, Hamilton, was dead; and Burr had been so discredited and dishonored that a public trial might only bring out the truth of it all and cause him and Madison embarrassment. The charges simply melted away and so did Burr - - And Jefferson had the Country and the Constitution, both of which he had opposed with all his might, to do with as he wished - - Can't beat that - - At least Hamilton had a smattering of integrity to the day he died. Can't say that for many that survived him - - Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "", 
        "reply": "And who accused him of adultery through surrogates? Jefferson, the man who was having children by his slave mistress while his wife was dying - There's a real paragon of virture for you. Jefferson also had a very public affair with a French General's wife while acting as America's diplomat in France. He had his daughter with him there at times while carrying on that affair - what a nice fatherly example. As for Hamilton, he all too Publicly admitted to his short moral indiscretion in an essay pamphlet, which he published at his own expense. As for his allegations against Aaron Burr, they were call factual. Aaron Burr was a money-grasping, ladder climbing jerk, and Hamilton had no problem or error in making that public. His error was supporting Burr's attempt to be elected President, not to get him elected, but to block Jefferson, which he almost managed to do. One must understand that Jefferson's surrogate, Madison, had manipulated the Constitution to keep Hamilton from ever running for President. There was only one Founding Father who was under 35 and not Native Born at the Constitutional Convention, and that was Alexander Hamilton - 34 and born in the Caribbean. Don't forget either that Jefferson was the leader of the Anti-Federalist faction that tried to sabotage the Constitution's ratification at every turn, and almost managed it... So it was Jefferson who started rumors that Hamilton had insult Burr, his Vice President, in some way. Jefferson also made and published anonymous allegations that Hamilton was an illegitimate son of a black Carribean prostitute by a white businessman, which may very well have been true, but it showed how racist and low-thinking Jefferson was! Jefferson hated both Burr and Hamilton - New Yorkers - as modernists who would support big business instead of the planters. He festered the wound between them by buying a newspaper an publishing anonymous essays and editorials attacking them both. He was the consummate back-stabber. Burr finally challenged Hamilton to a duel, common for the times, and Hamilton, a courageous Revolutionary War Veteran, would have been labeled a slanderer and a coward had he refused. Hamilton was an excellent shot and could have killed Burr easily, but he delayed the event, hoping Burr would learn he was being duped by Jefferson - and that is when Hamilton published the essay the scrupulously detailed his own indiscretion and sorrow for it. But Burr would not be satisfied because both Jefferson and Madison kept goading him on. It was also during this time that Hamilton's own son accept a duel and was killed, breaking his heart - - Finally, when the day of the duel did arrive and the two men faced each other on a small island outside of New York to avoid local laws against dueling....Hamilton said words to the effect, \"Sir, you are not worthy my bullet!\" He took aim at a nearby tree, and fired his pistol. Burr, either unaware that he could do the same thing and it would all be over, or simply full of vindictive hate - took aim, but was a poor shot. His bullet hit Hamilton in the belly, and it took about 36 hours to die at his home, with his wife and remaining children at his his side as he comforted them, apologizing for all the grief he had brought them, then died. As for Vice President Burr, he fled the country under charges of murder. He engaged in a conspiracy to steal the Western Territories and set up some kind of Monarchy. He was arrested by Andrew Jackson and sent back to Washington to be tried for murder and treason... But Jefferson already had what he wanted. The only person who could really challenge him, Hamilton, was dead; and Burr had been so discredited and dishonored that a public trial might only bring out the truth of it all and cause him and Madison embarrassment. The charges simply melted away and so did Burr - - And Jefferson had the Country and the Constitution, both of which he had opposed with all his might, to do with as he wished - - Can't beat that - - At least Hamilton had a smattering of integrity to the day he died. Can't say that for many that survived him - - Wandering and Wondering", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 14:17:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "intTime": 20090415, 
        "postID": 21, 
        "quote": "", 
        "reply": "If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:20:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe.", 
        "intTime": 20090415, 
        "postID": 22, 
        "quote": "Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "reply": " They'd move back to Europe.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:23:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090415, 
        "postID": 23, 
        "quote": "Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe.", 
        "reply": " how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:28:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Good answer Tank,,,,,I agree.", 
        "intTime": 20090415, 
        "postID": 24, 
        "quote": "", 
        "reply": "Good answer Tank,,,,,I agree.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:33:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets.", 
        "intTime": 20090415, 
        "postID": 25, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind.", 
        "reply": " Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:40:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "They would reAmericaniz the United States of America. As it was intended to be. Doing away with poltical correctness, all enemies out, If you don't want to assimulate, leave. Do what ever it took to make the USA look like America again. If you have served your country and sent overseas, what country have you ever been to that has mulitiple nationalities in it yet, still it is loud and clear what country you are in. I like that.", 
        "intTime": 20090415, 
        "postID": 26, 
        "quote": "", 
        "reply": "They would reAmericaniz the United States of America. As it was intended to be. Doing away with poltical correctness, all enemies out, If you don't want to assimulate, leave. Do what ever it took to make the USA look like America again. If you have served your country and sent overseas, what country have you ever been to that has mulitiple nationalities in it yet, still it is loud and clear what country you are in. I like that.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:40:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "I think something along these lines while grabbing the gun from over the fireplace. \"When, in the course of human events, it becomes necessary for one people to dissolve the political bonds which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the laws of nature and of nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their safety and happiness...\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090415, 
        "postID": 27, 
        "quote": "", 
        "reply": "I think something along these lines while grabbing the gun from over the fireplace. \"When, in the course of human events, it becomes necessary for one people to dissolve the political bonds which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the laws of nature and of nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation. We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable rights, that among these are life, liberty and the pursuit of happiness. That to secure these rights, governments are instituted among men, deriving their just powers from the consent of the governed. That whenever any form of government becomes destructive to these ends, it is the right of the people to alter or to abolish it, and to institute new government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their safety and happiness...\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 17:42:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MaddogK: quote: Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets. or afford the taxes to buy a pack of cigarettes if one chooses to smoke. Some people will encourage and admire a tax on something they choose and decide is not right and it's fine and dandy until something they like or do or want is taxed then it's not ok. This is not toward you what so ever maddog, it is just how I see one reason that has drove us to this point. I only see government as a mediator between the people and what they want, cry and rant for. I think it boils down to we the people have crushed each others rights using the tool of our government and now we the people are angered by that same force we wanted to help resolve our problems. In essence, we the people created and fed this monster over the past decades and are now seeing how out of control it can get. We are getting exactly what we have been asking for have we not? Not we as in us now, but all of it put together over the years.", 
        "intTime": 20090415, 
        "postID": 28, 
        "quote": "Originally posted by MaddogK: quote: Originally posted by m551sheridan: quote: Originally posted by MaddogK: quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. They'd move back to Europe. how would they fix it?? Something about a bridge, a place named Concord, shots heard round the world..... come to mind. Very shortly civilians with guns WILL be a story from history books, unless your rich and can afford the taxes on bullets.", 
        "reply": " or afford the taxes to buy a pack of cigarettes if one chooses to smoke. Some people will encourage and admire a tax on something they choose and decide is not right and it's fine and dandy until something they like or do or want is taxed then it's not ok. This is not toward you what so ever maddog, it is just how I see one reason that has drove us to this point. I only see government as a mediator between the people and what they want, cry and rant for. I think it boils down to we the people have crushed each others rights using the tool of our government and now we the people are angered by that same force we wanted to help resolve our problems. In essence, we the people created and fed this monster over the past decades and are now seeing how out of control it can get. We are getting exactly what we have been asking for have we not? Not we as in us now, but all of it put together over the years.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 19:11:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I know one thing for sure...they are spinning in their graves right now! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090415, 
        "postID": 29, 
        "quote": "", 
        "reply": "I know one thing for sure...they are spinning in their graves right now! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 19:29:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "First thing they would do is start heating a pot of TAR... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090415, 
        "postID": 30, 
        "quote": "", 
        "reply": "First thing they would do is start heating a pot of TAR... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 19:42:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: What Would Our Founders Do? Well, I think about half of them would be so off balance not having slave labor around to earn their daily living for them that they'd be hard put do much for a while. The other half would become so enamored with the way banks and big business runs the country at the expense of everyone else that they would slide right in and make themselves at home. They weren't saints, boys and girls; they were lawyers, judges, slave owners, and the big businessmen of the era. And most of what they did in the Constitution was to protect their class and keep the power there. The Bill of Rights did open the way for lower class people to eventually pry their way into the power grid, but that was completely happenstance. A voter had to be a male property-owner 21 and above, and the most he could do was vote for state offices and state representatives. Senators and Presidents were really elected by legislatures and the Electoral College (The Rich Upper Class). I think they would abhor how close we have moved to democracy/mobaucracy, which they detested as being too swayed by emotions. I would also guess that they would be astounded the country is even still around, since it was so loosely nit and lacking in good communications when they were alive. Even after he finished his 8 years as President, Washington was skeptical the country would last, because of the dissension being cause by sectionalism and \"factions\" (Political Parties). We can thank Jefferson and Madison for that - - I doubt they would change much, because they wouldn't have the slightest f#%%!#%ing idea what they would be looking at!! But one caveat: I think George Washington would look this country over from end to end, think about it, suggest we get out of debt and teach ourselves some descent manners (since he was frugal, always kept his debts paid - unlike the debtor Jefferson - and was always insistent on courteous, mannerly behavior in people), and otherwise, be rather pleased - - Wandering and Wondering", 
        "intTime": 20090415, 
        "postID": 31, 
        "quote": "What Would Our Founders Do?", 
        "reply": " Well, I think about half of them would be so off balance not having slave labor around to earn their daily living for them that they'd be hard put do much for a while. The other half would become so enamored with the way banks and big business runs the country at the expense of everyone else that they would slide right in and make themselves at home. They weren't saints, boys and girls; they were lawyers, judges, slave owners, and the big businessmen of the era. And most of what they did in the Constitution was to protect their class and keep the power there. The Bill of Rights did open the way for lower class people to eventually pry their way into the power grid, but that was completely happenstance. A voter had to be a male property-owner 21 and above, and the most he could do was vote for state offices and state representatives. Senators and Presidents were really elected by legislatures and the Electoral College (The Rich Upper Class). I think they would abhor how close we have moved to democracy/mobaucracy, which they detested as being too swayed by emotions. I would also guess that they would be astounded the country is even still around, since it was so loosely nit and lacking in good communications when they were alive. Even after he finished his 8 years as President, Washington was skeptical the country would last, because of the dissension being cause by sectionalism and \"factions\" (Political Parties). We can thank Jefferson and Madison for that - - I doubt they would change much, because they wouldn't have the slightest f#%%!#%ing idea what they would be looking at!! But one caveat: I think George Washington would look this country over from end to end, think about it, suggest we get out of debt and teach ourselves some descent manners (since he was frugal, always kept his debts paid - unlike the debtor Jefferson - and was always insistent on courteous, mannerly behavior in people), and otherwise, be rather pleased - - Wandering and Wondering", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 20:09:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The same thing they did last time this happened.", 
        "intTime": 20090415, 
        "postID": 32, 
        "quote": "", 
        "reply": "The same thing they did last time this happened.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-15 20:15:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I think I'm going to take it upon myself to disagree with greywolf and agree with 10tenths... Remember in the military how we are taught let focus on a sloution. We recgonize then problem solve. That's how 10tenth sounds. Greywolf to me sounds more like lets, keep talking about the problems or supposed problems and the end result is more talk.", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "", 
        "reply": "I think I'm going to take it upon myself to disagree with greywolf and agree with 10tenths... Remember in the military how we are taught let focus on a sloution. We recgonize then problem solve. That's how 10tenth sounds. Greywolf to me sounds more like lets, keep talking about the problems or supposed problems and the end result is more talk.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-16 15:58:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "ACEINFI"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: The same thing they did last time this happened. It would never happen, the majority of our current population are gutless sheep and will sit idly by as someone does their dirty work for them.", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "Originally posted by 10tenths: The same thing they did last time this happened.", 
        "reply": " It would never happen, the majority of our current population are gutless sheep and will sit idly by as someone does their dirty work for them.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-16 16:40:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible. Impossible to say. It's a different world. For example, the founding fathers did not believce in a standing army. Very unrealistic in todays world. They supported slavery. Many were slaveowners. If they saw the president, they would freak out. They did not believe women should have the vote. Some believed only land owners should have the vote. Many of the things they would \"fix\" are what few today would consider broken.", 
        "intTime": 20090417, 
        "postID": 35, 
        "quote": "Originally posted by crackerjacks61: If they were alive today, and could read back the 200+ years of this nations history, what it has become at all levels, and they were asked to fix it with the blessing of all government at all levels. What would they do? How would they fix it? Could they fix it? Non-partisan discussion only please. If that's possible.", 
        "reply": " Impossible to say. It's a different world. For example, the founding fathers did not believce in a standing army. Very unrealistic in todays world. They supported slavery. Many were slaveowners. If they saw the president, they would freak out. They did not believe women should have the vote. Some believed only land owners should have the vote. Many of the things they would \"fix\" are what few today would consider broken.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 01:29:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "they'd have a heart attack and die the moment they seen a horseless carriage or marilyn manson.", 
        "intTime": 20090417, 
        "postID": 36, 
        "quote": "", 
        "reply": "they'd have a heart attack and die the moment they seen a horseless carriage or marilyn manson.", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 02:06:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Most would be in awe of our technical advances - flight, computers, automobiles, flush toilets, etc. I would imagine Washington would be pleased at our military record, and be eager to review units of our armed forces. Jefferson would be aghast at our lack of appreciation for agrarian matters. Adams and his son would be all over the amendments to the Constitution and Supreme Court rulings, frowning, but with grudging admiration. Hamilton would be gloating over the Federal Reserve System, claiming it was his intent from the beginning. And Franklin? Lost in thought with a bemused look on his face as he walked the halls of the Smithsonian, stopping and nodding at the exhibits in the Air and Space section and laughing quietly at Andy Warhol's work. Later you'd find him in the library, chuckling and shaking his head over Mark Twain's \"Life on the Mississippi\". Sullivan013", 
        "intTime": 20090417, 
        "postID": 37, 
        "quote": "", 
        "reply": "Most would be in awe of our technical advances - flight, computers, automobiles, flush toilets, etc. I would imagine Washington would be pleased at our military record, and be eager to review units of our armed forces. Jefferson would be aghast at our lack of appreciation for agrarian matters. Adams and his son would be all over the amendments to the Constitution and Supreme Court rulings, frowning, but with grudging admiration. Hamilton would be gloating over the Federal Reserve System, claiming it was his intent from the beginning. And Franklin? Lost in thought with a bemused look on his face as he walked the halls of the Smithsonian, stopping and nodding at the exhibits in the Air and Space section and laughing quietly at Andy Warhol's work. Later you'd find him in the library, chuckling and shaking his head over Mark Twain's \"Life on the Mississippi\". Sullivan013", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 04:46:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "Hamilton would be the most pizzed - at how corrupt and idiotic the banking system and wall street is, and how close they have driven this country to self destruction. Though he was a Champion of a central banking system, based on the savings of rich businessmen, his concept was that they would work hard to keep the country strong and growing to protect their investments, and keep them growing too. All this creating of debt and using debt as false wealth to draw more credit is theft be deception: CEOs lining their own pockets, knowing it has to collapse and fail eventually, but sucking as much as they can out of the system before it does - People can be critical of Hamilton if they wish, but he was an extremely hard-working, honest man, and the shady, dishonest nature of the banking and stock systems in this country, and the way they grind the poor to enrich the greedy, would probably put him at the head of any movement - legislative or revolutionary - to put it right, or tear it down!!! He, like Washington, was ALWAYS a fighter for what is right!! Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 38, 
        "quote": "", 
        "reply": "Hamilton would be the most pizzed - at how corrupt and idiotic the banking system and wall street is, and how close they have driven this country to self destruction. Though he was a Champion of a central banking system, based on the savings of rich businessmen, his concept was that they would work hard to keep the country strong and growing to protect their investments, and keep them growing too. All this creating of debt and using debt as false wealth to draw more credit is theft be deception: CEOs lining their own pockets, knowing it has to collapse and fail eventually, but sucking as much as they can out of the system before it does - People can be critical of Hamilton if they wish, but he was an extremely hard-working, honest man, and the shady, dishonest nature of the banking and stock systems in this country, and the way they grind the poor to enrich the greedy, would probably put him at the head of any movement - legislative or revolutionary - to put it right, or tear it down!!! He, like Washington, was ALWAYS a fighter for what is right!! Wandering and Wondering", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 08:20:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "As intelligent as he was, Hamilton had his faults, not the least of which was an overweaned sense of self importance and that he was never wrong, be it federalist policy or even adultery. It eventually led to his death, as he couldn't even bring himself to beg pardon for a self-admitted unguarded statement. He wasn't 'always fighting for what was right', he was always fighting because he couldn't concieve himself as ever being wrong. It's a significant difference, and in his case, fatal. Sullivan013", 
        "intTime": 20090417, 
        "postID": 39, 
        "quote": "", 
        "reply": "As intelligent as he was, Hamilton had his faults, not the least of which was an overweaned sense of self importance and that he was never wrong, be it federalist policy or even adultery. It eventually led to his death, as he couldn't even bring himself to beg pardon for a self-admitted unguarded statement. He wasn't 'always fighting for what was right', he was always fighting because he couldn't concieve himself as ever being wrong. It's a significant difference, and in his case, fatal. Sullivan013", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 10:31:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "sullivan013"
    }, 
    {
        "content": "And who accused him of adultery through surrogates? Jefferson, the man who was having children by his slave mistress while his wife was dying - There's a real paragon of virture for you. Jefferson also had a very public affair with a French General's wife while acting as America's diplomat in France. He had his daughter with him there at times while carrying on that affair - what a nice fatherly example. As for Hamilton, he all too Publicly admitted to his short moral indiscretion in an essay pamphlet, which he published at his own expense. As for his allegations against Aaron Burr, they were call factual. Aaron Burr was a money-grasping, ladder climbing jerk, and Hamilton had no problem or error in making that public. His error was supporting Burr's attempt to be elected President, not to get him elected, but to block Jefferson, which he almost managed to do. One must understand that Jefferson's surrogate, Madison, had manipulated the Constitution to keep Hamilton from ever running for President. There was only one Founding Father who was under 35 and not Native Born at the Constitutional Convention, and that was Alexander Hamilton - 34 and born in the Caribbean. Don't forget either that Jefferson was the leader of the Anti-Federalist faction that tried to sabotage the Constitution's ratification at every turn, and almost managed it... So it was Jefferson who started rumors that Hamilton had insult Burr, his Vice President, in some way. Jefferson also made and published anonymous allegations that Hamilton was an illegitimate son of a black Carribean prostitute by a white businessman, which may very well have been true, but it showed how racist and low-thinking Jefferson was! Jefferson hated both Burr and Hamilton - New Yorkers - as modernists who would support big business instead of the planters. He festered the wound between them by buying a newspaper an publishing anonymous essays and editorials attacking them both. He was the consummate back-stabber. Burr finally challenged Hamilton to a duel, common for the times, and Hamilton, a courageous Revolutionary War Veteran, would have been labeled a slanderer and a coward had he refused. Hamilton was an excellent shot and could have killed Burr easily, but he delayed the event, hoping Burr would learn he was being duped by Jefferson - and that is when Hamilton published the essay the scrupulously detailed his own indiscretion and sorrow for it. But Burr would not be satisfied because both Jefferson and Madison kept goading him on. It was also during this time that Hamilton's own son accept a duel and was killed, breaking his heart - - Finally, when the day of the duel did arrive and the two men faced each other on a small island outside of New York to avoid local laws against dueling....Hamilton said words to the effect, \"Sir, you are not worthy my bullet!\" He took aim at a nearby tree, and fired his pistol. Burr, either unaware that he could do the same thing and it would all be over, or simply full of vindictive hate - took aim, but was a poor shot. His bullet hit Hamilton in the belly, and it took about 36 hours to die at his home, with his wife and remaining children at his his side as he comforted them, apologizing for all the grief he had brought them, then died. As for Vice President Burr, he fled the country under charges of murder. He engaged in a conspiracy to steal the Western Territories and set up some kind of Monarchy. He was arrested by Andrew Jackson and sent back to Washington to be tried for murder and treason... But Jefferson already had what he wanted. The only person who could really challenge him, Hamilton, was dead; and Burr had been so discredited and dishonored that a public trial might only bring out the truth of it all and cause him and Madison embarrassment. The charges simply melted away and so did Burr - - And Jefferson had the Country and the Constitution, both of which he had opposed with all his might, to do with as he wished - - Can't beat that - - At least Hamilton had a smattering of integrity to the day he died. Can't say that for many that survived him - - Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 40, 
        "quote": "", 
        "reply": "And who accused him of adultery through surrogates? Jefferson, the man who was having children by his slave mistress while his wife was dying - There's a real paragon of virture for you. Jefferson also had a very public affair with a French General's wife while acting as America's diplomat in France. He had his daughter with him there at times while carrying on that affair - what a nice fatherly example. As for Hamilton, he all too Publicly admitted to his short moral indiscretion in an essay pamphlet, which he published at his own expense. As for his allegations against Aaron Burr, they were call factual. Aaron Burr was a money-grasping, ladder climbing jerk, and Hamilton had no problem or error in making that public. His error was supporting Burr's attempt to be elected President, not to get him elected, but to block Jefferson, which he almost managed to do. One must understand that Jefferson's surrogate, Madison, had manipulated the Constitution to keep Hamilton from ever running for President. There was only one Founding Father who was under 35 and not Native Born at the Constitutional Convention, and that was Alexander Hamilton - 34 and born in the Caribbean. Don't forget either that Jefferson was the leader of the Anti-Federalist faction that tried to sabotage the Constitution's ratification at every turn, and almost managed it... So it was Jefferson who started rumors that Hamilton had insult Burr, his Vice President, in some way. Jefferson also made and published anonymous allegations that Hamilton was an illegitimate son of a black Carribean prostitute by a white businessman, which may very well have been true, but it showed how racist and low-thinking Jefferson was! Jefferson hated both Burr and Hamilton - New Yorkers - as modernists who would support big business instead of the planters. He festered the wound between them by buying a newspaper an publishing anonymous essays and editorials attacking them both. He was the consummate back-stabber. Burr finally challenged Hamilton to a duel, common for the times, and Hamilton, a courageous Revolutionary War Veteran, would have been labeled a slanderer and a coward had he refused. Hamilton was an excellent shot and could have killed Burr easily, but he delayed the event, hoping Burr would learn he was being duped by Jefferson - and that is when Hamilton published the essay the scrupulously detailed his own indiscretion and sorrow for it. But Burr would not be satisfied because both Jefferson and Madison kept goading him on. It was also during this time that Hamilton's own son accept a duel and was killed, breaking his heart - - Finally, when the day of the duel did arrive and the two men faced each other on a small island outside of New York to avoid local laws against dueling....Hamilton said words to the effect, \"Sir, you are not worthy my bullet!\" He took aim at a nearby tree, and fired his pistol. Burr, either unaware that he could do the same thing and it would all be over, or simply full of vindictive hate - took aim, but was a poor shot. His bullet hit Hamilton in the belly, and it took about 36 hours to die at his home, with his wife and remaining children at his his side as he comforted them, apologizing for all the grief he had brought them, then died. As for Vice President Burr, he fled the country under charges of murder. He engaged in a conspiracy to steal the Western Territories and set up some kind of Monarchy. He was arrested by Andrew Jackson and sent back to Washington to be tried for murder and treason... But Jefferson already had what he wanted. The only person who could really challenge him, Hamilton, was dead; and Burr had been so discredited and dishonored that a public trial might only bring out the truth of it all and cause him and Madison embarrassment. The charges simply melted away and so did Burr - - And Jefferson had the Country and the Constitution, both of which he had opposed with all his might, to do with as he wished - - Can't beat that - - At least Hamilton had a smattering of integrity to the day he died. Can't say that for many that survived him - - Wandering and Wondering", 
        "threadID": "5291911282_9940058022001", 
        "time": "2009-04-17 14:17:00", 
        "title": "What Would Our Founders Do?", 
        "userID": "greywolfghost"
    }
]