[
    {
        "content": "\"http://www.msnbc.msn.com/id/29607219/\" I can't beleive this, free nursing care now. What's next for that wench? \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.msnbc.msn.com/id/29607219/\" I can't beleive this, free nursing care now. What's next for that wench? \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:01:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "I watched Dr. Phil yesterday and part 2 is today. I am not going to bash this woman because she admitted she was wrong/stupid. The house she got is for the children, not her. The help she got is for the children, not her. And I am glad she got some help.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "I watched Dr. Phil yesterday and part 2 is today. I am not going to bash this woman because she admitted she was wrong/stupid. The house she got is for the children, not her. The help she got is for the children, not her. And I am glad she got some help.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:32:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "She still hasn't gotten her tubes tied yet. I wonder why?", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "She still hasn't gotten her tubes tied yet. I wonder why?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:43:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Duster6"
    }, 
    {
        "content": "My main concern is for all the children and they have a very disturbed mother who is being rewarded for her inexcusable behavior. Decency demands that citizens provide for these innocent children but I am not particularly happy that the mother has been permitted to keep the children and be provided with a more luxurious life.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "", 
        "reply": "My main concern is for all the children and they have a very disturbed mother who is being rewarded for her inexcusable behavior. Decency demands that citizens provide for these innocent children but I am not particularly happy that the mother has been permitted to keep the children and be provided with a more luxurious life.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:58:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "mallovesthetroops"
    }, 
    {
        "content": "wow... kinda like the auto industry.. get into all this trouble then expect people to bail them out..", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "wow... kinda like the auto industry.. get into all this trouble then expect people to bail them out..", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:11:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by Duster6: She still hasn't gotten her tubes tied yet. I wonder why? Cuz she's flippin' NUTS!", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by Duster6: She still hasn't gotten her tubes tied yet. I wonder why?", 
        "reply": " Cuz she's flippin' NUTS!", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:38:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "There was only room for one of two solutions available. Either \"take the kids away\" or a \"benevolent person gives her a house and helps the family\". I kinda figured the State would take them but this was something that was always in the works in someones mind. I wonder if the donor was \"O\"? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "There was only room for one of two solutions available. Either \"take the kids away\" or a \"benevolent person gives her a house and helps the family\". I kinda figured the State would take them but this was something that was always in the works in someones mind. I wonder if the donor was \"O\"? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:38:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I ain't gonna say I told ya so, but I told ya so. She is a wack job! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "I ain't gonna say I told ya so, but I told ya so. She is a wack job! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:45:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "", 
        "reply": "I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:51:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Persy"
    }, 
    {
        "content": "quote: Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one. sounds good to me rather than having taxdollars pay for her lunacy.. all in favor?", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "reply": " sounds good to me rather than having taxdollars pay for her lunacy.. all in favor?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 09:13:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "88miker"
    }, 
    {
        "content": "Just think of it this way, in twenty years or so, we'll have an additional eight taxpayers in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on.", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "", 
        "reply": "Just think of it this way, in twenty years or so, we'll have an additional eight taxpayers in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 09:29:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "Just more evidence that something is awry in this country. People who really need help have to jump through hoops to try to get what they need! This loony tunes idiot seems to have captured the attention she was looking for. I wonder when she will be on Oprah, looking for a book deal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "Just more evidence that something is awry in this country. People who really need help have to jump through hoops to try to get what they need! This loony tunes idiot seems to have captured the attention she was looking for. I wonder when she will be on Oprah, looking for a book deal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 10:24:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on.", 
        "reply": " Please change as above. You know that's how it's going to work out How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 10:52:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one. There's a lot of truth there. It might change the face of fertility medicine. I feel bad for any child who is the bad weather of life. Glad we do have some agencies that do still look out for them. Wall street can go suc an egg... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "reply": " There's a lot of truth there. It might change the face of fertility medicine. I feel bad for any child who is the bad weather of life. Glad we do have some agencies that do still look out for them. Wall street can go suc an egg... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 10:53:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Although I agree with most of the comments, it just isn't fair for those that are responsible and have fallen on hard times. I mean the families that bought homes within their budget, paid their bills and then lost their jobs and homes. It seems to be that the more outrageous you are in the US, the more things are given to you. I understand that these babies need support and help, but there should also be stipulations on what the mother can and cannot do. She complains endlessly that she wants her privacy but she is on every show on TV. It is very sad when the only way you will ever get helped if you do something totally irresponsible, outlandish, and completely out of the norm.", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "", 
        "reply": "Although I agree with most of the comments, it just isn't fair for those that are responsible and have fallen on hard times. I mean the families that bought homes within their budget, paid their bills and then lost their jobs and homes. It seems to be that the more outrageous you are in the US, the more things are given to you. I understand that these babies need support and help, but there should also be stipulations on what the mother can and cannot do. She complains endlessly that she wants her privacy but she is on every show on TV. It is very sad when the only way you will ever get helped if you do something totally irresponsible, outlandish, and completely out of the norm.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 11:42:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Opalfire"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors.", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out", 
        "reply": " I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:02:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors. Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 17, 
        "quote": "Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors.", 
        "reply": " Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:16:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. True, \"you don't get Cherries from an Apple tree\".", 
        "intTime": 20090311, 
        "postID": 18, 
        "quote": "Originally posted by m551sheridan: Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer.", 
        "reply": " True, \"you don't get Cherries from an Apple tree\".", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:22:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors. Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves.", 
        "intTime": 20090311, 
        "postID": 19, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors. Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer.", 
        "reply": " I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:50:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Originally posted by OrangeCat97: I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves. well, I am pleased that you still like me... I did not want to infer that all would be like their mom.. but statistics are against you my dear... is why there are so many willing to take the free ride then go out and earn an honest dollar.. Oh, did you note Barry hs poked his head in? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 20, 
        "quote": "Originally posted by OrangeCat97: I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves.", 
        "reply": " well, I am pleased that you still like me... I did not want to infer that all would be like their mom.. but statistics are against you my dear... is why there are so many willing to take the free ride then go out and earn an honest dollar.. Oh, did you note Barry hs poked his head in? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 13:01:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "\"http://www.msnbc.msn.com/id/29607219/\" I can't beleive this, free nursing care now. What's next for that wench? \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090311, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.msnbc.msn.com/id/29607219/\" I can't beleive this, free nursing care now. What's next for that wench? \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:01:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "I watched Dr. Phil yesterday and part 2 is today. I am not going to bash this woman because she admitted she was wrong/stupid. The house she got is for the children, not her. The help she got is for the children, not her. And I am glad she got some help.", 
        "intTime": 20090311, 
        "postID": 22, 
        "quote": "", 
        "reply": "I watched Dr. Phil yesterday and part 2 is today. I am not going to bash this woman because she admitted she was wrong/stupid. The house she got is for the children, not her. The help she got is for the children, not her. And I am glad she got some help.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:32:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "She still hasn't gotten her tubes tied yet. I wonder why?", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "", 
        "reply": "She still hasn't gotten her tubes tied yet. I wonder why?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:43:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Duster6"
    }, 
    {
        "content": "My main concern is for all the children and they have a very disturbed mother who is being rewarded for her inexcusable behavior. Decency demands that citizens provide for these innocent children but I am not particularly happy that the mother has been permitted to keep the children and be provided with a more luxurious life.", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "", 
        "reply": "My main concern is for all the children and they have a very disturbed mother who is being rewarded for her inexcusable behavior. Decency demands that citizens provide for these innocent children but I am not particularly happy that the mother has been permitted to keep the children and be provided with a more luxurious life.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 06:58:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "mallovesthetroops"
    }, 
    {
        "content": "wow... kinda like the auto industry.. get into all this trouble then expect people to bail them out..", 
        "intTime": 20090311, 
        "postID": 25, 
        "quote": "", 
        "reply": "wow... kinda like the auto industry.. get into all this trouble then expect people to bail them out..", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:11:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by Duster6: She still hasn't gotten her tubes tied yet. I wonder why? Cuz she's flippin' NUTS!", 
        "intTime": 20090311, 
        "postID": 26, 
        "quote": "Originally posted by Duster6: She still hasn't gotten her tubes tied yet. I wonder why?", 
        "reply": " Cuz she's flippin' NUTS!", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:38:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "There was only room for one of two solutions available. Either \"take the kids away\" or a \"benevolent person gives her a house and helps the family\". I kinda figured the State would take them but this was something that was always in the works in someones mind. I wonder if the donor was \"O\"? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090311, 
        "postID": 27, 
        "quote": "", 
        "reply": "There was only room for one of two solutions available. Either \"take the kids away\" or a \"benevolent person gives her a house and helps the family\". I kinda figured the State would take them but this was something that was always in the works in someones mind. I wonder if the donor was \"O\"? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:38:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I ain't gonna say I told ya so, but I told ya so. She is a wack job! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 28, 
        "quote": "", 
        "reply": "I ain't gonna say I told ya so, but I told ya so. She is a wack job! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:45:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "", 
        "reply": "I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 07:51:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Persy"
    }, 
    {
        "content": "quote: Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one. sounds good to me rather than having taxdollars pay for her lunacy.. all in favor?", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "reply": " sounds good to me rather than having taxdollars pay for her lunacy.. all in favor?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 09:13:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "88miker"
    }, 
    {
        "content": "Just think of it this way, in twenty years or so, we'll have an additional eight taxpayers in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on.", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "", 
        "reply": "Just think of it this way, in twenty years or so, we'll have an additional eight taxpayers in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 09:29:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "Just more evidence that something is awry in this country. People who really need help have to jump through hoops to try to get what they need! This loony tunes idiot seems to have captured the attention she was looking for. I wonder when she will be on Oprah, looking for a book deal! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "Just more evidence that something is awry in this country. People who really need help have to jump through hoops to try to get what they need! This loony tunes idiot seems to have captured the attention she was looking for. I wonder when she will be on Oprah, looking for a book deal! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 10:24:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on.", 
        "reply": " Please change as above. You know that's how it's going to work out How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 10:52:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one. There's a lot of truth there. It might change the face of fertility medicine. I feel bad for any child who is the bad weather of life. Glad we do have some agencies that do still look out for them. Wall street can go suc an egg... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "Originally posted by Persy: I would rather help those children than Wall Street!!! I don't agree with anything she did - and think that she needs some serious psychological help, but the children didn't ask for any of this. That doctor should be made to give her a HUGE child support check every month since he made the moral decision to inplant 6! Seems to me that he is getting off free on this one.", 
        "reply": " There's a lot of truth there. It might change the face of fertility medicine. I feel bad for any child who is the bad weather of life. Glad we do have some agencies that do still look out for them. Wall street can go suc an egg... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 10:53:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Although I agree with most of the comments, it just isn't fair for those that are responsible and have fallen on hard times. I mean the families that bought homes within their budget, paid their bills and then lost their jobs and homes. It seems to be that the more outrageous you are in the US, the more things are given to you. I understand that these babies need support and help, but there should also be stipulations on what the mother can and cannot do. She complains endlessly that she wants her privacy but she is on every show on TV. It is very sad when the only way you will ever get helped if you do something totally irresponsible, outlandish, and completely out of the norm.", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "", 
        "reply": "Although I agree with most of the comments, it just isn't fair for those that are responsible and have fallen on hard times. I mean the families that bought homes within their budget, paid their bills and then lost their jobs and homes. It seems to be that the more outrageous you are in the US, the more things are given to you. I understand that these babies need support and help, but there should also be stipulations on what the mother can and cannot do. She complains endlessly that she wants her privacy but she is on every show on TV. It is very sad when the only way you will ever get helped if you do something totally irresponsible, outlandish, and completely out of the norm.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 11:42:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Opalfire"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors.", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out", 
        "reply": " I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:02:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors. Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 37, 
        "quote": "Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors.", 
        "reply": " Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:16:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. True, \"you don't get Cherries from an Apple tree\".", 
        "intTime": 20090311, 
        "postID": 38, 
        "quote": "Originally posted by m551sheridan: Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer.", 
        "reply": " True, \"you don't get Cherries from an Apple tree\".", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:22:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors. Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer. I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves.", 
        "intTime": 20090311, 
        "postID": 39, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by OrangeCat97: quote: Originally posted by Vicdude: quote: Originally posted by OrangeCat97: Just think of it this way, in twenty years or so, we'll have an additional eight fourteen taxpayers welfare recipients in the system. Whatever Ponzi schemes are popular then, probably they will be part of. and the beat goes on. Please change as above. You know that's how it's going to work out I stand corrected on my math, but often the sins of the parents don't fall on the children. I'm not a carbon copy of my parents, and there's a good chance her kids won't be, either. In fact, they may even go in reverse, because they had to live under her ideas. Did you do EVERYTHING your parents did? I didn't. I tried to correct what I saw as their errors. Dear lady..... not all have a sense of worth and pride in self as you do... this woman has no pride..... she's out for the free ride and if her kids are brought up that way there is high probibility they will turn out the same... just look at the generations of those on the dole already.... they \"expect\" it as their due.. but we will be gone by the time it comes about - well, I will anyway. You I think are one of those who will live to 110 or longer.", 
        "reply": " I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves.", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 12:50:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "OrangeCat97"
    }, 
    {
        "content": "quote: Originally posted by OrangeCat97: I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves. well, I am pleased that you still like me... I did not want to infer that all would be like their mom.. but statistics are against you my dear... is why there are so many willing to take the free ride then go out and earn an honest dollar.. Oh, did you note Barry hs poked his head in? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 40, 
        "quote": "Originally posted by OrangeCat97: I dunno, Tank. I have noticed that kids in my neighborhood are very intrigued by \"opposites\". The more their lazy indolent parents hate me.... the more they secretly worship and try to copy me, LOL. My mom put it in an interesting way one time to my dad, who thought I should be a (female) clone of him. She says to him, \"She's part me, part you, and part the way God made her.\" Every creation has something that is uniquely theirs. Just as there's always a black sheep in every family, there is also, alternatively, always a white sheep. I think that's because God is the one who has His way, ultimately. So no.... I STILL disagree with you. Much as I loves you. Not to say that NONE of her pups will emulate her. But I think she is too uniquely weird, and when they suffer under their raising, they won't go there. Bet ya ten bucks none of them has a huge family themselves.", 
        "reply": " well, I am pleased that you still like me... I did not want to infer that all would be like their mom.. but statistics are against you my dear... is why there are so many willing to take the free ride then go out and earn an honest dollar.. Oh, did you note Barry hs poked his head in? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_1850025712001", 
        "time": "2009-03-11 13:01:00", 
        "title": "Octuplets' Mother May Get New Home, Nursing Care", 
        "userID": "m551sheridan"
    }
]