[
    {
        "content": "Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!! \"The World's Finest\"", 
        "intTime": 20090411, 
        "postID": 1, 
        "quote": "", 
        "reply": "Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!! \"The World's Finest\"", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 04:59:00", 
        "title": "Reminder...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I think that guy w/ out a shirt helped lay new sod in my yard a few years ago", 
        "intTime": 20090411, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think that guy w/ out a shirt helped lay new sod in my yard a few years ago", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 06:58:00", 
        "title": "Reminder...", 
        "userID": "TsgtTharin"
    }, 
    {
        "content": "dude.....thats me!", 
        "intTime": 20090411, 
        "postID": 3, 
        "quote": "", 
        "reply": "dude.....thats me!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 07:00:00", 
        "title": "Reminder...", 
        "userID": "AceShaw"
    }, 
    {
        "content": "The fat one looks like the guy who came through my ER with his 8 kids looking for free clinic visits and lunch. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090411, 
        "postID": 4, 
        "quote": "", 
        "reply": "The fat one looks like the guy who came through my ER with his 8 kids looking for free clinic visits and lunch. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 07:46:00", 
        "title": "Reminder...", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year...", 
        "intTime": 20090411, 
        "postID": 5, 
        "quote": "", 
        "reply": "wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year...", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 08:08:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year... I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\" \"The World's Finest\"", 
        "intTime": 20090411, 
        "postID": 6, 
        "quote": "Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year...", 
        "reply": " I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\" \"The World's Finest\"", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 08:13:00", 
        "title": "Reminder...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "There should be a law, \"Illegals\", first must have a job for 5 years, before they ask for free government handouts, if their job does not provide health care. Government would pay 10%, the insured would have to pay 90% Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090411, 
        "postID": 7, 
        "quote": "", 
        "reply": "There should be a law, \"Illegals\", first must have a job for 5 years, before they ask for free government handouts, if their job does not provide health care. Government would pay 10%, the insured would have to pay 90% Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 08:43:00", 
        "title": "Reminder...", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year... I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\" fist off.. your web site is not even active... you might want to get updated by going here : \"http://www.americansov.org/news/news.html\" the counter you see is an ESTIMATED number of people that, if entering at the rate he posted... which is ludicrous. the numbers are still (in reality) between 8 and 12 million. understand that i am not denying there is a problem. i am just saying that your numbers are not reflective of the truth, and only serve to undermine any and all efforts put forth by INS, ICE, and even the Minuteman movement. i would like to see you put these numbers in fron to any minuteman and explain to him that, on HIS WATCH, NINE MILLION people just mosied by him... if we can seperate fact, from fiction, we will get ahold of the problem faster than if we wrestle with lies and begin commiting acts of agression agaimst an imagined threat created by demagoguery. furthermore i find it amazing that you would talk about \"Legality\" whgen dealing with corrupt CEO's that are being bailed out by the government. these are the VERY people that made a mint off illegals, and who sent jobs out of the country. these are the same peolple that laid off good hard working americans so they could make a bigger profit. \"legally\" stealing from us seems to be a hard concept for me to understand. and keggy... just to mark a point... why is it that when someone disagrees with you, they are automatically \"liberals\"? do you speak for conservatives, nation wide? or are you far to the right that EVERYONE is a liberal compared to you?", 
        "intTime": 20090411, 
        "postID": 8, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year... I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\"", 
        "reply": " fist off.. your web site is not even active... you might want to get updated by going here : \"http://www.americansov.org/news/news.html\" the counter you see is an ESTIMATED number of people that, if entering at the rate he posted... which is ludicrous. the numbers are still (in reality) between 8 and 12 million. understand that i am not denying there is a problem. i am just saying that your numbers are not reflective of the truth, and only serve to undermine any and all efforts put forth by INS, ICE, and even the Minuteman movement. i would like to see you put these numbers in fron to any minuteman and explain to him that, on HIS WATCH, NINE MILLION people just mosied by him... if we can seperate fact, from fiction, we will get ahold of the problem faster than if we wrestle with lies and begin commiting acts of agression agaimst an imagined threat created by demagoguery. furthermore i find it amazing that you would talk about \"Legality\" whgen dealing with corrupt CEO's that are being bailed out by the government. these are the VERY people that made a mint off illegals, and who sent jobs out of the country. these are the same peolple that laid off good hard working americans so they could make a bigger profit. \"legally\" stealing from us seems to be a hard concept for me to understand. and keggy... just to mark a point... why is it that when someone disagrees with you, they are automatically \"liberals\"? do you speak for conservatives, nation wide? or are you far to the right that EVERYONE is a liberal compared to you?", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 09:58:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don", 
        "intTime": 20090411, 
        "postID": 9, 
        "quote": "Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like...", 
        "reply": " Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:17:00", 
        "title": "Reminder...", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!! That was the guys \"working\" in front of my house all week - really good at leaning on shovels - - Wandering and Wondering", 
        "intTime": 20090411, 
        "postID": 10, 
        "quote": "Originally posted by Kegler300: Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!!", 
        "reply": " That was the guys \"working\" in front of my house all week - really good at leaning on shovels - - Wandering and Wondering", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:31:00", 
        "title": "Reminder...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "National and state governments need to make tougher laws regarding immigration. Screw the ACLU, they can move to Mexico and stay there and keep their nose out our business! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "", 
        "reply": "National and state governments need to make tougher laws regarding immigration. Screw the ACLU, they can move to Mexico and stay there and keep their nose out our business! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:36:00", 
        "title": "Reminder...", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Our state passed harsher laws, but the Capitol City Mayor and Police Chief said they won't enforce the new laws - - go figure!! Wandering and Wondering", 
        "intTime": 20090411, 
        "postID": 12, 
        "quote": "", 
        "reply": "Our state passed harsher laws, but the Capitol City Mayor and Police Chief said they won't enforce the new laws - - go figure!! Wandering and Wondering", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:44:00", 
        "title": "Reminder...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don yup... i feel better. and i have to admit, i see a group of hispanics standing by home depot, and i think \"illegals\" too... admittedly, hispanics account for 70% of illegals.... but i KNOW better. having worked with INS, i have discovered that i have been wrong more often than not. How does that whole ASS-U-ME thing go? but i was more concerned with the inflated numbers that Keggler was using... that is a much bigger problem. Demagoguery. that little attitude has led to the deaths of millions of humans world wide over the centuries. This message has been edited. Last edited by: Elesso, Sun 12 April 2009 08:32 AM", 
        "intTime": 20090412, 
        "postID": 13, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don", 
        "reply": " yup... i feel better. and i have to admit, i see a group of hispanics standing by home depot, and i think \"illegals\" too... admittedly, hispanics account for 70% of illegals.... but i KNOW better. having worked with INS, i have discovered that i have been wrong more often than not. How does that whole ASS-U-ME thing go? but i was more concerned with the inflated numbers that Keggler was using... that is a much bigger problem. Demagoguery. that little attitude has led to the deaths of millions of humans world wide over the centuries. This message has been edited. Last edited by: Elesso, Sun 12 April 2009 08:32 AM", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 08:04:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "I don't know what everyone is worried about soon there will be no more illegal aliens they will all be citizens of this here country. And to top that off 30,000 illegal alien Gang Members will automatically be citizens all they have to do is say I don't want to be a gang member any more.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090412, 
        "postID": 14, 
        "quote": "", 
        "reply": "I don't know what everyone is worried about soon there will be no more illegal aliens they will all be citizens of this here country. And to top that off 30,000 illegal alien Gang Members will automatically be citizens all they have to do is say I don't want to be a gang member any more.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 09:15:00", 
        "title": "Reminder...", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090412, 
        "postID": 15, 
        "quote": "", 
        "reply": "Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 10:05:00", 
        "title": "Reminder...", 
        "userID": "Bergy46"
    }, 
    {
        "content": "And an ex-POTUS who used signing statements, saying he was not obligated to follow the law he just signed, appeased the right wing nut jobs. Nut jobs are on both sides. It is not limited to one only.", 
        "intTime": 20090412, 
        "postID": 16, 
        "quote": "", 
        "reply": "And an ex-POTUS who used signing statements, saying he was not obligated to follow the law he just signed, appeased the right wing nut jobs. Nut jobs are on both sides. It is not limited to one only.", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 10:20:00", 
        "title": "Reminder...", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! you have it backwards Bergy...... signing into law a law that the majority does not want IS LAW.... enforcing an existing law that the majority does want IS NOT LAW and an abuse of human rights. Geeeeese, get with the program. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090412, 
        "postID": 17, 
        "quote": "Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs!", 
        "reply": " you have it backwards Bergy...... signing into law a law that the majority does not want IS LAW.... enforcing an existing law that the majority does want IS NOT LAW and an abuse of human rights. Geeeeese, get with the program. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 10:36:00", 
        "title": "Reminder...", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! you know... the ACLU works for YOU. they are a watchdog group insuring that our governemt does not overstop its bounds. many times, in their every day work they get on our nerves. believe me that Obama will feel the sting of their tongue. liberals and conservatives alike have been in the sights of the ACLU. now as much as they get on our nerves, are they any worse than, say... the NRA? or the NAACP? or LuLAc? MeCha? all of these organizations protect people from Government intrusion, and from Government oversight. they serve a purpose beyond that of your or my feelings.", 
        "intTime": 20090412, 
        "postID": 18, 
        "quote": "Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs!", 
        "reply": " you know... the ACLU works for YOU. they are a watchdog group insuring that our governemt does not overstop its bounds. many times, in their every day work they get on our nerves. believe me that Obama will feel the sting of their tongue. liberals and conservatives alike have been in the sights of the ACLU. now as much as they get on our nerves, are they any worse than, say... the NRA? or the NAACP? or LuLAc? MeCha? all of these organizations protect people from Government intrusion, and from Government oversight. they serve a purpose beyond that of your or my feelings.", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 17:00:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! Source: \"http://thebatavian.com/4907/lllegal-aliens\" \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 19, 
        "quote": "What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!!", 
        "reply": " Source: \"http://thebatavian.com/4907/lllegal-aliens\" \"The World's Finest\"", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-13 05:34:00", 
        "title": "Reminder...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! Source: \"http://thebatavian.com/4907/lllegal-aliens\" more inflated numbers. 3 million, not 13, were targeted by operation wetback. amongst the people deported were thousands of LEGAL citizens of hispanic descent. people born here or citizens, not \"anchor\" babies. Stalin could have done the job better... you jad 500 deportees stuffed into ships designed for 100 passengers. plaeloads and trainloads of deportees speaking \"perfect english\" being dropped off deep in Mexican territory even if theywere not Mexican. I'd say \"operation wetback\" was a resounding success (if we were stalinist Russia\" c'mon Kegggler... now you are just gettting lazy. quoting another chat forum? that is just plain wrong! here.. let me give you a hand... how about you read up on the afore mentioned operation? read into Truman's repatriation act and his \"Bracero program\"? read into the reagan immigration amnesty act to get a little deapth. you make a decent argument, but your inflated numbers make you seem \"ravenously rabid\" in your points, and thus, you seem unreliable to listen to....", 
        "intTime": 20090413, 
        "postID": 20, 
        "quote": "Originally posted by Kegler300: quote: What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! Source: \"http://thebatavian.com/4907/lllegal-aliens\"", 
        "reply": " more inflated numbers. 3 million, not 13, were targeted by operation wetback. amongst the people deported were thousands of LEGAL citizens of hispanic descent. people born here or citizens, not \"anchor\" babies. Stalin could have done the job better... you jad 500 deportees stuffed into ships designed for 100 passengers. plaeloads and trainloads of deportees speaking \"perfect english\" being dropped off deep in Mexican territory even if theywere not Mexican. I'd say \"operation wetback\" was a resounding success (if we were stalinist Russia\" c'mon Kegggler... now you are just gettting lazy. quoting another chat forum? that is just plain wrong! here.. let me give you a hand... how about you read up on the afore mentioned operation? read into Truman's repatriation act and his \"Bracero program\"? read into the reagan immigration amnesty act to get a little deapth. you make a decent argument, but your inflated numbers make you seem \"ravenously rabid\" in your points, and thus, you seem unreliable to listen to....", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-13 09:12:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!! \"The World's Finest\"", 
        "intTime": 20090411, 
        "postID": 21, 
        "quote": "", 
        "reply": "Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!! \"The World's Finest\"", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 04:59:00", 
        "title": "Reminder...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "I think that guy w/ out a shirt helped lay new sod in my yard a few years ago", 
        "intTime": 20090411, 
        "postID": 22, 
        "quote": "", 
        "reply": "I think that guy w/ out a shirt helped lay new sod in my yard a few years ago", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 06:58:00", 
        "title": "Reminder...", 
        "userID": "TsgtTharin"
    }, 
    {
        "content": "dude.....thats me!", 
        "intTime": 20090411, 
        "postID": 23, 
        "quote": "", 
        "reply": "dude.....thats me!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 07:00:00", 
        "title": "Reminder...", 
        "userID": "AceShaw"
    }, 
    {
        "content": "The fat one looks like the guy who came through my ER with his 8 kids looking for free clinic visits and lunch. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090411, 
        "postID": 24, 
        "quote": "", 
        "reply": "The fat one looks like the guy who came through my ER with his 8 kids looking for free clinic visits and lunch. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 07:46:00", 
        "title": "Reminder...", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year...", 
        "intTime": 20090411, 
        "postID": 25, 
        "quote": "", 
        "reply": "wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year...", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 08:08:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year... I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\" \"The World's Finest\"", 
        "intTime": 20090411, 
        "postID": 26, 
        "quote": "Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year...", 
        "reply": " I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\" \"The World's Finest\"", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 08:13:00", 
        "title": "Reminder...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "There should be a law, \"Illegals\", first must have a job for 5 years, before they ask for free government handouts, if their job does not provide health care. Government would pay 10%, the insured would have to pay 90% Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090411, 
        "postID": 27, 
        "quote": "", 
        "reply": "There should be a law, \"Illegals\", first must have a job for 5 years, before they ask for free government handouts, if their job does not provide health care. Government would pay 10%, the insured would have to pay 90% Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 08:43:00", 
        "title": "Reminder...", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year... I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\" fist off.. your web site is not even active... you might want to get updated by going here : \"http://www.americansov.org/news/news.html\" the counter you see is an ESTIMATED number of people that, if entering at the rate he posted... which is ludicrous. the numbers are still (in reality) between 8 and 12 million. understand that i am not denying there is a problem. i am just saying that your numbers are not reflective of the truth, and only serve to undermine any and all efforts put forth by INS, ICE, and even the Minuteman movement. i would like to see you put these numbers in fron to any minuteman and explain to him that, on HIS WATCH, NINE MILLION people just mosied by him... if we can seperate fact, from fiction, we will get ahold of the problem faster than if we wrestle with lies and begin commiting acts of agression agaimst an imagined threat created by demagoguery. furthermore i find it amazing that you would talk about \"Legality\" whgen dealing with corrupt CEO's that are being bailed out by the government. these are the VERY people that made a mint off illegals, and who sent jobs out of the country. these are the same peolple that laid off good hard working americans so they could make a bigger profit. \"legally\" stealing from us seems to be a hard concept for me to understand. and keggy... just to mark a point... why is it that when someone disagrees with you, they are automatically \"liberals\"? do you speak for conservatives, nation wide? or are you far to the right that EVERYONE is a liberal compared to you?", 
        "intTime": 20090411, 
        "postID": 28, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... now there are 21 million illegal aliens... they are pretty prolific... with all the pressure mounting and people closing doors and they STILL got NINE MILLION PEOPLE IN in less than one year... wondering when we'll stop inflating the numbers maybe we pay our taxes so that some overbloated CEO can make his yatch payment this year... I was using a very conservative figure. Sounds like you're more concerned about CEO's who are here legally making money and stimulating the economy, than you are about those who have ignored our laws and are here illegally draining our resources at tax payer's expense. You probably stand a better chance at getting hired by an illegal immigrant than you do a rich CEO anyway. Go figure...you're probably a liberal... \"http://www.theamericanresistance.com/ref/illegal_alien_numbers.html\"", 
        "reply": " fist off.. your web site is not even active... you might want to get updated by going here : \"http://www.americansov.org/news/news.html\" the counter you see is an ESTIMATED number of people that, if entering at the rate he posted... which is ludicrous. the numbers are still (in reality) between 8 and 12 million. understand that i am not denying there is a problem. i am just saying that your numbers are not reflective of the truth, and only serve to undermine any and all efforts put forth by INS, ICE, and even the Minuteman movement. i would like to see you put these numbers in fron to any minuteman and explain to him that, on HIS WATCH, NINE MILLION people just mosied by him... if we can seperate fact, from fiction, we will get ahold of the problem faster than if we wrestle with lies and begin commiting acts of agression agaimst an imagined threat created by demagoguery. furthermore i find it amazing that you would talk about \"Legality\" whgen dealing with corrupt CEO's that are being bailed out by the government. these are the VERY people that made a mint off illegals, and who sent jobs out of the country. these are the same peolple that laid off good hard working americans so they could make a bigger profit. \"legally\" stealing from us seems to be a hard concept for me to understand. and keggy... just to mark a point... why is it that when someone disagrees with you, they are automatically \"liberals\"? do you speak for conservatives, nation wide? or are you far to the right that EVERYONE is a liberal compared to you?", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 09:58:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don", 
        "intTime": 20090411, 
        "postID": 29, 
        "quote": "Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like...", 
        "reply": " Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:17:00", 
        "title": "Reminder...", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!! That was the guys \"working\" in front of my house all week - really good at leaning on shovels - - Wandering and Wondering", 
        "intTime": 20090411, 
        "postID": 30, 
        "quote": "Originally posted by Kegler300: Don't forget to file your taxes on April 15th...21 million illegal aliens are depending on YOU! Muchas gracias!!", 
        "reply": " That was the guys \"working\" in front of my house all week - really good at leaning on shovels - - Wandering and Wondering", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:31:00", 
        "title": "Reminder...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "National and state governments need to make tougher laws regarding immigration. Screw the ACLU, they can move to Mexico and stay there and keep their nose out our business! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090411, 
        "postID": 31, 
        "quote": "", 
        "reply": "National and state governments need to make tougher laws regarding immigration. Screw the ACLU, they can move to Mexico and stay there and keep their nose out our business! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:36:00", 
        "title": "Reminder...", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Our state passed harsher laws, but the Capitol City Mayor and Police Chief said they won't enforce the new laws - - go figure!! Wandering and Wondering", 
        "intTime": 20090411, 
        "postID": 32, 
        "quote": "", 
        "reply": "Our state passed harsher laws, but the Capitol City Mayor and Police Chief said they won't enforce the new laws - - go figure!! Wandering and Wondering", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-11 10:44:00", 
        "title": "Reminder...", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don yup... i feel better. and i have to admit, i see a group of hispanics standing by home depot, and i think \"illegals\" too... admittedly, hispanics account for 70% of illegals.... but i KNOW better. having worked with INS, i have discovered that i have been wrong more often than not. How does that whole ASS-U-ME thing go? but i was more concerned with the inflated numbers that Keggler was using... that is a much bigger problem. Demagoguery. that little attitude has led to the deaths of millions of humans world wide over the centuries. This message has been edited. Last edited by: Elesso, Sun 12 April 2009 08:32 AM", 
        "intTime": 20090412, 
        "postID": 33, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by Elesso: wow.. you got good eyes... so THAT is what illegal aliens look like... Since I personally have detained hundreds of Illegals over the years, yep, that's pretty much what they look like. Of course I can not say that these men are indeed \"Illegal\" but I can say with 100% certainty, that is what many of them look like. I know, I know Elesso, they can also look Haitian, Chinese, and even as White as any average Irishman. Feel better? Don", 
        "reply": " yup... i feel better. and i have to admit, i see a group of hispanics standing by home depot, and i think \"illegals\" too... admittedly, hispanics account for 70% of illegals.... but i KNOW better. having worked with INS, i have discovered that i have been wrong more often than not. How does that whole ASS-U-ME thing go? but i was more concerned with the inflated numbers that Keggler was using... that is a much bigger problem. Demagoguery. that little attitude has led to the deaths of millions of humans world wide over the centuries. This message has been edited. Last edited by: Elesso, Sun 12 April 2009 08:32 AM", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 08:04:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "I don't know what everyone is worried about soon there will be no more illegal aliens they will all be citizens of this here country. And to top that off 30,000 illegal alien Gang Members will automatically be citizens all they have to do is say I don't want to be a gang member any more.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090412, 
        "postID": 34, 
        "quote": "", 
        "reply": "I don't know what everyone is worried about soon there will be no more illegal aliens they will all be citizens of this here country. And to top that off 30,000 illegal alien Gang Members will automatically be citizens all they have to do is say I don't want to be a gang member any more.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 09:15:00", 
        "title": "Reminder...", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090412, 
        "postID": 35, 
        "quote": "", 
        "reply": "Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 10:05:00", 
        "title": "Reminder...", 
        "userID": "Bergy46"
    }, 
    {
        "content": "And an ex-POTUS who used signing statements, saying he was not obligated to follow the law he just signed, appeased the right wing nut jobs. Nut jobs are on both sides. It is not limited to one only.", 
        "intTime": 20090412, 
        "postID": 36, 
        "quote": "", 
        "reply": "And an ex-POTUS who used signing statements, saying he was not obligated to follow the law he just signed, appeased the right wing nut jobs. Nut jobs are on both sides. It is not limited to one only.", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 10:20:00", 
        "title": "Reminder...", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! you have it backwards Bergy...... signing into law a law that the majority does not want IS LAW.... enforcing an existing law that the majority does want IS NOT LAW and an abuse of human rights. Geeeeese, get with the program. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090412, 
        "postID": 37, 
        "quote": "Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs!", 
        "reply": " you have it backwards Bergy...... signing into law a law that the majority does not want IS LAW.... enforcing an existing law that the majority does want IS NOT LAW and an abuse of human rights. Geeeeese, get with the program. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 10:36:00", 
        "title": "Reminder...", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs! you know... the ACLU works for YOU. they are a watchdog group insuring that our governemt does not overstop its bounds. many times, in their every day work they get on our nerves. believe me that Obama will feel the sting of their tongue. liberals and conservatives alike have been in the sights of the ACLU. now as much as they get on our nerves, are they any worse than, say... the NRA? or the NAACP? or LuLAc? MeCha? all of these organizations protect people from Government intrusion, and from Government oversight. they serve a purpose beyond that of your or my feelings.", 
        "intTime": 20090412, 
        "postID": 38, 
        "quote": "Originally posted by Bergy46: Why bother to enact a law if they don't enforce it?. Wait a minute, I got it, enacting a law appeases, concerned citizens. Not enforcing the law appeases the ACLU, which in turn appeases the libs. Screw the ACLU and the libs!", 
        "reply": " you know... the ACLU works for YOU. they are a watchdog group insuring that our governemt does not overstop its bounds. many times, in their every day work they get on our nerves. believe me that Obama will feel the sting of their tongue. liberals and conservatives alike have been in the sights of the ACLU. now as much as they get on our nerves, are they any worse than, say... the NRA? or the NAACP? or LuLAc? MeCha? all of these organizations protect people from Government intrusion, and from Government oversight. they serve a purpose beyond that of your or my feelings.", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-12 17:00:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! Source: \"http://thebatavian.com/4907/lllegal-aliens\" \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 39, 
        "quote": "What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!!", 
        "reply": " Source: \"http://thebatavian.com/4907/lllegal-aliens\" \"The World's Finest\"", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-13 05:34:00", 
        "title": "Reminder...", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! Source: \"http://thebatavian.com/4907/lllegal-aliens\" more inflated numbers. 3 million, not 13, were targeted by operation wetback. amongst the people deported were thousands of LEGAL citizens of hispanic descent. people born here or citizens, not \"anchor\" babies. Stalin could have done the job better... you jad 500 deportees stuffed into ships designed for 100 passengers. plaeloads and trainloads of deportees speaking \"perfect english\" being dropped off deep in Mexican territory even if theywere not Mexican. I'd say \"operation wetback\" was a resounding success (if we were stalinist Russia\" c'mon Kegggler... now you are just gettting lazy. quoting another chat forum? that is just plain wrong! here.. let me give you a hand... how about you read up on the afore mentioned operation? read into Truman's repatriation act and his \"Bracero program\"? read into the reagan immigration amnesty act to get a little deapth. you make a decent argument, but your inflated numbers make you seem \"ravenously rabid\" in your points, and thus, you seem unreliable to listen to....", 
        "intTime": 20090413, 
        "postID": 40, 
        "quote": "Originally posted by Kegler300: quote: What do Hoover, Truman & Eisenhower Have in Common Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! Source: \"http://thebatavian.com/4907/lllegal-aliens\"", 
        "reply": " more inflated numbers. 3 million, not 13, were targeted by operation wetback. amongst the people deported were thousands of LEGAL citizens of hispanic descent. people born here or citizens, not \"anchor\" babies. Stalin could have done the job better... you jad 500 deportees stuffed into ships designed for 100 passengers. plaeloads and trainloads of deportees speaking \"perfect english\" being dropped off deep in Mexican territory even if theywere not Mexican. I'd say \"operation wetback\" was a resounding success (if we were stalinist Russia\" c'mon Kegggler... now you are just gettting lazy. quoting another chat forum? that is just plain wrong! here.. let me give you a hand... how about you read up on the afore mentioned operation? read into Truman's repatriation act and his \"Bracero program\"? read into the reagan immigration amnesty act to get a little deapth. you make a decent argument, but your inflated numbers make you seem \"ravenously rabid\" in your points, and thus, you seem unreliable to listen to....", 
        "threadID": "5291911282_8030034022001", 
        "time": "2009-04-13 09:12:00", 
        "title": "Reminder...", 
        "userID": "Elesso"
    }
]