[
    {
        "content": "sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case..", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case..", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-10 03:09:00", 
        "title": "has anyone ever done this?", 
        "userID": "88miker"
    }, 
    {
        "content": "Nope can't say that I have.Especially not a \"Gerber\"! Too good to have!", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "Nope can't say that I have.Especially not a \"Gerber\"! Too good to have!", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-11 01:39:00", 
        "title": "has anyone ever done this?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case..", 
        "reply": " No, I stopped doing drugs like 35 years ago. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-11 14:58:00", 
        "title": "has anyone ever done this?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago. And none of it was this good! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago.", 
        "reply": " And none of it was this good! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-11 16:03:00", 
        "title": "has anyone ever done this?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago. What are you fed-ex-ing? Well I can think of the one thing he kept running out of... Just send the seeds... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago.", 
        "reply": " What are you fed-ex-ing? Well I can think of the one thing he kept running out of... Just send the seeds... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-11 16:10:00", 
        "title": "has anyone ever done this?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "I fed-ex'd a booger once! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "", 
        "reply": "I fed-ex'd a booger once! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-11 16:20:00", 
        "title": "has anyone ever done this?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by Vicdude: quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago. And none of it was this good! Yeah right, I get \"high on life.\" Do Y'all know what that statement means? It means you're out on date with a tight azzed girl that doesn't drink, doesn't smoke and doesn't put out. Best thing is to put her out of the car at a bus stop and go back to the bar and look for something else. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by Vicdude: quote: Originally posted by 88miker: sent something fed ex, and then wonder how it could have helped tom hanks in castaway? sometimes i like to randomly mail a gerber... ya know.. just in case.. No, I stopped doing drugs like 35 years ago. And none of it was this good!", 
        "reply": " Yeah right, I get \"high on life.\" Do Y'all know what that statement means? It means you're out on date with a tight azzed girl that doesn't drink, doesn't smoke and doesn't put out. Best thing is to put her out of the car at a bus stop and go back to the bar and look for something else. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8130024712001", 
        "time": "2009-03-11 17:52:00", 
        "title": "has anyone ever done this?", 
        "userID": "Vicdude"
    }
]