[
    {
        "content": "Well a quick overview of my situation. Basically I messed up my paper work at MEPS when I went to go for the national Guard, Long story short (because of my mother's death and me talking about being a Marine all my life) I decided to join the USMC. Well this stuff about MEPS is still haunting me and keeping me from my dream job. Basically I accidentally put \"dizziness\" down as a \"medical problem\" which I don't have. Now I got a physical by my doctor, and even got a signed paper saying that there is No DIZZINESS! Well my marine recuiter is saying that that won't work...and that I need to get a physical...well...yea. Ha, just got one there buddy. So any help would be greatly thanked, what do I do?", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "", 
        "reply": "Well a quick overview of my situation. Basically I messed up my paper work at MEPS when I went to go for the national Guard, Long story short (because of my mother's death and me talking about being a Marine all my life) I decided to join the USMC. Well this stuff about MEPS is still haunting me and keeping me from my dream job. Basically I accidentally put \"dizziness\" down as a \"medical problem\" which I don't have. Now I got a physical by my doctor, and even got a signed paper saying that there is No DIZZINESS! Well my marine recuiter is saying that that won't work...and that I need to get a physical...well...yea. Ha, just got one there buddy. So any help would be greatly thanked, what do I do?", 
        "threadID": "5291911282_8000080422001", 
        "time": "2009-05-23 09:28:00", 
        "title": "NEED HELP", 
        "userID": "kiyro"
    }, 
    {
        "content": "I ask you to bring this question to : Joining the Military Recruiting pages They will be able to provide better answers than our guesses here. Good luck.", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "", 
        "reply": "I ask you to bring this question to : Joining the Military Recruiting pages They will be able to provide better answers than our guesses here. Good luck.", 
        "threadID": "5291911282_8000080422001", 
        "time": "2009-05-23 09:30:00", 
        "title": "NEED HELP", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by kiyro: Well a quick overview of my situation. Basically I messed up my paper work at MEPS when I went to go for the national Guard, Long story short (because of my mother's death and me talking about being a Marine all my life) I decided to join the USMC. Well this stuff about MEPS is still haunting me and keeping me from my dream job. Basically I accidentally put \"dizziness\" down as a \"medical problem\" which I don't have. Now I got a physical by my doctor, and even got a signed paper saying that there is No DIZZINESS! Well my marine recuiter is saying that that won't work...and that I need to get a physical...well...yea. Ha, just got one there buddy. So any help would be greatly thanked, what do I do? Get a letter from your Dr. explaining your condition, that may help. The military will give you a physical, if you pass you are good to go! In the future post on the Joining the military forum as scpd3045 recommends! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 3, 
        "quote": "Originally posted by kiyro: Well a quick overview of my situation. Basically I messed up my paper work at MEPS when I went to go for the national Guard, Long story short (because of my mother's death and me talking about being a Marine all my life) I decided to join the USMC. Well this stuff about MEPS is still haunting me and keeping me from my dream job. Basically I accidentally put \"dizziness\" down as a \"medical problem\" which I don't have. Now I got a physical by my doctor, and even got a signed paper saying that there is No DIZZINESS! Well my marine recuiter is saying that that won't work...and that I need to get a physical...well...yea. Ha, just got one there buddy. So any help would be greatly thanked, what do I do?", 
        "reply": " Get a letter from your Dr. explaining your condition, that may help. The military will give you a physical, if you pass you are good to go! In the future post on the Joining the military forum as scpd3045 recommends! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8000080422001", 
        "time": "2009-05-23 10:50:00", 
        "title": "NEED HELP", 
        "userID": "Bergy46"
    }
]