[
    {
        "content": "I’ve never heard of this either……. What a beautiful tribute. Did anyone out there even know this thing existed? I didn't and I like to think I keep up with this type of thing. Makes one wonder!! I had never heard of this before receiving it. Why didn't the press report it? This is the \"TEAR DROP\" made and Installed by the Russians to honor those Who died in 9/11 and a statement against Terrorism. It is very impressive. The tear drop is lined up with the Statue Of Liberty ... ....it is an impressive memorial and Statement against terrorism. Names of the persons killed on 9 11 are inscribed on the base. The base like the Vietnam Memorial wall. It was a cold and Windy day but well worth the drive to see. It is down in the Shipping yards across from \"The Lady\". The walkway is made of stones. Gift from the people of Russia .......\" Monument to the struggle against world Terrorism, artist Zurab Tesereteii\". This message has been edited. Last edited by: EOCRon, Tue 24 March 2009 03:11 PM SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090324, 
        "postID": 1, 
        "quote": "", 
        "reply": "I’ve never heard of this either……. What a beautiful tribute. Did anyone out there even know this thing existed? I didn't and I like to think I keep up with this type of thing. Makes one wonder!! I had never heard of this before receiving it. Why didn't the press report it? This is the \"TEAR DROP\" made and Installed by the Russians to honor those Who died in 9/11 and a statement against Terrorism. It is very impressive. The tear drop is lined up with the Statue Of Liberty ... ....it is an impressive memorial and Statement against terrorism. Names of the persons killed on 9 11 are inscribed on the base. The base like the Vietnam Memorial wall. It was a cold and Windy day but well worth the drive to see. It is down in the Shipping yards across from \"The Lady\". The walkway is made of stones. Gift from the people of Russia .......\" Monument to the struggle against world Terrorism, artist Zurab Tesereteii\". This message has been edited. Last edited by: EOCRon, Tue 24 March 2009 03:11 PM SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 13:59:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Thanks Ron, I did not know about this either. The freaking media buried it, a BIG THANK YOU TO RUSSIA. Skerew the terrorists and anyone who supports them1 Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090324, 
        "postID": 2, 
        "quote": "", 
        "reply": "Thanks Ron, I did not know about this either. The freaking media buried it, a BIG THANK YOU TO RUSSIA. Skerew the terrorists and anyone who supports them1 Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 14:07:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Thanks Ron, I did not know about this either. The freaking media buried it, a BIG THANK YOU TO RUSSIA. Skerew the terrorists and anyone who supports them1 Look again I lightened the pic it looks better SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090324, 
        "postID": 3, 
        "quote": "Originally posted by Bergy46: Thanks Ron, I did not know about this either. The freaking media buried it, a BIG THANK YOU TO RUSSIA. Skerew the terrorists and anyone who supports them1", 
        "reply": " Look again I lightened the pic it looks better SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 14:14:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Told some guys at the gym about the Muslim site peaceforall posted and their training camp in Jesup not 50 miles from here. This is a family site and I can’t repeat what they said. Unfortunately the news keeps a lot of good things under wrap.", 
        "intTime": 20090324, 
        "postID": 4, 
        "quote": "", 
        "reply": "Told some guys at the gym about the Muslim site peaceforall posted and their training camp in Jesup not 50 miles from here. This is a family site and I can’t repeat what they said. Unfortunately the news keeps a lot of good things under wrap.", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 14:19:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "Here's the snopes article giving more pictures and story - it is true. *http://www.snopes.com/rumors/tributes/teardrop.asp God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090324, 
        "postID": 5, 
        "quote": "", 
        "reply": "Here's the snopes article giving more pictures and story - it is true. *http://www.snopes.com/rumors/tributes/teardrop.asp God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 14:34:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by OldArmyLove: Here's the snopes article giving more pictures and story - it is true. *http://www.snopes.com/rumors/tributes/teardrop.asp ============================================== Thanks army love , I went to snopes and got a front view and added it.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090324, 
        "postID": 6, 
        "quote": "Originally posted by OldArmyLove: Here's the snopes article giving more pictures and story - it is true. *http://www.snopes.com/rumors/tributes/teardrop.asp", 
        "reply": " ============================================== Thanks army love , I went to snopes and got a front view and added it.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 15:14:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Why do you blame the media? The US government and the State of New Jersey knew about it - why didn't they publicize it? Was it because, perhaps - there are those in the previous Administration who wanted to villify Russia? Here's a piece on it: Time cures everything, but there are things we cannot and must not forget. Standing more than 100 feet tall, “To the Struggle Against World Terrorism” honors victims of 9/11 and the 1993 World Trade Center bombings and serves a symbol of solidarity in the fight against world terrorism. Created by Russian sculptor Zurab Tsereteli, the memorial was a gift from the Russian people. The Memorial was dedicated on the fifth anniversary of 9/11, in a ceremony attended by President Bill Clinton, Secretary of the Department of Homeland Security Michael Chertoff, Governor Jon Corzine, Senator Frank Lautenberg, Senator Robert Menendez and family members of World Trade Center victims. Grammy award winner, Leann Rimes, sang the National Anthem. By day, or nighttime when it is lit, the Memorial is clearly visible from lower Manhattan, the Staten Island Ferry, ships passing through New York Harbor and airplanes approaching Newark Airport. \"http://www.bayonnelra.com/events.htm\"", 
        "intTime": 20090324, 
        "postID": 7, 
        "quote": "", 
        "reply": "Why do you blame the media? The US government and the State of New Jersey knew about it - why didn't they publicize it? Was it because, perhaps - there are those in the previous Administration who wanted to villify Russia? Here's a piece on it: Time cures everything, but there are things we cannot and must not forget. Standing more than 100 feet tall, “To the Struggle Against World Terrorism” honors victims of 9/11 and the 1993 World Trade Center bombings and serves a symbol of solidarity in the fight against world terrorism. Created by Russian sculptor Zurab Tsereteli, the memorial was a gift from the Russian people. The Memorial was dedicated on the fifth anniversary of 9/11, in a ceremony attended by President Bill Clinton, Secretary of the Department of Homeland Security Michael Chertoff, Governor Jon Corzine, Senator Frank Lautenberg, Senator Robert Menendez and family members of World Trade Center victims. Grammy award winner, Leann Rimes, sang the National Anthem. By day, or nighttime when it is lit, the Memorial is clearly visible from lower Manhattan, the Staten Island Ferry, ships passing through New York Harbor and airplanes approaching Newark Airport. \"http://www.bayonnelra.com/events.htm\"", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 16:11:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Another story: \"http://www.waxahachiejournal.com/content/view/253/1/\" ...and a pic:", 
        "intTime": 20090324, 
        "postID": 8, 
        "quote": "", 
        "reply": "Another story: \"http://www.waxahachiejournal.com/content/view/253/1/\" ...and a pic:", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 16:28:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Another story: \"http://www.waxahachiejournal.com/content/view/253/1/\" ...and a pic: That is a really, really impressive monument. And, when viewed from that angle right there, it's pure genius.", 
        "intTime": 20090324, 
        "postID": 9, 
        "quote": "Originally posted by mcgreer: Another story: \"http://www.waxahachiejournal.com/content/view/253/1/\" ...and a pic:", 
        "reply": " That is a really, really impressive monument. And, when viewed from that angle right there, it's pure genius.", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 18:02:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's beautiful. It tops all the ideas they've been arguing over endlessly at Ground Zero. Just leave Ground Zero a nice park with a big flat plaque, and direct people to this monument...", 
        "intTime": 20090324, 
        "postID": 10, 
        "quote": "", 
        "reply": "It's beautiful. It tops all the ideas they've been arguing over endlessly at Ground Zero. Just leave Ground Zero a nice park with a big flat plaque, and direct people to this monument...", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 18:26:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Here's my two cents, I wrote this 9/12/2001 about 0500 hours. It's not the greatest thing, but it was my heart on that day. The Lady Stands Tall” The Lady Stands Tall, As she always has done, In the dark night and bright sun, The Lady Stands Tall, She’s there for her children and her friends, She’s steadfast, never dealing in trends. The Lady Stands Tall, Her children look to her with pride, Her friends know that she’ll stand at their side. The Lady Stands Tall, She’s always be there, She’s there, in weather foul and fair. The Lady Stands Tall, Her heart is open and ready Her stance is steady. The Lady Stands Tall, She hears her children cry. She let out a mournful sigh. The Lady Stands Tall, Her enemies strike to make her fall, Her friends heed her call. The Lady Stands Tall, She proclaims “this is war”, She knows what’s in store. The Lady Stands Tall, Her face shows this is not fun. Her commitment, until the victory is won. by Edwin L. Bruce, used with permission God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090324, 
        "postID": 11, 
        "quote": "", 
        "reply": "Here's my two cents, I wrote this 9/12/2001 about 0500 hours. It's not the greatest thing, but it was my heart on that day. The Lady Stands Tall” The Lady Stands Tall, As she always has done, In the dark night and bright sun, The Lady Stands Tall, She’s there for her children and her friends, She’s steadfast, never dealing in trends. The Lady Stands Tall, Her children look to her with pride, Her friends know that she’ll stand at their side. The Lady Stands Tall, She’s always be there, She’s there, in weather foul and fair. The Lady Stands Tall, Her heart is open and ready Her stance is steady. The Lady Stands Tall, She hears her children cry. She let out a mournful sigh. The Lady Stands Tall, Her enemies strike to make her fall, Her friends heed her call. The Lady Stands Tall, She proclaims “this is war”, She knows what’s in store. The Lady Stands Tall, Her face shows this is not fun. Her commitment, until the victory is won. by Edwin L. Bruce, used with permission God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-24 19:02:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by OldArmyLove: Here's my two cents, I wrote this 9/12/2001 about 0500 hours. It's not the greatest thing, but it was my heart on that day. The Lady Stands Tall” The Lady Stands Tall, As she always has done, In the dark night and bright sun, The Lady Stands Tall, She’s there for her children and her friends, She’s steadfast, never dealing in trends. The Lady Stands Tall, Her children look to her with pride, Her friends know that she’ll stand at their side. The Lady Stands Tall, She’s always be there, She’s there, in weather foul and fair. The Lady Stands Tall, Her heart is open and ready Her stance is steady. The Lady Stands Tall, She hears her children cry. She let out a mournful sigh. The Lady Stands Tall, Her enemies strike to make her fall, Her friends heed her call. The Lady Stands Tall, She proclaims “this is war”, She knows what’s in store. The Lady Stands Tall, Her face shows this is not fun. Her commitment, until the victory is won. by Edwin L. Bruce, used with permission I like it!", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "Originally posted by OldArmyLove: Here's my two cents, I wrote this 9/12/2001 about 0500 hours. It's not the greatest thing, but it was my heart on that day. The Lady Stands Tall” The Lady Stands Tall, As she always has done, In the dark night and bright sun, The Lady Stands Tall, She’s there for her children and her friends, She’s steadfast, never dealing in trends. The Lady Stands Tall, Her children look to her with pride, Her friends know that she’ll stand at their side. The Lady Stands Tall, She’s always be there, She’s there, in weather foul and fair. The Lady Stands Tall, Her heart is open and ready Her stance is steady. The Lady Stands Tall, She hears her children cry. She let out a mournful sigh. The Lady Stands Tall, Her enemies strike to make her fall, Her friends heed her call. The Lady Stands Tall, She proclaims “this is war”, She knows what’s in store. The Lady Stands Tall, Her face shows this is not fun. Her commitment, until the victory is won. by Edwin L. Bruce, used with permission", 
        "reply": " I like it!", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 05:42:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Why do you blame the media? The US government and the State of New Jersey knew about it - why didn't they publicize it? Was it because, perhaps - there are those in the previous Administration who wanted to villify Russia? I doubt they wanted to suppress it to vilify Russia. My theory is that the MSM was pushing the \"Bush is wrong on everything\" wave and feared this would be a powerful reminder of why we were doing what we are. It would fly in the faces of everyone that was screaming \"Bush lied, people died\" rhetoric.", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "Why do you blame the media? The US government and the State of New Jersey knew about it - why didn't they publicize it? Was it because, perhaps - there are those in the previous Administration who wanted to villify Russia?", 
        "reply": " I doubt they wanted to suppress it to vilify Russia. My theory is that the MSM was pushing the \"Bush is wrong on everything\" wave and feared this would be a powerful reminder of why we were doing what we are. It would fly in the faces of everyone that was screaming \"Bush lied, people died\" rhetoric.", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 05:52:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: It's beautiful. It tops all the ideas they've been arguing over endlessly at Ground Zero. Just leave Ground Zero a nice park with a big flat plaque, and direct people to this monument... That is about what I was thinking....", 
        "intTime": 20090325, 
        "postID": 14, 
        "quote": "Originally posted by Ruanne: It's beautiful. It tops all the ideas they've been arguing over endlessly at Ground Zero. Just leave Ground Zero a nice park with a big flat plaque, and direct people to this monument...", 
        "reply": " That is about what I was thinking....", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 05:56:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Why do you blame the media? The US government and the State of New Jersey knew about it - why didn't they publicize it? Was it because, perhaps - there are those in the previous Administration who wanted to villify Russia? I doubt they wanted to suppress it to vilify Russia. My theory is that the MSM was pushing the \"Bush is wrong on everything\" wave and feared this would be a powerful reminder of why we were doing what we are. It would fly in the faces of everyone that was screaming \"Bush lied, people died\" rhetoric. Well, the Russian government provided the lion's share of funding for it. Also, President Clinton dedicated it - why wouldn't President Bush have done so? I'd think he would have jumped at the chance to do such a thing, considering the occasion.", 
        "intTime": 20090325, 
        "postID": 15, 
        "quote": "Originally posted by Woody_in_La: quote: Why do you blame the media? The US government and the State of New Jersey knew about it - why didn't they publicize it? Was it because, perhaps - there are those in the previous Administration who wanted to villify Russia? I doubt they wanted to suppress it to vilify Russia. My theory is that the MSM was pushing the \"Bush is wrong on everything\" wave and feared this would be a powerful reminder of why we were doing what we are. It would fly in the faces of everyone that was screaming \"Bush lied, people died\" rhetoric.", 
        "reply": " Well, the Russian government provided the lion's share of funding for it. Also, President Clinton dedicated it - why wouldn't President Bush have done so? I'd think he would have jumped at the chance to do such a thing, considering the occasion.", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 06:41:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is this in Liberty State Park???", 
        "intTime": 20090325, 
        "postID": 16, 
        "quote": "", 
        "reply": "Is this in Liberty State Park???", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 06:48:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Well, the Russian government provided the lion's share of funding for it. Also, President Clinton dedicated it - why wouldn't President Bush have done so? I'd think he would have jumped at the chance to do such a thing, considering the occasion. It is very possible that Bush had a pressing issue that popped up and had asked Bill to do the honor. But that still does not explain why MSM did not give it the coverage it deserves. As I said, in my opinion it is because it would fly in the face of everything they were screaming. It would remind everyone of what got us to that point.", 
        "intTime": 20090325, 
        "postID": 17, 
        "quote": "Well, the Russian government provided the lion's share of funding for it. Also, President Clinton dedicated it - why wouldn't President Bush have done so? I'd think he would have jumped at the chance to do such a thing, considering the occasion.", 
        "reply": " It is very possible that Bush had a pressing issue that popped up and had asked Bill to do the honor. But that still does not explain why MSM did not give it the coverage it deserves. As I said, in my opinion it is because it would fly in the face of everything they were screaming. It would remind everyone of what got us to that point.", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 09:34:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: Is this in Liberty State Park??? Harbor View Park. \"\"http://www.bayonnelra.com/events.htm\"\"", 
        "intTime": 20090325, 
        "postID": 18, 
        "quote": "Originally posted by 67NOV: Is this in Liberty State Park???", 
        "reply": " Harbor View Park. \"\"http://www.bayonnelra.com/events.htm\"\"", 
        "threadID": "5291911282_9390077812001", 
        "time": "2009-03-25 09:46:00", 
        "title": "Why wouldn't the news show this????", 
        "userID": "Woody_in_La"
    }
]