[
    {
        "content": "1. If a young married couple join together will they be guaranteed to be assigned to the same base after boot camp? 2. If a female has enlisted but is not set to leave for several months - if she becomes pregnant will this null her enlist commitment or would it just be deferred to a later time?", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "", 
        "reply": "1. If a young married couple join together will they be guaranteed to be assigned to the same base after boot camp? 2. If a female has enlisted but is not set to leave for several months - if she becomes pregnant will this null her enlist commitment or would it just be deferred to a later time?", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 05:35:00", 
        "title": "Parent in need of answers", 
        "userID": "lkohr"
    }, 
    {
        "content": "This section of military.com would probably be a good place to get your answers: Military Life, Spouses and Community: Military 101, Back to the Basics http://forums.military.com/eve/forums/a/frm/f/6510050131001 or Joining the Military, Recruiting Questions http://forums.military.com/eve/forums/a/frm/f/78192862 Good luck, Don Proud father of a US Marine", 
        "intTime": 20090313, 
        "postID": 2, 
        "quote": "", 
        "reply": "This section of military.com would probably be a good place to get your answers: Military Life, Spouses and Community: Military 101, Back to the Basics http://forums.military.com/eve/forums/a/frm/f/6510050131001 or Joining the Military, Recruiting Questions http://forums.military.com/eve/forums/a/frm/f/78192862 Good luck, Don Proud father of a US Marine", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 05:40:00", 
        "title": "Parent in need of answers", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Tough questions! Don's advice is likely best, as we have several recruiters and, perhaps even better, families that can help you through personal experience. In my day (1989-1993), the Army did its very best to keep pre-service married personnel together. There was no guarantee, though - especially when the MOS's were different. That is, if he is Infantry and she is a lawyer, getting them assigned to the same location would be very difficult. If they're both mechanics, then the assignment is easy enough. The problem is that units tend to frown on that type of thing, as husband/wife teams working and then living together every day typically have issues. And what if one is promoted faster than the other? There are just so many variables... As to the pregnancy thing? I can't say how the military would handle that. Instead, I pose a question: As a soldier, I question the motivation. Signing the contract to serve your nation is a very admirable thing to do. But it means duty before family at all costs. What would she bring to the military besides a financial burden? We don't need moms. We need soldiers. How can they both be deployable? If the unit moves out, who will take care of the baby? This is why women are not allowed to serve in Combat Arms. They are too unpredictable in their desires. I can't use a pregnant woman in my squad in any way. If you want to get preggers, do the REAL soldiers a favor and stay a civilian. We count on you to be ready for duty at all times. Moms are civilians, not soldiers. Soldiers serve their country - they may have a family, but they serve God, country and family - in that order. It's not fair to put a child through that. And it is not fair to make the rest of us pull your share of the load because you want to play civilian patty finger games. That's my opinion, of course. Some will agree and some will disagree. But if I were a recruiter, I wouldn't touch anyone like her with a ten foot pole. She just wants free medical, free college, and the military to pay her to be completely useless to their country. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "", 
        "reply": "Tough questions! Don's advice is likely best, as we have several recruiters and, perhaps even better, families that can help you through personal experience. In my day (1989-1993), the Army did its very best to keep pre-service married personnel together. There was no guarantee, though - especially when the MOS's were different. That is, if he is Infantry and she is a lawyer, getting them assigned to the same location would be very difficult. If they're both mechanics, then the assignment is easy enough. The problem is that units tend to frown on that type of thing, as husband/wife teams working and then living together every day typically have issues. And what if one is promoted faster than the other? There are just so many variables... As to the pregnancy thing? I can't say how the military would handle that. Instead, I pose a question: As a soldier, I question the motivation. Signing the contract to serve your nation is a very admirable thing to do. But it means duty before family at all costs. What would she bring to the military besides a financial burden? We don't need moms. We need soldiers. How can they both be deployable? If the unit moves out, who will take care of the baby? This is why women are not allowed to serve in Combat Arms. They are too unpredictable in their desires. I can't use a pregnant woman in my squad in any way. If you want to get preggers, do the REAL soldiers a favor and stay a civilian. We count on you to be ready for duty at all times. Moms are civilians, not soldiers. Soldiers serve their country - they may have a family, but they serve God, country and family - in that order. It's not fair to put a child through that. And it is not fair to make the rest of us pull your share of the load because you want to play civilian patty finger games. That's my opinion, of course. Some will agree and some will disagree. But if I were a recruiter, I wouldn't touch anyone like her with a ten foot pole. She just wants free medical, free college, and the military to pay her to be completely useless to their country. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 06:09:00", 
        "title": "Parent in need of answers", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Guess you feel strongly about that. And I agree. My concern is that my son's girlfriend englisted before they met. She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. He will be 18 soon and I want to hand him the facts so he knows what he is getting himself into.", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "", 
        "reply": "Guess you feel strongly about that. And I agree. My concern is that my son's girlfriend englisted before they met. She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. He will be 18 soon and I want to hand him the facts so he knows what he is getting himself into.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 06:18:00", 
        "title": "Parent in need of answers", 
        "userID": "lkohr"
    }, 
    {
        "content": "quote: Originally posted by lkohr: 1. If a young married couple join together will they be guaranteed to be assigned to the same base after boot camp? 2. If a female has enlisted but is not set to leave for several months - if she becomes pregnant will this null her enlist commitment or would it just be deferred to a later time? 1 Depends if they both have a station of choice option, besides that, no, definately not guarenteed. 2. Difficult question, though, I'm picturing a woman 6 months pregnant waddling through an obstacle course. Keep it simple, keep taking the pill.", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "Originally posted by lkohr: 1. If a young married couple join together will they be guaranteed to be assigned to the same base after boot camp? 2. If a female has enlisted but is not set to leave for several months - if she becomes pregnant will this null her enlist commitment or would it just be deferred to a later time?", 
        "reply": " 1 Depends if they both have a station of choice option, besides that, no, definately not guarenteed. 2. Difficult question, though, I'm picturing a woman 6 months pregnant waddling through an obstacle course. Keep it simple, keep taking the pill.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 06:19:00", 
        "title": "Parent in need of answers", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by lkohr: She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. Might I suggest getting a set of Chest Waders for your son's birthday? Beats the heck out of a simple condom. Don", 
        "intTime": 20090313, 
        "postID": 6, 
        "quote": "Originally posted by lkohr: She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go.", 
        "reply": " Might I suggest getting a set of Chest Waders for your son's birthday? Beats the heck out of a simple condom. Don", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 06:30:00", 
        "title": "Parent in need of answers", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by lkohr: Guess you feel strongly about that. And I agree. My concern is that my son's girlfriend englisted before they met. She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. He will be 18 soon and I want to hand him the facts so he knows what he is getting himself into. If she has already signed on the line then she can be dishonorably discharged for refusing to fulfill her obligation. (it would be exceedingly hard for her to get employment after that) besides, if he's being a good boy and wearing a love glove there shouldn't be an easy way for her to trap him.", 
        "intTime": 20090313, 
        "postID": 7, 
        "quote": "Originally posted by lkohr: Guess you feel strongly about that. And I agree. My concern is that my son's girlfriend englisted before they met. She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. He will be 18 soon and I want to hand him the facts so he knows what he is getting himself into.", 
        "reply": " If she has already signed on the line then she can be dishonorably discharged for refusing to fulfill her obligation. (it would be exceedingly hard for her to get employment after that) besides, if he's being a good boy and wearing a love glove there shouldn't be an easy way for her to trap him.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 06:49:00", 
        "title": "Parent in need of answers", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by lkohr: Guess you feel strongly about that. And I agree. My concern is that my son's girlfriend englisted before they met. She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. He will be 18 soon and I want to hand him the facts so he knows what he is getting himself into. Yes, ma'am (sir? No profile so I don't know), I am very passionate about the issue. And please understand that all I have said and will say is in no way a slant against your son or his girlfriend. I am speaking to you as a soldier AND as a parent. I know for a fact that you don't accept this situation lightly, and I do not intend to formulate my replies lightly out of respect for you: less than full disclosure of my truths would be insulting. 18 is the very definition of a frail age. An adult by many legal standards, but not an adult. But here are the facts: Trap him or not - if she signs the line, she promises 8 years of her life to this nation. Once you sign the contract, there is no thinking twice. You belong to the military. You are property. You lose your rights as a citizen, such as free speech. And if anything comes between you and that contract, you are FOREVER labeled a failure. Your DD form 214 will be the number ONE factor when an employer reviews your history. Anything other than honorable will tell anyone that you are... other than honorable. I don't know the story. It is not mine to judge, at any rate. But, ma'am (sir)? Even now, some 16 years after I left active service, when your son was the entirety of two years old, I am impassioned about my service and my country. I am indisposed towards your situation. I am not apathetic, though. I would advise your young man to avoid any sexual contact with her until they have discussed her motives. This will not only affect her, it will present certain ramifications to him. You know this, or you wouldn't be here asking questions. I would suggest that you advise him sensibly. I would remind him that service to this country is about country and not self. That civilians have families outside of the military. But in the military, we ARE our family. You cover my six and I cover yours. If she wants to have a baby to forgo her duty, all she has to do is tell the recruiter that and avoid the repercussions of a bad discharge. My humble thoughts. I will pray over the situation for you -- with you, if that is your wish. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090313, 
        "postID": 8, 
        "quote": "Originally posted by lkohr: Guess you feel strongly about that. And I agree. My concern is that my son's girlfriend englisted before they met. She is scheduled to leave in Jan. I think she is trying to trap him and get pregnant so she doesn't have to go. He will be 18 soon and I want to hand him the facts so he knows what he is getting himself into.", 
        "reply": " Yes, ma'am (sir? No profile so I don't know), I am very passionate about the issue. And please understand that all I have said and will say is in no way a slant against your son or his girlfriend. I am speaking to you as a soldier AND as a parent. I know for a fact that you don't accept this situation lightly, and I do not intend to formulate my replies lightly out of respect for you: less than full disclosure of my truths would be insulting. 18 is the very definition of a frail age. An adult by many legal standards, but not an adult. But here are the facts: Trap him or not - if she signs the line, she promises 8 years of her life to this nation. Once you sign the contract, there is no thinking twice. You belong to the military. You are property. You lose your rights as a citizen, such as free speech. And if anything comes between you and that contract, you are FOREVER labeled a failure. Your DD form 214 will be the number ONE factor when an employer reviews your history. Anything other than honorable will tell anyone that you are... other than honorable. I don't know the story. It is not mine to judge, at any rate. But, ma'am (sir)? Even now, some 16 years after I left active service, when your son was the entirety of two years old, I am impassioned about my service and my country. I am indisposed towards your situation. I am not apathetic, though. I would advise your young man to avoid any sexual contact with her until they have discussed her motives. This will not only affect her, it will present certain ramifications to him. You know this, or you wouldn't be here asking questions. I would suggest that you advise him sensibly. I would remind him that service to this country is about country and not self. That civilians have families outside of the military. But in the military, we ARE our family. You cover my six and I cover yours. If she wants to have a baby to forgo her duty, all she has to do is tell the recruiter that and avoid the repercussions of a bad discharge. My humble thoughts. I will pray over the situation for you -- with you, if that is your wish. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 07:09:00", 
        "title": "Parent in need of answers", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Prayer are always welcome. Thanks for your honest. I'm the mom - please pray for Andrew. Thanks.", 
        "intTime": 20090313, 
        "postID": 9, 
        "quote": "", 
        "reply": "Prayer are always welcome. Thanks for your honest. I'm the mom - please pray for Andrew. Thanks.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 08:05:00", 
        "title": "Parent in need of answers", 
        "userID": "lkohr"
    }, 
    {
        "content": "Prayers going out for Andrew! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090313, 
        "postID": 10, 
        "quote": "", 
        "reply": "Prayers going out for Andrew! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 08:51:00", 
        "title": "Parent in need of answers", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Prayers for everyone !!", 
        "intTime": 20090313, 
        "postID": 11, 
        "quote": "", 
        "reply": "Prayers for everyone !!", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 11:47:00", 
        "title": "Parent in need of answers", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "First, unless the rules have changed, the services will work to see if both could be stationed in the same geographic area. However, needs of the service come first, last, and always. Second, you would need to talk to a recruiter on the pregnancy issue. As far as I know it would be grounds for her being denied entry, but again ... Third, the girl may not want anything more from your son than a baby - however she (if she is smart) can after birth go to court and get child support set up. That will follow him until the child turns 18 or graduates high school, whichever is later (depending on the state). Right now it's unclear from your post if your son is considering enlistment or not. If so, then he needs to do some serious thinking. Unfortunately, at the age you mention, kids in many cases could care less about what a parent or any other adult has to say on any issue. Good luck. I got a feeling you're going to need it.", 
        "intTime": 20090313, 
        "postID": 12, 
        "quote": "", 
        "reply": "First, unless the rules have changed, the services will work to see if both could be stationed in the same geographic area. However, needs of the service come first, last, and always. Second, you would need to talk to a recruiter on the pregnancy issue. As far as I know it would be grounds for her being denied entry, but again ... Third, the girl may not want anything more from your son than a baby - however she (if she is smart) can after birth go to court and get child support set up. That will follow him until the child turns 18 or graduates high school, whichever is later (depending on the state). Right now it's unclear from your post if your son is considering enlistment or not. If so, then he needs to do some serious thinking. Unfortunately, at the age you mention, kids in many cases could care less about what a parent or any other adult has to say on any issue. Good luck. I got a feeling you're going to need it.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 13:11:00", 
        "title": "Parent in need of answers", 
        "userID": "Boats22151"
    }, 
    {
        "content": "I only pray like 3 times a year. I'm not wasting one on anyone. If the boy was smart, he'ld drop her like yesterdays newspaper!", 
        "intTime": 20090313, 
        "postID": 13, 
        "quote": "", 
        "reply": "I only pray like 3 times a year. I'm not wasting one on anyone. If the boy was smart, he'ld drop her like yesterdays newspaper!", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 13:32:00", 
        "title": "Parent in need of answers", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: If she has already signed on the line then she can be dishonorably discharged for refusing to fulfill her obligation. I disagree with that assessment. Sounds like she's in the DEP, in which case she can just be a no-show and there's no real consequences to that at all except possible bar to future enlistments. Anyone can refuse to show up, and other than royally ****ing off a recruiter not much else happens. An important point here is that if she's in the DEP and doesn't want to go, having a baby is a stupid way to go about getting out of the commitment, since she can just decide not to go without the whole pregnancy thing. If she shows up to basic pregnant, they won't let her train. I knew one woman whose urine test showed her as pregnant. She was assigned office duty but she couldn't do any training, and couldn't graduate basic. The kicker for her was that she wasn't pregnant - she'd been at Ft. Dix for a few months, clearly wasn't getting any larger, but her hormones were out of whack so the test kept showing positive. But all the same, as long as that test was there, they weren't taking any chances. If she and your son both sign up, but she shows up pregnant, they definitely won't be assigned to the same post since he'll be at his post while she's still unable to complete basic training. She won't get assigned anywhere during her wait. Hope that makes sense, not sure I'm phrasing it right. Women who are already in and trained and then get pregnant can request a separation, which would either be an honorable discharge or reassignment to the IRR. They'll lose their benefits if they don't do their minimum active service, but it's not a dishonorable discharge.", 
        "intTime": 20090313, 
        "postID": 14, 
        "quote": "Originally posted by armywifefigueroa: If she has already signed on the line then she can be dishonorably discharged for refusing to fulfill her obligation.", 
        "reply": " I disagree with that assessment. Sounds like she's in the DEP, in which case she can just be a no-show and there's no real consequences to that at all except possible bar to future enlistments. Anyone can refuse to show up, and other than royally ****ing off a recruiter not much else happens. An important point here is that if she's in the DEP and doesn't want to go, having a baby is a stupid way to go about getting out of the commitment, since she can just decide not to go without the whole pregnancy thing. If she shows up to basic pregnant, they won't let her train. I knew one woman whose urine test showed her as pregnant. She was assigned office duty but she couldn't do any training, and couldn't graduate basic. The kicker for her was that she wasn't pregnant - she'd been at Ft. Dix for a few months, clearly wasn't getting any larger, but her hormones were out of whack so the test kept showing positive. But all the same, as long as that test was there, they weren't taking any chances. If she and your son both sign up, but she shows up pregnant, they definitely won't be assigned to the same post since he'll be at his post while she's still unable to complete basic training. She won't get assigned anywhere during her wait. Hope that makes sense, not sure I'm phrasing it right. Women who are already in and trained and then get pregnant can request a separation, which would either be an honorable discharge or reassignment to the IRR. They'll lose their benefits if they don't do their minimum active service, but it's not a dishonorable discharge.", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 14:57:00", 
        "title": "Parent in need of answers", 
        "userID": "jake98c"
    }, 
    {
        "content": "quote: Originally posted by lkohr: Prayer are always welcome. Thanks for your honest. I'm the mom - please pray for Andrew. Thanks. I concur with follow me infantry above. I also add. 18 is way too young to get married and have to settle down with a child especially in the military. It is very difficult to try and make the low salary cover basic needs. Even though they will receive money for an apartment the apartment will not be very nice around a military base (the more rank he achieves the more money they will get for housing.)Babies need things, the will need transportation, furniture and the list goes on and on until they are very deep in debt. If she has to go ahead and becaome a member of the military, who will watch the baby when they are on duty? Maybe they will both be out on field duty at the same time, where will the baby be? What if one has to go overseas? So many questions unanswered. Talk with your son and have him read these post from Former military members that have been there and done that. It is not easy. Best of luck to your son...", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "Originally posted by lkohr: Prayer are always welcome. Thanks for your honest. I'm the mom - please pray for Andrew. Thanks.", 
        "reply": " I concur with follow me infantry above. I also add. 18 is way too young to get married and have to settle down with a child especially in the military. It is very difficult to try and make the low salary cover basic needs. Even though they will receive money for an apartment the apartment will not be very nice around a military base (the more rank he achieves the more money they will get for housing.)Babies need things, the will need transportation, furniture and the list goes on and on until they are very deep in debt. If she has to go ahead and becaome a member of the military, who will watch the baby when they are on duty? Maybe they will both be out on field duty at the same time, where will the baby be? What if one has to go overseas? So many questions unanswered. Talk with your son and have him read these post from Former military members that have been there and done that. It is not easy. Best of luck to your son...", 
        "threadID": "5291911282_7780027712001", 
        "time": "2009-03-13 16:47:00", 
        "title": "Parent in need of answers", 
        "userID": "Vanir97"
    }
]