[
    {
        "content": "every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "intTime": 20090426, 
        "postID": 1, 
        "quote": "", 
        "reply": "every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:14:00", 
        "title": "This is a serious question!", 
        "userID": "vansslim"
    }, 
    {
        "content": "Try \"Nair\" and avoid the hassle (of us).... Ain't you got a close relative (dad) you ought to be asking these questions of? Wandering and Wondering", 
        "intTime": 20090426, 
        "postID": 2, 
        "quote": "", 
        "reply": "Try \"Nair\" and avoid the hassle (of us).... Ain't you got a close relative (dad) you ought to be asking these questions of? Wandering and Wondering", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:25:00", 
        "title": "This is a serious question!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol lookit dude, when I went into the Army we were susposed to shave everyday too........ I didn't grow much hair back then (still don't) and I only shaved every other or third day... DS could't tell.... use your smarts pal. Ask your dad, like GW said or ask the local pharmacist, I am sure he will recommend something. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090426, 
        "postID": 3, 
        "quote": "Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "reply": " lookit dude, when I went into the Army we were susposed to shave everyday too........ I didn't grow much hair back then (still don't) and I only shaved every other or third day... DS could't tell.... use your smarts pal. Ask your dad, like GW said or ask the local pharmacist, I am sure he will recommend something. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:36:00", 
        "title": "This is a serious question!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Ask your Pastor etc.. if Your Dad or one of your Uncles don't know. Puberty, Fun ain't it! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 4, 
        "quote": "", 
        "reply": "Ask your Pastor etc.. if Your Dad or one of your Uncles don't know. Puberty, Fun ain't it! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:43:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "My dad isnt around and it would be alittle awkward asking someone in person", 
        "intTime": 20090426, 
        "postID": 5, 
        "quote": "", 
        "reply": "My dad isnt around and it would be alittle awkward asking someone in person", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:44:00", 
        "title": "This is a serious question!", 
        "userID": "vansslim"
    }, 
    {
        "content": "quote: Originally posted by vansslim: My dad isnt around and it would be alittle awkward asking someone in person I don't see why. You come in here with a big eight posts and want us to comment on your grooming. Why not get to know us a bit and let us get to know you? Remember behind each of our screen names is a person. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "Originally posted by vansslim: My dad isnt around and it would be alittle awkward asking someone in person", 
        "reply": " I don't see why. You come in here with a big eight posts and want us to comment on your grooming. Why not get to know us a bit and let us get to know you? Remember behind each of our screen names is a person. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:55:00", 
        "title": "This is a serious question!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "You are required to shave, if you don't have a waiver. BUT it has never been stated that it has to be with a blade. Have you tried an electric razor? How about the shaving powders that use a plastic \"blade\" to scrape it off? (it acts like nair). Both of these are viable options. If you still get frequent in-grown hairs from shaving (folliculitis), you can go to sick call and see about getting a shaving profile. Then you would be required to keep any beard to a minimum lenght, typically 1/8-1/4 inch.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "", 
        "reply": "You are required to shave, if you don't have a waiver. BUT it has never been stated that it has to be with a blade. Have you tried an electric razor? How about the shaving powders that use a plastic \"blade\" to scrape it off? (it acts like nair). Both of these are viable options. If you still get frequent in-grown hairs from shaving (folliculitis), you can go to sick call and see about getting a shaving profile. Then you would be required to keep any beard to a minimum lenght, typically 1/8-1/4 inch.", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:56:00", 
        "title": "This is a serious question!", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: i was reading on here and this one guy said he just shaved with out cream, how? lol Remember that when You fall out for formation needen a shave. You'll learn real quick http://forums.military.com/eve/forums/a/cfrm/f/6801982206 Click on the link and ask around. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "reply": " Remember that when You fall out for formation needen a shave. You'll learn real quick http://forums.military.com/eve/forums/a/cfrm/f/6801982206 Click on the link and ask around. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:57:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Puberty, Fun ain't it! I went through it so long ago I don't think it had a name yet. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "Puberty, Fun ain't it!", 
        "reply": " I went through it so long ago I don't think it had a name yet. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:57:00", 
        "title": "This is a serious question!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "", 
        "reply": "This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:02:00", 
        "title": "This is a serious question!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... hey, the kid discovered some pubic hair and he is impressed...... what he does not know is the infamous weekly \"bendem-n-speardem\" inspection..... and he has to shave that too One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090426, 
        "postID": 11, 
        "quote": "Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "reply": " hey, the kid discovered some pubic hair and he is impressed...... what he does not know is the infamous weekly \"bendem-n-speardem\" inspection..... and he has to shave that too One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:11:00", 
        "title": "This is a serious question!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Puberty, Fun ain't it! I went through it so long ago I don't think it had a name yet. I don't remember it either, I found out raising 2 Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 12, 
        "quote": "Originally posted by Vicdude: quote: Puberty, Fun ain't it! I went through it so long ago I don't think it had a name yet.", 
        "reply": " I don't remember it either, I found out raising 2 Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:17:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 13, 
        "quote": "Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "reply": " Saw that Hoffy, Needs attention eh? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:20:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run...", 
        "intTime": 20090426, 
        "postID": 14, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh?", 
        "reply": " Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run...", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:39:00", 
        "title": "This is a serious question!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol Look Bud, everyone on here was young once and everyone gave them a hard time so don't take it personal. If you have an electric razor then get some \"Williams Lectric shave\". It makes the hair stand up more and makes it easier to shave with an electric razor. If I had to shave with a safety razor I would sometimes use regular bar soap. Make a lather in your hand and then smear it on your face. Make certain that you rinse your face after shaving. Almost any canned lather works okay, if it has lanolin it will help shaving a little bit. Also go to the drug store and get a styptic pencil. The styptic pencil will stop the bleeding fast when you nick yourself while shaving .As for the bumps, well I never had that problem. If they bother you or get infected than go on sick call and the Doctor can give you something for it. As for the multi bladed safety razors, I wouldn't even fool with them. They are okay if you have a heavy beard because they help shave closer, but for a light beard forget it, just a waste of money. Okay? Give all of this a try now and let me know how it turns out.", 
        "intTime": 20090426, 
        "postID": 15, 
        "quote": "Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "reply": " Look Bud, everyone on here was young once and everyone gave them a hard time so don't take it personal. If you have an electric razor then get some \"Williams Lectric shave\". It makes the hair stand up more and makes it easier to shave with an electric razor. If I had to shave with a safety razor I would sometimes use regular bar soap. Make a lather in your hand and then smear it on your face. Make certain that you rinse your face after shaving. Almost any canned lather works okay, if it has lanolin it will help shaving a little bit. Also go to the drug store and get a styptic pencil. The styptic pencil will stop the bleeding fast when you nick yourself while shaving .As for the bumps, well I never had that problem. If they bother you or get infected than go on sick call and the Doctor can give you something for it. As for the multi bladed safety razors, I wouldn't even fool with them. They are okay if you have a heavy beard because they help shave closer, but for a light beard forget it, just a waste of money. Okay? Give all of this a try now and let me know how it turns out.", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:59:00", 
        "title": "This is a serious question!", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run... And Many a Boot left thier ID Cards in the foot locker. Those were interesting times Back then. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 16, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run...", 
        "reply": " And Many a Boot left thier ID Cards in the foot locker. Those were interesting times Back then. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 16:11:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Members of some races can't use razor, they get razor bumps. They use a product simliar to Nair, but it's made to be used on the face! Go to any store that has shaving products, they should have shaving needs for men who can't use a razor ie, razor bumps. You can Google it, google has a wealth of information! Good luck! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090426, 
        "postID": 17, 
        "quote": "", 
        "reply": "Members of some races can't use razor, they get razor bumps. They use a product simliar to Nair, but it's made to be used on the face! Go to any store that has shaving products, they should have shaving needs for men who can't use a razor ie, razor bumps. You can Google it, google has a wealth of information! Good luck! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 16:12:00", 
        "title": "This is a serious question!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I can't believe this! NOBODY remembers what you were taught in basic about how to avoid razor burn? It's simple. Rinse your razor in cold water. That's worked for me now for nearly 40 years.", 
        "intTime": 20090426, 
        "postID": 18, 
        "quote": "", 
        "reply": "I can't believe this! NOBODY remembers what you were taught in basic about how to avoid razor burn? It's simple. Rinse your razor in cold water. That's worked for me now for nearly 40 years.", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 18:13:00", 
        "title": "This is a serious question!", 
        "userID": "stillkit"
    }, 
    {
        "content": "Wash and dry your face good after each shave helps too... And after-shave maybe to kill bacteria, not to smell good. Nothing a DS enjoys more than a week one trainee that fall out of the barracks smelling like a French W-hore House!! \"Is your name Daisy!? Cuz you SMELL like a daisy!! From now on - You are Daisy Slick Sleeve! Right, TRAINEE!!?? I can't HEAR YOU!! SPEAK UP LIKE YOU GOT A PAIR!! LOUDER!!!!!!\" Yep, on second thought - use LOTS of after shave!! Wandering and Wondering", 
        "intTime": 20090426, 
        "postID": 19, 
        "quote": "", 
        "reply": "Wash and dry your face good after each shave helps too... And after-shave maybe to kill bacteria, not to smell good. Nothing a DS enjoys more than a week one trainee that fall out of the barracks smelling like a French W-hore House!! \"Is your name Daisy!? Cuz you SMELL like a daisy!! From now on - You are Daisy Slick Sleeve! Right, TRAINEE!!?? I can't HEAR YOU!! SPEAK UP LIKE YOU GOT A PAIR!! LOUDER!!!!!!\" Yep, on second thought - use LOTS of after shave!! Wandering and Wondering", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 18:52:00", 
        "title": "This is a serious question!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The D.I's are gonna have some fun with this one Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090426, 
        "postID": 20, 
        "quote": "", 
        "reply": "The D.I's are gonna have some fun with this one Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 18:55:00", 
        "title": "This is a serious question!", 
        "userID": "DSTremf"
    }, 
    {
        "content": "every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "intTime": 20090426, 
        "postID": 21, 
        "quote": "", 
        "reply": "every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:14:00", 
        "title": "This is a serious question!", 
        "userID": "vansslim"
    }, 
    {
        "content": "Try \"Nair\" and avoid the hassle (of us).... Ain't you got a close relative (dad) you ought to be asking these questions of? Wandering and Wondering", 
        "intTime": 20090426, 
        "postID": 22, 
        "quote": "", 
        "reply": "Try \"Nair\" and avoid the hassle (of us).... Ain't you got a close relative (dad) you ought to be asking these questions of? Wandering and Wondering", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:25:00", 
        "title": "This is a serious question!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol lookit dude, when I went into the Army we were susposed to shave everyday too........ I didn't grow much hair back then (still don't) and I only shaved every other or third day... DS could't tell.... use your smarts pal. Ask your dad, like GW said or ask the local pharmacist, I am sure he will recommend something. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090426, 
        "postID": 23, 
        "quote": "Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "reply": " lookit dude, when I went into the Army we were susposed to shave everyday too........ I didn't grow much hair back then (still don't) and I only shaved every other or third day... DS could't tell.... use your smarts pal. Ask your dad, like GW said or ask the local pharmacist, I am sure he will recommend something. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:36:00", 
        "title": "This is a serious question!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Ask your Pastor etc.. if Your Dad or one of your Uncles don't know. Puberty, Fun ain't it! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 24, 
        "quote": "", 
        "reply": "Ask your Pastor etc.. if Your Dad or one of your Uncles don't know. Puberty, Fun ain't it! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:43:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "My dad isnt around and it would be alittle awkward asking someone in person", 
        "intTime": 20090426, 
        "postID": 25, 
        "quote": "", 
        "reply": "My dad isnt around and it would be alittle awkward asking someone in person", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:44:00", 
        "title": "This is a serious question!", 
        "userID": "vansslim"
    }, 
    {
        "content": "quote: Originally posted by vansslim: My dad isnt around and it would be alittle awkward asking someone in person I don't see why. You come in here with a big eight posts and want us to comment on your grooming. Why not get to know us a bit and let us get to know you? Remember behind each of our screen names is a person. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090426, 
        "postID": 26, 
        "quote": "Originally posted by vansslim: My dad isnt around and it would be alittle awkward asking someone in person", 
        "reply": " I don't see why. You come in here with a big eight posts and want us to comment on your grooming. Why not get to know us a bit and let us get to know you? Remember behind each of our screen names is a person. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:55:00", 
        "title": "This is a serious question!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "You are required to shave, if you don't have a waiver. BUT it has never been stated that it has to be with a blade. Have you tried an electric razor? How about the shaving powders that use a plastic \"blade\" to scrape it off? (it acts like nair). Both of these are viable options. If you still get frequent in-grown hairs from shaving (folliculitis), you can go to sick call and see about getting a shaving profile. Then you would be required to keep any beard to a minimum lenght, typically 1/8-1/4 inch.", 
        "intTime": 20090426, 
        "postID": 27, 
        "quote": "", 
        "reply": "You are required to shave, if you don't have a waiver. BUT it has never been stated that it has to be with a blade. Have you tried an electric razor? How about the shaving powders that use a plastic \"blade\" to scrape it off? (it acts like nair). Both of these are viable options. If you still get frequent in-grown hairs from shaving (folliculitis), you can go to sick call and see about getting a shaving profile. Then you would be required to keep any beard to a minimum lenght, typically 1/8-1/4 inch.", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:56:00", 
        "title": "This is a serious question!", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "quote: i was reading on here and this one guy said he just shaved with out cream, how? lol Remember that when You fall out for formation needen a shave. You'll learn real quick http://forums.military.com/eve/forums/a/cfrm/f/6801982206 Click on the link and ask around. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 28, 
        "quote": "i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "reply": " Remember that when You fall out for formation needen a shave. You'll learn real quick http://forums.military.com/eve/forums/a/cfrm/f/6801982206 Click on the link and ask around. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:57:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Puberty, Fun ain't it! I went through it so long ago I don't think it had a name yet. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090426, 
        "postID": 29, 
        "quote": "Puberty, Fun ain't it!", 
        "reply": " I went through it so long ago I don't think it had a name yet. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 14:57:00", 
        "title": "This is a serious question!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "intTime": 20090426, 
        "postID": 30, 
        "quote": "", 
        "reply": "This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:02:00", 
        "title": "This is a serious question!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... hey, the kid discovered some pubic hair and he is impressed...... what he does not know is the infamous weekly \"bendem-n-speardem\" inspection..... and he has to shave that too One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090426, 
        "postID": 31, 
        "quote": "Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "reply": " hey, the kid discovered some pubic hair and he is impressed...... what he does not know is the infamous weekly \"bendem-n-speardem\" inspection..... and he has to shave that too One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:11:00", 
        "title": "This is a serious question!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Puberty, Fun ain't it! I went through it so long ago I don't think it had a name yet. I don't remember it either, I found out raising 2 Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 32, 
        "quote": "Originally posted by Vicdude: quote: Puberty, Fun ain't it! I went through it so long ago I don't think it had a name yet.", 
        "reply": " I don't remember it either, I found out raising 2 Son's. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:17:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 33, 
        "quote": "Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies...", 
        "reply": " Saw that Hoffy, Needs attention eh? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:20:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run...", 
        "intTime": 20090426, 
        "postID": 34, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh?", 
        "reply": " Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run...", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:39:00", 
        "title": "This is a serious question!", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "quote: Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol Look Bud, everyone on here was young once and everyone gave them a hard time so don't take it personal. If you have an electric razor then get some \"Williams Lectric shave\". It makes the hair stand up more and makes it easier to shave with an electric razor. If I had to shave with a safety razor I would sometimes use regular bar soap. Make a lather in your hand and then smear it on your face. Make certain that you rinse your face after shaving. Almost any canned lather works okay, if it has lanolin it will help shaving a little bit. Also go to the drug store and get a styptic pencil. The styptic pencil will stop the bleeding fast when you nick yourself while shaving .As for the bumps, well I never had that problem. If they bother you or get infected than go on sick call and the Doctor can give you something for it. As for the multi bladed safety razors, I wouldn't even fool with them. They are okay if you have a heavy beard because they help shave closer, but for a light beard forget it, just a waste of money. Okay? Give all of this a try now and let me know how it turns out.", 
        "intTime": 20090426, 
        "postID": 35, 
        "quote": "Originally posted by vansslim: every since i've started shaving i would get razor bumps. Sometimes not as much, but i always do. I've heard that the military makes you shave every day or at least where theres no hair. my question is if i had to shave and couldnt get a waiver, what would be the best razor and cream to buy, and the techniques from getting bumps. i have a fusion but its only good for nothin, i saw this 6 blade razor by sainsbury which doesnt have that padding like a girls razor usually does. and another thing, i was reading on here and this one guy said he just shaved with out cream, how? lol", 
        "reply": " Look Bud, everyone on here was young once and everyone gave them a hard time so don't take it personal. If you have an electric razor then get some \"Williams Lectric shave\". It makes the hair stand up more and makes it easier to shave with an electric razor. If I had to shave with a safety razor I would sometimes use regular bar soap. Make a lather in your hand and then smear it on your face. Make certain that you rinse your face after shaving. Almost any canned lather works okay, if it has lanolin it will help shaving a little bit. Also go to the drug store and get a styptic pencil. The styptic pencil will stop the bleeding fast when you nick yourself while shaving .As for the bumps, well I never had that problem. If they bother you or get infected than go on sick call and the Doctor can give you something for it. As for the multi bladed safety razors, I wouldn't even fool with them. They are okay if you have a heavy beard because they help shave closer, but for a light beard forget it, just a waste of money. Okay? Give all of this a try now and let me know how it turns out.", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 15:59:00", 
        "title": "This is a serious question!", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by Hoffy1951: quote: Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run... And Many a Boot left thier ID Cards in the foot locker. Those were interesting times Back then. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090426, 
        "postID": 36, 
        "quote": "Originally posted by Hoffy1951: quote: Originally posted by mikeyR8: quote: Originally posted by Hoffy1951: This is the such SECOND topic you have started on the very same forum... Title: \"SHAVING\"...35 replies... Saw that Hoffy, Needs attention eh? Naw...let skippy dig his own hole and refill it until we get tired... Just make sure that when 'skippy' stands the next inspection, he damn better well be using a blade this time... I remember the \"ID Card\" check...taking the ID Card and running the edge upwards on the jaw... Many a 'boot' needed a 2d or 3d run...", 
        "reply": " And Many a Boot left thier ID Cards in the foot locker. Those were interesting times Back then. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 16:11:00", 
        "title": "This is a serious question!", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Members of some races can't use razor, they get razor bumps. They use a product simliar to Nair, but it's made to be used on the face! Go to any store that has shaving products, they should have shaving needs for men who can't use a razor ie, razor bumps. You can Google it, google has a wealth of information! Good luck! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090426, 
        "postID": 37, 
        "quote": "", 
        "reply": "Members of some races can't use razor, they get razor bumps. They use a product simliar to Nair, but it's made to be used on the face! Go to any store that has shaving products, they should have shaving needs for men who can't use a razor ie, razor bumps. You can Google it, google has a wealth of information! Good luck! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 16:12:00", 
        "title": "This is a serious question!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I can't believe this! NOBODY remembers what you were taught in basic about how to avoid razor burn? It's simple. Rinse your razor in cold water. That's worked for me now for nearly 40 years.", 
        "intTime": 20090426, 
        "postID": 38, 
        "quote": "", 
        "reply": "I can't believe this! NOBODY remembers what you were taught in basic about how to avoid razor burn? It's simple. Rinse your razor in cold water. That's worked for me now for nearly 40 years.", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 18:13:00", 
        "title": "This is a serious question!", 
        "userID": "stillkit"
    }, 
    {
        "content": "Wash and dry your face good after each shave helps too... And after-shave maybe to kill bacteria, not to smell good. Nothing a DS enjoys more than a week one trainee that fall out of the barracks smelling like a French W-hore House!! \"Is your name Daisy!? Cuz you SMELL like a daisy!! From now on - You are Daisy Slick Sleeve! Right, TRAINEE!!?? I can't HEAR YOU!! SPEAK UP LIKE YOU GOT A PAIR!! LOUDER!!!!!!\" Yep, on second thought - use LOTS of after shave!! Wandering and Wondering", 
        "intTime": 20090426, 
        "postID": 39, 
        "quote": "", 
        "reply": "Wash and dry your face good after each shave helps too... And after-shave maybe to kill bacteria, not to smell good. Nothing a DS enjoys more than a week one trainee that fall out of the barracks smelling like a French W-hore House!! \"Is your name Daisy!? Cuz you SMELL like a daisy!! From now on - You are Daisy Slick Sleeve! Right, TRAINEE!!?? I can't HEAR YOU!! SPEAK UP LIKE YOU GOT A PAIR!! LOUDER!!!!!!\" Yep, on second thought - use LOTS of after shave!! Wandering and Wondering", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 18:52:00", 
        "title": "This is a serious question!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The D.I's are gonna have some fun with this one Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090426, 
        "postID": 40, 
        "quote": "", 
        "reply": "The D.I's are gonna have some fun with this one Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_4550038122001", 
        "time": "2009-04-26 18:55:00", 
        "title": "This is a serious question!", 
        "userID": "DSTremf"
    }
]