[
    {
        "content": "MY HUSBAND WAS SUPPOSE TO JOIN THE USMC ABOUT 6 YEARS AGO... HE HAD HIS DATE TO SHIP OUT TO BOOT CAMP. BUT SINCE I DID NOT WANT HIM TO GO BE DID NOT AND BACKED OUT. NOW PRESENTLY HE WANTS TO GO AND THE RECRUITER IS LOOKING TO SEE WHY THEY ARE SHOWING HIM AT DISQUALIFIED. SO WAITING ON THAT CALL. DOES ANYONE KNOW WHY THIS WOULD BE. THIS IS HIS DREAM WHY WOULD THEY NOT LET HIM NOW", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "", 
        "reply": "MY HUSBAND WAS SUPPOSE TO JOIN THE USMC ABOUT 6 YEARS AGO... HE HAD HIS DATE TO SHIP OUT TO BOOT CAMP. BUT SINCE I DID NOT WANT HIM TO GO BE DID NOT AND BACKED OUT. NOW PRESENTLY HE WANTS TO GO AND THE RECRUITER IS LOOKING TO SEE WHY THEY ARE SHOWING HIM AT DISQUALIFIED. SO WAITING ON THAT CALL. DOES ANYONE KNOW WHY THIS WOULD BE. THIS IS HIS DREAM WHY WOULD THEY NOT LET HIM NOW", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 08:47:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "cllopez310"
    }, 
    {
        "content": "So why did you kill his dream 6 years ago? We're not mind readers. We don't know you, him, or what happened back then or now. Lay off the caps, it somehow makes people aggressive.", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "So why did you kill his dream 6 years ago? We're not mind readers. We don't know you, him, or what happened back then or now. Lay off the caps, it somehow makes people aggressive.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 09:00:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "azmax64"
    }, 
    {
        "content": "more details please... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "", 
        "reply": "more details please... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 09:03:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "You didn't WANT him to go, but it was his dream, so he didn't go... Doesn't add up sister... and besides, you can't just \"back out\" of a signed contract with the Military...if he had his date to ship out and such, is he sure they didn't black list him as a deserter?", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "", 
        "reply": "You didn't WANT him to go, but it was his dream, so he didn't go... Doesn't add up sister... and besides, you can't just \"back out\" of a signed contract with the Military...if he had his date to ship out and such, is he sure they didn't black list him as a deserter?", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 09:37:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Not sure yet waiting to hear back... It was his dream but I begged and pleaded for him not to go for me and our daughter. It doesn't add up but its true. He has regretted backing out since that day. Oh and he reminds me everyday.", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "", 
        "reply": "Not sure yet waiting to hear back... It was his dream but I begged and pleaded for him not to go for me and our daughter. It doesn't add up but its true. He has regretted backing out since that day. Oh and he reminds me everyday.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 09:47:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "cllopez310"
    }, 
    {
        "content": "quote: Originally posted by cllopez310: MY HUSBAND WAS SUPPOSE TO JOIN THE USMC ABOUT 6 YEARS AGO... HE HAD HIS DATE TO SHIP OUT TO BOOT CAMP. BUT SINCE I DID NOT WANT HIM TO GO BE DID NOT AND BACKED OUT. NOW PRESENTLY HE WANTS TO GO AND THE RECRUITER IS LOOKING TO SEE WHY THEY ARE SHOWING HIM AT DISQUALIFIED. SO WAITING ON THAT CALL. DOES ANYONE KNOW WHY THIS WOULD BE. THIS IS HIS DREAM WHY WOULD THEY NOT LET HIM NOW", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "Originally posted by cllopez310: MY HUSBAND WAS SUPPOSE TO JOIN THE USMC ABOUT 6 YEARS AGO... HE HAD HIS DATE TO SHIP OUT TO BOOT CAMP. BUT SINCE I DID NOT WANT HIM TO GO BE DID NOT AND BACKED OUT. NOW PRESENTLY HE WANTS TO GO AND THE RECRUITER IS LOOKING TO SEE WHY THEY ARE SHOWING HIM AT DISQUALIFIED. SO WAITING ON THAT CALL. DOES ANYONE KNOW WHY THIS WOULD BE. THIS IS HIS DREAM WHY WOULD THEY NOT LET HIM NOW", 
        "reply": "", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 09:51:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "Again, a few more details are needed... I mean if this is just a case of he didn't bother to show up then he was probably listed as a deserter. And just so you know, if that is the case, they can throw him in the Brig for that. What has changed in these 6 years that you are willing to give your unending support to him and his mission and take the step of you and your family coming second? I hope the two of you understand how big of a commitment this is... especially you. A military wife has to deal with a lot of stress, and worry, and many times is alone doing it. You will not be in control of your lives any more, the USMC will be. Please do research as to how this will affect your family before he decides to go. IT IS A HUGE COMMITMENT FROM BOTH HIM AND YOU. IT IS NOT ONLY A COMMITMENT, BUT A LIFESTYLE. and you can't wait until he gets into his 6th month on tour and decide that you can't hack it... A distracted soldier (or marine) is a dead soldier....", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "", 
        "reply": "Again, a few more details are needed... I mean if this is just a case of he didn't bother to show up then he was probably listed as a deserter. And just so you know, if that is the case, they can throw him in the Brig for that. What has changed in these 6 years that you are willing to give your unending support to him and his mission and take the step of you and your family coming second? I hope the two of you understand how big of a commitment this is... especially you. A military wife has to deal with a lot of stress, and worry, and many times is alone doing it. You will not be in control of your lives any more, the USMC will be. Please do research as to how this will affect your family before he decides to go. IT IS A HUGE COMMITMENT FROM BOTH HIM AND YOU. IT IS NOT ONLY A COMMITMENT, BUT A LIFESTYLE. and you can't wait until he gets into his 6th month on tour and decide that you can't hack it... A distracted soldier (or marine) is a dead soldier....", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 09:53:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Sorry about all caps. I am at working and trying to type at the same time. LOL Change of heart is that I never really understood how much he wanted this. I mean he would talk about it but I would always just say he just wants to blow things up. But over the years he still talks about it. Regrets it and always looking at Marine videos. I just want to be supportive because he has supported me in everyway possible in the desicions I have made. I know this is going to be hard and I will have to do a lot of things on my own and be the one doing everything alone but I hope these sacrafices pay off in the future. I pray that it works out for the best. If it was meant to be it will happen if not then maybe that is why he wasn't suppose to leave the first time.", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "", 
        "reply": "Sorry about all caps. I am at working and trying to type at the same time. LOL Change of heart is that I never really understood how much he wanted this. I mean he would talk about it but I would always just say he just wants to blow things up. But over the years he still talks about it. Regrets it and always looking at Marine videos. I just want to be supportive because he has supported me in everyway possible in the desicions I have made. I know this is going to be hard and I will have to do a lot of things on my own and be the one doing everything alone but I hope these sacrafices pay off in the future. I pray that it works out for the best. If it was meant to be it will happen if not then maybe that is why he wasn't suppose to leave the first time.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 10:02:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "cllopez310"
    }, 
    {
        "content": "I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all.", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "", 
        "reply": "I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 10:07:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "cllopez310"
    }, 
    {
        "content": "quote: Originally posted by cllopez310: I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all. and if he is allowed now into the military what makes you think anything is changed....... there might be a \"flash Point\" somewhere and he gets sent in harms way - you gonna beg him not to go again........ if he wishes the combat arms that is what they do... chase bad guys and sometimes die... is what we get/got paid for. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "Originally posted by cllopez310: I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all.", 
        "reply": " and if he is allowed now into the military what makes you think anything is changed....... there might be a \"flash Point\" somewhere and he gets sent in harms way - you gonna beg him not to go again........ if he wishes the combat arms that is what they do... chase bad guys and sometimes die... is what we get/got paid for. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 10:16:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by cllopez310: I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all. There will always be that fear whether there is a war or not. Training exercises can go wrong, electrical failures on aircraft, there are any number of situations that all military personnel are put in every day that could wind up potentially fatal. You can't keep asking him not to go when you're afraid... Read this and maybe it will help you understand a little more quote: The good Lord was creating a model for military wives and was into his sixth day of overtime when an angel appeared. She said, \"Lord, you seem to be having a lot of trouble with this one. What's the matter with the standard model?\" The Lord replied, \"Have you seen the specs on this order? She has to be completely independent, posses the qualities of both father and mother, be a perfect hostess to four or forty with an hour's notice, run on black coffee, handle every emergency imaginable without a manual, be able to carry on cheerfully, ever if she's pregnant and has the flu, and she must be willing to move 10 times in 17 years. And oh, yes, she must have six pairs of hands.\" The angel shook her head. \"Six pairs of hands? No way!\" The Lord continued, \"Don't worry, we shall make other military wives to help her. And we will give her an unusually strong heart so it can swell with pride in her husband's achievements, sustain the pain of separations, beat soundly when it's over-worked and tired, and be large enough to say 'I understand,' when she does not, and say 'I love you,' regardless.\" The angel circled the model of the military wife, looked at it closely and sighed, \"It looks fine, but it's too soft.\" \"She might look soft,\" replied the Lord, \"but she has the strength of a lion. You would not believe what she can endure.\" Finally, the angel bent over and ran her finger across the cheek of the Lord's creation. \"There's a leak,\" she announced. \"Something is wrong with the construction. I am not surprised that it has cracked. You are trying to put too much into this model.\" The Lord appeared offended at the angel's lack of confidence. What you see is not a leak,\" he said. \"It's a tear.\" \"A tear? What is it there for?\" asked the angel. The Lord replied, \"It's for joy sadness, pain, disappointment, loneliness, pride and a dedication to all the values that she and her husband hold dear.\" \"You are a genius!\" exclaimed the angel. The Lord looked puzzled and replied, \"I didn't put it there.\"", 
        "intTime": 20090501, 
        "postID": 11, 
        "quote": "Originally posted by cllopez310: I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all.", 
        "reply": " There will always be that fear whether there is a war or not. Training exercises can go wrong, electrical failures on aircraft, there are any number of situations that all military personnel are put in every day that could wind up potentially fatal. You can't keep asking him not to go when you're afraid... Read this and maybe it will help you understand a little more quote: The good Lord was creating a model for military wives and was into his sixth day of overtime when an angel appeared. She said, \"Lord, you seem to be having a lot of trouble with this one. What's the matter with the standard model?\" The Lord replied, \"Have you seen the specs on this order? She has to be completely independent, posses the qualities of both father and mother, be a perfect hostess to four or forty with an hour's notice, run on black coffee, handle every emergency imaginable without a manual, be able to carry on cheerfully, ever if she's pregnant and has the flu, and she must be willing to move 10 times in 17 years. And oh, yes, she must have six pairs of hands.\" The angel shook her head. \"Six pairs of hands? No way!\" The Lord continued, \"Don't worry, we shall make other military wives to help her. And we will give her an unusually strong heart so it can swell with pride in her husband's achievements, sustain the pain of separations, beat soundly when it's over-worked and tired, and be large enough to say 'I understand,' when she does not, and say 'I love you,' regardless.\" The angel circled the model of the military wife, looked at it closely and sighed, \"It looks fine, but it's too soft.\" \"She might look soft,\" replied the Lord, \"but she has the strength of a lion. You would not believe what she can endure.\" Finally, the angel bent over and ran her finger across the cheek of the Lord's creation. \"There's a leak,\" she announced. \"Something is wrong with the construction. I am not surprised that it has cracked. You are trying to put too much into this model.\" The Lord appeared offended at the angel's lack of confidence. What you see is not a leak,\" he said. \"It's a tear.\" \"A tear? What is it there for?\" asked the angel. The Lord replied, \"It's for joy sadness, pain, disappointment, loneliness, pride and a dedication to all the values that she and her husband hold dear.\" \"You are a genius!\" exclaimed the angel. The Lord looked puzzled and replied, \"I didn't put it there.\"", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 10:24:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by cllopez310: Not sure yet waiting to hear back... It was his dream but I begged and pleaded for him not to go for me and our daughter. It doesn't add up but its true. He has regretted backing out since that day. Oh and he reminds me everyday. Truthfully I don't blame him. His desire to join the Marines was deep inside him. At the time he attempted to join six years ago, how long had you been married? When you married him did you know he wanted to be a Marine? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090501, 
        "postID": 12, 
        "quote": "Originally posted by cllopez310: Not sure yet waiting to hear back... It was his dream but I begged and pleaded for him not to go for me and our daughter. It doesn't add up but its true. He has regretted backing out since that day. Oh and he reminds me everyday.", 
        "reply": " Truthfully I don't blame him. His desire to join the Marines was deep inside him. At the time he attempted to join six years ago, how long had you been married? When you married him did you know he wanted to be a Marine? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 10:26:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: There will always be that fear whether there is a war or not. Training exercises can go wrong, electrical failures on aircraft, there are any number of situations that all military personnel are put in every day that could wind up potentially fatal. You can't keep asking him not to go when you're afraid... Read this and maybe it will help you understand a little more [QUOTE] Exactly. In the first Gulf War, more troops died from training exercises than in combat. They say working on a flight deck on an aircraft carrier, is one of the most dangerous jobs there is.(give me a rifle I can fight back wth anytime,lol), and I can't even imagine what bubbleheads go through in those little bitty boats under the water for weeks on end.", 
        "intTime": 20090501, 
        "postID": 13, 
        "quote": "Originally posted by armywifefigueroa:", 
        "reply": " There will always be that fear whether there is a war or not. Training exercises can go wrong, electrical failures on aircraft, there are any number of situations that all military personnel are put in every day that could wind up potentially fatal. You can't keep asking him not to go when you're afraid... Read this and maybe it will help you understand a little more [QUOTE] Exactly. In the first Gulf War, more troops died from training exercises than in combat. They say working on a flight deck on an aircraft carrier, is one of the most dangerous jobs there is.(give me a rifle I can fight back wth anytime,lol), and I can't even imagine what bubbleheads go through in those little bitty boats under the water for weeks on end.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 11:09:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "billdawg24"
    }, 
    {
        "content": "I wrote this a month or so ago for a contest, adn posted it here fo rpeople to see. I am posting it here for you clio, as I think it's always the little things you have to work the hardest at in a military marriage. I don't know if he will be able to enlist or not. But, always remember that. If he does, the USMC is bigger then both of you, and will become a huge part of both your lives. I wrote this for a contest on military spouses, then realized it was for active duty only. But I thought maybe some of you might want to see it, plus, I wanted to brag about my wife to you. My Hero I am writing this, because there is someone in my life, that gives me strength, and is the person who gets me through the tough times. My wife Debbie, is a husbands dream. I will give you some background on her and why she is THE best military spouse a man could have. I am in the Navy reserves, as a Seabee. In 2003, my Air-Det was deployed to Iraq. And again in 2007-08. I understand that thousands of active duty spouses go through this on a regular basis, but my wife had several strikes against her. We had just moved to a new house a few months previous, when I got my warning order. A new town, a 4 year old son, a six month old daughter, and a 16 year old step -daughter, that my ex-wife decided she couldn’t handle about 2 months before I deployed. If this wasn’t enough, as a reservist, she wasn’t sure of military support or structure. Deb wouldn’t know if I was an E-1 in the Air Force or a General in the Marines. (I am a Chief in the Navy). That has no interest to her. What she finds important, is that I am doing a much needed job and, she has supported me in my military endeavors. During both of my deployments to OIF, she was my rock. While running the gamut of emotions overseas, there were always things that I could count on. I knew my kids were being taken well care of, the house was going to be still standing, and I would have money in the bank. Those sound like small things, but we have all heard horror stories of troops returning home to absent spouses and no money. When I would find myself outside the wire, and things seemed hopeless or bleak, I would always think of Debbie, and how she is so tough, and I would continue to persevere. I was in charge of a 28 man convoy security team. Several times, I had guys on my team, tell me they wished their spouse/significant other was more like Deb. Not because she is beautiful, she is, but because of her attitude and demeanor. That feeling of pride is un-paralleled. People often call me and other service people their heroes. They couldn’t be more wrong. We do a rough job, that needs doing, but we know the consequences and rewards. Spouses generally, and Deb specifically, do it to no fanfare or applause. Deb is my hero and my life. If I died today, my life would have been a success. She let me into her life and has honored me by sharing it with me. She is my wife, lover, confidant, and my best friend", 
        "intTime": 20090501, 
        "postID": 14, 
        "quote": "", 
        "reply": "I wrote this a month or so ago for a contest, adn posted it here fo rpeople to see. I am posting it here for you clio, as I think it's always the little things you have to work the hardest at in a military marriage. I don't know if he will be able to enlist or not. But, always remember that. If he does, the USMC is bigger then both of you, and will become a huge part of both your lives. I wrote this for a contest on military spouses, then realized it was for active duty only. But I thought maybe some of you might want to see it, plus, I wanted to brag about my wife to you. My Hero I am writing this, because there is someone in my life, that gives me strength, and is the person who gets me through the tough times. My wife Debbie, is a husbands dream. I will give you some background on her and why she is THE best military spouse a man could have. I am in the Navy reserves, as a Seabee. In 2003, my Air-Det was deployed to Iraq. And again in 2007-08. I understand that thousands of active duty spouses go through this on a regular basis, but my wife had several strikes against her. We had just moved to a new house a few months previous, when I got my warning order. A new town, a 4 year old son, a six month old daughter, and a 16 year old step -daughter, that my ex-wife decided she couldn’t handle about 2 months before I deployed. If this wasn’t enough, as a reservist, she wasn’t sure of military support or structure. Deb wouldn’t know if I was an E-1 in the Air Force or a General in the Marines. (I am a Chief in the Navy). That has no interest to her. What she finds important, is that I am doing a much needed job and, she has supported me in my military endeavors. During both of my deployments to OIF, she was my rock. While running the gamut of emotions overseas, there were always things that I could count on. I knew my kids were being taken well care of, the house was going to be still standing, and I would have money in the bank. Those sound like small things, but we have all heard horror stories of troops returning home to absent spouses and no money. When I would find myself outside the wire, and things seemed hopeless or bleak, I would always think of Debbie, and how she is so tough, and I would continue to persevere. I was in charge of a 28 man convoy security team. Several times, I had guys on my team, tell me they wished their spouse/significant other was more like Deb. Not because she is beautiful, she is, but because of her attitude and demeanor. That feeling of pride is un-paralleled. People often call me and other service people their heroes. They couldn’t be more wrong. We do a rough job, that needs doing, but we know the consequences and rewards. Spouses generally, and Deb specifically, do it to no fanfare or applause. Deb is my hero and my life. If I died today, my life would have been a success. She let me into her life and has honored me by sharing it with me. She is my wife, lover, confidant, and my best friend", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 11:19:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by cllopez310: I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all. You're not ready to be a military wife. No offense at all, miss. But some are just not cut out for it. You swayed him to back out of his contract, and now he'll never fulfill his dream. But you got what you wanted. Congratulations. The answer is no - the military will never take him for stepping out of his initial contract. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090501, 
        "postID": 15, 
        "quote": "Originally posted by cllopez310: I guess I should also mention the reason I did not want him to go is because this is when the war was starting and they were sending everyone they could. I was afraid very afraid to lose him. All I would hear on the news is a Marine getting killed. So that added to my fears. Selfish I know especially since so many have sacraficed there lives for us. I am supportive of our troops especially since I have a family member in the Army and used to have one in the Navy(RIP to him). So that is why I asked him not to go after all.", 
        "reply": " You're not ready to be a military wife. No offense at all, miss. But some are just not cut out for it. You swayed him to back out of his contract, and now he'll never fulfill his dream. But you got what you wanted. Congratulations. The answer is no - the military will never take him for stepping out of his initial contract. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 11:55:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Billdawg, that is awesome. I'm sure she is very proud to have you as a husband. This message has been edited. Last edited by: armywifefigueroa, Fri 01 May 2009 12:21 PM", 
        "intTime": 20090501, 
        "postID": 16, 
        "quote": "", 
        "reply": "Billdawg, that is awesome. I'm sure she is very proud to have you as a husband. This message has been edited. Last edited by: armywifefigueroa, Fri 01 May 2009 12:21 PM", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 11:56:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: cllopez310 They may not let him join now. Marines have always been strict about disqualifying people. And all the services are getting stricter now that the economy is down and recruiting numbers are up. They can afford to pick and choose who will serve. They may be unwilling to trust signing on a person who has backed out of a commitment before, without some very good family reasons. It also depends on how he backed out. Did he call up the recruiter and inform him, or did he just not show up? Simply not showing up is considered a dishonorable thing to do, and would not help his case. I wish you and him the best of luck. But remember, the military requires a lot of people, both those who serve, and their spouses and children back home. Your fear is understandable. The military asks not that you have no fear, but that you never let fear dictate or decide your actions.", 
        "intTime": 20090501, 
        "postID": 17, 
        "quote": "cllopez310", 
        "reply": " They may not let him join now. Marines have always been strict about disqualifying people. And all the services are getting stricter now that the economy is down and recruiting numbers are up. They can afford to pick and choose who will serve. They may be unwilling to trust signing on a person who has backed out of a commitment before, without some very good family reasons. It also depends on how he backed out. Did he call up the recruiter and inform him, or did he just not show up? Simply not showing up is considered a dishonorable thing to do, and would not help his case. I wish you and him the best of luck. But remember, the military requires a lot of people, both those who serve, and their spouses and children back home. Your fear is understandable. The military asks not that you have no fear, but that you never let fear dictate or decide your actions.", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 19:19:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "Ruanne"
    }, 
    {
        "content": "If he signed a contract...that's legal and binding! It's doubtful the Marine's or any military will take him now! This will follow him around for the rest of his life. He may need to get an attorney, if the military goes after him for not honoring the contract. Just so you know...anytime you sign a contract, you are bound by that! I'm talking about civilian contracts as well as military. Not honoring a contract can bring legal problems you don't want! I hope all goes well for him! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090501, 
        "postID": 18, 
        "quote": "", 
        "reply": "If he signed a contract...that's legal and binding! It's doubtful the Marine's or any military will take him now! This will follow him around for the rest of his life. He may need to get an attorney, if the military goes after him for not honoring the contract. Just so you know...anytime you sign a contract, you are bound by that! I'm talking about civilian contracts as well as military. Not honoring a contract can bring legal problems you don't want! I hope all goes well for him! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4460042222001", 
        "time": "2009-05-01 19:34:00", 
        "title": "Disqualified to be a Marine", 
        "userID": "Bergy46"
    }
]