[
    {
        "content": "quote: any squid worth his crow will tip their dog dish to em. They are the sailor of sailors. hahahahahahaha!!!", 
        "intTime": 20090301, 
        "postID": 10, 
        "quote": "any squid worth his crow will tip their dog dish to em. They are the sailor of sailors.", 
        "reply": " hahahahahahaha!!!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-01 01:25:00", 
        "title": "what do navy bm's do", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "tanner, you are starting off on the wrong foot, there are Navy men on here. No matter their rating, Navy guys stick together. Since you have not joined yet, you might consider joining one of the other branches of the military! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "", 
        "reply": "tanner, you are starting off on the wrong foot, there are Navy men on here. No matter their rating, Navy guys stick together. Since you have not joined yet, you might consider joining one of the other branches of the military! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-02 16:46:00", 
        "title": "what do navy bm's do", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Read stumpx's post, he got it right. Those who are making funny comments, a suggestion, don't do it in front of a Boatswain's Mate, unless you want your azz kicked or thrown over the side. tanner, if you are serious about joining the Navy best get a different attitude or join a different branch.", 
        "intTime": 20090302, 
        "postID": 12, 
        "quote": "", 
        "reply": "Read stumpx's post, he got it right. Those who are making funny comments, a suggestion, don't do it in front of a Boatswain's Mate, unless you want your azz kicked or thrown over the side. tanner, if you are serious about joining the Navy best get a different attitude or join a different branch.", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-02 21:19:00", 
        "title": "what do navy bm's do", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by tanner_ray: what do navy bm's do, are they relly boat janitors as people say chiping paint of the boat and then repainting? some people say they get not respect is that true? I suggest you bring your questions over to the Navy forums. R/ BMC, USN (Retired)", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Originally posted by tanner_ray: what do navy bm's do, are they relly boat janitors as people say chiping paint of the boat and then repainting? some people say they get not respect is that true?", 
        "reply": " I suggest you bring your questions over to the Navy forums. R/ BMC, USN (Retired)", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 06:51:00", 
        "title": "what do navy bm's do", 
        "userID": "Boats22151"
    }, 
    {
        "content": "quote: Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors. He's right, they are the true \"Seaman\" of the Navy. They are the ones that handle the lines and small boats, maintain the ships and carry on the Naval traditions.", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors.", 
        "reply": " He's right, they are the true \"Seaman\" of the Navy. They are the ones that handle the lines and small boats, maintain the ships and carry on the Naval traditions.", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 07:28:00", 
        "title": "what do navy bm's do", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors. Oh, I had the other BM in mind too. I have a boatswains pipe around here someplace. I used it to get attention when everyone was shouting at the same time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors.", 
        "reply": " Oh, I had the other BM in mind too. I have a boatswains pipe around here someplace. I used it to get attention when everyone was shouting at the same time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 07:41:00", 
        "title": "what do navy bm's do", 
        "userID": "Vicdude"
    }, 
    {
        "content": "In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "", 
        "reply": "In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 07:43:00", 
        "title": "what do navy bm's do", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\"", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you!", 
        "reply": " _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\"", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 14:33:00", 
        "title": "what do navy bm's do", 
        "userID": "stosh301"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! I donno about cutting him off at the knees just yet. How many \"kids\" went into the military and came out men? A stint in Uncle Sam's Canoe Club might be the best place there is to make a man of him. How about putting your arm around his shoulder instead of your fist in his mouth? (I'm only kidding about the fist thing.) How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 18, 
        "quote": "Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you!", 
        "reply": " I donno about cutting him off at the knees just yet. How many \"kids\" went into the military and came out men? A stint in Uncle Sam's Canoe Club might be the best place there is to make a man of him. How about putting your arm around his shoulder instead of your fist in his mouth? (I'm only kidding about the fist thing.) How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 15:03:00", 
        "title": "what do navy bm's do", 
        "userID": "Vicdude"
    }, 
    {
        "content": "My Father was a BMC . I learned thru him what they do...BUST they're Azzes. They are the backbone of any ship. Handling cargo,pulling up alongside in the middle of the night, serious watches, AND they don't chip the paint, the schidtbirds that get sent to the BM's do. At least they did during dad's time.They know more about the vessel their on than most sailors. AND trust me, growing up under a BMC was a living hell. hats off to all of them,they're tuff S.O.B.'s", 
        "intTime": 20090303, 
        "postID": 19, 
        "quote": "", 
        "reply": "My Father was a BMC . I learned thru him what they do...BUST they're Azzes. They are the backbone of any ship. Handling cargo,pulling up alongside in the middle of the night, serious watches, AND they don't chip the paint, the schidtbirds that get sent to the BM's do. At least they did during dad's time.They know more about the vessel their on than most sailors. AND trust me, growing up under a BMC was a living hell. hats off to all of them,they're tuff S.O.B.'s", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 15:43:00", 
        "title": "what do navy bm's do", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "quote: Originally posted by stosh301: quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\" Not when he comes in here badmouthing Bosun's, or any military member. The military may not be the place for him, he may not make it through boot camp! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 20, 
        "quote": "Originally posted by stosh301: quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\"", 
        "reply": " Not when he comes in here badmouthing Bosun's, or any military member. The military may not be the place for him, he may not make it through boot camp! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 19:54:00", 
        "title": "what do navy bm's do", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: any squid worth his crow will tip their dog dish to em. They are the sailor of sailors. hahahahahahaha!!!", 
        "intTime": 20090301, 
        "postID": 30, 
        "quote": "any squid worth his crow will tip their dog dish to em. They are the sailor of sailors.", 
        "reply": " hahahahahahaha!!!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-01 01:25:00", 
        "title": "what do navy bm's do", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "tanner, you are starting off on the wrong foot, there are Navy men on here. No matter their rating, Navy guys stick together. Since you have not joined yet, you might consider joining one of the other branches of the military! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090302, 
        "postID": 31, 
        "quote": "", 
        "reply": "tanner, you are starting off on the wrong foot, there are Navy men on here. No matter their rating, Navy guys stick together. Since you have not joined yet, you might consider joining one of the other branches of the military! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-02 16:46:00", 
        "title": "what do navy bm's do", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Read stumpx's post, he got it right. Those who are making funny comments, a suggestion, don't do it in front of a Boatswain's Mate, unless you want your azz kicked or thrown over the side. tanner, if you are serious about joining the Navy best get a different attitude or join a different branch.", 
        "intTime": 20090302, 
        "postID": 32, 
        "quote": "", 
        "reply": "Read stumpx's post, he got it right. Those who are making funny comments, a suggestion, don't do it in front of a Boatswain's Mate, unless you want your azz kicked or thrown over the side. tanner, if you are serious about joining the Navy best get a different attitude or join a different branch.", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-02 21:19:00", 
        "title": "what do navy bm's do", 
        "userID": "OldDoc"
    }, 
    {
        "content": "quote: Originally posted by tanner_ray: what do navy bm's do, are they relly boat janitors as people say chiping paint of the boat and then repainting? some people say they get not respect is that true? I suggest you bring your questions over to the Navy forums. R/ BMC, USN (Retired)", 
        "intTime": 20090303, 
        "postID": 33, 
        "quote": "Originally posted by tanner_ray: what do navy bm's do, are they relly boat janitors as people say chiping paint of the boat and then repainting? some people say they get not respect is that true?", 
        "reply": " I suggest you bring your questions over to the Navy forums. R/ BMC, USN (Retired)", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 06:51:00", 
        "title": "what do navy bm's do", 
        "userID": "Boats22151"
    }, 
    {
        "content": "quote: Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors. He's right, they are the true \"Seaman\" of the Navy. They are the ones that handle the lines and small boats, maintain the ships and carry on the Naval traditions.", 
        "intTime": 20090303, 
        "postID": 34, 
        "quote": "Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors.", 
        "reply": " He's right, they are the true \"Seaman\" of the Navy. They are the ones that handle the lines and small boats, maintain the ships and carry on the Naval traditions.", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 07:28:00", 
        "title": "what do navy bm's do", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors. Oh, I had the other BM in mind too. I have a boatswains pipe around here someplace. I used it to get attention when everyone was shouting at the same time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "Originally posted by stumpx: Folks, The boatswains mates of our Navy should be the last people you make fun of. They are the tie back to our proud history, to JP Jones, To Preble, to Halsey, and to new heroes we can't even conceive. Their job is, yes, to chip paint and so on, but it is also to work the boatswain pipe, caretake the quarter decks, and safeguard the salty line that goes back to The Shores of Tripoli. It is fitting that the lowliest seeming rate of the Nav is the one that safeguards our honor, that passes on the traditions and standards. Those of you that are not Navy, but other branches, you should think of the Bosun, or BM as our version of the infantryman, because they are the closest the Navy has, and any squid worth his crow will tip their dog dish to em. They are the sailor of sailors.", 
        "reply": " Oh, I had the other BM in mind too. I have a boatswains pipe around here someplace. I used it to get attention when everyone was shouting at the same time. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 07:41:00", 
        "title": "what do navy bm's do", 
        "userID": "Vicdude"
    }, 
    {
        "content": "In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "", 
        "reply": "In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 07:43:00", 
        "title": "what do navy bm's do", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\"", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you!", 
        "reply": " _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\"", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 14:33:00", 
        "title": "what do navy bm's do", 
        "userID": "stosh301"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! I donno about cutting him off at the knees just yet. How many \"kids\" went into the military and came out men? A stint in Uncle Sam's Canoe Club might be the best place there is to make a man of him. How about putting your arm around his shoulder instead of your fist in his mouth? (I'm only kidding about the fist thing.) How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you!", 
        "reply": " I donno about cutting him off at the knees just yet. How many \"kids\" went into the military and came out men? A stint in Uncle Sam's Canoe Club might be the best place there is to make a man of him. How about putting your arm around his shoulder instead of your fist in his mouth? (I'm only kidding about the fist thing.) How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 15:03:00", 
        "title": "what do navy bm's do", 
        "userID": "Vicdude"
    }, 
    {
        "content": "My Father was a BMC . I learned thru him what they do...BUST they're Azzes. They are the backbone of any ship. Handling cargo,pulling up alongside in the middle of the night, serious watches, AND they don't chip the paint, the schidtbirds that get sent to the BM's do. At least they did during dad's time.They know more about the vessel their on than most sailors. AND trust me, growing up under a BMC was a living hell. hats off to all of them,they're tuff S.O.B.'s", 
        "intTime": 20090303, 
        "postID": 39, 
        "quote": "", 
        "reply": "My Father was a BMC . I learned thru him what they do...BUST they're Azzes. They are the backbone of any ship. Handling cargo,pulling up alongside in the middle of the night, serious watches, AND they don't chip the paint, the schidtbirds that get sent to the BM's do. At least they did during dad's time.They know more about the vessel their on than most sailors. AND trust me, growing up under a BMC was a living hell. hats off to all of them,they're tuff S.O.B.'s", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 15:43:00", 
        "title": "what do navy bm's do", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "quote: Originally posted by stosh301: quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\" Not when he comes in here badmouthing Bosun's, or any military member. The military may not be the place for him, he may not make it through boot camp! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090303, 
        "postID": 40, 
        "quote": "Originally posted by stosh301: quote: Originally posted by Bergy46: In the Navy, not one rating considers it's self above another. In the Navy, we are a team, we all work together to accomplish one goal! Tanner, I suggest you reconsider NOT enlisting in any branch of the military. Your juvenile attitude will do nothing not you any friends. You will be isolated, which can be dangerous in war! I suspect you don't have any friends. Find a civilian job where you work by yourself. No one wants to be around some one like you! _______________________________________________- Cut him some slack..It looks to me like he is considering enlisting and just wants to get the straight skinny on nonsense he was fed. No harm in that... Now in the Seabees we were constantly at war with the fleet sailors. If you wanted to see some action take one 2nd class EO (equipment operator E/5) and a Chief Aviation Boatswains mate, add a case or 2 of Falstaff and I garantee you till you broke it up it would involve the Marines and the Shore Patrol.. But we did have fleet ratings in our units, Bosun's, set the watches, Gunnersmates, we had M-60's, 45's, M-79s and M-16 & M-14, Personelmen (payclerks) and commisarymen (cooks) You never ever called a Seabee a \"Sailor\"", 
        "reply": " Not when he comes in here badmouthing Bosun's, or any military member. The military may not be the place for him, he may not make it through boot camp! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4530035612001", 
        "time": "2009-03-03 19:54:00", 
        "title": "what do navy bm's do", 
        "userID": "Bergy46"
    }
]