[
    {
        "content": "To Whom It May Concern: My name is Rhonda Singleton and I am the widow of Woodrow Singleton an E-7 that served in the United States Army for twenty-one years. While on active duty my husband contributed in combat in Haiti and Bosnia. Upon his return to conus duty assignment my husband trained troops under his supervision making every effort to produce the next generation of soldiers that would serve and protect the United States and serve the army proud. We enjoyed life as a military family until May of 2003 when my husband’s health began to decline due to a service connected disability. He was admitted to Walter Reid Army medical center where he was diagnosed with sarcoma of the leg. He remained an out patient receiving chemo therapy for nine months and was later released for treatment in the Fort Bragg N.C. area where his family resided. He died on December 07, 2004 leaving behind a wife and two young children. The SGLI benefit awarded my family 250,000 withholding the retroactive death benefit of an additional 150,000 dollars as stated in Article H.R.1815-181 and H.R. 1815-182 section 664 paragraph D 2 & 3. Under this article soldiers who where not in war time situations when illness, injuries or death occurred are not awarded this sum. I speak for myself and the other 176 documented cases of families that were shorted, when I say it is unfair. The dates written in this article put limitations on the service validity of the soldiers that served their country. Although my husband and others may not have served and died in the current war, they did die in service to their country. Where they died should not be the deciding factor in weather their families receive the full benefits allowed. I believe this article should be amended to include soldiers who die within one year of retirement as a result of a service connected illness or injury. It would greatly benefit the families these soldiers leave behind. Sincerely, Mrs. Rhonda Singleton", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "", 
        "reply": "To Whom It May Concern: My name is Rhonda Singleton and I am the widow of Woodrow Singleton an E-7 that served in the United States Army for twenty-one years. While on active duty my husband contributed in combat in Haiti and Bosnia. Upon his return to conus duty assignment my husband trained troops under his supervision making every effort to produce the next generation of soldiers that would serve and protect the United States and serve the army proud. We enjoyed life as a military family until May of 2003 when my husband’s health began to decline due to a service connected disability. He was admitted to Walter Reid Army medical center where he was diagnosed with sarcoma of the leg. He remained an out patient receiving chemo therapy for nine months and was later released for treatment in the Fort Bragg N.C. area where his family resided. He died on December 07, 2004 leaving behind a wife and two young children. The SGLI benefit awarded my family 250,000 withholding the retroactive death benefit of an additional 150,000 dollars as stated in Article H.R.1815-181 and H.R. 1815-182 section 664 paragraph D 2 & 3. Under this article soldiers who where not in war time situations when illness, injuries or death occurred are not awarded this sum. I speak for myself and the other 176 documented cases of families that were shorted, when I say it is unfair. The dates written in this article put limitations on the service validity of the soldiers that served their country. Although my husband and others may not have served and died in the current war, they did die in service to their country. Where they died should not be the deciding factor in weather their families receive the full benefits allowed. I believe this article should be amended to include soldiers who die within one year of retirement as a result of a service connected illness or injury. It would greatly benefit the families these soldiers leave behind. Sincerely, Mrs. Rhonda Singleton", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 18:21:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "sunlite38"
    }, 
    {
        "content": "Mrs. Singleton, please accept my regrets-and I think I can speak for many here. It's never easy to face this kind of tragedy. I will be moving this topic to the General Discussion forum, as this forum is for discussion of current news stories. Also, please post your story in this Army forum: http://forums.military.com/eve/forums/a/frm/f/65819558 Gypsysnipe Moderator", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "Mrs. Singleton, please accept my regrets-and I think I can speak for many here. It's never easy to face this kind of tragedy. I will be moving this topic to the General Discussion forum, as this forum is for discussion of current news stories. Also, please post your story in this Army forum: http://forums.military.com/eve/forums/a/frm/f/65819558 Gypsysnipe Moderator", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 18:32:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "Rhonda, after reading your post, and let me add I am sorry for your loss, but why do you figure you are entitled to the additional 150K? How is his cancer connected to anything military\"? Sounds like he got cancer, it progressed, and he died. It sounds like you did receive the full entitlement, just not the additional monies. Please explain. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "Rhonda, after reading your post, and let me add I am sorry for your loss, but why do you figure you are entitled to the additional 150K? How is his cancer connected to anything military\"? Sounds like he got cancer, it progressed, and he died. It sounds like you did receive the full entitlement, just not the additional monies. Please explain. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 18:50:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Please! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090513, 
        "postID": 4, 
        "quote": "", 
        "reply": "Please! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 19:26:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Mrs Singleton, I'm sorry to hear of your loss! I offer my condolences, it's difficult enough to lose your husband. He gave his all, the least that can be expected is his family will be provided for! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090513, 
        "postID": 5, 
        "quote": "", 
        "reply": "Mrs Singleton, I'm sorry to hear of your loss! I offer my condolences, it's difficult enough to lose your husband. He gave his all, the least that can be expected is his family will be provided for! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 19:43:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "Bergy46"
    }, 
    {
        "content": "My husband was on active duty for 21 years. He entered the military in 1983, he did not have cancer, nor is there a family history of cancer. He received yearly physicals and whatever shots the Army required. My husband complained of pain in his leg, and the Army doctors gave him Motrin. When his cancer was found it was at stage 4 sarcoma. Had the military shown concern for his complaints of leg pain and took the time to investigate his complaint, he may still be with his family today. At the time the laws were being amended, and the changes made my husband was on active duty. He was placed on the Temporary Disability Retired List, (TDRL) using imminent death processing. Imminent Death Processing, as I now know, should have been discontinued early in 2002. The law clearly states that the death of ALL service members should be treated the same. He served his country just like the next soldier. No he did not die in combat. But he was a soldier until the day he died. His death and the deaths of the other 158 service member should be treated equally to the rest of the soldiers who gave their lives in support of our country. Should the life of a soldier who has only served 2 years on active duty or reserves be worth more than the life of a soldier who has given 20 years in service to his country? I hope not. That is why I feel that my family should receive the benefits that were made retroactive to Oct 2001.", 
        "intTime": 20090513, 
        "postID": 6, 
        "quote": "", 
        "reply": "My husband was on active duty for 21 years. He entered the military in 1983, he did not have cancer, nor is there a family history of cancer. He received yearly physicals and whatever shots the Army required. My husband complained of pain in his leg, and the Army doctors gave him Motrin. When his cancer was found it was at stage 4 sarcoma. Had the military shown concern for his complaints of leg pain and took the time to investigate his complaint, he may still be with his family today. At the time the laws were being amended, and the changes made my husband was on active duty. He was placed on the Temporary Disability Retired List, (TDRL) using imminent death processing. Imminent Death Processing, as I now know, should have been discontinued early in 2002. The law clearly states that the death of ALL service members should be treated the same. He served his country just like the next soldier. No he did not die in combat. But he was a soldier until the day he died. His death and the deaths of the other 158 service member should be treated equally to the rest of the soldiers who gave their lives in support of our country. Should the life of a soldier who has only served 2 years on active duty or reserves be worth more than the life of a soldier who has given 20 years in service to his country? I hope not. That is why I feel that my family should receive the benefits that were made retroactive to Oct 2001.", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 20:09:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "sunlite38"
    }, 
    {
        "content": "quote: Originally posted by sunlite38: My husband was on active duty for 21 years. He entered the military in 1983, he did not have cancer, nor is there a family history of cancer. He received yearly physicals and whatever shots the Army required. My husband complained of pain in his leg, and the Army doctors gave him Motrin. When his cancer was found it was at stage 4 sarcoma. Had the military shown concern for his complaints of leg pain and took the time to investigate his complaint, he may still be with his family today. At the time the laws were being amended, and the changes made my husband was on active duty. He was placed on the Temporary Disability Retired List, (TDRL) using imminent death processing. Imminent Death Processing, as I now know, should have been discontinued early in 2002. The law clearly states that the death of ALL service members should be treated the same. He served his country just like the next soldier. No he did not die in combat. But he was a soldier until the day he died. His death and the deaths of the other 158 service member should be treated equally to the rest of the soldiers who gave their lives in support of our country. Should the life of a soldier who has only served 2 years on active duty or reserves be worth more than the life of a soldier who has given 20 years in service to his country? I hope not. That is why I feel that my family should receive the benefits that were made retroactive to Oct 2001. Have Ya talked to a VSO, DAV, VFW or AL rep? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090513, 
        "postID": 7, 
        "quote": "Originally posted by sunlite38: My husband was on active duty for 21 years. He entered the military in 1983, he did not have cancer, nor is there a family history of cancer. He received yearly physicals and whatever shots the Army required. My husband complained of pain in his leg, and the Army doctors gave him Motrin. When his cancer was found it was at stage 4 sarcoma. Had the military shown concern for his complaints of leg pain and took the time to investigate his complaint, he may still be with his family today. At the time the laws were being amended, and the changes made my husband was on active duty. He was placed on the Temporary Disability Retired List, (TDRL) using imminent death processing. Imminent Death Processing, as I now know, should have been discontinued early in 2002. The law clearly states that the death of ALL service members should be treated the same. He served his country just like the next soldier. No he did not die in combat. But he was a soldier until the day he died. His death and the deaths of the other 158 service member should be treated equally to the rest of the soldiers who gave their lives in support of our country. Should the life of a soldier who has only served 2 years on active duty or reserves be worth more than the life of a soldier who has given 20 years in service to his country? I hope not. That is why I feel that my family should receive the benefits that were made retroactive to Oct 2001.", 
        "reply": " Have Ya talked to a VSO, DAV, VFW or AL rep? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-13 20:34:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Under this article soldiers who where not in war time situations when illness, injuries or death occurred are not awarded this sum. It's not a matter of one soldier's life is worth more than anothers, it's about the situation as to WHY the soldier died. Had your husband died because of a combat related scenario, you would have been awarded the additional sum. Look, I know it may sound cold but my family was in similar situation... my father served in the USMC for 22years and in 03 was diagnosed with Agent Orange related cancer. He died in April of 05. My family received the proper amount through the life insurance benefit as well as monthly assistance from the VA. My father's cancer WAS directly related to his exposure to Agent Orange in 'Nam, but my father died here, at home, and I would not deprive others that have lost their loved ones abroad that extra bit of security. If there is anything in your husband's records that you can use to prove that the cancer he had was directly related to his service in a combat situation (exposure to something, similar cases in other soldiers he was around,etc) then, if I were you, I would try, but don't dishonor the deaths of other soldiers just because you think you're entitled... that is what is unfair.", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "Under this article soldiers who where not in war time situations when illness, injuries or death occurred are not awarded this sum.", 
        "reply": " It's not a matter of one soldier's life is worth more than anothers, it's about the situation as to WHY the soldier died. Had your husband died because of a combat related scenario, you would have been awarded the additional sum. Look, I know it may sound cold but my family was in similar situation... my father served in the USMC for 22years and in 03 was diagnosed with Agent Orange related cancer. He died in April of 05. My family received the proper amount through the life insurance benefit as well as monthly assistance from the VA. My father's cancer WAS directly related to his exposure to Agent Orange in 'Nam, but my father died here, at home, and I would not deprive others that have lost their loved ones abroad that extra bit of security. If there is anything in your husband's records that you can use to prove that the cancer he had was directly related to his service in a combat situation (exposure to something, similar cases in other soldiers he was around,etc) then, if I were you, I would try, but don't dishonor the deaths of other soldiers just because you think you're entitled... that is what is unfair.", 
        "threadID": "5291911282_1690042322001", 
        "time": "2009-05-14 10:43:00", 
        "title": "please explain why congress left out 158 family membres on this gab??", 
        "userID": "armywifefigueroa"
    }
]