[
    {
        "content": "according to local news reports, on Wed. May 21st, a terrorsit plot to blow up some Jewish synogogues and fire stinger missles at a New York Air National Guard base was thwarted by combined Law Enforcement agencies in New York. the Stewart Airport/ National Guard base in Newburgh, NY just roughly 60 miles NW of NYC was an intended target. Fortunately, officails from the FBI, ICE, and LLEA were aware of the intentions of the group and had plans in place to take down the terrorists before they could begin their attack. reports say that the cell was relatively unsophisticated and had no operational weaponry to actually carry out a successful attack. BTW, this airport is just a few miles from where i grew up and where my family still resides.", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "", 
        "reply": "according to local news reports, on Wed. May 21st, a terrorsit plot to blow up some Jewish synogogues and fire stinger missles at a New York Air National Guard base was thwarted by combined Law Enforcement agencies in New York. the Stewart Airport/ National Guard base in Newburgh, NY just roughly 60 miles NW of NYC was an intended target. Fortunately, officails from the FBI, ICE, and LLEA were aware of the intentions of the group and had plans in place to take down the terrorists before they could begin their attack. reports say that the cell was relatively unsophisticated and had no operational weaponry to actually carry out a successful attack. BTW, this airport is just a few miles from where i grew up and where my family still resides.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 04:34:00", 
        "title": "terror plot stopped in NY", 
        "userID": "NYvet469"
    }, 
    {
        "content": "for info check out the website recordonline.com to view related stories.", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "for info check out the website recordonline.com to view related stories.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 04:36:00", 
        "title": "terror plot stopped in NY", 
        "userID": "NYvet469"
    }, 
    {
        "content": "Old News first posted on this site 6 days ago. http://www.military.com/eve/fo...8221/m/1910038322001 You should get out more often and read the forums more.", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "", 
        "reply": "Old News first posted on this site 6 days ago. http://www.military.com/eve/fo...8221/m/1910038322001 You should get out more often and read the forums more.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 04:44:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "thanks Hoffy, i just found out. sorry to post old news funny thing, the NRC just sent out this as an urgent bulletin. guess they need to get out more too!", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "", 
        "reply": "thanks Hoffy, i just found out. sorry to post old news funny thing, the NRC just sent out this as an urgent bulletin. guess they need to get out more too!", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 04:55:00", 
        "title": "terror plot stopped in NY", 
        "userID": "NYvet469"
    }, 
    {
        "content": "Hang 'em high - enough said.... Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "", 
        "reply": "Hang 'em high - enough said.... Wandering and Wondering", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 05:01:00", 
        "title": "terror plot stopped in NY", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "yeah, i agree. i wonder though, they seemed to be extremely inept and relatively easy to apprehend, were they sacrifical lambs? maybe i watch too much TV", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "", 
        "reply": "yeah, i agree. i wonder though, they seemed to be extremely inept and relatively easy to apprehend, were they sacrifical lambs? maybe i watch too much TV", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 05:18:00", 
        "title": "terror plot stopped in NY", 
        "userID": "NYvet469"
    }, 
    {
        "content": "The \"Bright\" ones wasted the chance at lucrative pilot careers to run planes into buildings - - I don't think any of 'em got a full boat of oars - - Best just shoot or hang the lot!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "", 
        "reply": "The \"Bright\" ones wasted the chance at lucrative pilot careers to run planes into buildings - - I don't think any of 'em got a full boat of oars - - Best just shoot or hang the lot!! Wandering and Wondering", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 05:26:00", 
        "title": "terror plot stopped in NY", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: BTW, this airport is just a few miles from where i grew up and where my family still resides. I lived in Hackensack, NJ and had my plane tied down at Titerboro AP. My CFI took me to Stewart early on. If one can't land on those huge runways it's time to give up flying. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "BTW, this airport is just a few miles from where i grew up and where my family still resides.", 
        "reply": " I lived in Hackensack, NJ and had my plane tied down at Titerboro AP. My CFI took me to Stewart early on. If one can't land on those huge runways it's time to give up flying. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 05:30:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Vicdude"
    }, 
    {
        "content": "ok i guess that sounds like solid logic. these guys looked mostly like average citizens though, if they hadn't been spoting off at their mosque we may not have known of their plot. glad we have HUMINT around to help spot these types", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "", 
        "reply": "ok i guess that sounds like solid logic. these guys looked mostly like average citizens though, if they hadn't been spoting off at their mosque we may not have known of their plot. glad we have HUMINT around to help spot these types", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 05:31:00", 
        "title": "terror plot stopped in NY", 
        "userID": "NYvet469"
    }, 
    {
        "content": "I recall a number of other close calls here in NY recently. Despite our best efforts I feel our luck is eventually going to run out. The scenario speculation is endless, but something will probably happen.", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "", 
        "reply": "I recall a number of other close calls here in NY recently. Despite our best efforts I feel our luck is eventually going to run out. The scenario speculation is endless, but something will probably happen.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 07:44:00", 
        "title": "terror plot stopped in NY", 
        "userID": "scpd3045"
    }, 
    {
        "content": "Hang them from a short rope! Everytime a terrorist is caught, hang them on a public gallows. Use a narrow rope, it will cause more pain than a thick rope and death will be slow! Televise it world wide, get the message out. Some of the terrorist are fanatical, nothing will stop them. Others may change their minds and back off! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "", 
        "reply": "Hang them from a short rope! Everytime a terrorist is caught, hang them on a public gallows. Use a narrow rope, it will cause more pain than a thick rope and death will be slow! Televise it world wide, get the message out. Some of the terrorist are fanatical, nothing will stop them. Others may change their minds and back off! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 08:02:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Hang them from a short rope! Everytime a terrorist is caught, hang them on a public gallows. Use a narrow rope, it will cause more pain than a thick rope and death will be slow! Televise it world wide, get the message out. Some of the terrorist are fanatical, nothing will stop them. Others may change their minds and back off! No, no, no, send them to a rehabilitative institution on the taxpayers dime. For 35K a year give them free education, health care, recreation, weight room, college, law library, cable TV, visits, special diets, counseling, religious services, and more. They came from a broken home. Feel sorry for them while I conspire to shoot them.", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "Originally posted by Bergy46: Hang them from a short rope! Everytime a terrorist is caught, hang them on a public gallows. Use a narrow rope, it will cause more pain than a thick rope and death will be slow! Televise it world wide, get the message out. Some of the terrorist are fanatical, nothing will stop them. Others may change their minds and back off!", 
        "reply": " No, no, no, send them to a rehabilitative institution on the taxpayers dime. For 35K a year give them free education, health care, recreation, weight room, college, law library, cable TV, visits, special diets, counseling, religious services, and more. They came from a broken home. Feel sorry for them while I conspire to shoot them.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 09:22:00", 
        "title": "terror plot stopped in NY", 
        "userID": "scpd3045"
    }, 
    {
        "content": "that's right we must be kinder and gentler, if we play nice so will they!", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "", 
        "reply": "that's right we must be kinder and gentler, if we play nice so will they!", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 09:26:00", 
        "title": "terror plot stopped in NY", 
        "userID": "NYvet469"
    }, 
    {
        "content": "quote: Originally posted by scpd3045: quote: Originally posted by Bergy46: Hang them from a short rope! Everytime a terrorist is caught, hang them on a public gallows. Use a narrow rope, it will cause more pain than a thick rope and death will be slow! Televise it world wide, get the message out. Some of the terrorist are fanatical, nothing will stop them. Others may change their minds and back off! No, no, no, send them to a rehabilitative institution on the taxpayers dime. For 35K a year give them free education, health care, recreation, weight room, college, law library, cable TV, visits, special diets, counseling, religious services, and more. They came from a broken home. Feel sorry for them while I conspire to shoot them. Ok, if you let me help shoot them! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090527, 
        "postID": 14, 
        "quote": "Originally posted by scpd3045: quote: Originally posted by Bergy46: Hang them from a short rope! Everytime a terrorist is caught, hang them on a public gallows. Use a narrow rope, it will cause more pain than a thick rope and death will be slow! Televise it world wide, get the message out. Some of the terrorist are fanatical, nothing will stop them. Others may change their minds and back off! No, no, no, send them to a rehabilitative institution on the taxpayers dime. For 35K a year give them free education, health care, recreation, weight room, college, law library, cable TV, visits, special diets, counseling, religious services, and more. They came from a broken home. Feel sorry for them while I conspire to shoot them.", 
        "reply": " Ok, if you let me help shoot them! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 20:06:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I always heard Navy guys would be your best friend or worst enemy.", 
        "intTime": 20090527, 
        "postID": 15, 
        "quote": "", 
        "reply": "I always heard Navy guys would be your best friend or worst enemy.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-27 22:31:00", 
        "title": "terror plot stopped in NY", 
        "userID": "scpd3045"
    }, 
    {
        "content": "WAKE UP AMERICA! Oh, it's going to happen again folks, more than once. The questions are: Where, when and to what magnitude?", 
        "intTime": 20090528, 
        "postID": 16, 
        "quote": "", 
        "reply": "WAKE UP AMERICA! Oh, it's going to happen again folks, more than once. The questions are: Where, when and to what magnitude?", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-28 00:33:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Hercules1944"
    }, 
    {
        "content": "A lengthly read, but, think about it. quote: NO MISSION TOO DIFFICULT, NO SACRIFICE TOO GREAT, DUTY FIRST! First Infantry Division,HHC 2nd Bn 18th Inf Viet Nam 65-66, Recon Platoon History Re-visited… SOME OF YOU ARE NOT OLD ENOUGH TO REMEMBER THAT NEARLY EVERY FAMILY IN AMERICA WAS GROSSLY AFFECTED BY WW II . MOST OF YOU DON'T REMEMBER THE RATIONING OF MEAT, SHOES, GASOLINE, AND SUGAR. NO TIRES FOR OUR AUTOMOBILES, AND A SPEED LIMIT OF 35 MILES AN HOUR ON THE ROAD, NOT TO MENTION, NO NEW AUTOMOBILES. READ THIS AND THINK ABOUT HOW WE WOULD REACT TO BEING TAKEN OVER BY FOREIGNERS IN 2010. This is an EXCELLENT essay . Well thought out and presented. Historical Significance Sixty-three years ago, Nazi Germany had overrun almost all of Europe and hammered England to the verge of bankruptcy and defeat. The Nazis had sunk more than 400 British ships in their convoys between England andAmerica taking food and war materials At that time the US was in an isolationist, pacifist mood, and most Americans wanted nothing to do with the European or the Asian war . Then along came Pearl Harbor on December 7, 1941 , and in outrage Congress unanimously declared war on Japan , and the following day onGermany , who had not yet attacked us . It was a dicey thing . We had few allies .. France was not an ally, as the Vichy government of France quickly aligned itself with its German occupiers . Germany was certainly not an ally, as Hitler was intent on setting up a Thousand Year Reich in Europe . Japan was not an ally, as it was well on its way to owning and controlling all ofAsia .. Together, Japan and Germany had long-range plans of invading Canada andMexico , as launching pads to get into the United States over our northern and southern borders, after they finished gaining control of Asia andEurope . America's only allies then were England , Ireland , Scotland , Canada , Australia, and Russia .. That was about it. All of Europe, from Norway toItaly (except Russia in the East) was already under the Nazi heel The US was certainly not prepared for war. The US had drastically downgraded most of its military forces after WW I because of the depression, so that at the outbreak of WW II, Army units were training with broomsticks because they didn't have guns, and cars with \"tank\" painted on the doors because they didn't have real tanks A huge chunk of our Navy had just been sunk or damaged at Pearl Harbor. Britain had already gone bankrupt, saved only by the donation of $600 million in gold bullion in the Bank of England (that was actually the property of Belgium ) given by Belgium to England to carry on the war when Belgiumwas overrun by Hitler (a little known fact). Actually, Belgium surrendered after one day, because it was unable to oppose the German invasion, and the Germans bombed Brussels into rubble the next day just to prove they could . Britain had already been holding out for two years in the face of staggering losses and the near decimation of its Royal Air Force in the Battle of Britain, and was saved from being overrun by Germany only because Hitler made the mistake of thinking the Brits were a relatively minor threat that could be dealt with later. Hitler, first turned his attention to Russia, in the late summer of 1940 at a time when England was on the verge of collapse. Ironically, Russia saved America's butt by putting up a desperate fight for two years, until the US got geared up to begin hammering away at Germany .. Russia lost something like 24,000,000 people in the sieges of Stalingrad and Moscow alone . . . 90% of them from cold and starvation, mostly civilians, but also more than a 1,000,000 soldiers Had Russia surrendered, Hitler would have been able to focus his entire war effort against the Brits, then America . If that had happened, the Nazis could possibly have won the war .. All of this has been brought out to illustrate that turning points in history are often dicey things. Now, we find ourselves at another one of those key moments in history.. There is a very dangerous minority in Islam that either has, or wants, and may soon have, the ability to deliver small nuclear, biological, or chemical weapons, almost anywhere in the world . The Jihadis, the militant Muslims, are basically Nazis in Kaffiyahs -- they believe that Islam, a radically conservative form of Wahhabi Islam, should own and control the Middle East first, then Europe, then the world. To them, all who do not bow to their will of thinking should be killed, enslaved, or subjugated .. They want to finish the Holocaust, destroy Israel , and purge the world of Jews . This is their mantra . (goal) There is also a civil war raging in the Middle East -- for the most part not a hot war, but a war of ideas. Islam is having its Inquisition and its Reformation, but it is not yet known which side will win -- the Inquisitors, or the Reformationists. If the Inquisition wins, then the Wahhabis, the Jihadis, will control the Middle East, the OPEC oil, and the US , European, and Asian economies. The techno-industrial economies will be at the mercy of OPEC -- not an OPEC dominated by the educated, rational Saudis of today, but an OPEC dominated by the Jihadis. Do you want gas in your car? Do you want heating oil next winter? Do you want the dollar to be worth anything? You had better hope the Jihad, the Muslim Inquisition, loses, and the Islamic Reformation wins. If the Reformation movement wins, that is, the moderate Muslims who believe that Islam can respect and tolerate other religions, live in peace with the rest of the world, and move out of the 10th century into the 21st, then the troubles in the Middle East will eventually fade away. A moderate and prosperous Middle East will emerge. We have to help the Reformation win, and to do that we have to fight the Inquisition, i.e., the Wahhabi movement, the Jihad, Al Qaeda and the Islamic terrorist movements. We have to do it somewhere. We can't do it everywhere at once. We have created a focal point for the battle at a time and place of our choosing . . . . . . . . in Iraq . Not in New York , not in London , or Paris or Berlin , but in Iraq , where we are doing two important things.. (1) We deposed Saddam Hussein. Whether Saddam Hussein was directly involved in the 9/11 terrorist attack or not, it is undisputed that Saddam has been actively supporting the terrorist movement for decades Saddam was a terrorist! Saddam was a weapon of mass destruction, responsible for the deaths of probably more than a 1,000,000 Iraqis and 2,000,000 Iranians . (2) We created a battle, a confrontation, a flash point, with Islamic terrorism in Iraq . We have focused the battle. We are killing bad people, and the ones we get there we won't have to get here. We also have a good shot at creating a democratic, peaceful Iraq, which will be a catalyst for democratic change in the rest of the Middle East, and an outpost for a stabilizing American military presence in the Middle East for as long as it is needed WW II, the war with the Japanese and German Nazis, really began with a \"whimper\" in 1928. It did not begin with Pearl Harbor . It began with the Japanese invasion of China . It was a war for fourteen years before theUS joined it. It officially ended in 1945 -- a 17 year war -- and was followed by another decade of US occupation in Germany and Japan to get those countries reconstructed and running on their own a gain . a 27 year war.. WW II cost the United States an amount equal to approximately a full year's GDP -- adjusted for inflation, equal to about $12 trillion dollars. WW II cost America more than 400,000 soldiers killed in action, and nearly 100,000 still missing in action. The Iraq war has, so far, cost the United States about $160,000,000,000, which is roughly what the 9/11 terrorist attack cost New York. It has also cost about 3,000 American lives, which is roughly equivalent to lives that the Jihad killed (within the United States ) in the 9/11 terrorist attack ... The cost of not fighting and winning WW II would have been unimaginably greater -- a world dominated by Japanese Imperialism and German Nazism . This is not a 60-Minutes TV show, or a 2-hour movie in which everything comes out okay . The real world is not like that. It is messy, uncertain, and sometimes bloody and ugly. It always has been, and probably always will be . The bottom line is that we will have to deal with Islamic terrorism until we defeat it, whenever that is. It will not go away if we ignore it If the US can create a reasonably democratic and stable Iraq , then we have an ally, like England , in the Middle East, a platform, from which we can work to help modernize and moderate the Middle East .. The history of the world is the clash between the forces of relative civility and civilization, and the barbarians clamoring at the gates to conquer the world. The Iraq War is merely another battle in this ancient and never ending war. Now, for the first time ever, the barbarians are about to get nuclear weapons. Unless somebody prevents them from getting them. We have four options: 1 We can defeat the Jihad now, before it gets nuclear weapons. 2 We can fight the Jihad later, after it gets nuclear weapons (which may be as early as next year, if Iran 's progress on nuclear weapons is whatIran claims it is). 3 . We can surrender to the Jihad and accept its dominance in the Middle East now; in Europe in the next few years or decades, and ultimately inAmerica . OR 4 . We can stand down now, and pick up the fight later when the Jihad is more widespread and better armed, perhaps after the Jihad has dominatedFrance and Germany and possibly most of the rest of Europe . It will, of course, be more dangerous, more expensive, and much bloodier. If you oppose this war, I hope you like the idea that your children, or grandchildren, may live in an Islamic America under the Mullahs and the Sharia, an America that resembles Iran today. The history of the world is the history of civilization clashes, cultural clashes. All wars are about ideas, ideas about what society and civilization should be like, and the most determined always win. Those who are willing to be the most ruthless always win . The pacifists always lose, because the anti-pacifists kill them .. Remember, perspective is every thing, and America 's schools teach too little history for perspective to be clear, especially in the young American mind. The Cold War lasted from about 1947 at least until the Berlin Wall came down in 1989; forty-two years! Europe spent the first half of the 19th century fighting Napoleon, and from 1870 to 1945 fighting Germany ! World War II began in 1928, lasted 17 years, plus a ten year occupation, and the US still has troops in Germany and Japan . World War II resulted in the death of more than 50,000,000 people, maybe more than 100,000,000 people, depending on which estimates you accept. The US has taken more than 3,000 killed in action in Iraq .. The US took more than 4,000 killed in action on the morning of June 6, 1944 , the first day of the Normandy Invasion to rid Europe of Nazi Imperialism. In WW II the US averaged 2,000 KIA a week -- for four years. Most of the individual battles of WW II lost more Americans than the entire Iraqwar has done so far The stakes are at least as high . . A world dominated by representative governments with civil rights, human rights, and personal freedoms . . or a world dominated by a radical Islamic Wahhabi movement, by the Jihad, under the Mullahs and the Sharia (Islamic law) It's difficult to understand why the average American does not grasp this. They favor human rights, civil rights, liberty and freedom, but evidently not for Iraqis. \"Peace Activists\" always seem to demonstrate here in America , where it's safe. Why don't we see Peace Activist demonstrating in Iran , Syria , Iraq ,Sudan , North Korea , in the places that really need peace activism the most? I'll tell you why! They would be killed! The liberal mentality is supposed to favor human rights, civil rights, democracy, multiculturalism, diversity, etc . , but if the Jihad wins, wherever the Jihad wins, it is the end of civil rights, human rights, democracy, multiculturalism, diversity, etc. Americans who oppose the liberation of Iraq are coming down on the side of their own worst enemy", 
        "intTime": 20090528, 
        "postID": 17, 
        "quote": "NO MISSION TOO DIFFICULT, NO SACRIFICE TOO GREAT, DUTY FIRST! First Infantry Division,HHC 2nd Bn 18th Inf Viet Nam 65-66, Recon Platoon History Re-visited… SOME OF YOU ARE NOT OLD ENOUGH TO REMEMBER THAT NEARLY EVERY FAMILY IN AMERICA WAS GROSSLY AFFECTED BY WW II . MOST OF YOU DON'T REMEMBER THE RATIONING OF MEAT, SHOES, GASOLINE, AND SUGAR. NO TIRES FOR OUR AUTOMOBILES, AND A SPEED LIMIT OF 35 MILES AN HOUR ON THE ROAD, NOT TO MENTION, NO NEW AUTOMOBILES. READ THIS AND THINK ABOUT HOW WE WOULD REACT TO BEING TAKEN OVER BY FOREIGNERS IN 2010. This is an EXCELLENT essay . Well thought out and presented. Historical Significance Sixty-three years ago, Nazi Germany had overrun almost all of Europe and hammered England to the verge of bankruptcy and defeat. The Nazis had sunk more than 400 British ships in their convoys between England andAmerica taking food and war materials At that time the US was in an isolationist, pacifist mood, and most Americans wanted nothing to do with the European or the Asian war . Then along came Pearl Harbor on December 7, 1941 , and in outrage Congress unanimously declared war on Japan , and the following day onGermany , who had not yet attacked us . It was a dicey thing . We had few allies .. France was not an ally, as the Vichy government of France quickly aligned itself with its German occupiers . Germany was certainly not an ally, as Hitler was intent on setting up a Thousand Year Reich in Europe . Japan was not an ally, as it was well on its way to owning and controlling all ofAsia .. Together, Japan and Germany had long-range plans of invading Canada andMexico , as launching pads to get into the United States over our northern and southern borders, after they finished gaining control of Asia andEurope . America's only allies then were England , Ireland , Scotland , Canada , Australia, and Russia .. That was about it. All of Europe, from Norway toItaly (except Russia in the East) was already under the Nazi heel The US was certainly not prepared for war. The US had drastically downgraded most of its military forces after WW I because of the depression, so that at the outbreak of WW II, Army units were training with broomsticks because they didn't have guns, and cars with \"tank\" painted on the doors because they didn't have real tanks A huge chunk of our Navy had just been sunk or damaged at Pearl Harbor. Britain had already gone bankrupt, saved only by the donation of $600 million in gold bullion in the Bank of England (that was actually the property of Belgium ) given by Belgium to England to carry on the war when Belgiumwas overrun by Hitler (a little known fact). Actually, Belgium surrendered after one day, because it was unable to oppose the German invasion, and the Germans bombed Brussels into rubble the next day just to prove they could . Britain had already been holding out for two years in the face of staggering losses and the near decimation of its Royal Air Force in the Battle of Britain, and was saved from being overrun by Germany only because Hitler made the mistake of thinking the Brits were a relatively minor threat that could be dealt with later. Hitler, first turned his attention to Russia, in the late summer of 1940 at a time when England was on the verge of collapse. Ironically, Russia saved America's butt by putting up a desperate fight for two years, until the US got geared up to begin hammering away at Germany .. Russia lost something like 24,000,000 people in the sieges of Stalingrad and Moscow alone . . . 90% of them from cold and starvation, mostly civilians, but also more than a 1,000,000 soldiers Had Russia surrendered, Hitler would have been able to focus his entire war effort against the Brits, then America . If that had happened, the Nazis could possibly have won the war .. All of this has been brought out to illustrate that turning points in history are often dicey things. Now, we find ourselves at another one of those key moments in history.. There is a very dangerous minority in Islam that either has, or wants, and may soon have, the ability to deliver small nuclear, biological, or chemical weapons, almost anywhere in the world . The Jihadis, the militant Muslims, are basically Nazis in Kaffiyahs -- they believe that Islam, a radically conservative form of Wahhabi Islam, should own and control the Middle East first, then Europe, then the world. To them, all who do not bow to their will of thinking should be killed, enslaved, or subjugated .. They want to finish the Holocaust, destroy Israel , and purge the world of Jews . This is their mantra . (goal) There is also a civil war raging in the Middle East -- for the most part not a hot war, but a war of ideas. Islam is having its Inquisition and its Reformation, but it is not yet known which side will win -- the Inquisitors, or the Reformationists. If the Inquisition wins, then the Wahhabis, the Jihadis, will control the Middle East, the OPEC oil, and the US , European, and Asian economies. The techno-industrial economies will be at the mercy of OPEC -- not an OPEC dominated by the educated, rational Saudis of today, but an OPEC dominated by the Jihadis. Do you want gas in your car? Do you want heating oil next winter? Do you want the dollar to be worth anything? You had better hope the Jihad, the Muslim Inquisition, loses, and the Islamic Reformation wins. If the Reformation movement wins, that is, the moderate Muslims who believe that Islam can respect and tolerate other religions, live in peace with the rest of the world, and move out of the 10th century into the 21st, then the troubles in the Middle East will eventually fade away. A moderate and prosperous Middle East will emerge. We have to help the Reformation win, and to do that we have to fight the Inquisition, i.e., the Wahhabi movement, the Jihad, Al Qaeda and the Islamic terrorist movements. We have to do it somewhere. We can't do it everywhere at once. We have created a focal point for the battle at a time and place of our choosing . . . . . . . . in Iraq . Not in New York , not in London , or Paris or Berlin , but in Iraq , where we are doing two important things.. (1) We deposed Saddam Hussein. Whether Saddam Hussein was directly involved in the 9/11 terrorist attack or not, it is undisputed that Saddam has been actively supporting the terrorist movement for decades Saddam was a terrorist! Saddam was a weapon of mass destruction, responsible for the deaths of probably more than a 1,000,000 Iraqis and 2,000,000 Iranians . (2) We created a battle, a confrontation, a flash point, with Islamic terrorism in Iraq . We have focused the battle. We are killing bad people, and the ones we get there we won't have to get here. We also have a good shot at creating a democratic, peaceful Iraq, which will be a catalyst for democratic change in the rest of the Middle East, and an outpost for a stabilizing American military presence in the Middle East for as long as it is needed WW II, the war with the Japanese and German Nazis, really began with a \"whimper\" in 1928. It did not begin with Pearl Harbor . It began with the Japanese invasion of China . It was a war for fourteen years before theUS joined it. It officially ended in 1945 -- a 17 year war -- and was followed by another decade of US occupation in Germany and Japan to get those countries reconstructed and running on their own a gain . a 27 year war.. WW II cost the United States an amount equal to approximately a full year's GDP -- adjusted for inflation, equal to about $12 trillion dollars. WW II cost America more than 400,000 soldiers killed in action, and nearly 100,000 still missing in action. The Iraq war has, so far, cost the United States about $160,000,000,000, which is roughly what the 9/11 terrorist attack cost New York. It has also cost about 3,000 American lives, which is roughly equivalent to lives that the Jihad killed (within the United States ) in the 9/11 terrorist attack ... The cost of not fighting and winning WW II would have been unimaginably greater -- a world dominated by Japanese Imperialism and German Nazism . This is not a 60-Minutes TV show, or a 2-hour movie in which everything comes out okay . The real world is not like that. It is messy, uncertain, and sometimes bloody and ugly. It always has been, and probably always will be . The bottom line is that we will have to deal with Islamic terrorism until we defeat it, whenever that is. It will not go away if we ignore it If the US can create a reasonably democratic and stable Iraq , then we have an ally, like England , in the Middle East, a platform, from which we can work to help modernize and moderate the Middle East .. The history of the world is the clash between the forces of relative civility and civilization, and the barbarians clamoring at the gates to conquer the world. The Iraq War is merely another battle in this ancient and never ending war. Now, for the first time ever, the barbarians are about to get nuclear weapons. Unless somebody prevents them from getting them. We have four options: 1 We can defeat the Jihad now, before it gets nuclear weapons. 2 We can fight the Jihad later, after it gets nuclear weapons (which may be as early as next year, if Iran 's progress on nuclear weapons is whatIran claims it is). 3 . We can surrender to the Jihad and accept its dominance in the Middle East now; in Europe in the next few years or decades, and ultimately inAmerica . OR 4 . We can stand down now, and pick up the fight later when the Jihad is more widespread and better armed, perhaps after the Jihad has dominatedFrance and Germany and possibly most of the rest of Europe . It will, of course, be more dangerous, more expensive, and much bloodier. If you oppose this war, I hope you like the idea that your children, or grandchildren, may live in an Islamic America under the Mullahs and the Sharia, an America that resembles Iran today. The history of the world is the history of civilization clashes, cultural clashes. All wars are about ideas, ideas about what society and civilization should be like, and the most determined always win. Those who are willing to be the most ruthless always win . The pacifists always lose, because the anti-pacifists kill them .. Remember, perspective is every thing, and America 's schools teach too little history for perspective to be clear, especially in the young American mind. The Cold War lasted from about 1947 at least until the Berlin Wall came down in 1989; forty-two years! Europe spent the first half of the 19th century fighting Napoleon, and from 1870 to 1945 fighting Germany ! World War II began in 1928, lasted 17 years, plus a ten year occupation, and the US still has troops in Germany and Japan . World War II resulted in the death of more than 50,000,000 people, maybe more than 100,000,000 people, depending on which estimates you accept. The US has taken more than 3,000 killed in action in Iraq .. The US took more than 4,000 killed in action on the morning of June 6, 1944 , the first day of the Normandy Invasion to rid Europe of Nazi Imperialism. In WW II the US averaged 2,000 KIA a week -- for four years. Most of the individual battles of WW II lost more Americans than the entire Iraqwar has done so far The stakes are at least as high . . A world dominated by representative governments with civil rights, human rights, and personal freedoms . . or a world dominated by a radical Islamic Wahhabi movement, by the Jihad, under the Mullahs and the Sharia (Islamic law) It's difficult to understand why the average American does not grasp this. They favor human rights, civil rights, liberty and freedom, but evidently not for Iraqis. \"Peace Activists\" always seem to demonstrate here in America , where it's safe. Why don't we see Peace Activist demonstrating in Iran , Syria , Iraq ,Sudan , North Korea , in the places that really need peace activism the most? I'll tell you why! They would be killed! The liberal mentality is supposed to favor human rights, civil rights, democracy, multiculturalism, diversity, etc . , but if the Jihad wins, wherever the Jihad wins, it is the end of civil rights, human rights, democracy, multiculturalism, diversity, etc. Americans who oppose the liberation of Iraq are coming down on the side of their own worst enemy", 
        "reply": "A lengthly read, but, think about it. ", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-28 00:42:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Hercules1944"
    }, 
    {
        "content": "I like option # 2. Bring our troops home and stand them down for a year then go in with the NUKES. The boys with the most toys win. Remember, the Muslims may have a Nuke or two but we have more MOPP gear then they have.", 
        "intTime": 20090528, 
        "postID": 18, 
        "quote": "", 
        "reply": "I like option # 2. Bring our troops home and stand them down for a year then go in with the NUKES. The boys with the most toys win. Remember, the Muslims may have a Nuke or two but we have more MOPP gear then they have.", 
        "threadID": "5291911282_2830073422001", 
        "time": "2009-05-28 02:06:00", 
        "title": "terror plot stopped in NY", 
        "userID": "Duster6"
    }
]