[
    {
        "content": "Where were these people born? quote: One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case.", 
        "reply": "Where were these people born?  \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 04:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing in public Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "Women should be hit for wearing sexy clothing in public", 
        "reply": " Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:15:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fredette"
    }, 
    {
        "content": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "", 
        "reply": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "", 
        "reply": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....) Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "reply": " Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those. It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "intTime": 20090310, 
        "postID": 9, 
        "quote": "Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "reply": " It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:38:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "intTime": 20090310, 
        "postID": 10, 
        "quote": "", 
        "reply": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:53:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: There are some mean as hell women out there . You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "intTime": 20090310, 
        "postID": 11, 
        "quote": "Originally posted by Wolfhound_1968: There are some mean as hell women out there .", 
        "reply": " You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Most physical violence would be avoided if a woman would learn when to shut up and stop nagging. What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "intTime": 20090310, 
        "postID": 12, 
        "quote": "Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "reply": " What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:44:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "intTime": 20090310, 
        "postID": 13, 
        "quote": "", 
        "reply": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "intTime": 20090310, 
        "postID": 14, 
        "quote": "", 
        "reply": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing Do you mean like “I’d hit that/it”?", 
        "intTime": 20090310, 
        "postID": 15, 
        "quote": "Women should be hit for wearing sexy clothing", 
        "reply": " Do you mean like “I’d hit that/it”?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 16, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": "", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:11:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "intTime": 20090310, 
        "postID": 17, 
        "quote": "", 
        "reply": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:14:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: The findings of the poll, conducted for the Home Office Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 18, 
        "quote": "The findings of the poll, conducted for the Home Office", 
        "reply": " Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:00:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don ....yes, I would hit it....wait.....what?....", 
        "intTime": 20090310, 
        "postID": 19, 
        "quote": "Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": " ....yes, I would hit it....wait.....what?....", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "VDoP"
    }, 
    {
        "content": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "intTime": 20090310, 
        "postID": 20, 
        "quote": "", 
        "reply": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "LHA_3Rusty"
    }, 
    {
        "content": "Where were these people born? quote: One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090310, 
        "postID": 21, 
        "quote": "One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case.", 
        "reply": "Where were these people born?  \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 04:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "intTime": 20090310, 
        "postID": 22, 
        "quote": "", 
        "reply": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "intTime": 20090310, 
        "postID": 23, 
        "quote": "", 
        "reply": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "intTime": 20090310, 
        "postID": 24, 
        "quote": "", 
        "reply": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing in public Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "intTime": 20090310, 
        "postID": 25, 
        "quote": "Women should be hit for wearing sexy clothing in public", 
        "reply": " Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:15:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fredette"
    }, 
    {
        "content": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 26, 
        "quote": "", 
        "reply": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 27, 
        "quote": "", 
        "reply": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....) Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "intTime": 20090310, 
        "postID": 28, 
        "quote": "Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "reply": " Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those. It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "intTime": 20090310, 
        "postID": 29, 
        "quote": "Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "reply": " It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:38:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "intTime": 20090310, 
        "postID": 30, 
        "quote": "", 
        "reply": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:53:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: There are some mean as hell women out there . You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "intTime": 20090310, 
        "postID": 31, 
        "quote": "Originally posted by Wolfhound_1968: There are some mean as hell women out there .", 
        "reply": " You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Most physical violence would be avoided if a woman would learn when to shut up and stop nagging. What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "intTime": 20090310, 
        "postID": 32, 
        "quote": "Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "reply": " What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:44:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "intTime": 20090310, 
        "postID": 33, 
        "quote": "", 
        "reply": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "intTime": 20090310, 
        "postID": 34, 
        "quote": "", 
        "reply": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing Do you mean like “I’d hit that/it”?", 
        "intTime": 20090310, 
        "postID": 35, 
        "quote": "Women should be hit for wearing sexy clothing", 
        "reply": " Do you mean like “I’d hit that/it”?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 36, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": "", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:11:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "intTime": 20090310, 
        "postID": 37, 
        "quote": "", 
        "reply": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:14:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: The findings of the poll, conducted for the Home Office Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 38, 
        "quote": "The findings of the poll, conducted for the Home Office", 
        "reply": " Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:00:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don ....yes, I would hit it....wait.....what?....", 
        "intTime": 20090310, 
        "postID": 39, 
        "quote": "Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": " ....yes, I would hit it....wait.....what?....", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "VDoP"
    }, 
    {
        "content": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "intTime": 20090310, 
        "postID": 40, 
        "quote": "", 
        "reply": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "LHA_3Rusty"
    }, 
    {
        "content": "Where were these people born? quote: One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090310, 
        "postID": 41, 
        "quote": "One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case.", 
        "reply": "Where were these people born?  \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 04:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "intTime": 20090310, 
        "postID": 42, 
        "quote": "", 
        "reply": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "intTime": 20090310, 
        "postID": 43, 
        "quote": "", 
        "reply": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "intTime": 20090310, 
        "postID": 44, 
        "quote": "", 
        "reply": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing in public Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "intTime": 20090310, 
        "postID": 45, 
        "quote": "Women should be hit for wearing sexy clothing in public", 
        "reply": " Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:15:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fredette"
    }, 
    {
        "content": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 46, 
        "quote": "", 
        "reply": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 47, 
        "quote": "", 
        "reply": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....) Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "intTime": 20090310, 
        "postID": 48, 
        "quote": "Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "reply": " Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those. It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "intTime": 20090310, 
        "postID": 49, 
        "quote": "Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "reply": " It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:38:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "intTime": 20090310, 
        "postID": 50, 
        "quote": "", 
        "reply": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:53:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: There are some mean as hell women out there . You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "intTime": 20090310, 
        "postID": 51, 
        "quote": "Originally posted by Wolfhound_1968: There are some mean as hell women out there .", 
        "reply": " You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Most physical violence would be avoided if a woman would learn when to shut up and stop nagging. What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "intTime": 20090310, 
        "postID": 52, 
        "quote": "Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "reply": " What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:44:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "intTime": 20090310, 
        "postID": 53, 
        "quote": "", 
        "reply": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "intTime": 20090310, 
        "postID": 54, 
        "quote": "", 
        "reply": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing Do you mean like “I’d hit that/it”?", 
        "intTime": 20090310, 
        "postID": 55, 
        "quote": "Women should be hit for wearing sexy clothing", 
        "reply": " Do you mean like “I’d hit that/it”?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 56, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": "", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:11:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "intTime": 20090310, 
        "postID": 57, 
        "quote": "", 
        "reply": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:14:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: The findings of the poll, conducted for the Home Office Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 58, 
        "quote": "The findings of the poll, conducted for the Home Office", 
        "reply": " Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:00:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don ....yes, I would hit it....wait.....what?....", 
        "intTime": 20090310, 
        "postID": 59, 
        "quote": "Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": " ....yes, I would hit it....wait.....what?....", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "VDoP"
    }, 
    {
        "content": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "intTime": 20090310, 
        "postID": 60, 
        "quote": "", 
        "reply": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "LHA_3Rusty"
    }, 
    {
        "content": "Where were these people born? quote: One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090310, 
        "postID": 61, 
        "quote": "One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case.", 
        "reply": "Where were these people born?  \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 04:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "intTime": 20090310, 
        "postID": 62, 
        "quote": "", 
        "reply": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "intTime": 20090310, 
        "postID": 63, 
        "quote": "", 
        "reply": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "intTime": 20090310, 
        "postID": 64, 
        "quote": "", 
        "reply": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing in public Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "intTime": 20090310, 
        "postID": 65, 
        "quote": "Women should be hit for wearing sexy clothing in public", 
        "reply": " Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:15:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fredette"
    }, 
    {
        "content": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 66, 
        "quote": "", 
        "reply": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 67, 
        "quote": "", 
        "reply": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....) Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "intTime": 20090310, 
        "postID": 68, 
        "quote": "Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "reply": " Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those. It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "intTime": 20090310, 
        "postID": 69, 
        "quote": "Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "reply": " It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:38:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "intTime": 20090310, 
        "postID": 70, 
        "quote": "", 
        "reply": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:53:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: There are some mean as hell women out there . You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "intTime": 20090310, 
        "postID": 71, 
        "quote": "Originally posted by Wolfhound_1968: There are some mean as hell women out there .", 
        "reply": " You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Most physical violence would be avoided if a woman would learn when to shut up and stop nagging. What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "intTime": 20090310, 
        "postID": 72, 
        "quote": "Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "reply": " What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:44:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "intTime": 20090310, 
        "postID": 73, 
        "quote": "", 
        "reply": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "intTime": 20090310, 
        "postID": 74, 
        "quote": "", 
        "reply": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing Do you mean like “I’d hit that/it”?", 
        "intTime": 20090310, 
        "postID": 75, 
        "quote": "Women should be hit for wearing sexy clothing", 
        "reply": " Do you mean like “I’d hit that/it”?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 76, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": "", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:11:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "intTime": 20090310, 
        "postID": 77, 
        "quote": "", 
        "reply": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:14:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: The findings of the poll, conducted for the Home Office Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 78, 
        "quote": "The findings of the poll, conducted for the Home Office", 
        "reply": " Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:00:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don ....yes, I would hit it....wait.....what?....", 
        "intTime": 20090310, 
        "postID": 79, 
        "quote": "Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": " ....yes, I would hit it....wait.....what?....", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "VDoP"
    }, 
    {
        "content": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "intTime": 20090310, 
        "postID": 80, 
        "quote": "", 
        "reply": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "LHA_3Rusty"
    }, 
    {
        "content": "Where were these people born? quote: One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090310, 
        "postID": 81, 
        "quote": "One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case.", 
        "reply": "Where were these people born?  \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 04:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "intTime": 20090310, 
        "postID": 82, 
        "quote": "", 
        "reply": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "intTime": 20090310, 
        "postID": 83, 
        "quote": "", 
        "reply": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "intTime": 20090310, 
        "postID": 84, 
        "quote": "", 
        "reply": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing in public Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "intTime": 20090310, 
        "postID": 85, 
        "quote": "Women should be hit for wearing sexy clothing in public", 
        "reply": " Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:15:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fredette"
    }, 
    {
        "content": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 86, 
        "quote": "", 
        "reply": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 87, 
        "quote": "", 
        "reply": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....) Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "intTime": 20090310, 
        "postID": 88, 
        "quote": "Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "reply": " Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those. It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "intTime": 20090310, 
        "postID": 89, 
        "quote": "Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "reply": " It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:38:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "intTime": 20090310, 
        "postID": 90, 
        "quote": "", 
        "reply": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:53:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: There are some mean as hell women out there . You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "intTime": 20090310, 
        "postID": 91, 
        "quote": "Originally posted by Wolfhound_1968: There are some mean as hell women out there .", 
        "reply": " You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Most physical violence would be avoided if a woman would learn when to shut up and stop nagging. What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "intTime": 20090310, 
        "postID": 92, 
        "quote": "Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "reply": " What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:44:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "intTime": 20090310, 
        "postID": 93, 
        "quote": "", 
        "reply": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "intTime": 20090310, 
        "postID": 94, 
        "quote": "", 
        "reply": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing Do you mean like “I’d hit that/it”?", 
        "intTime": 20090310, 
        "postID": 95, 
        "quote": "Women should be hit for wearing sexy clothing", 
        "reply": " Do you mean like “I’d hit that/it”?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 96, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": "", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:11:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "intTime": 20090310, 
        "postID": 97, 
        "quote": "", 
        "reply": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:14:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: The findings of the poll, conducted for the Home Office Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 98, 
        "quote": "The findings of the poll, conducted for the Home Office", 
        "reply": " Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:00:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don ....yes, I would hit it....wait.....what?....", 
        "intTime": 20090310, 
        "postID": 99, 
        "quote": "Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": " ....yes, I would hit it....wait.....what?....", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "VDoP"
    }, 
    {
        "content": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "intTime": 20090310, 
        "postID": 100, 
        "quote": "", 
        "reply": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "LHA_3Rusty"
    }, 
    {
        "content": "Where were these people born? quote: One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090310, 
        "postID": 101, 
        "quote": "One in seven people believe it is acceptable in some circumstances for a man to hit his wife or girlfriend if she is dressed in “sexy or revealing clothes in public”, according to the findings of a survey released today. A similar number believed that it was all right for a man to slap his wife or girlfriend if she is “nagging or constantly moaning at him”. The findings of the poll, conducted for the Home Office, also disclosed about a quarter of people believe that wearing sexy or revealing clothing should lead to a woman being held partly responsible for being raped or sexually assaulted. Although a majority of 1,065 people over 18 questioned last month believe that it is never acceptable to hit or slap a woman, the poll found that those aged 25-39 were more likely to consider that there were circumstances in which it was acceptable to hit or slap a woman. Men and women over 65 and those in the lower social class groups D and E are more likely to believe that woman should be held partly responsible for being raped or sexually assaulted, Ipsos Mori telephone poll found. Jacqui Smith, the Home Secretary, said: “Violence against women and girls is unacceptable in any form no matter what the circumstances are.” Ms Smith said that more needed to be done to challenge attitudes that condoned violence against women and girls. She was speaking as she launched a police lead review of whether new laws are needed to tackle serial domestic violence abuses and whether there is a link between the early sexualisation of young girls and violent abuse. One idea being considered is to allow women to ask police if a new partner has a record of domestic violence. A pilot scheme that allows women to request information on whether a new partner has a history of child sex abuse is currently underway in four police force areas of England and Wales. But Ms Smith was confronted at a working breakfast at which she launched the campaign by a veteran domestic violence campaigner. Sandra Horley, chief executive of Refuge, accused Ms Smith over breakfast at the Cinnamon Club in Westminster of using “gimmicks” and “spin”. She said that government action so far had been “piecemeal” and condemned plans for a database of serial domestic abusers. Ms Horley said: “We have had enough talking – we need action. As for the perpetrators’ register, it is a gimmick and doesn’t address the root problem. “The majority of violent men don’t come to the attention of police and it won’t keep women safe. “Police can’t be expected to monitor relationships and love lives of offenders.” She went on: ”The Government is hoping to get away with useless initiatives like this register and it is hypocritical to sound tough and do little.” She said that the cases of Sabina Akhtar and Katie Summers showed that not enough was being done. Ms Smith tried to interrupt the tirade but was shouted down before Vera Baird, the solicitor general, stepped in to argue the Government’s case.", 
        "reply": "Where were these people born?  \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 04:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "intTime": 20090310, 
        "postID": 102, 
        "quote": "", 
        "reply": "Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "stillkit"
    }, 
    {
        "content": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "intTime": 20090310, 
        "postID": 103, 
        "quote": "", 
        "reply": "It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "intTime": 20090310, 
        "postID": 104, 
        "quote": "", 
        "reply": "well im not for this but heres somehting for thought.. i was with a girl, on a secluded island. she was sunbathing topless. and wouldnt you know the marine state troopers happened to stop bye. I.. I got a ticket because my boat was bow on shore and it was a wildlife preserve, she gets a cops number.. now.. if that had been me out there in all my glory, i would have been arrested for indecent exposue, taken to jail and probably been charged a sex offender. girls get away with damn near everything", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing in public Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "intTime": 20090310, 
        "postID": 105, 
        "quote": "Women should be hit for wearing sexy clothing in public", 
        "reply": " Typo I do it all the time, you skipped a two letter word while typing. quote: Women should be hit on for wearing sexy clothing in public See how much better that is. Matter a Fact we could shorten the title, like so. Women should be hit on. Women, the only game in Town.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 06:15:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fredette"
    }, 
    {
        "content": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 106, 
        "quote": "", 
        "reply": "Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 107, 
        "quote": "", 
        "reply": "It's not a good reason for anyone to wear alluring clothing (this includes members of both genders) in public. I don't agree that anyone should be raped because of the clothing they wear. The animals who can't keep it in their pants need to be punished to the fullest extent of the law! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:35:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....) Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "intTime": 20090310, 
        "postID": 108, 
        "quote": "Originally posted by fmfdoc451: It's really sad when society (ANY society) advocates the abuse of females. I was raised that IF i ever hit a female, my father would beat me. Given the physical difference between the sexes, there is (in most cases) a truely unfair advantage when it comes to physical domination! IF a man has more than two brain cells, they can handle the situation with means other than physical violence. It matters not if it's your sister, wife, cousin, gf/so....... IF there is any situation which you find you cannot deal with at all----- walk the H--- Away!!!! Self protection is the same way: protect yourself, while you extricate yourself from the situation, but, leave her azz! It takes a truely amoral whimp, to beat on some one smaller, weeker, less dignified- REGARDLESS of race/creed/color/sex. And, NO, I do mean to imply that anyone other than myself, is always weeker, smaller, or less diginified. It's just that some of those charachteristics are always present, when a man goes to the physical domination/stop-thinking mode! (No, I'm no saint....)", 
        "reply": " Physical violence is never acceptable. Man should never hit a woman and a woman should never hit or slap a man! I don't believe in physical violence against either gender. With that said is it acceptable in the following: If a woman slaps a man with very little reason is it okay for a man to hit her back? If she initiated physical violence can a man defend himself? Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:37:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those. It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "intTime": 20090310, 
        "postID": 109, 
        "quote": "Originally posted by stillkit: Where were they born? Obviously not here as that survey was done by the Home Office. We don't have one of those.", 
        "reply": " It's the UK; the Cinnamon Club is in London. However, there are those who would pillory women here in the same manner.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:38:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "intTime": 20090310, 
        "postID": 110, 
        "quote": "", 
        "reply": "I don’t believe in hitting women and have never hit one but I’m not going to let one beat me to death either. There are some mean as hell women out there sitting in jail for killing men. What perturbs me most is when a woman dresses sexy or very skimpy and then says, “What are YOU looking at”? I can assure you if she dressed like my grandma I wouldn’t give her a second glance.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 07:53:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: There are some mean as hell women out there . You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "intTime": 20090310, 
        "postID": 111, 
        "quote": "Originally posted by Wolfhound_1968: There are some mean as hell women out there .", 
        "reply": " You've MET my wife ??!!! (good thing she doesn't READ these posts or I'd be \"a dead man walking\")", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Most physical violence would be avoided if a woman would learn when to shut up and stop nagging. What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "intTime": 20090310, 
        "postID": 112, 
        "quote": "Most physical violence would be avoided if a woman would learn when to shut up and stop nagging.", 
        "reply": " What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around......", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 08:44:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "intTime": 20090310, 
        "postID": 113, 
        "quote": "", 
        "reply": "Don't want to spin this thread in a totally different direction, but there have been instances when women have worn very revealing or provocative clothing in the workplace, yet if a guy says anything that might be considered a come-on, or disgust, he can be slapped with a sexual harassment complaint and charge - - The man should be able counter-sue - and win.... Wandering and Wondering", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "intTime": 20090310, 
        "postID": 114, 
        "quote": "", 
        "reply": "What the heck ever happened to walk away?? I have, on one occassion, told a woman that she went to far, and that I didn't need her sheite, and left her azz..... didn't feel bad about it either! Strange how I didn't feel the need to smack her around...... [/QUOTE] I once went with one you couldn’t walk away from, she followed me like a hound dog. You don’t know the restraint it took to keep from shutting her mouth. A friend of mine use to lock himself in the car to get away from his and just get some sleep.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Women should be hit for wearing sexy clothing Do you mean like “I’d hit that/it”?", 
        "intTime": 20090310, 
        "postID": 115, 
        "quote": "Women should be hit for wearing sexy clothing", 
        "reply": " Do you mean like “I’d hit that/it”?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:08:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "intTime": 20090310, 
        "postID": 116, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": "", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:11:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "Knele"
    }, 
    {
        "content": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "intTime": 20090310, 
        "postID": 117, 
        "quote": "", 
        "reply": "Seems that the Brits are doing this to further the moslemization of their culture. I don't understand their rationale but it's their farm to give away...", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 09:14:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: The findings of the poll, conducted for the Home Office Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 118, 
        "quote": "The findings of the poll, conducted for the Home Office", 
        "reply": " Who are they? How was the test conducted? How were the questions posed? Do they have a method or agenda? What are some of their past polls and how have those polls measured up in the polling industry? Are they a reliable company, entity? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:00:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don ....yes, I would hit it....wait.....what?....", 
        "intTime": 20090310, 
        "postID": 119, 
        "quote": "Originally posted by Knele: quote: Originally posted by 21yrsUSCGUSCS: Remember Kyla Ebberts who was tossed off that Southwest Airlines flight for dressing \"too sexy\"? Don", 
        "reply": " ....yes, I would hit it....wait.....what?....", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:05:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "VDoP"
    }, 
    {
        "content": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "intTime": 20090310, 
        "postID": 120, 
        "quote": "", 
        "reply": "It's sad that the problem is always depicted as male-on-female, not the other way around, which happens more than most would ever imagine. Having been a law enforcement person, I've seen BOTH sides of the coin. Neither is pleasant, but the female offenders were/are often worse than many of the males. Setting their victims on fire, throwing scalding water on them and disfiguring them, cutting or cutting off extremities(guess what), throwing hot iron skillets at them, destroying costly property, etc. The media does not feel fit to display that side of the equation. However, it is a stark reality. In any event, any acts of abuse perpetrated by ANYONE are unacceptable. The best thing to avoid any such hassles is to stay single and avoid complicated entanglements with members of the opposite sex. One never knows about the mental \"baggage\" another person carries. One person's peace of mind is truly priceless, and easily compromised or lost by another person's intrusions and attempts to deprive them of that peace of mind. Sadly, the frailties of being human manifest themselves in many negative ways. Governments cannot ever legislate away stupidity or imprudence. Being accountable for one's actions is a solution. The \"blame\" falls on both sides, but it is never clearly black-and-white, easily differentiated or simple. That someone should be oppressed, harrassed or deprived of their liberties or happiness because others take offense or CHOOSE to be 'offended', as in the female Southwest passenger, is a sign that there are serious inhibitions and mental issues to be dealt with. Who CARES how someone else decides to dress? So WHAT! Get over it! If ya don't like it, DON'T LOOK AT IT! No one is holding a gun to anyone's head and FORCING those others to look! How clearly immature and peevishly intolerant are we being? I think we all need to leave others alone and get on with our own lives. When we try to impose our will and our limitations and inhibitions on others, this is called exercising unrighteous dominion over others. We are no better than closed-minded terrorists if we cannot leave others well enough alone. GET OVER IT and get on with your life! Deal with your own personal inhibitions...don't make them someone else's unwanted limitations because of an internal conflict/inferiority complex or a desire to make someone else as unhappy as you are. If some person dresses/acts in a way you don't like, ask yourself if you would like someone else to decide/judge how YOU dress and think, and force THEIR way upon you...put the shoe on the other foot. Leave him/her alone. Get over your quirky insecurities and your impulsive desire to force your views and your will on someone else who may not choose to see the world the way you do. That's not liberty. That's not right. Live and let live. Go your own way in peace. Deal with your personal inner conflicts and limitations yourself. Don't make them into someone else's misery because of your own insecurity, intolerance or your inability to accept others as they are.", 
        "threadID": "5291911282_8640024712001", 
        "time": "2009-03-10 11:21:00", 
        "title": "Women should be hit for wearing sexy clothing in public, one in seven believe", 
        "userID": "LHA_3Rusty"
    }
]