[
    {
        "content": "I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one?", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one?", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-11 19:13:00", 
        "title": "No physician?", 
        "userID": "rpmred09"
    }, 
    {
        "content": "quote: Originally posted by rpmred09: I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one? If you have no prior medical history you should be fine,IMO. If you ever saw a Doctor, get their name and address, maybe even phone number and dates seen. Or you could just say, last time I saw a Doctor, was when I was born , and the Doctor's name should be on your birth certificate. Ask your Mom if she ever paid for medical services for you, either in cash or through medical insurance, have her check her records, if any. Good luck.", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "Originally posted by rpmred09: I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one?", 
        "reply": " If you have no prior medical history you should be fine,IMO. If you ever saw a Doctor, get their name and address, maybe even phone number and dates seen. Or you could just say, last time I saw a Doctor, was when I was born , and the Doctor's name should be on your birth certificate. Ask your Mom if she ever paid for medical services for you, either in cash or through medical insurance, have her check her records, if any. Good luck.", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-11 19:26:00", 
        "title": "No physician?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "I wouldn't worry about it to much. Not everyone who joins the military has or had access to a doctor. Now your SSI card and Education record, that you better have. Good luck. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "", 
        "reply": "I wouldn't worry about it to much. Not everyone who joins the military has or had access to a doctor. Now your SSI card and Education record, that you better have. Good luck. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-11 19:36:00", 
        "title": "No physician?", 
        "userID": "DSTremf"
    }, 
    {
        "content": "Ask you mom she has a copy of your childhood health record. You should be good to go. You have no pre-exsisting illneses or conditons. Good luck. Let us know how you make out.", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "", 
        "reply": "Ask you mom she has a copy of your childhood health record. You should be good to go. You have no pre-exsisting illneses or conditons. Good luck. Let us know how you make out.", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-11 19:56:00", 
        "title": "No physician?", 
        "userID": "pipedreamsandbabies"
    }, 
    {
        "content": "quote: Originally posted by pipedreamsandbabies: Ask you mom she has a copy of your childhood health record. You should be good to go. You have no pre-exsisting illneses or conditons. Good luck. Let us know how you make out. Good point. You should have a immunization shot record. I mean...you have had your shots right?", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "Originally posted by pipedreamsandbabies: Ask you mom she has a copy of your childhood health record. You should be good to go. You have no pre-exsisting illneses or conditons. Good luck. Let us know how you make out.", 
        "reply": " Good point. You should have a immunization shot record. I mean...you have had your shots right?", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-11 20:02:00", 
        "title": "No physician?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by pipedreamsandbabies: Ask you mom she has a copy of your childhood health record. You should be good to go. You have no pre-exsisting illneses or conditons. Good luck. Let us know how you make out. Good point. You should have a immunization shot record. I mean...you have had your shots right? If he/she hasn't, they're about to!", 
        "intTime": 20090512, 
        "postID": 6, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by pipedreamsandbabies: Ask you mom she has a copy of your childhood health record. You should be good to go. You have no pre-exsisting illneses or conditons. Good luck. Let us know how you make out. Good point. You should have a immunization shot record. I mean...you have had your shots right?", 
        "reply": " If he/she hasn't, they're about to!", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-12 07:30:00", 
        "title": "No physician?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "If you have not had any health issues, you should be fine! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090512, 
        "postID": 7, 
        "quote": "", 
        "reply": "If you have not had any health issues, you should be fine! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-12 07:44:00", 
        "title": "No physician?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Originally posted by rpmred09: I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one? If you have no prior medical history you should be fine,IMO. If you ever saw a Doctor, get their name and address, maybe even phone number and dates seen. Or you could just say, last time I saw a Doctor, was when I was born , and the Doctor's name should be on your birth certificate. Ask your Mom if she ever paid for medical services for you, either in cash or through medical insurance, have her check her records, if any. Good luck. I talked to my recruiter today about this issue and he said not to worry about it. He asked if I have an immuzation card with the health unit's address on it. I do and I will use that when I go to MEPS.", 
        "intTime": 20090512, 
        "postID": 8, 
        "quote": "Originally posted by VeteranDad78: quote: Originally posted by rpmred09: I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one? If you have no prior medical history you should be fine,IMO. If you ever saw a Doctor, get their name and address, maybe even phone number and dates seen. Or you could just say, last time I saw a Doctor, was when I was born , and the Doctor's name should be on your birth certificate. Ask your Mom if she ever paid for medical services for you, either in cash or through medical insurance, have her check her records, if any. Good luck.", 
        "reply": " I talked to my recruiter today about this issue and he said not to worry about it. He asked if I have an immuzation card with the health unit's address on it. I do and I will use that when I go to MEPS.", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-12 17:27:00", 
        "title": "No physician?", 
        "userID": "rpmred09"
    }, 
    {
        "content": "quote: Originally posted by rpmred09: quote: Originally posted by VeteranDad78: quote: Originally posted by rpmred09: I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one? If you have no prior medical history you should be fine,IMO. If you ever saw a Doctor, get their name and address, maybe even phone number and dates seen. Or you could just say, last time I saw a Doctor, was when I was born , and the Doctor's name should be on your birth certificate. Ask your Mom if she ever paid for medical services for you, either in cash or through medical insurance, have her check her records, if any. Good luck. I talked to my recruiter today about this issue and he said not to worry about it. He asked if I have an immuzation card with the health unit's address on it. I do and I will use that when I go to MEPS. Godspeed and good luck", 
        "intTime": 20090512, 
        "postID": 9, 
        "quote": "Originally posted by rpmred09: quote: Originally posted by VeteranDad78: quote: Originally posted by rpmred09: I'm going to MEPS Wednesday and I don't have a physician because I never had anything wrong with me. I asked my mom about my medical history and she told me I never had anything wrong with me, thus involving me not having one as a kid. I would like to know would I still be able to join the National Guard without having one? If you have no prior medical history you should be fine,IMO. If you ever saw a Doctor, get their name and address, maybe even phone number and dates seen. Or you could just say, last time I saw a Doctor, was when I was born , and the Doctor's name should be on your birth certificate. Ask your Mom if she ever paid for medical services for you, either in cash or through medical insurance, have her check her records, if any. Good luck. I talked to my recruiter today about this issue and he said not to worry about it. He asked if I have an immuzation card with the health unit's address on it. I do and I will use that when I go to MEPS.", 
        "reply": " Godspeed and good luck", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-12 17:39:00", 
        "title": "No physician?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "You will for sure have one after Basic Training. Don't mind the Drill Sergeants, they don't want to be there anymore than you do. Drive On Recruit! Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090512, 
        "postID": 10, 
        "quote": "", 
        "reply": "You will for sure have one after Basic Training. Don't mind the Drill Sergeants, they don't want to be there anymore than you do. Drive On Recruit! Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-12 17:49:00", 
        "title": "No physician?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "When I went in they said, \"turn your head to left and cough\". That was it, I passed! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090513, 
        "postID": 11, 
        "quote": "", 
        "reply": "When I went in they said, \"turn your head to left and cough\". That was it, I passed! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-13 06:38:00", 
        "title": "No physician?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: When I went in they said, \"turn your head to left and cough\". That was it, I passed! What about bending over and spreading your cheeks? Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090513, 
        "postID": 12, 
        "quote": "Originally posted by Bergy46: When I went in they said, \"turn your head to left and cough\". That was it, I passed!", 
        "reply": " What about bending over and spreading your cheeks? Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-13 20:08:00", 
        "title": "No physician?", 
        "userID": "DSTremf"
    }, 
    {
        "content": "ALL Your Birth record has the hospital, docs name and date. If you can get the Kindergarten Health shot card, that has a Nurse and location data. Reading your post and others, seems like the problem? is solved Good Luck Fair winds and Following seas. Semper FI end", 
        "intTime": 20090514, 
        "postID": 13, 
        "quote": "", 
        "reply": "ALL Your Birth record has the hospital, docs name and date. If you can get the Kindergarten Health shot card, that has a Nurse and location data. Reading your post and others, seems like the problem? is solved Good Luck Fair winds and Following seas. Semper FI end", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-14 05:10:00", 
        "title": "No physician?", 
        "userID": "TennSlim"
    }, 
    {
        "content": "I got back from MEPS yesterday. They didn't even ask for any of that stuff at all. I passed the physical with flying colors, chose my MOS, did the processing, and swore in. My recruiter will call me Monday and tell me when I'll go to RSP, and I leave to go to Fort Sill, Ok. Jun 26 from New Orleans.", 
        "intTime": 20090515, 
        "postID": 14, 
        "quote": "", 
        "reply": "I got back from MEPS yesterday. They didn't even ask for any of that stuff at all. I passed the physical with flying colors, chose my MOS, did the processing, and swore in. My recruiter will call me Monday and tell me when I'll go to RSP, and I leave to go to Fort Sill, Ok. Jun 26 from New Orleans.", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-15 13:52:00", 
        "title": "No physician?", 
        "userID": "rpmred09"
    }, 
    {
        "content": "quote: Originally posted by DSTremf: quote: Originally posted by Bergy46: When I went in they said, \"turn your head to left and cough\". That was it, I passed! What about bending over and spreading your cheeks? Oh, I hated that part of the physical. It was so embarrassing and very uncomfortable. The doctor looked at us in a very creepy way while doing it. Lol", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "Originally posted by DSTremf: quote: Originally posted by Bergy46: When I went in they said, \"turn your head to left and cough\". That was it, I passed! What about bending over and spreading your cheeks?", 
        "reply": " Oh, I hated that part of the physical. It was so embarrassing and very uncomfortable. The doctor looked at us in a very creepy way while doing it. Lol", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-15 13:54:00", 
        "title": "No physician?", 
        "userID": "rpmred09"
    }, 
    {
        "content": "quote: Originally posted by rpmred09: I got back from MEPS yesterday. They didn't even ask for any of that stuff at all. I passed the physical with flying colors, chose my MOS, did the processing, and swore in. My recruiter will call me Monday and tell me when I'll go to RSP, and I leave to go to Fort Sill, Ok. Jun 26 from New Orleans. Congrats. Stay in shape and squared away...no slack", 
        "intTime": 20090515, 
        "postID": 16, 
        "quote": "Originally posted by rpmred09: I got back from MEPS yesterday. They didn't even ask for any of that stuff at all. I passed the physical with flying colors, chose my MOS, did the processing, and swore in. My recruiter will call me Monday and tell me when I'll go to RSP, and I leave to go to Fort Sill, Ok. Jun 26 from New Orleans.", 
        "reply": " Congrats. Stay in shape and squared away...no slack", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-15 17:28:00", 
        "title": "No physician?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "Congratulations! We have a lot of posers come around here asking questions, but you're the first one I can remember who came back and reported that you'd actually signed on the dotted line. Good job! Is Ft. Sill just for basic, or artillery OSUT?", 
        "intTime": 20090515, 
        "postID": 17, 
        "quote": "", 
        "reply": "Congratulations! We have a lot of posers come around here asking questions, but you're the first one I can remember who came back and reported that you'd actually signed on the dotted line. Good job! Is Ft. Sill just for basic, or artillery OSUT?", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-15 20:10:00", 
        "title": "No physician?", 
        "userID": "stillkit"
    }, 
    {
        "content": "I gotta ask my recruiter on Monday.", 
        "intTime": 20090515, 
        "postID": 18, 
        "quote": "", 
        "reply": "I gotta ask my recruiter on Monday.", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-15 20:31:00", 
        "title": "No physician?", 
        "userID": "rpmred09"
    }, 
    {
        "content": "quote: Originally posted by rpmred09: I gotta ask my recruiter on Monday. So far as I know, Artillery is the only OSUT program operating at Ft. Sill, so if you didn't sign up to be a \"cannon-cocker,\" it's probably just for basic training.", 
        "intTime": 20090515, 
        "postID": 19, 
        "quote": "Originally posted by rpmred09: I gotta ask my recruiter on Monday.", 
        "reply": " So far as I know, Artillery is the only OSUT program operating at Ft. Sill, so if you didn't sign up to be a \"cannon-cocker,\" it's probably just for basic training.", 
        "threadID": "5291911282_6400080322001", 
        "time": "2009-05-15 21:43:00", 
        "title": "No physician?", 
        "userID": "stillkit"
    }
]