[
    {
        "content": "I am 37 years old and had been trying to enlist in the WA arng. I had to have several medical waivers approved which I did over the course of 2 years. At the point of enlisting (I was actually signing the electronic signature pad) the arng liason who was working with me noticed I needed one more waiver. It was a moral waiver for some past drug use I did over 10 years ago. He said it would pass no problem I'll just have to wait about 4 more weeks. Ok no problem I thought, I'd come this far. Well about 3 weeks later my recruiter called and told me they lowered the age limit from 42 to 35! Is that correct? I worked for 2 years to get in and jumped through tons of hoops only to be told the age limit has gone down! The recruiter said even all those waiting on waivers were denied! WTF! What I really want to know is that correct and is it the same for the reserves or other branches? Please help me out i've tried too hard only to be turned down after 2 years.", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "I am 37 years old and had been trying to enlist in the WA arng. I had to have several medical waivers approved which I did over the course of 2 years. At the point of enlisting (I was actually signing the electronic signature pad) the arng liason who was working with me noticed I needed one more waiver. It was a moral waiver for some past drug use I did over 10 years ago. He said it would pass no problem I'll just have to wait about 4 more weeks. Ok no problem I thought, I'd come this far. Well about 3 weeks later my recruiter called and told me they lowered the age limit from 42 to 35! Is that correct? I worked for 2 years to get in and jumped through tons of hoops only to be told the age limit has gone down! The recruiter said even all those waiting on waivers were denied! WTF! What I really want to know is that correct and is it the same for the reserves or other branches? Please help me out i've tried too hard only to be turned down after 2 years.", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-28 02:01:00", 
        "title": "age limit army? true?", 
        "userID": "pullman92"
    }, 
    {
        "content": "Yes. It reverted back to 35 on 23 March. They changed it from 35 to 40 in 2006, and then they raised it to 42 not long after that. But now it has gone back to 35. You must be IN Basic by that age, ie: not just signed up, but serving your first day. This is for non-prior service - prior service stayed the same, age 43. It sucks ballz that you went through all this trouble just to get hit with last month's decision to lower the age standards back to pre-2006. I am so sorry, my friend. Still, you MAY be able to get an age waiver based on the fact that you have been in the system before the change. I don't know that you can, but if I were in your shoes I'd be demanding one for all the effort already put in. Let us know how it goes, ok? Remember, where one recruiter won't do for you, there are a million more that might. Don't stop looking at different recruiters until you find the one that will do anything to sign you up. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yes. It reverted back to 35 on 23 March. They changed it from 35 to 40 in 2006, and then they raised it to 42 not long after that. But now it has gone back to 35. You must be IN Basic by that age, ie: not just signed up, but serving your first day. This is for non-prior service - prior service stayed the same, age 43. It sucks ballz that you went through all this trouble just to get hit with last month's decision to lower the age standards back to pre-2006. I am so sorry, my friend. Still, you MAY be able to get an age waiver based on the fact that you have been in the system before the change. I don't know that you can, but if I were in your shoes I'd be demanding one for all the effort already put in. Let us know how it goes, ok? Remember, where one recruiter won't do for you, there are a million more that might. Don't stop looking at different recruiters until you find the one that will do anything to sign you up. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-28 04:48:00", 
        "title": "age limit army? true?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Ask your question HERE We wish you the very best. Please keep us posted. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "", 
        "reply": "Ask your question HERE We wish you the very best. Please keep us posted. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-28 06:39:00", 
        "title": "age limit army? true?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by pullman92: I am 37 years old and had been trying to enlist in the WA arng. I had to have several medical waivers approved which I did over the course of 2 years. At the point of enlisting (I was actually signing the electronic signature pad) the arng liason who was working with me noticed I needed one more waiver. It was a moral waiver for some past drug use I did over 10 years ago. He said it would pass no problem I'll just have to wait about 4 more weeks. Ok no problem I thought, I'd come this far. Well about 3 weeks later my recruiter called and told me they lowered the age limit from 42 to 35! Is that correct? I worked for 2 years to get in and jumped through tons of hoops only to be told the age limit has gone down! The recruiter said even all those waiting on waivers were denied! WTF! What I really want to know is that correct and is it the same for the reserves or other branches? Please help me out i've tried too hard only to be turned down after 2 years. Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090429, 
        "postID": 4, 
        "quote": "Originally posted by pullman92: I am 37 years old and had been trying to enlist in the WA arng. I had to have several medical waivers approved which I did over the course of 2 years. At the point of enlisting (I was actually signing the electronic signature pad) the arng liason who was working with me noticed I needed one more waiver. It was a moral waiver for some past drug use I did over 10 years ago. He said it would pass no problem I'll just have to wait about 4 more weeks. Ok no problem I thought, I'd come this far. Well about 3 weeks later my recruiter called and told me they lowered the age limit from 42 to 35! Is that correct? I worked for 2 years to get in and jumped through tons of hoops only to be told the age limit has gone down! The recruiter said even all those waiting on waivers were denied! WTF! What I really want to know is that correct and is it the same for the reserves or other branches? Please help me out i've tried too hard only to be turned down after 2 years.", 
        "reply": " Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-29 10:26:00", 
        "title": "age limit army? true?", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "As soon as things heat up more in Afghanistan or some other place, and enlistments drop off again, expect \"Change 2 to Plan B\" - - Wandering and Wondering", 
        "intTime": 20090429, 
        "postID": 5, 
        "quote": "", 
        "reply": "As soon as things heat up more in Afghanistan or some other place, and enlistments drop off again, expect \"Change 2 to Plan B\" - - Wandering and Wondering", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-29 13:58:00", 
        "title": "age limit army? true?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed.", 
        "reply": " <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-30 01:34:00", 
        "title": "age limit army? true?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. Stop Loss????? I got out (retired) in 03. Five days before it all started. There was no stop loss here. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row.", 
        "reply": " Stop Loss????? I got out (retired) in 03. Five days before it all started. There was no stop loss here. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-30 09:59:00", 
        "title": "age limit army? true?", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "quote: Originally posted by sethkonigsbergrn: quote: Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. Stop Loss????? I got out (retired) in 03. Five days before it all started. There was no stop loss here. I didn't mean you specifically, bro. I was referencing the stop loss program itself. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "Originally posted by sethkonigsbergrn: quote: Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. Stop Loss????? I got out (retired) in 03. Five days before it all started. There was no stop loss here.", 
        "reply": " I didn't mean you specifically, bro. I was referencing the stop loss program itself. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-30 10:15:00", 
        "title": "age limit army? true?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Seth, I hereby officially rescind my marriage proposal. As a young lass of merely 62, I resent being called OLD.", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "", 
        "reply": "Seth, I hereby officially rescind my marriage proposal. As a young lass of merely 62, I resent being called OLD.", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-30 11:23:00", 
        "title": "age limit army? true?", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Seth, I hereby officially rescind my marriage proposal. As a young lass of merely 62, I resent being called OLD. I call next in line! I call next in line! 62? You're not old - you're just finally ready to teach us 40-year olds! I like feet, long walks, the beach, and beer (ok, maybe the last one is out of your grasp). I sweet talk to the best of them, and I do windows. I'm ticklish and sincere, and I prefer candlelight over spotlights. What ails me you can cure. What hurts you I can shoulder. What we feel can be each other. Pardon me - I need to be alone. (Yeah, our politics differ. But I will never not remember what you do for this country. Thank you) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "Originally posted by Cider33_Alpha: Seth, I hereby officially rescind my marriage proposal. As a young lass of merely 62, I resent being called OLD.", 
        "reply": " I call next in line! I call next in line! 62? You're not old - you're just finally ready to teach us 40-year olds! I like feet, long walks, the beach, and beer (ok, maybe the last one is out of your grasp). I sweet talk to the best of them, and I do windows. I'm ticklish and sincere, and I prefer candlelight over spotlights. What ails me you can cure. What hurts you I can shoulder. What we feel can be each other. Pardon me - I need to be alone. (Yeah, our politics differ. But I will never not remember what you do for this country. Thank you) It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-30 12:01:00", 
        "title": "age limit army? true?", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "She is not telling the truth about her age. She has only been back on active duty for a few months and she celebrated her 39th birthday right before she returned to active duty. How can that be possible, you ask? She's an army brat and they can do anything. Now, Cider isn't that right? God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "", 
        "reply": "She is not telling the truth about her age. She has only been back on active duty for a few months and she celebrated her 39th birthday right before she returned to active duty. How can that be possible, you ask? She's an army brat and they can do anything. Now, Cider isn't that right? God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-04-30 13:46:00", 
        "title": "age limit army? true?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: quote: Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. Stop Loss????? I got out (retired) in 03. Five days before it all started. There was no stop loss here. I didn't mean you specifically, bro. I was referencing the stop loss program itself. So was I. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: quote: Originally posted by FollowMeInfantry: quote: Originally posted by sethkonigsbergrn: Sorry Old Man, And the funny part is old folks in their 50s and 60s and being recalled and deployed. <Snipped for brevity> Funny, ain't it? Stop loss exists where standards are strict. A young man that wants to serve is denied whereas an old man that doesn't is recalled. I love the military, but let's face it: sometimes their ducks ain't exactly in a row. Stop Loss????? I got out (retired) in 03. Five days before it all started. There was no stop loss here. I didn't mean you specifically, bro. I was referencing the stop loss program itself.", 
        "reply": " So was I. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-05-08 09:13:00", 
        "title": "age limit army? true?", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Seth, I hereby officially rescind my marriage proposal. As a young lass of merely 62, I resent being called OLD. 62? I never would have guessed. I was joking however, I guess some things get lost text. My apologies if I offeneded you. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by Cider33_Alpha: Seth, I hereby officially rescind my marriage proposal. As a young lass of merely 62, I resent being called OLD.", 
        "reply": " 62? I never would have guessed. I was joking however, I guess some things get lost text. My apologies if I offeneded you. \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_3100059122001", 
        "time": "2009-05-08 09:15:00", 
        "title": "age limit army? true?", 
        "userID": "sethkonigsbergrn"
    }
]