[
    {
        "content": "Hi, I'm hoping some one can help me. Yes I can. Post this in missin persons and you will do better. MD Paulette This message has been edited. Last edited by: mainedawg, Tue 26 May 2009 07:35 PM", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "Hi, I'm hoping some one can help me. Yes I can. Post this in missin persons and you will do better. MD Paulette This message has been edited. Last edited by: mainedawg, Tue 26 May 2009 07:35 PM", 
        "threadID": "5291911282_2240053422001", 
        "time": "2009-05-26 19:08:00", 
        "title": "family research", 
        "userID": "pbcoppenrath"
    }, 
    {
        "content": "quote: Originally posted by pbcoppenrath: Hi, I'm hoping some one can help me. I've been searching for my mother for over 35 years and the only information i have is that she married a US Serviceman in Germany in 1960. Her name was Paulette and his name was Vernon and that's all I know. Any leads or help as to where I can go with my search would be greatly appreciated. This has been a long and heartbreaking search for me, so i'm hoping some-one can give me a suggestion. Kindest Regards Paulette First, you need to know his last name.If you know what branch of military he was in, that would help. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "Originally posted by pbcoppenrath: Hi, I'm hoping some one can help me. I've been searching for my mother for over 35 years and the only information i have is that she married a US Serviceman in Germany in 1960. Her name was Paulette and his name was Vernon and that's all I know. Any leads or help as to where I can go with my search would be greatly appreciated. This has been a long and heartbreaking search for me, so i'm hoping some-one can give me a suggestion. Kindest Regards Paulette", 
        "reply": " First, you need to know his last name.If you know what branch of military he was in, that would help. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2240053422001", 
        "time": "2009-05-26 19:23:00", 
        "title": "family research", 
        "userID": "Bergy46"
    }
]