[
    {
        "content": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "intTime": 20090303, 
        "postID": 1, 
        "quote": "", 
        "reply": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:20:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Please send me an e-mail with the information on this individual.", 
        "intTime": 20090303, 
        "postID": 2, 
        "quote": "", 
        "reply": "Please send me an e-mail with the information on this individual.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:46:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "http://profile.military.com/member/view.do?memberId=7337460", 
        "intTime": 20090303, 
        "postID": 3, 
        "quote": "", 
        "reply": "http://profile.military.com/member/view.do?memberId=7337460", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:02:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "intTime": 20090303, 
        "postID": 4, 
        "quote": "", 
        "reply": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:11:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "intTime": 20090303, 
        "postID": 5, 
        "quote": "", 
        "reply": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:15:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "I sure wished there was a way to see what this person has posted.", 
        "intTime": 20090303, 
        "postID": 6, 
        "quote": "", 
        "reply": "I sure wished there was a way to see what this person has posted.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:24:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "", 
        "reply": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:28:00", 
        "title": "all four branches of the military?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 8, 
        "quote": "", 
        "reply": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "", 
        "reply": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "", 
        "reply": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited.", 
        "reply": " Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "", 
        "reply": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:39:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion.", 
        "reply": " Identified and tracking.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:58:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking. I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "reply": " I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:05:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week.", 
        "reply": " Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:10:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "in all four branches", 
        "reply": " There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 13:52:00", 
        "title": "all four branches of the military?", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds.", 
        "reply": " Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:36:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "intTime": 20090303, 
        "postID": 18, 
        "quote": "", 
        "reply": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:37:00", 
        "title": "all four branches of the military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "intTime": 20090305, 
        "postID": 19, 
        "quote": "", 
        "reply": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:44:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "intTime": 20090305, 
        "postID": 20, 
        "quote": "Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military.", 
        "reply": " Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:49:00", 
        "title": "all four branches of the military?", 
        "userID": "stillkit"
    }, 
    {
        "content": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "intTime": 20090303, 
        "postID": 21, 
        "quote": "", 
        "reply": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:20:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Please send me an e-mail with the information on this individual.", 
        "intTime": 20090303, 
        "postID": 22, 
        "quote": "", 
        "reply": "Please send me an e-mail with the information on this individual.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:46:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "http://profile.military.com/member/view.do?memberId=7337460", 
        "intTime": 20090303, 
        "postID": 23, 
        "quote": "", 
        "reply": "http://profile.military.com/member/view.do?memberId=7337460", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:02:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "intTime": 20090303, 
        "postID": 24, 
        "quote": "", 
        "reply": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:11:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "intTime": 20090303, 
        "postID": 25, 
        "quote": "", 
        "reply": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:15:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "I sure wished there was a way to see what this person has posted.", 
        "intTime": 20090303, 
        "postID": 26, 
        "quote": "", 
        "reply": "I sure wished there was a way to see what this person has posted.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:24:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "intTime": 20090303, 
        "postID": 27, 
        "quote": "", 
        "reply": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:28:00", 
        "title": "all four branches of the military?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 28, 
        "quote": "", 
        "reply": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "intTime": 20090303, 
        "postID": 29, 
        "quote": "", 
        "reply": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "intTime": 20090303, 
        "postID": 30, 
        "quote": "", 
        "reply": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 31, 
        "quote": "Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited.", 
        "reply": " Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 32, 
        "quote": "", 
        "reply": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:39:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "intTime": 20090303, 
        "postID": 33, 
        "quote": "Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion.", 
        "reply": " Identified and tracking.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:58:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking. I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 34, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "reply": " I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:05:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week.", 
        "reply": " Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:10:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "in all four branches", 
        "reply": " There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 13:52:00", 
        "title": "all four branches of the military?", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds.", 
        "reply": " Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:36:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "", 
        "reply": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:37:00", 
        "title": "all four branches of the military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "intTime": 20090305, 
        "postID": 39, 
        "quote": "", 
        "reply": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:44:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "intTime": 20090305, 
        "postID": 40, 
        "quote": "Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military.", 
        "reply": " Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:49:00", 
        "title": "all four branches of the military?", 
        "userID": "stillkit"
    }, 
    {
        "content": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "intTime": 20090303, 
        "postID": 41, 
        "quote": "", 
        "reply": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:20:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Please send me an e-mail with the information on this individual.", 
        "intTime": 20090303, 
        "postID": 42, 
        "quote": "", 
        "reply": "Please send me an e-mail with the information on this individual.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:46:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "http://profile.military.com/member/view.do?memberId=7337460", 
        "intTime": 20090303, 
        "postID": 43, 
        "quote": "", 
        "reply": "http://profile.military.com/member/view.do?memberId=7337460", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:02:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "intTime": 20090303, 
        "postID": 44, 
        "quote": "", 
        "reply": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:11:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "intTime": 20090303, 
        "postID": 45, 
        "quote": "", 
        "reply": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:15:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "I sure wished there was a way to see what this person has posted.", 
        "intTime": 20090303, 
        "postID": 46, 
        "quote": "", 
        "reply": "I sure wished there was a way to see what this person has posted.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:24:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "intTime": 20090303, 
        "postID": 47, 
        "quote": "", 
        "reply": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:28:00", 
        "title": "all four branches of the military?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 48, 
        "quote": "", 
        "reply": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "intTime": 20090303, 
        "postID": 49, 
        "quote": "", 
        "reply": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "intTime": 20090303, 
        "postID": 50, 
        "quote": "", 
        "reply": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 51, 
        "quote": "Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited.", 
        "reply": " Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 52, 
        "quote": "", 
        "reply": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:39:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "intTime": 20090303, 
        "postID": 53, 
        "quote": "Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion.", 
        "reply": " Identified and tracking.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:58:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking. I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 54, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "reply": " I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:05:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 55, 
        "quote": "Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week.", 
        "reply": " Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:10:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090303, 
        "postID": 56, 
        "quote": "in all four branches", 
        "reply": " There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 13:52:00", 
        "title": "all four branches of the military?", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 57, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds.", 
        "reply": " Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:36:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "intTime": 20090303, 
        "postID": 58, 
        "quote": "", 
        "reply": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:37:00", 
        "title": "all four branches of the military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "intTime": 20090305, 
        "postID": 59, 
        "quote": "", 
        "reply": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:44:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "intTime": 20090305, 
        "postID": 60, 
        "quote": "Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military.", 
        "reply": " Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:49:00", 
        "title": "all four branches of the military?", 
        "userID": "stillkit"
    }, 
    {
        "content": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "intTime": 20090303, 
        "postID": 61, 
        "quote": "", 
        "reply": "had a guy tell me he was an officer in all four branches of the military. an officer, at that. is this possible? name? Emperor Frederick Von Seidl yep, he posted his ribbons, medals, etc here on military.com has anyone ever heard of him? served with him? am i out of line for calling him a fake warrior, on my site?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:20:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Please send me an e-mail with the information on this individual.", 
        "intTime": 20090303, 
        "postID": 62, 
        "quote": "", 
        "reply": "Please send me an e-mail with the information on this individual.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 10:46:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "http://profile.military.com/member/view.do?memberId=7337460", 
        "intTime": 20090303, 
        "postID": 63, 
        "quote": "", 
        "reply": "http://profile.military.com/member/view.do?memberId=7337460", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:02:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "intTime": 20090303, 
        "postID": 64, 
        "quote": "", 
        "reply": "yep, that's it. i noticed he has good conducts for army, navy and marines. back in the day, you had to serve 4 years active duty to get one.. they have since changed it (at least navy) to 3 years. but he tells me he served either a little, or less than 10 years. and if i remember right, aren't enlisted the only ones to get good conducts?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:11:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "intTime": 20090303, 
        "postID": 65, 
        "quote": "", 
        "reply": "Cindy, thanks for the info. Leslie, we'll be checking into this person. And as far as I know, you're correct about the Good Conduct ribbons.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:15:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "I sure wished there was a way to see what this person has posted.", 
        "intTime": 20090303, 
        "postID": 66, 
        "quote": "", 
        "reply": "I sure wished there was a way to see what this person has posted.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:24:00", 
        "title": "all four branches of the military?", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "intTime": 20090303, 
        "postID": 67, 
        "quote": "", 
        "reply": "Here are a few goodies for you: \"http://www.alivenotdead.com/emperor/details.html\" \"http://www.imdb.com/name/nm2732248/bio\" \"http://movies.nytimes.com/person/1553854/Emperor-Frederick-Von-Seidl/filmography\"", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:28:00", 
        "title": "all four branches of the military?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 68, 
        "quote": "", 
        "reply": "Here are some more. “http://www.imdb.com/name/nm2732248/bio” “http://www.hollywood.com/celebrity/Emperor_Frederick_Von_Seidl/5106720” “http://www.weblo.com/celebrity/available/Emperor_Frederick_Von_Seidl/636903/” How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "intTime": 20090303, 
        "postID": 69, 
        "quote": "", 
        "reply": "i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. I appreciate you providing the link. I edited it so there wouldn't be any argument since hot links/direct links aren't allowed. We'll follow up on this. Posting the info on the Army Forums like you have done will also help to get some answers. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:38 AM", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:31:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "intTime": 20090303, 
        "postID": 70, 
        "quote": "", 
        "reply": "yep. know about the hollywood stuff. but what about the military thing. he never mentions it. other than to argue about it. makes you wonder why.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited. Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 71, 
        "quote": "Originally posted by pita45: i'm not trying to promote my site. and i hope i have it set up so you can read, without being a member. \"groups.yahoo.com/group/fakewarriors/\" this is the site that has his words, and mine. nothing edited.", 
        "reply": " Dude, disable the hot link before the mods make you peel spuds for a week. \"http://groups.yahoo.com/group/fakewarriors/]http://groups.yahoo.com/group/fakewarriors/\" It's ok, Vic, I'm the one who asked for the info. This message has been edited. Last edited by: gypsysnipe, Tue 03 March 2009 11:40 AM How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:38:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 72, 
        "quote": "", 
        "reply": "there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:39:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "intTime": 20090303, 
        "postID": 73, 
        "quote": "Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion.", 
        "reply": " Identified and tracking.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 11:58:00", 
        "title": "all four branches of the military?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking. I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 74, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by m551sheridan: there was another poster here the other day in the Jane Fonda thread. In that thread I was interested in seeing if the most damming post were folks who were in country or even a part of that generation so I checked their profiles. This one said he was an E5 in the National Guard but his badges included officers cap badge and his ribbons included Navy, Marine, Army and Coast Guard - could be... since then I do look at \"New Member\" profiles on occasion. Identified and tracking.", 
        "reply": " I don't know if I did good or bad but I did push the yellow triangle thingie.... oh, and if in your research you find the party to be guilty what happens then? Curious minds want to know. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:05:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090303, 
        "postID": 75, 
        "quote": "Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week.", 
        "reply": " Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 12:10:00", 
        "title": "all four branches of the military?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090303, 
        "postID": 76, 
        "quote": "in all four branches", 
        "reply": " There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. We have a dear friend who served as an officer in all five branches. Here how how it went for him. He was an army ROTC graduate and received his commission in the army. He got out after three years and enrolled in seminary. The air force reserve accepted him so he could be a Chaplin for them and the CAP during his seminary days. However upon receiving his doctorate the AF didn't have an open slot for his denominations.. You guessed it, the navy did. Because he was a cavalry line officer in army the navy detailed him to the marines for his first duty assignment. He landed with the marines during desert storm. When he returned the chief of chaplains for the navy realized as he stated it \"A once in a life time opportunity and ask him how he would feel about having another uniform in his sea bag.\" he accepted, of course, and was detailed to the Coast Guard. About ten years ago, he retired as a navy-captain chaplain at Paris Island with 30 years active duty. There was a big story about him in the military time, all of them. I think it said he it was only the third person since some time before WW2 to serve as an officer in all five branches, If you dig deep enough you can find the story. I don’t have his permission to share his name. The coast guard and marine use the navy chaplains. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 13:52:00", 
        "title": "all four branches of the military?", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds. Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090303, 
        "postID": 77, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Vicdude: Dude, disable the hot link before the mods make you peel spuds for a week. Vic...... todays troops would most likely say \"no sweat GI\". Why? One, because I don't think there are KP's anymore and Two, they now have a machine which does the peeling... no more paring knives, a bucket and a quintillion pounds of spuds.", 
        "reply": " Like wow man, I guess I'm letting my past show. No more KP? My God what has the military come to? Next you're going to tell be that Beetle Bailey has mustered out? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:36:00", 
        "title": "all four branches of the military?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "intTime": 20090303, 
        "postID": 78, 
        "quote": "", 
        "reply": "On the yahoo group site, he claims to have \"Brugada Disease\" which is actually Brugada Syndrome. This is a form of arrhythmia, so wouldn't that have been a medical disqualification for service?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-03 14:37:00", 
        "title": "all four branches of the military?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "intTime": 20090305, 
        "postID": 79, 
        "quote": "", 
        "reply": "so, is this guy legit? am i out of line? or is he a stolen valor?", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:44:00", 
        "title": "all four branches of the military?", 
        "userID": "pita45"
    }, 
    {
        "content": "quote: Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military. Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "intTime": 20090305, 
        "postID": 80, 
        "quote": "Originally posted by OldArmyWOPA: quote: in all four branches There are five branches of the military, my daughter and granddaughter would like me if I didn't remind everyone that the Coast Guard is a branch of the military.", 
        "reply": " Not any more. Today, the Coast Guard is part of the Dept. of Homeland Security. In the past, they were with the Treasury Department.", 
        "threadID": "5291911282_5930008612001", 
        "time": "2009-03-05 07:49:00", 
        "title": "all four branches of the military?", 
        "userID": "stillkit"
    }
]