[
    {
        "content": "In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "", 
        "reply": "In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 00:50:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "alexm1"
    }, 
    {
        "content": "Just an FYI You may want to change your personal profile and remove the \"ARMY\" from it, since you are not in the Army nor have you ever been. Thank you.", 
        "intTime": 20090313, 
        "postID": 2, 
        "quote": "", 
        "reply": "Just an FYI You may want to change your personal profile and remove the \"ARMY\" from it, since you are not in the Army nor have you ever been. Thank you.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 01:04:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "ssg91B"
    }, 
    {
        "content": "Chapter 10 discharge? Which one is that, hardship or discharge in lieu of courts martial? Now, I am not and was not a recruiter, however, I know that when a prospective recruit did not graduate, they were required to notify the recruiter, and the recruiter had to foward that information on to MEPS, where a determination was made to either extend the recruit in the DEP program to permit them to meet qualifications, or to remove them from the program. Next, did you sign a contract or not? It sounds silly, but until your signature is on the bottom line, you are not part of the military, or such is my understanding. Really, the best advice I can give you is to look at the discharge form you recieved, DD214 I assume is standard for all levels of the military. See how it defines your separation, if it falls into the General under honorable condition or honorable discharge types, I would not worry about it. If it fall under anything else, you may want to see about getting it changed, which can be a long, hard, and sometimes impossible task. To request a change in your discharge, you will need to submit an \"Application for the Review of Discharge From the Armed Forces of the United States\" DD293 You may want to get a professional to help with filling out and submitting it, but you may have a bit of saving grace as well, since you were separated after 1 OCT 1982, and were in an entry level status, if your discharge is an Other Than Honorable, you can request it be changed to \"Uncharacterized\" by reason of \"Entry Level Separation\" I hope this helps you out some. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "", 
        "reply": "Chapter 10 discharge? Which one is that, hardship or discharge in lieu of courts martial? Now, I am not and was not a recruiter, however, I know that when a prospective recruit did not graduate, they were required to notify the recruiter, and the recruiter had to foward that information on to MEPS, where a determination was made to either extend the recruit in the DEP program to permit them to meet qualifications, or to remove them from the program. Next, did you sign a contract or not? It sounds silly, but until your signature is on the bottom line, you are not part of the military, or such is my understanding. Really, the best advice I can give you is to look at the discharge form you recieved, DD214 I assume is standard for all levels of the military. See how it defines your separation, if it falls into the General under honorable condition or honorable discharge types, I would not worry about it. If it fall under anything else, you may want to see about getting it changed, which can be a long, hard, and sometimes impossible task. To request a change in your discharge, you will need to submit an \"Application for the Review of Discharge From the Armed Forces of the United States\" DD293 You may want to get a professional to help with filling out and submitting it, but you may have a bit of saving grace as well, since you were separated after 1 OCT 1982, and were in an entry level status, if your discharge is an Other Than Honorable, you can request it be changed to \"Uncharacterized\" by reason of \"Entry Level Separation\" I hope this helps you out some. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 01:47:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "http://forums.military.com/eve/forums/a/tpc/f/90700030713/m/3460063702001 ---http://www.objector.org/helpingout/Helpingoutchapters/10_Hardship_and_Dependency.pdf", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "", 
        "reply": "http://forums.military.com/eve/forums/a/tpc/f/90700030713/m/3460063702001 ---http://www.objector.org/helpingout/Helpingoutchapters/10_Hardship_and_Dependency.pdf", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 02:01:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I'm confused. You say you were in the DEP, but never fulfilled your obligation to enter the service, right? If you didn't sign a service contract and stand and be sworn in for active duty, you were never in the service. If you didn't graduate or graduated at a later date and didn't perform the above, you were never in the service, because once you signed and were sworn in, they packed you out for Boot Camp immediately. Did you have a lawyer provided by the Staff Judge Advocate or did you have your own? He/she should have explained everything to you, before you ever signed anything or said anything. Somewhere along the line, there has been a mistake and I'm not sure this really occured in the way you say it did. There has to be more to this story, like maybe you signed your contract, got sworn in and then took off and they just now caught up to you. If it happened the way you say it did, you got screwed.", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm confused. You say you were in the DEP, but never fulfilled your obligation to enter the service, right? If you didn't sign a service contract and stand and be sworn in for active duty, you were never in the service. If you didn't graduate or graduated at a later date and didn't perform the above, you were never in the service, because once you signed and were sworn in, they packed you out for Boot Camp immediately. Did you have a lawyer provided by the Staff Judge Advocate or did you have your own? He/she should have explained everything to you, before you ever signed anything or said anything. Somewhere along the line, there has been a mistake and I'm not sure this really occured in the way you say it did. There has to be more to this story, like maybe you signed your contract, got sworn in and then took off and they just now caught up to you. If it happened the way you say it did, you got screwed.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 02:16:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Anchorman7275"
    }, 
    {
        "content": "Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head.", 
        "intTime": 20090313, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 03:37:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks. Years ago (unsure of nowadays) Chapter 10s were for those soldiers who were dropped from the rolls of the Army after 30 days as deserters. Chapter 10s were offered in lieu of Special-BCD Courts Martial. Sounds like what occurred with your situation was about par for the course for such circumstances. I suggest you contact a civilian lawyer who regularly works UCMJ issues and with a successful track record to find out your alternatives; I would not trust such issues to just \"any\" lawyer.", 
        "intTime": 20090313, 
        "postID": 7, 
        "quote": "Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "reply": " Years ago (unsure of nowadays) Chapter 10s were for those soldiers who were dropped from the rolls of the Army after 30 days as deserters. Chapter 10s were offered in lieu of Special-BCD Courts Martial. Sounds like what occurred with your situation was about par for the course for such circumstances. I suggest you contact a civilian lawyer who regularly works UCMJ issues and with a successful track record to find out your alternatives; I would not trust such issues to just \"any\" lawyer.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 04:30:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks. This has the aroma of bovine fecal matter.", 
        "intTime": 20090313, 
        "postID": 8, 
        "quote": "Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "reply": " This has the aroma of bovine fecal matter.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:25:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "thorin001"
    }, 
    {
        "content": "Yep...it's Friday! The \"One Post Wonders\" will be invading all day today... And, with it being \"Friday the 13th\"...some will be some real winning entries!", 
        "intTime": 20090313, 
        "postID": 9, 
        "quote": "", 
        "reply": "Yep...it's Friday! The \"One Post Wonders\" will be invading all day today... And, with it being \"Friday the 13th\"...some will be some real winning entries!", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:30:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "You ought to ask here; Joining the Military, Recruiting Questions http://forums.military.com/eve/forums/a/frm/f/78192862 Don", 
        "intTime": 20090313, 
        "postID": 10, 
        "quote": "", 
        "reply": "You ought to ask here; Joining the Military, Recruiting Questions http://forums.military.com/eve/forums/a/frm/f/78192862 Don", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:49:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I guess the moral here is, don't slack off in school, or you'll go to jail.", 
        "intTime": 20090313, 
        "postID": 11, 
        "quote": "", 
        "reply": "I guess the moral here is, don't slack off in school, or you'll go to jail.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:59:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head. Duster, I don't want to start a row here but I must say with all due respect to you that I feel your comment was uncalled for. Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. I'll put my soap box away now. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head.", 
        "reply": " Duster, I don't want to start a row here but I must say with all due respect to you that I feel your comment was uncalled for. Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. I'll put my soap box away now. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:05:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on.", 
        "intTime": 20090313, 
        "postID": 13, 
        "quote": "Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment.", 
        "reply": " So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:29:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Not sure what the Chapter 10 is about but I agree with Anchorman, until you signed on the line, you couldn't be court martialed as you were not a part of the military. This document may help you (PDF) <<<http://www.usarec.army.mil/im/formpub/REC_PUBS/R601_56.pdf>>> pages 6 and 7 show that procedure requires that you be notified that you failed to report on your scheduled date a nd that they then have to go through a process of checking on what happened and either extend or seperate you. Your seperation code should be ZDA from AR 135-178, paragraph 15-8. There should have been a seperation request filed (page 13) but your recruiter(?) would have needed to talk to your high school either by phone or in a formal letter from the high school explaining the situation. You should have also received after all of that was filed a void Enlistment Packet. I'm not a recruiter by any means, but from everything I can see there was no reason for a court martial. You may want to take your file back to the recuiter's office and see if they can help you sort through it.", 
        "intTime": 20090313, 
        "postID": 14, 
        "quote": "", 
        "reply": "Not sure what the Chapter 10 is about but I agree with Anchorman, until you signed on the line, you couldn't be court martialed as you were not a part of the military. This document may help you (PDF) <<<http://www.usarec.army.mil/im/formpub/REC_PUBS/R601_56.pdf>>> pages 6 and 7 show that procedure requires that you be notified that you failed to report on your scheduled date a nd that they then have to go through a process of checking on what happened and either extend or seperate you. Your seperation code should be ZDA from AR 135-178, paragraph 15-8. There should have been a seperation request filed (page 13) but your recruiter(?) would have needed to talk to your high school either by phone or in a formal letter from the high school explaining the situation. You should have also received after all of that was filed a void Enlistment Packet. I'm not a recruiter by any means, but from everything I can see there was no reason for a court martial. You may want to take your file back to the recuiter's office and see if they can help you sort through it.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:37:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ya, my first wife, mom of my sons, didn't have enough credits at her graduation. She had to make up a freakin Art class. I guess she should be working at McDonald's too, right? Don", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "", 
        "reply": "Ya, my first wife, mom of my sons, didn't have enough credits at her graduation. She had to make up a freakin Art class. I guess she should be working at McDonald's too, right? Don", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:37:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on. I really didn't want to start a row but if someone asks me a question politely I don't reply calling them a pin head. Why not say something like, \"Most likely the best thing for you to do is move on and concentrate on getting a good job.\" By the way I don't recall reading that the man was unemployed. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 16, 
        "quote": "Originally posted by soscorpio: quote: Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on.", 
        "reply": " I really didn't want to start a row but if someone asks me a question politely I don't reply calling them a pin head. Why not say something like, \"Most likely the best thing for you to do is move on and concentrate on getting a good job.\" By the way I don't recall reading that the man was unemployed. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:41:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16... Wandering and Wondering", 
        "intTime": 20090313, 
        "postID": 17, 
        "quote": "", 
        "reply": "I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16... Wandering and Wondering", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:45:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16... Maybe the Army would even let him in now and let him complete those classes during a night school or something. I don't know, just trying to come up with ideas for this kid who only seems like he wants to serve. It's not like he got caught selling drugs or something. Don", 
        "intTime": 20090313, 
        "postID": 18, 
        "quote": "Originally posted by greywolfghost: I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16...", 
        "reply": " Maybe the Army would even let him in now and let him complete those classes during a night school or something. I don't know, just trying to come up with ideas for this kid who only seems like he wants to serve. It's not like he got caught selling drugs or something. Don", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 07:10:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "When your in DEP, you are sworn in. It does sound odd to me though. Him not finishing HS would have made him ineligable. Seems he should have recieved some sort of administrative discharge. There has to be more to the story than what we are hearing.", 
        "intTime": 20090313, 
        "postID": 19, 
        "quote": "", 
        "reply": "When your in DEP, you are sworn in. It does sound odd to me though. Him not finishing HS would have made him ineligable. Seems he should have recieved some sort of administrative discharge. There has to be more to the story than what we are hearing.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 07:14:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "azmax64"
    }, 
    {
        "content": "OK guy, stay on topic and stop calling out each other and the OP, more action than this message maybe on its way. If you want to discuss this please email me. Don’t post your questions or thought about this message on the forum, OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090313, 
        "postID": 20, 
        "quote": "", 
        "reply": "OK guy, stay on topic and stop calling out each other and the OP, more action than this message maybe on its way. If you want to discuss this please email me. Don’t post your questions or thought about this message on the forum, OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 07:38:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "intTime": 20090313, 
        "postID": 21, 
        "quote": "", 
        "reply": "In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 00:50:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "alexm1"
    }, 
    {
        "content": "Just an FYI You may want to change your personal profile and remove the \"ARMY\" from it, since you are not in the Army nor have you ever been. Thank you.", 
        "intTime": 20090313, 
        "postID": 22, 
        "quote": "", 
        "reply": "Just an FYI You may want to change your personal profile and remove the \"ARMY\" from it, since you are not in the Army nor have you ever been. Thank you.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 01:04:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "ssg91B"
    }, 
    {
        "content": "Chapter 10 discharge? Which one is that, hardship or discharge in lieu of courts martial? Now, I am not and was not a recruiter, however, I know that when a prospective recruit did not graduate, they were required to notify the recruiter, and the recruiter had to foward that information on to MEPS, where a determination was made to either extend the recruit in the DEP program to permit them to meet qualifications, or to remove them from the program. Next, did you sign a contract or not? It sounds silly, but until your signature is on the bottom line, you are not part of the military, or such is my understanding. Really, the best advice I can give you is to look at the discharge form you recieved, DD214 I assume is standard for all levels of the military. See how it defines your separation, if it falls into the General under honorable condition or honorable discharge types, I would not worry about it. If it fall under anything else, you may want to see about getting it changed, which can be a long, hard, and sometimes impossible task. To request a change in your discharge, you will need to submit an \"Application for the Review of Discharge From the Armed Forces of the United States\" DD293 You may want to get a professional to help with filling out and submitting it, but you may have a bit of saving grace as well, since you were separated after 1 OCT 1982, and were in an entry level status, if your discharge is an Other Than Honorable, you can request it be changed to \"Uncharacterized\" by reason of \"Entry Level Separation\" I hope this helps you out some. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090313, 
        "postID": 23, 
        "quote": "", 
        "reply": "Chapter 10 discharge? Which one is that, hardship or discharge in lieu of courts martial? Now, I am not and was not a recruiter, however, I know that when a prospective recruit did not graduate, they were required to notify the recruiter, and the recruiter had to foward that information on to MEPS, where a determination was made to either extend the recruit in the DEP program to permit them to meet qualifications, or to remove them from the program. Next, did you sign a contract or not? It sounds silly, but until your signature is on the bottom line, you are not part of the military, or such is my understanding. Really, the best advice I can give you is to look at the discharge form you recieved, DD214 I assume is standard for all levels of the military. See how it defines your separation, if it falls into the General under honorable condition or honorable discharge types, I would not worry about it. If it fall under anything else, you may want to see about getting it changed, which can be a long, hard, and sometimes impossible task. To request a change in your discharge, you will need to submit an \"Application for the Review of Discharge From the Armed Forces of the United States\" DD293 You may want to get a professional to help with filling out and submitting it, but you may have a bit of saving grace as well, since you were separated after 1 OCT 1982, and were in an entry level status, if your discharge is an Other Than Honorable, you can request it be changed to \"Uncharacterized\" by reason of \"Entry Level Separation\" I hope this helps you out some. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 01:47:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "http://forums.military.com/eve/forums/a/tpc/f/90700030713/m/3460063702001 ---http://www.objector.org/helpingout/Helpingoutchapters/10_Hardship_and_Dependency.pdf", 
        "intTime": 20090313, 
        "postID": 24, 
        "quote": "", 
        "reply": "http://forums.military.com/eve/forums/a/tpc/f/90700030713/m/3460063702001 ---http://www.objector.org/helpingout/Helpingoutchapters/10_Hardship_and_Dependency.pdf", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 02:01:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I'm confused. You say you were in the DEP, but never fulfilled your obligation to enter the service, right? If you didn't sign a service contract and stand and be sworn in for active duty, you were never in the service. If you didn't graduate or graduated at a later date and didn't perform the above, you were never in the service, because once you signed and were sworn in, they packed you out for Boot Camp immediately. Did you have a lawyer provided by the Staff Judge Advocate or did you have your own? He/she should have explained everything to you, before you ever signed anything or said anything. Somewhere along the line, there has been a mistake and I'm not sure this really occured in the way you say it did. There has to be more to this story, like maybe you signed your contract, got sworn in and then took off and they just now caught up to you. If it happened the way you say it did, you got screwed.", 
        "intTime": 20090313, 
        "postID": 25, 
        "quote": "", 
        "reply": "I'm confused. You say you were in the DEP, but never fulfilled your obligation to enter the service, right? If you didn't sign a service contract and stand and be sworn in for active duty, you were never in the service. If you didn't graduate or graduated at a later date and didn't perform the above, you were never in the service, because once you signed and were sworn in, they packed you out for Boot Camp immediately. Did you have a lawyer provided by the Staff Judge Advocate or did you have your own? He/she should have explained everything to you, before you ever signed anything or said anything. Somewhere along the line, there has been a mistake and I'm not sure this really occured in the way you say it did. There has to be more to this story, like maybe you signed your contract, got sworn in and then took off and they just now caught up to you. If it happened the way you say it did, you got screwed.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 02:16:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Anchorman7275"
    }, 
    {
        "content": "Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head.", 
        "intTime": 20090313, 
        "postID": 26, 
        "quote": "", 
        "reply": "Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 03:37:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks. Years ago (unsure of nowadays) Chapter 10s were for those soldiers who were dropped from the rolls of the Army after 30 days as deserters. Chapter 10s were offered in lieu of Special-BCD Courts Martial. Sounds like what occurred with your situation was about par for the course for such circumstances. I suggest you contact a civilian lawyer who regularly works UCMJ issues and with a successful track record to find out your alternatives; I would not trust such issues to just \"any\" lawyer.", 
        "intTime": 20090313, 
        "postID": 27, 
        "quote": "Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "reply": " Years ago (unsure of nowadays) Chapter 10s were for those soldiers who were dropped from the rolls of the Army after 30 days as deserters. Chapter 10s were offered in lieu of Special-BCD Courts Martial. Sounds like what occurred with your situation was about par for the course for such circumstances. I suggest you contact a civilian lawyer who regularly works UCMJ issues and with a successful track record to find out your alternatives; I would not trust such issues to just \"any\" lawyer.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 04:30:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks. This has the aroma of bovine fecal matter.", 
        "intTime": 20090313, 
        "postID": 28, 
        "quote": "Originally posted by alexm1: In 1990 I was in \"The delayed entry program\" with the Army. When I graduated from High school I was supposed to report for active duty. When it came time to graduate, I did not have all the credits needed, and was not able to report for active duty. The recruiters were aware of this. About 6 months later an MP shows up at my door, says I have been court marshalled and he took me away. I Went in front of a Judge, explained my situation and recieved a Chapter 10 discharge. I did not know what all that meant or what was going on. Now, I here from other people that I should not have got a chapter 10. Can anyone help me out with this or give me more info? thanks.", 
        "reply": " This has the aroma of bovine fecal matter.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:25:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "thorin001"
    }, 
    {
        "content": "Yep...it's Friday! The \"One Post Wonders\" will be invading all day today... And, with it being \"Friday the 13th\"...some will be some real winning entries!", 
        "intTime": 20090313, 
        "postID": 29, 
        "quote": "", 
        "reply": "Yep...it's Friday! The \"One Post Wonders\" will be invading all day today... And, with it being \"Friday the 13th\"...some will be some real winning entries!", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:30:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "You ought to ask here; Joining the Military, Recruiting Questions http://forums.military.com/eve/forums/a/frm/f/78192862 Don", 
        "intTime": 20090313, 
        "postID": 30, 
        "quote": "", 
        "reply": "You ought to ask here; Joining the Military, Recruiting Questions http://forums.military.com/eve/forums/a/frm/f/78192862 Don", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:49:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I guess the moral here is, don't slack off in school, or you'll go to jail.", 
        "intTime": 20090313, 
        "postID": 31, 
        "quote": "", 
        "reply": "I guess the moral here is, don't slack off in school, or you'll go to jail.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 05:59:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head. Duster, I don't want to start a row here but I must say with all due respect to you that I feel your comment was uncalled for. Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. I'll put my soap box away now. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 32, 
        "quote": "Originally posted by Duster6: Just drop the issue and start putting in job applications at McDonalds, Wendys, and Burger King. Get on with your life. Pin Head.", 
        "reply": " Duster, I don't want to start a row here but I must say with all due respect to you that I feel your comment was uncalled for. Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. I'll put my soap box away now. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:05:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on.", 
        "intTime": 20090313, 
        "postID": 33, 
        "quote": "Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment.", 
        "reply": " So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:29:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "soscorpio"
    }, 
    {
        "content": "Not sure what the Chapter 10 is about but I agree with Anchorman, until you signed on the line, you couldn't be court martialed as you were not a part of the military. This document may help you (PDF) <<<http://www.usarec.army.mil/im/formpub/REC_PUBS/R601_56.pdf>>> pages 6 and 7 show that procedure requires that you be notified that you failed to report on your scheduled date a nd that they then have to go through a process of checking on what happened and either extend or seperate you. Your seperation code should be ZDA from AR 135-178, paragraph 15-8. There should have been a seperation request filed (page 13) but your recruiter(?) would have needed to talk to your high school either by phone or in a formal letter from the high school explaining the situation. You should have also received after all of that was filed a void Enlistment Packet. I'm not a recruiter by any means, but from everything I can see there was no reason for a court martial. You may want to take your file back to the recuiter's office and see if they can help you sort through it.", 
        "intTime": 20090313, 
        "postID": 34, 
        "quote": "", 
        "reply": "Not sure what the Chapter 10 is about but I agree with Anchorman, until you signed on the line, you couldn't be court martialed as you were not a part of the military. This document may help you (PDF) <<<http://www.usarec.army.mil/im/formpub/REC_PUBS/R601_56.pdf>>> pages 6 and 7 show that procedure requires that you be notified that you failed to report on your scheduled date a nd that they then have to go through a process of checking on what happened and either extend or seperate you. Your seperation code should be ZDA from AR 135-178, paragraph 15-8. There should have been a seperation request filed (page 13) but your recruiter(?) would have needed to talk to your high school either by phone or in a formal letter from the high school explaining the situation. You should have also received after all of that was filed a void Enlistment Packet. I'm not a recruiter by any means, but from everything I can see there was no reason for a court martial. You may want to take your file back to the recuiter's office and see if they can help you sort through it.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:37:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Ya, my first wife, mom of my sons, didn't have enough credits at her graduation. She had to make up a freakin Art class. I guess she should be working at McDonald's too, right? Don", 
        "intTime": 20090313, 
        "postID": 35, 
        "quote": "", 
        "reply": "Ya, my first wife, mom of my sons, didn't have enough credits at her graduation. She had to make up a freakin Art class. I guess she should be working at McDonald's too, right? Don", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:37:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on. I really didn't want to start a row but if someone asks me a question politely I don't reply calling them a pin head. Why not say something like, \"Most likely the best thing for you to do is move on and concentrate on getting a good job.\" By the way I don't recall reading that the man was unemployed. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 36, 
        "quote": "Originally posted by soscorpio: quote: Alex came here to ask a question and perhaps get some advice. He asked politely and deserves polite treatment. So Duster's advice should be sugar-coated? No matter how it is said, it still will have the same reality. Duster's advice was spot-on.", 
        "reply": " I really didn't want to start a row but if someone asks me a question politely I don't reply calling them a pin head. Why not say something like, \"Most likely the best thing for you to do is move on and concentrate on getting a good job.\" By the way I don't recall reading that the man was unemployed. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:41:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16... Wandering and Wondering", 
        "intTime": 20090313, 
        "postID": 37, 
        "quote": "", 
        "reply": "I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16... Wandering and Wondering", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 06:45:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16... Maybe the Army would even let him in now and let him complete those classes during a night school or something. I don't know, just trying to come up with ideas for this kid who only seems like he wants to serve. It's not like he got caught selling drugs or something. Don", 
        "intTime": 20090313, 
        "postID": 38, 
        "quote": "Originally posted by greywolfghost: I don't understand this - How can a kid, who has never been sworn in, be punished under the UCMJ? Am I missing something here, or are we talking about a MINOR when the paper was signed? Can a Juvenile be handled this way without a travesty of justice taking place? YES, get a Lawyer and HAMMER this practice. There is some major unethical wool being pulled over somebody's eyes. Did the kid screw up? Yes. Do juveniles screw up because they don't see the big picture? Yes. Should this result in a permanent black mark on the record? No! \"Note what this means. It means that if an applicant failed to show up to ship out to basic training, the military COULD order the individual to active duty. If the individual refused, the military could legally court-martial the individual, if they wanted to. Now, let's talk reality. This never happens. Never. Not a single person has been involuntarily ordered to active duty, court-martialed, or otherwise prosecuted in civilian courts for being in the DEP and refusing to ship out to boot camp in *AT LEAST* the past 27 years. Not one single person.\" Did you \"refuse\" an order to report? Why not just report for duty, and the Army can work you through GED program - - Put the responsibility back on the military by saying, \"Here I am, ready to serve. Now what!?\" It don't take a HS Diploma to shoot an enemy with an M-16...", 
        "reply": " Maybe the Army would even let him in now and let him complete those classes during a night school or something. I don't know, just trying to come up with ideas for this kid who only seems like he wants to serve. It's not like he got caught selling drugs or something. Don", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 07:10:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "When your in DEP, you are sworn in. It does sound odd to me though. Him not finishing HS would have made him ineligable. Seems he should have recieved some sort of administrative discharge. There has to be more to the story than what we are hearing.", 
        "intTime": 20090313, 
        "postID": 39, 
        "quote": "", 
        "reply": "When your in DEP, you are sworn in. It does sound odd to me though. Him not finishing HS would have made him ineligable. Seems he should have recieved some sort of administrative discharge. There has to be more to the story than what we are hearing.", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 07:14:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "azmax64"
    }, 
    {
        "content": "OK guy, stay on topic and stop calling out each other and the OP, more action than this message maybe on its way. If you want to discuss this please email me. Don’t post your questions or thought about this message on the forum, OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090313, 
        "postID": 40, 
        "quote": "", 
        "reply": "OK guy, stay on topic and stop calling out each other and the OP, more action than this message maybe on its way. If you want to discuss this please email me. Don’t post your questions or thought about this message on the forum, OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_2670017712001", 
        "time": "2009-03-13 07:38:00", 
        "title": "Chapter 10 Discharge.", 
        "userID": "OldArmyLove"
    }
]