[
    {
        "content": "The problem with the pirates is difficult to solve. Ground strikes risk a lot of collateral damage, and there are hostages at risk. We could bring back convoys, and use destroyers to escort merchant vessels. This is expensive and ties up Navy assets that could be needed for real emergencies. Besides that, destroyers will not capture any actual pirates, because the pirates will not come out to play when destroyers are in view. Moreover, there are tons of fishing boats, making it difficult to pick out boats on piratical missions. Therefore, bring back the Q-boats: ships enticingly disguied as fat, tempting, weak targets for pirates, but are in fact heavily armed with hidden weapons. Choose whatever is their favorite kind of vessel. Flag with any countries flag--they're going to think twice about attacking US flagged ships in the future--probably! So send out a tramp steamer loaded down with gleaming Hummers. When the pirates show their cards and intentions, the SEAL team pops up and sends them to Davy Jones Locker. As the probability of certain death climbs, this will act as a deterrent. It would be cheap: the cost of a SEAL team or two versus the payrolls associated with several destroyers. It would turn the principles of asymmetric warfare against the rascals. It would be beautiful. I think it would work. Q ships!", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "", 
        "reply": "The problem with the pirates is difficult to solve. Ground strikes risk a lot of collateral damage, and there are hostages at risk. We could bring back convoys, and use destroyers to escort merchant vessels. This is expensive and ties up Navy assets that could be needed for real emergencies. Besides that, destroyers will not capture any actual pirates, because the pirates will not come out to play when destroyers are in view. Moreover, there are tons of fishing boats, making it difficult to pick out boats on piratical missions. Therefore, bring back the Q-boats: ships enticingly disguied as fat, tempting, weak targets for pirates, but are in fact heavily armed with hidden weapons. Choose whatever is their favorite kind of vessel. Flag with any countries flag--they're going to think twice about attacking US flagged ships in the future--probably! So send out a tramp steamer loaded down with gleaming Hummers. When the pirates show their cards and intentions, the SEAL team pops up and sends them to Davy Jones Locker. As the probability of certain death climbs, this will act as a deterrent. It would be cheap: the cost of a SEAL team or two versus the payrolls associated with several destroyers. It would turn the principles of asymmetric warfare against the rascals. It would be beautiful. I think it would work. Q ships!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 06:55:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "PT boats maybe an alternative. Fast, agile, armed to the gills. Lose the torpedo tubes. A good mix of 50 cals and mini guns.", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "PT boats maybe an alternative. Fast, agile, armed to the gills. Lose the torpedo tubes. A good mix of 50 cals and mini guns.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:00:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "azmax64"
    }, 
    {
        "content": "If they weren't so high maintenance, those Navy Hydrofoils would seem like a valuable asset to have in that area. Don", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "", 
        "reply": "If they weren't so high maintenance, those Navy Hydrofoils would seem like a valuable asset to have in that area. Don", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:05:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Good idea Warren! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "", 
        "reply": "Good idea Warren! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:25:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer.", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "", 
        "reply": "OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:36:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "galloglas"
    }, 
    {
        "content": "quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer.", 
        "reply": " That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:51:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. I agree perhaps a Q boat with PBR's in a well deck arrangement. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. I agree perhaps a Q boat with PBR's in a well deck arrangement. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "reply": "", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:53:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "galloglas"
    }, 
    {
        "content": "Maybe they could send that NEW boat over there. GO NAVY! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "", 
        "reply": "Maybe they could send that NEW boat over there. GO NAVY! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 08:47:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "We got twelve carrier fleets! They can't park one of those groups off the coast of West Africa and hammer anything that even frowns??? Give me a break!! We got to pay for their up-keep wherever they are, and that area of the world is so important with oil shipments and all. And they DID very clearly threaten retaliation/retribution yesterday - why not a Declaration of War?!? Then scorched earth!! If we give these creeps even an inch, we'll be getting shoved all over the planet (again), like the days of Carter - - Wandering and Wondering", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "", 
        "reply": "We got twelve carrier fleets! They can't park one of those groups off the coast of West Africa and hammer anything that even frowns??? Give me a break!! We got to pay for their up-keep wherever they are, and that area of the world is so important with oil shipments and all. And they DID very clearly threaten retaliation/retribution yesterday - why not a Declaration of War?!? Then scorched earth!! If we give these creeps even an inch, we'll be getting shoved all over the planet (again), like the days of Carter - - Wandering and Wondering", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 08:54:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun! PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands.", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "reply": " PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 10:03:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats.", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "", 
        "reply": "GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 10:08:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat Don't forget a lot of those barbaric nutz carry RPGs as weapon of choice - not good for a PT boat. One or two guys hiding under the gunwales could pop up, like out of a spider hole, and reek some real havoc. Being an ole tanker, I like standoff ranges of 1800 to 3600 yards with a 105MM. A destroyer's turret would supply that nicely. I'm sure the USS Stark would love to get back in that area and do a little pay-back!! Now, if ya want 20MM, then a Cobra or Hornet got those - - Wandering and Wondering", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat", 
        "reply": " Don't forget a lot of those barbaric nutz carry RPGs as weapon of choice - not good for a PT boat. One or two guys hiding under the gunwales could pop up, like out of a spider hole, and reek some real havoc. Being an ole tanker, I like standoff ranges of 1800 to 3600 yards with a 105MM. A destroyer's turret would supply that nicely. I'm sure the USS Stark would love to get back in that area and do a little pay-back!! Now, if ya want 20MM, then a Cobra or Hornet got those - - Wandering and Wondering", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 11:59:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats. Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - - Wandering and Wondering", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats.", 
        "reply": " Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - - Wandering and Wondering", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 12:08:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats. Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - - Don't get me wrong... I think the drones are very useful in this area. but to make sure needs boots on the deck. We cannot afford to be wrong even once.", 
        "intTime": 20090413, 
        "postID": 14, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats. Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - -", 
        "reply": " Don't get me wrong... I think the drones are very useful in this area. but to make sure needs boots on the deck. We cannot afford to be wrong even once.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 12:11:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat I like it too. But skip the depth charge racks in favor of a helipad. GWG has a point that drones are usefull surveilance tools and these small ships do need the ability to land and emergency stow small LAMPS style helicopters. But these PT replacements need to stand alone when needed so a decent stand off main gun is needed. Perhaps some sort of high caliber chain gun. 30mm??? The original mission req would be for anti AK and RPG weapons. but the idea of making the design modular would expand the boats mission capabilities.", 
        "intTime": 20090413, 
        "postID": 15, 
        "quote": "Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat", 
        "reply": " I like it too. But skip the depth charge racks in favor of a helipad. GWG has a point that drones are usefull surveilance tools and these small ships do need the ability to land and emergency stow small LAMPS style helicopters. But these PT replacements need to stand alone when needed so a decent stand off main gun is needed. Perhaps some sort of high caliber chain gun. 30mm??? The original mission req would be for anti AK and RPG weapons. but the idea of making the design modular would expand the boats mission capabilities.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 12:16:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "---- Yes guys.. Hot Rod PT boats sound good, but you still need a large, permanent COW - or - Mother ship for supply & maint.. The COW must have DRONES flying 24/7 for REAL - TIME eyeballin.. GW.. RPGs are short range only, and a 105mm would just force them to kill one hostage for every pirate you bag.. they have about 350 hostages now. -- we could take out their outboards with .50 cals. & let them row back.. ---- Guys... all this is just pipe dreams... Admiral obammma is now Guilty of Black on Black murder, and all this needs the U.N.s OK, plus the libs will never spend big $$$ for more Black on Black murder.. so forget abouuut it...", 
        "intTime": 20090413, 
        "postID": 16, 
        "quote": "", 
        "reply": "---- Yes guys.. Hot Rod PT boats sound good, but you still need a large, permanent COW - or - Mother ship for supply & maint.. The COW must have DRONES flying 24/7 for REAL - TIME eyeballin.. GW.. RPGs are short range only, and a 105mm would just force them to kill one hostage for every pirate you bag.. they have about 350 hostages now. -- we could take out their outboards with .50 cals. & let them row back.. ---- Guys... all this is just pipe dreams... Admiral obammma is now Guilty of Black on Black murder, and all this needs the U.N.s OK, plus the libs will never spend big $$$ for more Black on Black murder.. so forget abouuut it...", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 15:01:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun! PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands. Good points all. However, the two tactics are complementary. A Q-ship to entice the pirates out, then a PT boat to hunt down the mother ship determined by radar from whence the actual pirate attack boats. Also, one wouldn't need a special ship. What I propose is a roving team that would go from ship to ship. A tug boat one week, a yacht the next week, a freighter the next week. The SEALS are experts at concealment. Major modifications to such ships wouldn't be needed. That is, the 3 inch cannons can probably be replaced by .50 cal automatic weapons. Thow in a PT boat over the horizon as the QRF, it would work. When they stop coming out, we win.", 
        "intTime": 20090413, 
        "postID": 17, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun! PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands.", 
        "reply": " Good points all. However, the two tactics are complementary. A Q-ship to entice the pirates out, then a PT boat to hunt down the mother ship determined by radar from whence the actual pirate attack boats. Also, one wouldn't need a special ship. What I propose is a roving team that would go from ship to ship. A tug boat one week, a yacht the next week, a freighter the next week. The SEALS are experts at concealment. Major modifications to such ships wouldn't be needed. That is, the 3 inch cannons can probably be replaced by .50 cal automatic weapons. Thow in a PT boat over the horizon as the QRF, it would work. When they stop coming out, we win.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 16:19:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "My idea is to train the merchant men in anti-terrorist tactics like they do with our Sailors when they deploy to the Gulf. Also put a couple of 50 MG mounts on the bridge and mount a 25MM cannon on the main deck where it has a good firing view of the area. Plus send a couple of the LCS ships out to the region. They are more suited for this type of interdiction instead of DDGs. They can get closer to the shore. Outfit them with a couple of SEAL Teams also. Then we'll go hunting for pirates or Bear!", 
        "intTime": 20090413, 
        "postID": 18, 
        "quote": "", 
        "reply": "My idea is to train the merchant men in anti-terrorist tactics like they do with our Sailors when they deploy to the Gulf. Also put a couple of 50 MG mounts on the bridge and mount a 25MM cannon on the main deck where it has a good firing view of the area. Plus send a couple of the LCS ships out to the region. They are more suited for this type of interdiction instead of DDGs. They can get closer to the shore. Outfit them with a couple of SEAL Teams also. Then we'll go hunting for pirates or Bear!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 18:01:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "Jer_Pil"
    }, 
    {
        "content": "Here's an Idea, Put an attack sub off the coast. Wuith it's sonar it can follow a ship from thousand miles away. It can moniter the area and when the mother ship leave the harbor shadow it. When they see that it has launched the speed boats after a cargo ship. Sink the mother ship. Do that about five times in a row.They may never put to sea again,not knowing if they are being watched from below.", 
        "intTime": 20090413, 
        "postID": 19, 
        "quote": "", 
        "reply": "Here's an Idea, Put an attack sub off the coast. Wuith it's sonar it can follow a ship from thousand miles away. It can moniter the area and when the mother ship leave the harbor shadow it. When they see that it has launched the speed boats after a cargo ship. Sink the mother ship. Do that about five times in a row.They may never put to sea again,not knowing if they are being watched from below.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 19:06:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ENYVTHS"
    }, 
    {
        "content": "The problem with the pirates is difficult to solve. Ground strikes risk a lot of collateral damage, and there are hostages at risk. We could bring back convoys, and use destroyers to escort merchant vessels. This is expensive and ties up Navy assets that could be needed for real emergencies. Besides that, destroyers will not capture any actual pirates, because the pirates will not come out to play when destroyers are in view. Moreover, there are tons of fishing boats, making it difficult to pick out boats on piratical missions. Therefore, bring back the Q-boats: ships enticingly disguied as fat, tempting, weak targets for pirates, but are in fact heavily armed with hidden weapons. Choose whatever is their favorite kind of vessel. Flag with any countries flag--they're going to think twice about attacking US flagged ships in the future--probably! So send out a tramp steamer loaded down with gleaming Hummers. When the pirates show their cards and intentions, the SEAL team pops up and sends them to Davy Jones Locker. As the probability of certain death climbs, this will act as a deterrent. It would be cheap: the cost of a SEAL team or two versus the payrolls associated with several destroyers. It would turn the principles of asymmetric warfare against the rascals. It would be beautiful. I think it would work. Q ships!", 
        "intTime": 20090413, 
        "postID": 20, 
        "quote": "", 
        "reply": "The problem with the pirates is difficult to solve. Ground strikes risk a lot of collateral damage, and there are hostages at risk. We could bring back convoys, and use destroyers to escort merchant vessels. This is expensive and ties up Navy assets that could be needed for real emergencies. Besides that, destroyers will not capture any actual pirates, because the pirates will not come out to play when destroyers are in view. Moreover, there are tons of fishing boats, making it difficult to pick out boats on piratical missions. Therefore, bring back the Q-boats: ships enticingly disguied as fat, tempting, weak targets for pirates, but are in fact heavily armed with hidden weapons. Choose whatever is their favorite kind of vessel. Flag with any countries flag--they're going to think twice about attacking US flagged ships in the future--probably! So send out a tramp steamer loaded down with gleaming Hummers. When the pirates show their cards and intentions, the SEAL team pops up and sends them to Davy Jones Locker. As the probability of certain death climbs, this will act as a deterrent. It would be cheap: the cost of a SEAL team or two versus the payrolls associated with several destroyers. It would turn the principles of asymmetric warfare against the rascals. It would be beautiful. I think it would work. Q ships!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 06:55:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "PT boats maybe an alternative. Fast, agile, armed to the gills. Lose the torpedo tubes. A good mix of 50 cals and mini guns.", 
        "intTime": 20090413, 
        "postID": 21, 
        "quote": "", 
        "reply": "PT boats maybe an alternative. Fast, agile, armed to the gills. Lose the torpedo tubes. A good mix of 50 cals and mini guns.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:00:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "azmax64"
    }, 
    {
        "content": "If they weren't so high maintenance, those Navy Hydrofoils would seem like a valuable asset to have in that area. Don", 
        "intTime": 20090413, 
        "postID": 22, 
        "quote": "", 
        "reply": "If they weren't so high maintenance, those Navy Hydrofoils would seem like a valuable asset to have in that area. Don", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:05:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Good idea Warren! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090413, 
        "postID": 23, 
        "quote": "", 
        "reply": "Good idea Warren! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:25:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer.", 
        "intTime": 20090413, 
        "postID": 24, 
        "quote": "", 
        "reply": "OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:36:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "galloglas"
    }, 
    {
        "content": "quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "intTime": 20090413, 
        "postID": 25, 
        "quote": "Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer.", 
        "reply": " That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:51:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. I agree perhaps a Q boat with PBR's in a well deck arrangement. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "intTime": 20090413, 
        "postID": 26, 
        "quote": "Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. I agree perhaps a Q boat with PBR's in a well deck arrangement. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "reply": "", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 07:53:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "galloglas"
    }, 
    {
        "content": "Maybe they could send that NEW boat over there. GO NAVY! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090413, 
        "postID": 27, 
        "quote": "", 
        "reply": "Maybe they could send that NEW boat over there. GO NAVY! Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 08:47:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "We got twelve carrier fleets! They can't park one of those groups off the coast of West Africa and hammer anything that even frowns??? Give me a break!! We got to pay for their up-keep wherever they are, and that area of the world is so important with oil shipments and all. And they DID very clearly threaten retaliation/retribution yesterday - why not a Declaration of War?!? Then scorched earth!! If we give these creeps even an inch, we'll be getting shoved all over the planet (again), like the days of Carter - - Wandering and Wondering", 
        "intTime": 20090413, 
        "postID": 28, 
        "quote": "", 
        "reply": "We got twelve carrier fleets! They can't park one of those groups off the coast of West Africa and hammer anything that even frowns??? Give me a break!! We got to pay for their up-keep wherever they are, and that area of the world is so important with oil shipments and all. And they DID very clearly threaten retaliation/retribution yesterday - why not a Declaration of War?!? Then scorched earth!! If we give these creeps even an inch, we'll be getting shoved all over the planet (again), like the days of Carter - - Wandering and Wondering", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 08:54:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun! PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands.", 
        "intTime": 20090413, 
        "postID": 29, 
        "quote": "Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun!", 
        "reply": " PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 10:03:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats.", 
        "intTime": 20090413, 
        "postID": 30, 
        "quote": "", 
        "reply": "GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 10:08:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat Don't forget a lot of those barbaric nutz carry RPGs as weapon of choice - not good for a PT boat. One or two guys hiding under the gunwales could pop up, like out of a spider hole, and reek some real havoc. Being an ole tanker, I like standoff ranges of 1800 to 3600 yards with a 105MM. A destroyer's turret would supply that nicely. I'm sure the USS Stark would love to get back in that area and do a little pay-back!! Now, if ya want 20MM, then a Cobra or Hornet got those - - Wandering and Wondering", 
        "intTime": 20090413, 
        "postID": 31, 
        "quote": "Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat", 
        "reply": " Don't forget a lot of those barbaric nutz carry RPGs as weapon of choice - not good for a PT boat. One or two guys hiding under the gunwales could pop up, like out of a spider hole, and reek some real havoc. Being an ole tanker, I like standoff ranges of 1800 to 3600 yards with a 105MM. A destroyer's turret would supply that nicely. I'm sure the USS Stark would love to get back in that area and do a little pay-back!! Now, if ya want 20MM, then a Cobra or Hornet got those - - Wandering and Wondering", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 11:59:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats. Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - - Wandering and Wondering", 
        "intTime": 20090413, 
        "postID": 32, 
        "quote": "Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats.", 
        "reply": " Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - - Wandering and Wondering", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 12:08:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats. Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - - Don't get me wrong... I think the drones are very useful in this area. but to make sure needs boots on the deck. We cannot afford to be wrong even once.", 
        "intTime": 20090413, 
        "postID": 33, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by ArtMarsh: GWG... drones are only useful for finding a boat... not determining if it is friend or foe. You sink too many of the friendly boats and the world starts to get angry. And drones can not look under life rafts or in the cabin for weapons contraband. That takes a sailor or a soldier to actually board the vessel. We need to set up a small Navy unit styled like the riverine warfare units in Vietnam. Only have them man Ocean going boats. Drones, with their FLIR and other capabilities can actually look \"through and under\" stuff like tarps and thin flooring. The only way you can search better is to step on board. Drones can carry Hellfire and Maverick missiles, which will take out any threat pirates could mount, with no danger to American personnel. Just quarantine the coast and sink anything approaching a ship in deep water... Works for me - -", 
        "reply": " Don't get me wrong... I think the drones are very useful in this area. but to make sure needs boots on the deck. We cannot afford to be wrong even once.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 12:11:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat I like it too. But skip the depth charge racks in favor of a helipad. GWG has a point that drones are usefull surveilance tools and these small ships do need the ability to land and emergency stow small LAMPS style helicopters. But these PT replacements need to stand alone when needed so a decent stand off main gun is needed. Perhaps some sort of high caliber chain gun. 30mm??? The original mission req would be for anti AK and RPG weapons. but the idea of making the design modular would expand the boats mission capabilities.", 
        "intTime": 20090413, 
        "postID": 34, 
        "quote": "Originally posted by NEMESIS1960: I like the PT boat ideal,A couple of 20mm Vulcans,2 7.62 chain gun turrets, and a Y rack depth charge thrower.if it fly's,floats or swims...its toast. Use the German E boats style with the new water jet engines...a real schnellboat", 
        "reply": " I like it too. But skip the depth charge racks in favor of a helipad. GWG has a point that drones are usefull surveilance tools and these small ships do need the ability to land and emergency stow small LAMPS style helicopters. But these PT replacements need to stand alone when needed so a decent stand off main gun is needed. Perhaps some sort of high caliber chain gun. 30mm??? The original mission req would be for anti AK and RPG weapons. but the idea of making the design modular would expand the boats mission capabilities.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 12:16:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "---- Yes guys.. Hot Rod PT boats sound good, but you still need a large, permanent COW - or - Mother ship for supply & maint.. The COW must have DRONES flying 24/7 for REAL - TIME eyeballin.. GW.. RPGs are short range only, and a 105mm would just force them to kill one hostage for every pirate you bag.. they have about 350 hostages now. -- we could take out their outboards with .50 cals. & let them row back.. ---- Guys... all this is just pipe dreams... Admiral obammma is now Guilty of Black on Black murder, and all this needs the U.N.s OK, plus the libs will never spend big $$$ for more Black on Black murder.. so forget abouuut it...", 
        "intTime": 20090413, 
        "postID": 35, 
        "quote": "", 
        "reply": "---- Yes guys.. Hot Rod PT boats sound good, but you still need a large, permanent COW - or - Mother ship for supply & maint.. The COW must have DRONES flying 24/7 for REAL - TIME eyeballin.. GW.. RPGs are short range only, and a 105mm would just force them to kill one hostage for every pirate you bag.. they have about 350 hostages now. -- we could take out their outboards with .50 cals. & let them row back.. ---- Guys... all this is just pipe dreams... Admiral obammma is now Guilty of Black on Black murder, and all this needs the U.N.s OK, plus the libs will never spend big $$$ for more Black on Black murder.. so forget abouuut it...", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 15:01:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun! PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands. Good points all. However, the two tactics are complementary. A Q-ship to entice the pirates out, then a PT boat to hunt down the mother ship determined by radar from whence the actual pirate attack boats. Also, one wouldn't need a special ship. What I propose is a roving team that would go from ship to ship. A tug boat one week, a yacht the next week, a freighter the next week. The SEALS are experts at concealment. Major modifications to such ships wouldn't be needed. That is, the 3 inch cannons can probably be replaced by .50 cal automatic weapons. Thow in a PT boat over the horizon as the QRF, it would work. When they stop coming out, we win.", 
        "intTime": 20090413, 
        "postID": 36, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by WarrenPlatts: quote: Originally posted by galloglas: OH MY pt boats would be effective as hell but would be construed as to AGGRESSIVE AND CONFRONTATIONAL by our Gov. Q boats would be the answer. That's the thing. PT boats are cool and fast. But the pirates only take on the weak. They aren't stupid. Really, I have to admire their audacity. Yes they must be stopped. But to steal a Saudi supertanker full of crude--AND GET AWAY WITH IT--that's something Jack Sparrow would give his right arm for. You've got to hand it to them. They should make a movie about THOSE guys. Still, they must be stopped. They will not come out for a fair fight. Who can blame them? We don't fight fair either. Entrapment is an old tactic loved by ordinary US cops and highway patrolmen. If we're going to use those techniques on ourselves, let's let the Somali pirates share the fun! PT boats are not designed to fool raiders... that is a rather lame approach to go in the first place. Plus Q-boats are very expensive to modify and operate. for every Q you could have 4-5 PT styled boats. PTs are Ocean going high speed patrol boats that have extended range and crew berthing capabilities. Their primary use is in interdiction... KEEPING the Somalis from putting to sea in their mother ships. Your idea is only a hope that the Somalis fall for the ruse... eventually they will fail to atract the pirates and then you have a useless large ship on your hands.", 
        "reply": " Good points all. However, the two tactics are complementary. A Q-ship to entice the pirates out, then a PT boat to hunt down the mother ship determined by radar from whence the actual pirate attack boats. Also, one wouldn't need a special ship. What I propose is a roving team that would go from ship to ship. A tug boat one week, a yacht the next week, a freighter the next week. The SEALS are experts at concealment. Major modifications to such ships wouldn't be needed. That is, the 3 inch cannons can probably be replaced by .50 cal automatic weapons. Thow in a PT boat over the horizon as the QRF, it would work. When they stop coming out, we win.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 16:19:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "WarrenPlatts"
    }, 
    {
        "content": "My idea is to train the merchant men in anti-terrorist tactics like they do with our Sailors when they deploy to the Gulf. Also put a couple of 50 MG mounts on the bridge and mount a 25MM cannon on the main deck where it has a good firing view of the area. Plus send a couple of the LCS ships out to the region. They are more suited for this type of interdiction instead of DDGs. They can get closer to the shore. Outfit them with a couple of SEAL Teams also. Then we'll go hunting for pirates or Bear!", 
        "intTime": 20090413, 
        "postID": 37, 
        "quote": "", 
        "reply": "My idea is to train the merchant men in anti-terrorist tactics like they do with our Sailors when they deploy to the Gulf. Also put a couple of 50 MG mounts on the bridge and mount a 25MM cannon on the main deck where it has a good firing view of the area. Plus send a couple of the LCS ships out to the region. They are more suited for this type of interdiction instead of DDGs. They can get closer to the shore. Outfit them with a couple of SEAL Teams also. Then we'll go hunting for pirates or Bear!", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 18:01:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "Jer_Pil"
    }, 
    {
        "content": "Here's an Idea, Put an attack sub off the coast. Wuith it's sonar it can follow a ship from thousand miles away. It can moniter the area and when the mother ship leave the harbor shadow it. When they see that it has launched the speed boats after a cargo ship. Sink the mother ship. Do that about five times in a row.They may never put to sea again,not knowing if they are being watched from below.", 
        "intTime": 20090413, 
        "postID": 38, 
        "quote": "", 
        "reply": "Here's an Idea, Put an attack sub off the coast. Wuith it's sonar it can follow a ship from thousand miles away. It can moniter the area and when the mother ship leave the harbor shadow it. When they see that it has launched the speed boats after a cargo ship. Sink the mother ship. Do that about five times in a row.They may never put to sea again,not knowing if they are being watched from below.", 
        "threadID": "5291911282_9360085022001", 
        "time": "2009-04-13 19:06:00", 
        "title": "Bring Back the Q-Boats!", 
        "userID": "ENYVTHS"
    }
]