[
    {
        "content": "i got out of the navy in Oct 07 i was an E-5 jet engine mechanic and im thinking about joining the air force. is that even possible i heard the air force doesnt take people from different services.", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "", 
        "reply": "i got out of the navy in Oct 07 i was an E-5 jet engine mechanic and im thinking about joining the air force. is that even possible i heard the air force doesnt take people from different services.", 
        "threadID": "5291911282_1980042122001", 
        "time": "2009-04-20 05:23:00", 
        "title": "join the air force", 
        "userID": "buddylee199"
    }, 
    {
        "content": "Your best bet would be to post your question here: Joining the military or here: Air Force You might also want to ask about the Army's Blue to Green program Wishing you the best, please keep us posted. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "Your best bet would be to post your question here: Joining the military or here: Air Force You might also want to ask about the Army's Blue to Green program Wishing you the best, please keep us posted. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_1980042122001", 
        "time": "2009-04-20 05:38:00", 
        "title": "join the air force", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by buddylee199: i got out of the navy in Oct 07 i was an E-5 jet engine mechanic and im thinking about joining the air force. is that even possible i heard the air force doesnt take people from different services. If you're a good jet engine mechanic with no discipline problems, I have to guess Army Helicopter Units and Air Force aircraft units could use your skills and would want you, Regular, Guard, or Reserve. Getting somebody already trained saves a grundle of money, so they aren't going to turn a blind eye to that. Go in to any recruiter, go after what you want, and you'll get it. . . Good Luck! Wandering and Wondering", 
        "intTime": 20090420, 
        "postID": 3, 
        "quote": "Originally posted by buddylee199: i got out of the navy in Oct 07 i was an E-5 jet engine mechanic and im thinking about joining the air force. is that even possible i heard the air force doesnt take people from different services.", 
        "reply": " If you're a good jet engine mechanic with no discipline problems, I have to guess Army Helicopter Units and Air Force aircraft units could use your skills and would want you, Regular, Guard, or Reserve. Getting somebody already trained saves a grundle of money, so they aren't going to turn a blind eye to that. Go in to any recruiter, go after what you want, and you'll get it. . . Good Luck! Wandering and Wondering", 
        "threadID": "5291911282_1980042122001", 
        "time": "2009-04-20 07:19:00", 
        "title": "join the air force", 
        "userID": "greywolfghost"
    }
]