[
    {
        "content": "I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?!", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "", 
        "reply": "I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 14:24:00", 
        "title": "No Faith", 
        "userID": "aaronl1369"
    }, 
    {
        "content": "quote: Originally posted by aaronl1369: I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?! well for starters instead of voting for the \"lesser of two evils\", or along party lines vote next time for an unknown, from any party,... they can't do any worse then what we've been getting. That should send a message or, and I know it will never happen, is have \"none of the above\" on the ballots, requiring the next batch to be brought forward. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "Originally posted by aaronl1369: I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?!", 
        "reply": " well for starters instead of voting for the \"lesser of two evils\", or along party lines vote next time for an unknown, from any party,... they can't do any worse then what we've been getting. That should send a message or, and I know it will never happen, is have \"none of the above\" on the ballots, requiring the next batch to be brought forward. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 14:31:00", 
        "title": "No Faith", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "", 
        "reply": "I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "No Faith", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think? Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state.", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "Originally posted by Vicdude: I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think?", 
        "reply": " Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 16:06:00", 
        "title": "No Faith", 
        "userID": "Vanir97"
    }, 
    {
        "content": "I am all for helping people get on their feet and to those less fortunate but we will be sorry for making this a land of hand outs. It is making us lazy and in the end a socialist state will be the end for America.", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "", 
        "reply": "I am all for helping people get on their feet and to those less fortunate but we will be sorry for making this a land of hand outs. It is making us lazy and in the end a socialist state will be the end for America.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 18:35:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Problem is, all the CEOs are gettin' the BIG handouts, and all the employees be gettin' the pink slips!! The CEOs ought to be getting the rope, and the workers should be getting the jobs going to the illegals here and the Asians there!!! Wandering and Wondering", 
        "intTime": 20090406, 
        "postID": 6, 
        "quote": "", 
        "reply": "Problem is, all the CEOs are gettin' the BIG handouts, and all the employees be gettin' the pink slips!! The CEOs ought to be getting the rope, and the workers should be getting the jobs going to the illegals here and the Asians there!!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 18:38:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I am not for the CEO's getting anything when the company is in trouble and they need a hand out. I also don't think we should give the same CEO's that got us in this trouble money to get us out. We need to clean house. Trouble is, it was not just the CEO's but the suits in DC and we need to clean house with them too. I am all for a workers program if we have enough jobs for the American's already here. Again, I am not for the hand out society. If people can get down to make babies, get in line for the handout then they can work and no job should be too low for them. I think we should provide day care and transportation to anyone who needs social assistance and after they work they can have their paycheck, foodstamps, housing etc Of course, for those who have real medical issues like our vets then I don't count them as a social handout. I am talking about the dead beats abusing that system.", 
        "intTime": 20090406, 
        "postID": 7, 
        "quote": "", 
        "reply": "I am not for the CEO's getting anything when the company is in trouble and they need a hand out. I also don't think we should give the same CEO's that got us in this trouble money to get us out. We need to clean house. Trouble is, it was not just the CEO's but the suits in DC and we need to clean house with them too. I am all for a workers program if we have enough jobs for the American's already here. Again, I am not for the hand out society. If people can get down to make babies, get in line for the handout then they can work and no job should be too low for them. I think we should provide day care and transportation to anyone who needs social assistance and after they work they can have their paycheck, foodstamps, housing etc Of course, for those who have real medical issues like our vets then I don't count them as a social handout. I am talking about the dead beats abusing that system.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 18:50:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "usa_girl, I hope you run for President, you have my vote! What you are talking about is the real, \"Change We Need\", that term has been loosely tossed around for sometime now. What you are talking about is change we desperately need. Close the public feeding trough, used by neerdowells. Help those truly in need. The dems and libs want to throw our money out to freeloaders. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090406, 
        "postID": 8, 
        "quote": "", 
        "reply": "usa_girl, I hope you run for President, you have my vote! What you are talking about is the real, \"Change We Need\", that term has been loosely tossed around for sometime now. What you are talking about is change we desperately need. Close the public feeding trough, used by neerdowells. Help those truly in need. The dems and libs want to throw our money out to freeloaders. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 21:19:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state. I agree that it won't ever happen but my whole purpose is to not label our leaders conservative or liberal or any thing else. I would just like to see elected men and women working for what they individually believe in. I myself don't consider myself a liberal or a conservative. If a candidate stands for what I believe in I vote for them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090407, 
        "postID": 9, 
        "quote": "Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state.", 
        "reply": " I agree that it won't ever happen but my whole purpose is to not label our leaders conservative or liberal or any thing else. I would just like to see elected men and women working for what they individually believe in. I myself don't consider myself a liberal or a conservative. If a candidate stands for what I believe in I vote for them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 05:35:00", 
        "title": "No Faith", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Do I have faith in what the dems and libs are doin? No!, heck no! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090407, 
        "postID": 10, 
        "quote": "", 
        "reply": "Do I have faith in what the dems and libs are doin? No!, heck no! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 05:39:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I think the main problem comes in that there is TOO MUCH government involvement. I don't like big CEO's getting bonus's when the company is in trouble either, but I don't think the government should be able to regulate that. That is for the PRIVATE SECTOR to deal with. Eventually, that business will fail (as long as the government doesn't get involved) that space created will make way for a new company with better money management and morals. I hate the bailout stuff because it's NEVER going to end now. Once you bail one out, you have the bail them all out. We're in for a real rocky 4 years, then hopefully someone with some marbles will run for office that's actually intelligent. My .02, you want to fix the economy?- Remove government regulations on when and where to drill, remove ridiculous regulations on MPG and emissions that make manufactoring cars so expensive, remove the welfare program for those that are able to work and aren't, or those that have been on it for a certain amount of time (case by case scenario). I don't think Daycare or foodstamps should be provided for the simple reason of if you can have a baby, you can figure out a way to take care of it. Severely disabled and elderly should be the ONLY ones receiving any kind of assistance. We have to get people out of this \"entitlement\" mentality. It's eating away at the core of this great nation and there needs to be an end put to it.", 
        "intTime": 20090407, 
        "postID": 11, 
        "quote": "", 
        "reply": "I think the main problem comes in that there is TOO MUCH government involvement. I don't like big CEO's getting bonus's when the company is in trouble either, but I don't think the government should be able to regulate that. That is for the PRIVATE SECTOR to deal with. Eventually, that business will fail (as long as the government doesn't get involved) that space created will make way for a new company with better money management and morals. I hate the bailout stuff because it's NEVER going to end now. Once you bail one out, you have the bail them all out. We're in for a real rocky 4 years, then hopefully someone with some marbles will run for office that's actually intelligent. My .02, you want to fix the economy?- Remove government regulations on when and where to drill, remove ridiculous regulations on MPG and emissions that make manufactoring cars so expensive, remove the welfare program for those that are able to work and aren't, or those that have been on it for a certain amount of time (case by case scenario). I don't think Daycare or foodstamps should be provided for the simple reason of if you can have a baby, you can figure out a way to take care of it. Severely disabled and elderly should be the ONLY ones receiving any kind of assistance. We have to get people out of this \"entitlement\" mentality. It's eating away at the core of this great nation and there needs to be an end put to it.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 07:22:00", 
        "title": "No Faith", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Bergy you can be my VP! armywifefigueroa.. I agree that we don't want to reward bad behavior and encourage lazy behavior but I am all for a hand reaching out to help. We can't hurt the children of a parent that made bad choices. So, we take away the excuses and I know the first is \"I don't have day care\" and \"I have no way to get there\" If you have a bus pass and a safe place to leave the children then they can focus on going to work and getting that pay check. Shoot, if you want you can deduct a little from the check and put it towards paying back the day care and bus pass. handouts never work but people do need a helping hand to get on the right path.", 
        "intTime": 20090407, 
        "postID": 12, 
        "quote": "", 
        "reply": "Bergy you can be my VP! armywifefigueroa.. I agree that we don't want to reward bad behavior and encourage lazy behavior but I am all for a hand reaching out to help. We can't hurt the children of a parent that made bad choices. So, we take away the excuses and I know the first is \"I don't have day care\" and \"I have no way to get there\" If you have a bus pass and a safe place to leave the children then they can focus on going to work and getting that pay check. Shoot, if you want you can deduct a little from the check and put it towards paying back the day care and bus pass. handouts never work but people do need a helping hand to get on the right path.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 12:20:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "I would agree to a certain extent, USA, but I have seen too many take advantage of the system. The problem comes in that people EXPECT that help to be there instead of workin' their rearends off to get what they want. You take all those hand-outs away and suddenly you don't have such a picky workforce, you know what I'm sayin? I understand not wanting to hurt the children and it is unfortunate that happens that way, but we have got to stop this vicious cycle of helping everyone. People have to learn to help themselves and if you take away that safety net of the \"gov'ment\" always being there, then suddenly that job at the landscaping company that they were too good for before has a little more appeal. The government didn't have that baby, the person did and it is their responsibility to take care of it, not the governments or the taxpayers, if that is the case, then the children should be taken away and put into state custody to begin with.", 
        "intTime": 20090407, 
        "postID": 13, 
        "quote": "", 
        "reply": "I would agree to a certain extent, USA, but I have seen too many take advantage of the system. The problem comes in that people EXPECT that help to be there instead of workin' their rearends off to get what they want. You take all those hand-outs away and suddenly you don't have such a picky workforce, you know what I'm sayin? I understand not wanting to hurt the children and it is unfortunate that happens that way, but we have got to stop this vicious cycle of helping everyone. People have to learn to help themselves and if you take away that safety net of the \"gov'ment\" always being there, then suddenly that job at the landscaping company that they were too good for before has a little more appeal. The government didn't have that baby, the person did and it is their responsibility to take care of it, not the governments or the taxpayers, if that is the case, then the children should be taken away and put into state custody to begin with.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 14:12:00", 
        "title": "No Faith", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I'm living in a area that is becoming more and more \"Welfare Recipient Heaven.\" All the homes are small and older. The original buyers have long since died out of them. Now, most of the homes are owned en mass by people who could care less what happens to these neighborhoods as long as the rent comes in - so they rent everything to people on welfare assistance, because the money is guaranteed to keep coming in. But the people they rent to are nothing but a bunch lay-abouts. Day in and day out, they set in groups on the porches doing nothing but smoking cigarettes, drinking beer, and piling up trash to make things even worse around here... THAT is what's wrong with America, in a nutshell!! Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 14, 
        "quote": "", 
        "reply": "I'm living in a area that is becoming more and more \"Welfare Recipient Heaven.\" All the homes are small and older. The original buyers have long since died out of them. Now, most of the homes are owned en mass by people who could care less what happens to these neighborhoods as long as the rent comes in - so they rent everything to people on welfare assistance, because the money is guaranteed to keep coming in. But the people they rent to are nothing but a bunch lay-abouts. Day in and day out, they set in groups on the porches doing nothing but smoking cigarettes, drinking beer, and piling up trash to make things even worse around here... THAT is what's wrong with America, in a nutshell!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:01:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, This Country needs more people like you. My hackles really go up when home owners put their homes up for rent. They rent it out to more than one family, so the renters can afford the rent. The renters couldn't care less about the property. The sit around, take drugs, drink and let the place go to hell in a handbasket. Neighborhods that were nice begin to look like ghetto's! GWG, kick butt and take names! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090407, 
        "postID": 15, 
        "quote": "", 
        "reply": "GWG, This Country needs more people like you. My hackles really go up when home owners put their homes up for rent. They rent it out to more than one family, so the renters can afford the rent. The renters couldn't care less about the property. The sit around, take drugs, drink and let the place go to hell in a handbasket. Neighborhods that were nice begin to look like ghetto's! GWG, kick butt and take names! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:13:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy - - you crack me up!! Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 16, 
        "quote": "", 
        "reply": "Bergy - - you crack me up!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:14:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, thats ok bro, we all gotta stick together, this so called \"Change\" Obama is talking about is not good for those of us who are contributing to society! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090407, 
        "postID": 17, 
        "quote": "", 
        "reply": "GWG, thats ok bro, we all gotta stick together, this so called \"Change\" Obama is talking about is not good for those of us who are contributing to society! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:19:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Yup!! But I love yer posts some days...not as a put down .. . Some times, I'm so depressed or angry - and I read some of yer posts - and I just feel happier/better . . .Don't change a thing!!! Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 18, 
        "quote": "", 
        "reply": "Yup!! But I love yer posts some days...not as a put down .. . Some times, I'm so depressed or angry - and I read some of yer posts - and I just feel happier/better . . .Don't change a thing!!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:24:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Bergy and GWG, you two have a little bit of Clint in you from Gran Torino....did you see it? I loved it!!! armywife...I get what u r sayin. I am in Cally with the Octo mom so don't even get me started about paying for someone else and their children. And you know, back in the day people would walk for miles to work, go to the market, school etc and now they wont walk down the block. But still, at the end of the day, I don't want children to pay the price and I am not sure I trust those places they take the children. I think we need more restrictions too like Sherriff Joe in Arizona. I do wonder if the crime rate has gone down there even with his hard core rules. Even if they prison rate is up, he still turns a profit and makes them pay for their own room and board and meals and helps out the community and has brought back the chain gang method. You know the left is all over that and trying to bring him down.", 
        "intTime": 20090407, 
        "postID": 19, 
        "quote": "", 
        "reply": "Bergy and GWG, you two have a little bit of Clint in you from Gran Torino....did you see it? I loved it!!! armywife...I get what u r sayin. I am in Cally with the Octo mom so don't even get me started about paying for someone else and their children. And you know, back in the day people would walk for miles to work, go to the market, school etc and now they wont walk down the block. But still, at the end of the day, I don't want children to pay the price and I am not sure I trust those places they take the children. I think we need more restrictions too like Sherriff Joe in Arizona. I do wonder if the crime rate has gone down there even with his hard core rules. Even if they prison rate is up, he still turns a profit and makes them pay for their own room and board and meals and helps out the community and has brought back the chain gang method. You know the left is all over that and trying to bring him down.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 17:13:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Ain't seen Grand Torino, but I got the real thing going on right next door - a whole house full of lay-about sleazeballs, piling junk, old washing machines and broken cars in the front yard. If the city don't get after the druggie bums, I probably will - - Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 20, 
        "quote": "", 
        "reply": "Ain't seen Grand Torino, but I got the real thing going on right next door - a whole house full of lay-about sleazeballs, piling junk, old washing machines and broken cars in the front yard. If the city don't get after the druggie bums, I probably will - - Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 17:29:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?!", 
        "intTime": 20090406, 
        "postID": 21, 
        "quote": "", 
        "reply": "I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 14:24:00", 
        "title": "No Faith", 
        "userID": "aaronl1369"
    }, 
    {
        "content": "quote: Originally posted by aaronl1369: I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?! well for starters instead of voting for the \"lesser of two evils\", or along party lines vote next time for an unknown, from any party,... they can't do any worse then what we've been getting. That should send a message or, and I know it will never happen, is have \"none of the above\" on the ballots, requiring the next batch to be brought forward. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090406, 
        "postID": 22, 
        "quote": "Originally posted by aaronl1369: I don't even know if this is the right place for this. After looking back, all I've done; My country's history. I do believe that this is the greatest nation on earth. I have faith in my country, my Constitution, my form of government. I HAVE NO FAITH IN THOSE THAT RUN MY COUNTRY! No matter what \"party\" we get the same. We can't or don't want change. What is wrong with us? We forget where we come from. What can I do? WHAT CAN I DO?!", 
        "reply": " well for starters instead of voting for the \"lesser of two evils\", or along party lines vote next time for an unknown, from any party,... they can't do any worse then what we've been getting. That should send a message or, and I know it will never happen, is have \"none of the above\" on the ballots, requiring the next batch to be brought forward. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 14:31:00", 
        "title": "No Faith", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090406, 
        "postID": 23, 
        "quote": "", 
        "reply": "I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 15:02:00", 
        "title": "No Faith", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think? Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state.", 
        "intTime": 20090406, 
        "postID": 24, 
        "quote": "Originally posted by Vicdude: I have an idea. I doubt that it will ever happen but how about we dissolve all political parties, big and small. Candidates will campaign only on their stance on the issues they believe to be important. They will be nominated by partition. The top predetermined number of those partitioned for will be the candidates. Each shall have so many minutes of TV time, so many minutes of radio time and so many words in print. This campaigns will be paid from an established government fund. There will be no campaign contributions. Debates would be Round Robin and compulsory. Those citizens eighteen or older will receive a tax credit for voting. Election will be by vote count only. So what do y'all think?", 
        "reply": " Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 16:06:00", 
        "title": "No Faith", 
        "userID": "Vanir97"
    }, 
    {
        "content": "I am all for helping people get on their feet and to those less fortunate but we will be sorry for making this a land of hand outs. It is making us lazy and in the end a socialist state will be the end for America.", 
        "intTime": 20090406, 
        "postID": 25, 
        "quote": "", 
        "reply": "I am all for helping people get on their feet and to those less fortunate but we will be sorry for making this a land of hand outs. It is making us lazy and in the end a socialist state will be the end for America.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 18:35:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Problem is, all the CEOs are gettin' the BIG handouts, and all the employees be gettin' the pink slips!! The CEOs ought to be getting the rope, and the workers should be getting the jobs going to the illegals here and the Asians there!!! Wandering and Wondering", 
        "intTime": 20090406, 
        "postID": 26, 
        "quote": "", 
        "reply": "Problem is, all the CEOs are gettin' the BIG handouts, and all the employees be gettin' the pink slips!! The CEOs ought to be getting the rope, and the workers should be getting the jobs going to the illegals here and the Asians there!!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 18:38:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I am not for the CEO's getting anything when the company is in trouble and they need a hand out. I also don't think we should give the same CEO's that got us in this trouble money to get us out. We need to clean house. Trouble is, it was not just the CEO's but the suits in DC and we need to clean house with them too. I am all for a workers program if we have enough jobs for the American's already here. Again, I am not for the hand out society. If people can get down to make babies, get in line for the handout then they can work and no job should be too low for them. I think we should provide day care and transportation to anyone who needs social assistance and after they work they can have their paycheck, foodstamps, housing etc Of course, for those who have real medical issues like our vets then I don't count them as a social handout. I am talking about the dead beats abusing that system.", 
        "intTime": 20090406, 
        "postID": 27, 
        "quote": "", 
        "reply": "I am not for the CEO's getting anything when the company is in trouble and they need a hand out. I also don't think we should give the same CEO's that got us in this trouble money to get us out. We need to clean house. Trouble is, it was not just the CEO's but the suits in DC and we need to clean house with them too. I am all for a workers program if we have enough jobs for the American's already here. Again, I am not for the hand out society. If people can get down to make babies, get in line for the handout then they can work and no job should be too low for them. I think we should provide day care and transportation to anyone who needs social assistance and after they work they can have their paycheck, foodstamps, housing etc Of course, for those who have real medical issues like our vets then I don't count them as a social handout. I am talking about the dead beats abusing that system.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 18:50:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "usa_girl, I hope you run for President, you have my vote! What you are talking about is the real, \"Change We Need\", that term has been loosely tossed around for sometime now. What you are talking about is change we desperately need. Close the public feeding trough, used by neerdowells. Help those truly in need. The dems and libs want to throw our money out to freeloaders. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090406, 
        "postID": 28, 
        "quote": "", 
        "reply": "usa_girl, I hope you run for President, you have my vote! What you are talking about is the real, \"Change We Need\", that term has been loosely tossed around for sometime now. What you are talking about is change we desperately need. Close the public feeding trough, used by neerdowells. Help those truly in need. The dems and libs want to throw our money out to freeloaders. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-06 21:19:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state. I agree that it won't ever happen but my whole purpose is to not label our leaders conservative or liberal or any thing else. I would just like to see elected men and women working for what they individually believe in. I myself don't consider myself a liberal or a conservative. If a candidate stands for what I believe in I vote for them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090407, 
        "postID": 29, 
        "quote": "Never work Vic. There are just too many liberals in this country. We have to have a lot of conservatives just to counter act what they are trying to do, which is turn this country into a socialist state.", 
        "reply": " I agree that it won't ever happen but my whole purpose is to not label our leaders conservative or liberal or any thing else. I would just like to see elected men and women working for what they individually believe in. I myself don't consider myself a liberal or a conservative. If a candidate stands for what I believe in I vote for them. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 05:35:00", 
        "title": "No Faith", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Do I have faith in what the dems and libs are doin? No!, heck no! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090407, 
        "postID": 30, 
        "quote": "", 
        "reply": "Do I have faith in what the dems and libs are doin? No!, heck no! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 05:39:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I think the main problem comes in that there is TOO MUCH government involvement. I don't like big CEO's getting bonus's when the company is in trouble either, but I don't think the government should be able to regulate that. That is for the PRIVATE SECTOR to deal with. Eventually, that business will fail (as long as the government doesn't get involved) that space created will make way for a new company with better money management and morals. I hate the bailout stuff because it's NEVER going to end now. Once you bail one out, you have the bail them all out. We're in for a real rocky 4 years, then hopefully someone with some marbles will run for office that's actually intelligent. My .02, you want to fix the economy?- Remove government regulations on when and where to drill, remove ridiculous regulations on MPG and emissions that make manufactoring cars so expensive, remove the welfare program for those that are able to work and aren't, or those that have been on it for a certain amount of time (case by case scenario). I don't think Daycare or foodstamps should be provided for the simple reason of if you can have a baby, you can figure out a way to take care of it. Severely disabled and elderly should be the ONLY ones receiving any kind of assistance. We have to get people out of this \"entitlement\" mentality. It's eating away at the core of this great nation and there needs to be an end put to it.", 
        "intTime": 20090407, 
        "postID": 31, 
        "quote": "", 
        "reply": "I think the main problem comes in that there is TOO MUCH government involvement. I don't like big CEO's getting bonus's when the company is in trouble either, but I don't think the government should be able to regulate that. That is for the PRIVATE SECTOR to deal with. Eventually, that business will fail (as long as the government doesn't get involved) that space created will make way for a new company with better money management and morals. I hate the bailout stuff because it's NEVER going to end now. Once you bail one out, you have the bail them all out. We're in for a real rocky 4 years, then hopefully someone with some marbles will run for office that's actually intelligent. My .02, you want to fix the economy?- Remove government regulations on when and where to drill, remove ridiculous regulations on MPG and emissions that make manufactoring cars so expensive, remove the welfare program for those that are able to work and aren't, or those that have been on it for a certain amount of time (case by case scenario). I don't think Daycare or foodstamps should be provided for the simple reason of if you can have a baby, you can figure out a way to take care of it. Severely disabled and elderly should be the ONLY ones receiving any kind of assistance. We have to get people out of this \"entitlement\" mentality. It's eating away at the core of this great nation and there needs to be an end put to it.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 07:22:00", 
        "title": "No Faith", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Bergy you can be my VP! armywifefigueroa.. I agree that we don't want to reward bad behavior and encourage lazy behavior but I am all for a hand reaching out to help. We can't hurt the children of a parent that made bad choices. So, we take away the excuses and I know the first is \"I don't have day care\" and \"I have no way to get there\" If you have a bus pass and a safe place to leave the children then they can focus on going to work and getting that pay check. Shoot, if you want you can deduct a little from the check and put it towards paying back the day care and bus pass. handouts never work but people do need a helping hand to get on the right path.", 
        "intTime": 20090407, 
        "postID": 32, 
        "quote": "", 
        "reply": "Bergy you can be my VP! armywifefigueroa.. I agree that we don't want to reward bad behavior and encourage lazy behavior but I am all for a hand reaching out to help. We can't hurt the children of a parent that made bad choices. So, we take away the excuses and I know the first is \"I don't have day care\" and \"I have no way to get there\" If you have a bus pass and a safe place to leave the children then they can focus on going to work and getting that pay check. Shoot, if you want you can deduct a little from the check and put it towards paying back the day care and bus pass. handouts never work but people do need a helping hand to get on the right path.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 12:20:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "I would agree to a certain extent, USA, but I have seen too many take advantage of the system. The problem comes in that people EXPECT that help to be there instead of workin' their rearends off to get what they want. You take all those hand-outs away and suddenly you don't have such a picky workforce, you know what I'm sayin? I understand not wanting to hurt the children and it is unfortunate that happens that way, but we have got to stop this vicious cycle of helping everyone. People have to learn to help themselves and if you take away that safety net of the \"gov'ment\" always being there, then suddenly that job at the landscaping company that they were too good for before has a little more appeal. The government didn't have that baby, the person did and it is their responsibility to take care of it, not the governments or the taxpayers, if that is the case, then the children should be taken away and put into state custody to begin with.", 
        "intTime": 20090407, 
        "postID": 33, 
        "quote": "", 
        "reply": "I would agree to a certain extent, USA, but I have seen too many take advantage of the system. The problem comes in that people EXPECT that help to be there instead of workin' their rearends off to get what they want. You take all those hand-outs away and suddenly you don't have such a picky workforce, you know what I'm sayin? I understand not wanting to hurt the children and it is unfortunate that happens that way, but we have got to stop this vicious cycle of helping everyone. People have to learn to help themselves and if you take away that safety net of the \"gov'ment\" always being there, then suddenly that job at the landscaping company that they were too good for before has a little more appeal. The government didn't have that baby, the person did and it is their responsibility to take care of it, not the governments or the taxpayers, if that is the case, then the children should be taken away and put into state custody to begin with.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 14:12:00", 
        "title": "No Faith", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "I'm living in a area that is becoming more and more \"Welfare Recipient Heaven.\" All the homes are small and older. The original buyers have long since died out of them. Now, most of the homes are owned en mass by people who could care less what happens to these neighborhoods as long as the rent comes in - so they rent everything to people on welfare assistance, because the money is guaranteed to keep coming in. But the people they rent to are nothing but a bunch lay-abouts. Day in and day out, they set in groups on the porches doing nothing but smoking cigarettes, drinking beer, and piling up trash to make things even worse around here... THAT is what's wrong with America, in a nutshell!! Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 34, 
        "quote": "", 
        "reply": "I'm living in a area that is becoming more and more \"Welfare Recipient Heaven.\" All the homes are small and older. The original buyers have long since died out of them. Now, most of the homes are owned en mass by people who could care less what happens to these neighborhoods as long as the rent comes in - so they rent everything to people on welfare assistance, because the money is guaranteed to keep coming in. But the people they rent to are nothing but a bunch lay-abouts. Day in and day out, they set in groups on the porches doing nothing but smoking cigarettes, drinking beer, and piling up trash to make things even worse around here... THAT is what's wrong with America, in a nutshell!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:01:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, This Country needs more people like you. My hackles really go up when home owners put their homes up for rent. They rent it out to more than one family, so the renters can afford the rent. The renters couldn't care less about the property. The sit around, take drugs, drink and let the place go to hell in a handbasket. Neighborhods that were nice begin to look like ghetto's! GWG, kick butt and take names! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090407, 
        "postID": 35, 
        "quote": "", 
        "reply": "GWG, This Country needs more people like you. My hackles really go up when home owners put their homes up for rent. They rent it out to more than one family, so the renters can afford the rent. The renters couldn't care less about the property. The sit around, take drugs, drink and let the place go to hell in a handbasket. Neighborhods that were nice begin to look like ghetto's! GWG, kick butt and take names! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:13:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Bergy - - you crack me up!! Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 36, 
        "quote": "", 
        "reply": "Bergy - - you crack me up!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:14:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, thats ok bro, we all gotta stick together, this so called \"Change\" Obama is talking about is not good for those of us who are contributing to society! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090407, 
        "postID": 37, 
        "quote": "", 
        "reply": "GWG, thats ok bro, we all gotta stick together, this so called \"Change\" Obama is talking about is not good for those of us who are contributing to society! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:19:00", 
        "title": "No Faith", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Yup!! But I love yer posts some days...not as a put down .. . Some times, I'm so depressed or angry - and I read some of yer posts - and I just feel happier/better . . .Don't change a thing!!! Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 38, 
        "quote": "", 
        "reply": "Yup!! But I love yer posts some days...not as a put down .. . Some times, I'm so depressed or angry - and I read some of yer posts - and I just feel happier/better . . .Don't change a thing!!! Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 15:24:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Bergy and GWG, you two have a little bit of Clint in you from Gran Torino....did you see it? I loved it!!! armywife...I get what u r sayin. I am in Cally with the Octo mom so don't even get me started about paying for someone else and their children. And you know, back in the day people would walk for miles to work, go to the market, school etc and now they wont walk down the block. But still, at the end of the day, I don't want children to pay the price and I am not sure I trust those places they take the children. I think we need more restrictions too like Sherriff Joe in Arizona. I do wonder if the crime rate has gone down there even with his hard core rules. Even if they prison rate is up, he still turns a profit and makes them pay for their own room and board and meals and helps out the community and has brought back the chain gang method. You know the left is all over that and trying to bring him down.", 
        "intTime": 20090407, 
        "postID": 39, 
        "quote": "", 
        "reply": "Bergy and GWG, you two have a little bit of Clint in you from Gran Torino....did you see it? I loved it!!! armywife...I get what u r sayin. I am in Cally with the Octo mom so don't even get me started about paying for someone else and their children. And you know, back in the day people would walk for miles to work, go to the market, school etc and now they wont walk down the block. But still, at the end of the day, I don't want children to pay the price and I am not sure I trust those places they take the children. I think we need more restrictions too like Sherriff Joe in Arizona. I do wonder if the crime rate has gone down there even with his hard core rules. Even if they prison rate is up, he still turns a profit and makes them pay for their own room and board and meals and helps out the community and has brought back the chain gang method. You know the left is all over that and trying to bring him down.", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 17:13:00", 
        "title": "No Faith", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Ain't seen Grand Torino, but I got the real thing going on right next door - a whole house full of lay-about sleazeballs, piling junk, old washing machines and broken cars in the front yard. If the city don't get after the druggie bums, I probably will - - Wandering and Wondering", 
        "intTime": 20090407, 
        "postID": 40, 
        "quote": "", 
        "reply": "Ain't seen Grand Torino, but I got the real thing going on right next door - a whole house full of lay-about sleazeballs, piling junk, old washing machines and broken cars in the front yard. If the city don't get after the druggie bums, I probably will - - Wandering and Wondering", 
        "threadID": "5291911282_5350099912001", 
        "time": "2009-04-07 17:29:00", 
        "title": "No Faith", 
        "userID": "greywolfghost"
    }
]