[
    {
        "content": "Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "", 
        "reply": "Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 13:20:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:45:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "yokozuna"
    }, 
    {
        "content": "I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:56:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "gsuchey"
    }, 
    {
        "content": "The is no such thing as the new \"Yankee Stadium\". If The Babe, Gehrig, DiMaggio, the Mick, Yogi, and Reggie didn't trod it's base paths, it AIN'T Yankee Stadium!! The Real Thing ain't there no more! That said - - have at it... I hope it's a clean sweep for the Yanks - - Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "", 
        "reply": "The is no such thing as the new \"Yankee Stadium\". If The Babe, Gehrig, DiMaggio, the Mick, Yogi, and Reggie didn't trod it's base paths, it AIN'T Yankee Stadium!! The Real Thing ain't there no more! That said - - have at it... I hope it's a clean sweep for the Yanks - - Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:58:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "", 
        "reply": "GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:09:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7 What about Yankee Stadium? Have the cubs played there yet?", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Originally posted by yokozuna: The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "reply": " What about Yankee Stadium? Have the cubs played there yet?", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:10:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box. The guy that made watching baseball on TV in the 50s a must for a 7 year old kid - - The \"BLAST\"!! On May 22, 1963 Mickey Mantle came within six feet of hitting a fair ball out of Yankee Stadium. In the eleventh inning of a strange game, Mickey hit a 2-2 Bill Fischer off the right field upper façade to give the Yankees an 8-7 victory. The façade was 108 feet high and the distance from home plate was 374 feet. The ball was rising when it hit. Mickey thought it was the hardest ball he had ever hit.“…though I knew it would be well up there, I didn’t think it would go out of the park.” Players Were in Awe of the Blast The next day, former Yankee Norm Siebern expressed the feelings of everyone who ever saw Mantle play. “He ought to have a league of his own. He’s too much for everyone else.” Bill Fischer, who yielded the blast, was realistic. “He gets $100,000. He has to be making it for some reason.” And Kansas City manager Eddie Lopat, who had been with the Yankees when Mickey came up in 1951, said simply, “I’m a pitcher. I know the sound. I just turned my back.” Different Estimates of the Distance the Ball Would Have Gone: There have been many estimates with respect to how far the ball would have traveled, ranging from 506 to 734 feet, with a value of 636 in the middle. No one can hit a baseball 700 feet. Six hundred and thirty six feet appears reasonable, but HitTracker calculates the distance as 506 feet. However, it used the distance from home plate to the façade where the ball hit as 372 feet and the height as 102 feet., which are approximations. Regardless, it was one of the most awe-inspiring home runs ever hit. Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "reply": " The guy that made watching baseball on TV in the 50s a must for a 7 year old kid - - The \"BLAST\"!! On May 22, 1963 Mickey Mantle came within six feet of hitting a fair ball out of Yankee Stadium. In the eleventh inning of a strange game, Mickey hit a 2-2 Bill Fischer off the right field upper façade to give the Yankees an 8-7 victory. The façade was 108 feet high and the distance from home plate was 374 feet. The ball was rising when it hit. Mickey thought it was the hardest ball he had ever hit.“…though I knew it would be well up there, I didn’t think it would go out of the park.” Players Were in Awe of the Blast The next day, former Yankee Norm Siebern expressed the feelings of everyone who ever saw Mantle play. “He ought to have a league of his own. He’s too much for everyone else.” Bill Fischer, who yielded the blast, was realistic. “He gets $100,000. He has to be making it for some reason.” And Kansas City manager Eddie Lopat, who had been with the Yankees when Mickey came up in 1951, said simply, “I’m a pitcher. I know the sound. I just turned my back.” Different Estimates of the Distance the Ball Would Have Gone: There have been many estimates with respect to how far the ball would have traveled, ranging from 506 to 734 feet, with a value of 636 in the middle. No one can hit a baseball 700 feet. Six hundred and thirty six feet appears reasonable, but HitTracker calculates the distance as 506 feet. However, it used the distance from home plate to the façade where the ball hit as 372 feet and the height as 102 feet., which are approximations. Regardless, it was one of the most awe-inspiring home runs ever hit. Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:18:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The Mick was and still is my favorite player. I also like Jeter and Matingly very much.", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "", 
        "reply": "The Mick was and still is my favorite player. I also like Jeter and Matingly very much.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 17:19:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "", 
        "reply": "Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 19:35:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "yokozuna"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games. Oh please! The Cubbies have not won a World Series since 1908. Had the Cubs won it all last year, THAT WOULD HAVE BEEN NEWS! File this under who cares?!? And the first winner in the new Yankee will be the answer of a trivia question. Speaking of trivia, which city won the 1906 World Series?", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "reply": " Oh please! The Cubbies have not won a World Series since 1908. Had the Cubs won it all last year, THAT WOULD HAVE BEEN NEWS! File this under who cares?!? And the first winner in the new Yankee will be the answer of a trivia question. Speaking of trivia, which city won the 1906 World Series?", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 22:33:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium. You are a true baseball fan. Enjoy the game. I know I will.", 
        "intTime": 20090326, 
        "postID": 11, 
        "quote": "Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "reply": " You are a true baseball fan. Enjoy the game. I know I will.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:17:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Just wondering if they ever found that second Red Sox David Ortiz shirt buried in the base of the new Yankees stadium? Don", 
        "intTime": 20090326, 
        "postID": 12, 
        "quote": "", 
        "reply": "Just wondering if they ever found that second Red Sox David Ortiz shirt buried in the base of the new Yankees stadium? Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:46:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Why? The Cardinals aren't playing. I hate the cubs. If they never win another game, I'll be happy. I'll settle for them never winning a World Series in my lifetime. Oh yeah, and I hate the Yankees. My father was Browns fan. He never was much of a baseball fan when they left. He kinda supported the Cardinals because they were the hometown team, but never got over them leaving. Like all other AL team supporters, he hated the Yankees and passed that hatred along to me. Now, if the cubs and Yankees ever meet in a meaningful game, I'll root for the Yankees, but to watch a meaningless game between the 2 teams I hate most!! Naaah, I'll sort my sock drawer or watch Lifetime before I'll waste a few hours for that.", 
        "intTime": 20090326, 
        "postID": 13, 
        "quote": "For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games.", 
        "reply": " Why? The Cardinals aren't playing. I hate the cubs. If they never win another game, I'll be happy. I'll settle for them never winning a World Series in my lifetime. Oh yeah, and I hate the Yankees. My father was Browns fan. He never was much of a baseball fan when they left. He kinda supported the Cardinals because they were the hometown team, but never got over them leaving. Like all other AL team supporters, he hated the Yankees and passed that hatred along to me. Now, if the cubs and Yankees ever meet in a meaningful game, I'll root for the Yankees, but to watch a meaningless game between the 2 teams I hate most!! Naaah, I'll sort my sock drawer or watch Lifetime before I'll waste a few hours for that.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:53:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by gsuchey: I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching. I LOVE baseball, but don't follow MLB. You need to come to Omaha in June for teh college world sereies. Some of the best baseball, adn fantastic tailgating for 10 straight days. Open invite for ya. Starts June 13th(my birthday), and goes through teh 24th. I have the tix, if you can get here. Great time. Nothign like it.", 
        "intTime": 20090326, 
        "postID": 14, 
        "quote": "Originally posted by gsuchey: I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "reply": " I LOVE baseball, but don't follow MLB. You need to come to Omaha in June for teh college world sereies. Some of the best baseball, adn fantastic tailgating for 10 straight days. Open invite for ya. Starts June 13th(my birthday), and goes through teh 24th. I have the tix, if you can get here. Great time. Nothign like it.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 05:32:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium. Two ways: First: If you click on the little folder with quote marks in bottom right of \"poster's\" box, his whole post will appear in a reply box. You can delete any portions within the quote you don't want to address, before putting your own post under it. Second: If you highlight the portion you wish to quote, then go clear down and click on the \"Reply\" box at the bottom of the whole page, the highlighted portion will automatically appear in the top of the reply box as a quote - - Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 15, 
        "quote": "Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "reply": " Two ways: First: If you click on the little folder with quote marks in bottom right of \"poster's\" box, his whole post will appear in a reply box. You can delete any portions within the quote you don't want to address, before putting your own post under it. Second: If you highlight the portion you wish to quote, then go clear down and click on the \"Reply\" box at the bottom of the whole page, the highlighted portion will automatically appear in the top of the reply box as a quote - - Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 06:23:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090326, 
        "postID": 16, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:21:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 17, 
        "quote": "", 
        "reply": "Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:24:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "And for all the \"little guys\" who dreamed of playing in Major League Baseball.... Dustin Pedroia, MVP 2008 Don", 
        "intTime": 20090326, 
        "postID": 18, 
        "quote": "", 
        "reply": "And for all the \"little guys\" who dreamed of playing in Major League Baseball.... Dustin Pedroia, MVP 2008 Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:33:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Did you guys ever see that ESPN/Sportcenter commercial with Posada and Ortiz? Posada has a new Yankees hat and Ortiz is showing him how to break it in. As Ortiz is wearing the Yankees hat, Wally, the Red Sox mascot walks by and freaks. Pretty funny. youtube.com/watch?v=vp_sr5oYIL0 Don", 
        "intTime": 20090326, 
        "postID": 19, 
        "quote": "", 
        "reply": "Did you guys ever see that ESPN/Sportcenter commercial with Posada and Ortiz? Posada has a new Yankees hat and Ortiz is showing him how to break it in. As Ortiz is wearing the Yankees hat, Wally, the Red Sox mascot walks by and freaks. Pretty funny. youtube.com/watch?v=vp_sr5oYIL0 Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:44:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Mr. October Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 20, 
        "quote": "", 
        "reply": "Mr. October Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:51:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "intTime": 20090325, 
        "postID": 21, 
        "quote": "", 
        "reply": "Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 13:20:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "intTime": 20090325, 
        "postID": 22, 
        "quote": "", 
        "reply": "The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:45:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "yokozuna"
    }, 
    {
        "content": "I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "intTime": 20090325, 
        "postID": 23, 
        "quote": "", 
        "reply": "I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:56:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "gsuchey"
    }, 
    {
        "content": "The is no such thing as the new \"Yankee Stadium\". If The Babe, Gehrig, DiMaggio, the Mick, Yogi, and Reggie didn't trod it's base paths, it AIN'T Yankee Stadium!! The Real Thing ain't there no more! That said - - have at it... I hope it's a clean sweep for the Yanks - - Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 24, 
        "quote": "", 
        "reply": "The is no such thing as the new \"Yankee Stadium\". If The Babe, Gehrig, DiMaggio, the Mick, Yogi, and Reggie didn't trod it's base paths, it AIN'T Yankee Stadium!! The Real Thing ain't there no more! That said - - have at it... I hope it's a clean sweep for the Yanks - - Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:58:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "intTime": 20090325, 
        "postID": 25, 
        "quote": "", 
        "reply": "GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:09:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7 What about Yankee Stadium? Have the cubs played there yet?", 
        "intTime": 20090325, 
        "postID": 26, 
        "quote": "Originally posted by yokozuna: The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "reply": " What about Yankee Stadium? Have the cubs played there yet?", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:10:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box. The guy that made watching baseball on TV in the 50s a must for a 7 year old kid - - The \"BLAST\"!! On May 22, 1963 Mickey Mantle came within six feet of hitting a fair ball out of Yankee Stadium. In the eleventh inning of a strange game, Mickey hit a 2-2 Bill Fischer off the right field upper façade to give the Yankees an 8-7 victory. The façade was 108 feet high and the distance from home plate was 374 feet. The ball was rising when it hit. Mickey thought it was the hardest ball he had ever hit.“…though I knew it would be well up there, I didn’t think it would go out of the park.” Players Were in Awe of the Blast The next day, former Yankee Norm Siebern expressed the feelings of everyone who ever saw Mantle play. “He ought to have a league of his own. He’s too much for everyone else.” Bill Fischer, who yielded the blast, was realistic. “He gets $100,000. He has to be making it for some reason.” And Kansas City manager Eddie Lopat, who had been with the Yankees when Mickey came up in 1951, said simply, “I’m a pitcher. I know the sound. I just turned my back.” Different Estimates of the Distance the Ball Would Have Gone: There have been many estimates with respect to how far the ball would have traveled, ranging from 506 to 734 feet, with a value of 636 in the middle. No one can hit a baseball 700 feet. Six hundred and thirty six feet appears reasonable, but HitTracker calculates the distance as 506 feet. However, it used the distance from home plate to the façade where the ball hit as 372 feet and the height as 102 feet., which are approximations. Regardless, it was one of the most awe-inspiring home runs ever hit. Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 27, 
        "quote": "Originally posted by Duster6: GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "reply": " The guy that made watching baseball on TV in the 50s a must for a 7 year old kid - - The \"BLAST\"!! On May 22, 1963 Mickey Mantle came within six feet of hitting a fair ball out of Yankee Stadium. In the eleventh inning of a strange game, Mickey hit a 2-2 Bill Fischer off the right field upper façade to give the Yankees an 8-7 victory. The façade was 108 feet high and the distance from home plate was 374 feet. The ball was rising when it hit. Mickey thought it was the hardest ball he had ever hit.“…though I knew it would be well up there, I didn’t think it would go out of the park.” Players Were in Awe of the Blast The next day, former Yankee Norm Siebern expressed the feelings of everyone who ever saw Mantle play. “He ought to have a league of his own. He’s too much for everyone else.” Bill Fischer, who yielded the blast, was realistic. “He gets $100,000. He has to be making it for some reason.” And Kansas City manager Eddie Lopat, who had been with the Yankees when Mickey came up in 1951, said simply, “I’m a pitcher. I know the sound. I just turned my back.” Different Estimates of the Distance the Ball Would Have Gone: There have been many estimates with respect to how far the ball would have traveled, ranging from 506 to 734 feet, with a value of 636 in the middle. No one can hit a baseball 700 feet. Six hundred and thirty six feet appears reasonable, but HitTracker calculates the distance as 506 feet. However, it used the distance from home plate to the façade where the ball hit as 372 feet and the height as 102 feet., which are approximations. Regardless, it was one of the most awe-inspiring home runs ever hit. Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:18:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The Mick was and still is my favorite player. I also like Jeter and Matingly very much.", 
        "intTime": 20090325, 
        "postID": 28, 
        "quote": "", 
        "reply": "The Mick was and still is my favorite player. I also like Jeter and Matingly very much.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 17:19:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "intTime": 20090325, 
        "postID": 29, 
        "quote": "", 
        "reply": "Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 19:35:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "yokozuna"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games. Oh please! The Cubbies have not won a World Series since 1908. Had the Cubs won it all last year, THAT WOULD HAVE BEEN NEWS! File this under who cares?!? And the first winner in the new Yankee will be the answer of a trivia question. Speaking of trivia, which city won the 1906 World Series?", 
        "intTime": 20090325, 
        "postID": 30, 
        "quote": "Originally posted by Duster6: Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "reply": " Oh please! The Cubbies have not won a World Series since 1908. Had the Cubs won it all last year, THAT WOULD HAVE BEEN NEWS! File this under who cares?!? And the first winner in the new Yankee will be the answer of a trivia question. Speaking of trivia, which city won the 1906 World Series?", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 22:33:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium. You are a true baseball fan. Enjoy the game. I know I will.", 
        "intTime": 20090326, 
        "postID": 31, 
        "quote": "Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "reply": " You are a true baseball fan. Enjoy the game. I know I will.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:17:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Just wondering if they ever found that second Red Sox David Ortiz shirt buried in the base of the new Yankees stadium? Don", 
        "intTime": 20090326, 
        "postID": 32, 
        "quote": "", 
        "reply": "Just wondering if they ever found that second Red Sox David Ortiz shirt buried in the base of the new Yankees stadium? Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:46:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Why? The Cardinals aren't playing. I hate the cubs. If they never win another game, I'll be happy. I'll settle for them never winning a World Series in my lifetime. Oh yeah, and I hate the Yankees. My father was Browns fan. He never was much of a baseball fan when they left. He kinda supported the Cardinals because they were the hometown team, but never got over them leaving. Like all other AL team supporters, he hated the Yankees and passed that hatred along to me. Now, if the cubs and Yankees ever meet in a meaningful game, I'll root for the Yankees, but to watch a meaningless game between the 2 teams I hate most!! Naaah, I'll sort my sock drawer or watch Lifetime before I'll waste a few hours for that.", 
        "intTime": 20090326, 
        "postID": 33, 
        "quote": "For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games.", 
        "reply": " Why? The Cardinals aren't playing. I hate the cubs. If they never win another game, I'll be happy. I'll settle for them never winning a World Series in my lifetime. Oh yeah, and I hate the Yankees. My father was Browns fan. He never was much of a baseball fan when they left. He kinda supported the Cardinals because they were the hometown team, but never got over them leaving. Like all other AL team supporters, he hated the Yankees and passed that hatred along to me. Now, if the cubs and Yankees ever meet in a meaningful game, I'll root for the Yankees, but to watch a meaningless game between the 2 teams I hate most!! Naaah, I'll sort my sock drawer or watch Lifetime before I'll waste a few hours for that.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:53:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by gsuchey: I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching. I LOVE baseball, but don't follow MLB. You need to come to Omaha in June for teh college world sereies. Some of the best baseball, adn fantastic tailgating for 10 straight days. Open invite for ya. Starts June 13th(my birthday), and goes through teh 24th. I have the tix, if you can get here. Great time. Nothign like it.", 
        "intTime": 20090326, 
        "postID": 34, 
        "quote": "Originally posted by gsuchey: I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "reply": " I LOVE baseball, but don't follow MLB. You need to come to Omaha in June for teh college world sereies. Some of the best baseball, adn fantastic tailgating for 10 straight days. Open invite for ya. Starts June 13th(my birthday), and goes through teh 24th. I have the tix, if you can get here. Great time. Nothign like it.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 05:32:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium. Two ways: First: If you click on the little folder with quote marks in bottom right of \"poster's\" box, his whole post will appear in a reply box. You can delete any portions within the quote you don't want to address, before putting your own post under it. Second: If you highlight the portion you wish to quote, then go clear down and click on the \"Reply\" box at the bottom of the whole page, the highlighted portion will automatically appear in the top of the reply box as a quote - - Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 35, 
        "quote": "Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "reply": " Two ways: First: If you click on the little folder with quote marks in bottom right of \"poster's\" box, his whole post will appear in a reply box. You can delete any portions within the quote you don't want to address, before putting your own post under it. Second: If you highlight the portion you wish to quote, then go clear down and click on the \"Reply\" box at the bottom of the whole page, the highlighted portion will automatically appear in the top of the reply box as a quote - - Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 06:23:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090326, 
        "postID": 36, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:21:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 37, 
        "quote": "", 
        "reply": "Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:24:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "And for all the \"little guys\" who dreamed of playing in Major League Baseball.... Dustin Pedroia, MVP 2008 Don", 
        "intTime": 20090326, 
        "postID": 38, 
        "quote": "", 
        "reply": "And for all the \"little guys\" who dreamed of playing in Major League Baseball.... Dustin Pedroia, MVP 2008 Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:33:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Did you guys ever see that ESPN/Sportcenter commercial with Posada and Ortiz? Posada has a new Yankees hat and Ortiz is showing him how to break it in. As Ortiz is wearing the Yankees hat, Wally, the Red Sox mascot walks by and freaks. Pretty funny. youtube.com/watch?v=vp_sr5oYIL0 Don", 
        "intTime": 20090326, 
        "postID": 39, 
        "quote": "", 
        "reply": "Did you guys ever see that ESPN/Sportcenter commercial with Posada and Ortiz? Posada has a new Yankees hat and Ortiz is showing him how to break it in. As Ortiz is wearing the Yankees hat, Wally, the Red Sox mascot walks by and freaks. Pretty funny. youtube.com/watch?v=vp_sr5oYIL0 Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:44:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Mr. October Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 40, 
        "quote": "", 
        "reply": "Mr. October Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:51:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "intTime": 20090325, 
        "postID": 41, 
        "quote": "", 
        "reply": "Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 13:20:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "intTime": 20090325, 
        "postID": 42, 
        "quote": "", 
        "reply": "The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:45:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "yokozuna"
    }, 
    {
        "content": "I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "intTime": 20090325, 
        "postID": 43, 
        "quote": "", 
        "reply": "I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:56:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "gsuchey"
    }, 
    {
        "content": "The is no such thing as the new \"Yankee Stadium\". If The Babe, Gehrig, DiMaggio, the Mick, Yogi, and Reggie didn't trod it's base paths, it AIN'T Yankee Stadium!! The Real Thing ain't there no more! That said - - have at it... I hope it's a clean sweep for the Yanks - - Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 44, 
        "quote": "", 
        "reply": "The is no such thing as the new \"Yankee Stadium\". If The Babe, Gehrig, DiMaggio, the Mick, Yogi, and Reggie didn't trod it's base paths, it AIN'T Yankee Stadium!! The Real Thing ain't there no more! That said - - have at it... I hope it's a clean sweep for the Yanks - - Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 14:58:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "intTime": 20090325, 
        "postID": 45, 
        "quote": "", 
        "reply": "GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:09:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7 What about Yankee Stadium? Have the cubs played there yet?", 
        "intTime": 20090325, 
        "postID": 46, 
        "quote": "Originally posted by yokozuna: The Cubs played the Yankees at Wrigley Field on 6, 7 and 8 June 2003 & took 2 of 3 from them. Game 1 - Cubs 3 Yankees 5 Game 2 - Cubs 5 Yankees 2 Game 3 - Cubs 8 Yankees 7", 
        "reply": " What about Yankee Stadium? Have the cubs played there yet?", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:10:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box. The guy that made watching baseball on TV in the 50s a must for a 7 year old kid - - The \"BLAST\"!! On May 22, 1963 Mickey Mantle came within six feet of hitting a fair ball out of Yankee Stadium. In the eleventh inning of a strange game, Mickey hit a 2-2 Bill Fischer off the right field upper façade to give the Yankees an 8-7 victory. The façade was 108 feet high and the distance from home plate was 374 feet. The ball was rising when it hit. Mickey thought it was the hardest ball he had ever hit.“…though I knew it would be well up there, I didn’t think it would go out of the park.” Players Were in Awe of the Blast The next day, former Yankee Norm Siebern expressed the feelings of everyone who ever saw Mantle play. “He ought to have a league of his own. He’s too much for everyone else.” Bill Fischer, who yielded the blast, was realistic. “He gets $100,000. He has to be making it for some reason.” And Kansas City manager Eddie Lopat, who had been with the Yankees when Mickey came up in 1951, said simply, “I’m a pitcher. I know the sound. I just turned my back.” Different Estimates of the Distance the Ball Would Have Gone: There have been many estimates with respect to how far the ball would have traveled, ranging from 506 to 734 feet, with a value of 636 in the middle. No one can hit a baseball 700 feet. Six hundred and thirty six feet appears reasonable, but HitTracker calculates the distance as 506 feet. However, it used the distance from home plate to the façade where the ball hit as 372 feet and the height as 102 feet., which are approximations. Regardless, it was one of the most awe-inspiring home runs ever hit. Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 47, 
        "quote": "Originally posted by Duster6: GWG; Some of the old Yankee Stadium infield dirt and out field grass was put into the new stadium outfield and infield along with the batters box.", 
        "reply": " The guy that made watching baseball on TV in the 50s a must for a 7 year old kid - - The \"BLAST\"!! On May 22, 1963 Mickey Mantle came within six feet of hitting a fair ball out of Yankee Stadium. In the eleventh inning of a strange game, Mickey hit a 2-2 Bill Fischer off the right field upper façade to give the Yankees an 8-7 victory. The façade was 108 feet high and the distance from home plate was 374 feet. The ball was rising when it hit. Mickey thought it was the hardest ball he had ever hit.“…though I knew it would be well up there, I didn’t think it would go out of the park.” Players Were in Awe of the Blast The next day, former Yankee Norm Siebern expressed the feelings of everyone who ever saw Mantle play. “He ought to have a league of his own. He’s too much for everyone else.” Bill Fischer, who yielded the blast, was realistic. “He gets $100,000. He has to be making it for some reason.” And Kansas City manager Eddie Lopat, who had been with the Yankees when Mickey came up in 1951, said simply, “I’m a pitcher. I know the sound. I just turned my back.” Different Estimates of the Distance the Ball Would Have Gone: There have been many estimates with respect to how far the ball would have traveled, ranging from 506 to 734 feet, with a value of 636 in the middle. No one can hit a baseball 700 feet. Six hundred and thirty six feet appears reasonable, but HitTracker calculates the distance as 506 feet. However, it used the distance from home plate to the façade where the ball hit as 372 feet and the height as 102 feet., which are approximations. Regardless, it was one of the most awe-inspiring home runs ever hit. Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 15:18:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The Mick was and still is my favorite player. I also like Jeter and Matingly very much.", 
        "intTime": 20090325, 
        "postID": 48, 
        "quote": "", 
        "reply": "The Mick was and still is my favorite player. I also like Jeter and Matingly very much.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 17:19:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "intTime": 20090325, 
        "postID": 49, 
        "quote": "", 
        "reply": "Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 19:35:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "yokozuna"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games. Oh please! The Cubbies have not won a World Series since 1908. Had the Cubs won it all last year, THAT WOULD HAVE BEEN NEWS! File this under who cares?!? And the first winner in the new Yankee will be the answer of a trivia question. Speaking of trivia, which city won the 1906 World Series?", 
        "intTime": 20090325, 
        "postID": 50, 
        "quote": "Originally posted by Duster6: Breaking News... On Friday night, April 1st and Saturday night April 2nd, the Cubs will play the first of two games at the new Yankee Stadium. For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Check your TV listing for what channel it will be on. I understand this is the first time ever or at least the first time in modern history that these two teams played each other. These are exhibition games.", 
        "reply": " Oh please! The Cubbies have not won a World Series since 1908. Had the Cubs won it all last year, THAT WOULD HAVE BEEN NEWS! File this under who cares?!? And the first winner in the new Yankee will be the answer of a trivia question. Speaking of trivia, which city won the 1906 World Series?", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-25 22:33:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium. You are a true baseball fan. Enjoy the game. I know I will.", 
        "intTime": 20090326, 
        "postID": 51, 
        "quote": "Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "reply": " You are a true baseball fan. Enjoy the game. I know I will.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:17:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Just wondering if they ever found that second Red Sox David Ortiz shirt buried in the base of the new Yankees stadium? Don", 
        "intTime": 20090326, 
        "postID": 52, 
        "quote": "", 
        "reply": "Just wondering if they ever found that second Red Sox David Ortiz shirt buried in the base of the new Yankees stadium? Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:46:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games. Why? The Cardinals aren't playing. I hate the cubs. If they never win another game, I'll be happy. I'll settle for them never winning a World Series in my lifetime. Oh yeah, and I hate the Yankees. My father was Browns fan. He never was much of a baseball fan when they left. He kinda supported the Cardinals because they were the hometown team, but never got over them leaving. Like all other AL team supporters, he hated the Yankees and passed that hatred along to me. Now, if the cubs and Yankees ever meet in a meaningful game, I'll root for the Yankees, but to watch a meaningless game between the 2 teams I hate most!! Naaah, I'll sort my sock drawer or watch Lifetime before I'll waste a few hours for that.", 
        "intTime": 20090326, 
        "postID": 53, 
        "quote": "For all baseball fans throughout the world if you can, you should take a break and sit down and watch these games.", 
        "reply": " Why? The Cardinals aren't playing. I hate the cubs. If they never win another game, I'll be happy. I'll settle for them never winning a World Series in my lifetime. Oh yeah, and I hate the Yankees. My father was Browns fan. He never was much of a baseball fan when they left. He kinda supported the Cardinals because they were the hometown team, but never got over them leaving. Like all other AL team supporters, he hated the Yankees and passed that hatred along to me. Now, if the cubs and Yankees ever meet in a meaningful game, I'll root for the Yankees, but to watch a meaningless game between the 2 teams I hate most!! Naaah, I'll sort my sock drawer or watch Lifetime before I'll waste a few hours for that.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 04:53:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by gsuchey: I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching. I LOVE baseball, but don't follow MLB. You need to come to Omaha in June for teh college world sereies. Some of the best baseball, adn fantastic tailgating for 10 straight days. Open invite for ya. Starts June 13th(my birthday), and goes through teh 24th. I have the tix, if you can get here. Great time. Nothign like it.", 
        "intTime": 20090326, 
        "postID": 54, 
        "quote": "Originally posted by gsuchey: I USED to be a baseball fan. I USED to love to go to a game with my Dad when I was younger. Every time I start to love the game again, the players pull another strike out of their collective arses and stop the season. How many times in the last 20 years? All because they love money more than playing the game. Now I can't afford to take my family (wife and 2 daughters) to a game. The worst part of all of it is that last year their was talk in the wind of putting games on Pay-per-view. You've GOT to be kidding!! They want their money one way or the other apparantly. I've personally lost interest in watching.", 
        "reply": " I LOVE baseball, but don't follow MLB. You need to come to Omaha in June for teh college world sereies. Some of the best baseball, adn fantastic tailgating for 10 straight days. Open invite for ya. Starts June 13th(my birthday), and goes through teh 24th. I have the tix, if you can get here. Great time. Nothign like it.", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 05:32:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium. Two ways: First: If you click on the little folder with quote marks in bottom right of \"poster's\" box, his whole post will appear in a reply box. You can delete any portions within the quote you don't want to address, before putting your own post under it. Second: If you highlight the portion you wish to quote, then go clear down and click on the \"Reply\" box at the bottom of the whole page, the highlighted portion will automatically appear in the top of the reply box as a quote - - Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 55, 
        "quote": "Originally posted by yokozuna: Duster6 I have no idea how to use the quote function. So to answer your question, the Cubs (as far as I know) played at Yankee Stadium when they lost the 1932 and the 1938 World Series to the Yanks. The Yankees took both series 4 games to zip. So while the Cubs have played there it appears as though they have never won a game at the stadium.", 
        "reply": " Two ways: First: If you click on the little folder with quote marks in bottom right of \"poster's\" box, his whole post will appear in a reply box. You can delete any portions within the quote you don't want to address, before putting your own post under it. Second: If you highlight the portion you wish to quote, then go clear down and click on the \"Reply\" box at the bottom of the whole page, the highlighted portion will automatically appear in the top of the reply box as a quote - - Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 06:23:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090326, 
        "postID": 56, 
        "quote": "", 
        "reply": "Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:21:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 57, 
        "quote": "", 
        "reply": "Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:24:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "And for all the \"little guys\" who dreamed of playing in Major League Baseball.... Dustin Pedroia, MVP 2008 Don", 
        "intTime": 20090326, 
        "postID": 58, 
        "quote": "", 
        "reply": "And for all the \"little guys\" who dreamed of playing in Major League Baseball.... Dustin Pedroia, MVP 2008 Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:33:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Did you guys ever see that ESPN/Sportcenter commercial with Posada and Ortiz? Posada has a new Yankees hat and Ortiz is showing him how to break it in. As Ortiz is wearing the Yankees hat, Wally, the Red Sox mascot walks by and freaks. Pretty funny. youtube.com/watch?v=vp_sr5oYIL0 Don", 
        "intTime": 20090326, 
        "postID": 59, 
        "quote": "", 
        "reply": "Did you guys ever see that ESPN/Sportcenter commercial with Posada and Ortiz? Posada has a new Yankees hat and Ortiz is showing him how to break it in. As Ortiz is wearing the Yankees hat, Wally, the Red Sox mascot walks by and freaks. Pretty funny. youtube.com/watch?v=vp_sr5oYIL0 Don", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:44:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Mr. October Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 60, 
        "quote": "", 
        "reply": "Mr. October Wandering and Wondering", 
        "threadID": "5291911282_6140098812001", 
        "time": "2009-03-26 07:51:00", 
        "title": "For ALL baseball fans everywhere.", 
        "userID": "greywolfghost"
    }
]