[
    {
        "content": "how would I get to a position of working on high end technology not yet implemented into society? Intellgience stuff, I'd like to join If I can make thing's. I'm a jack of all trades. I'm not lookin got kill people unless it's a world war, Obama has my vote. the economy suck's, the poorer are poorer an the rich are richer,, which is backing up the economy bad enough where them not spending so much on helping the counrty's neccessaity bills.. we need to have the countries people grow there own food and degress the world's motion alittle bit. the governement is twisted sn incompetently using there power.. finaly obama is straighting thing's out abit, .. we'll see. but anyway, what about my question. what division sector researches alot and creates the most high tech? I'd like to researche biochemistry, and physic's along with acouple more. my uncle design's communication devices for the army, I'm more into the sonic sound wave weaponery and non-weaponery.", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "", 
        "reply": "how would I get to a position of working on high end technology not yet implemented into society? Intellgience stuff, I'd like to join If I can make thing's. I'm a jack of all trades. I'm not lookin got kill people unless it's a world war, Obama has my vote. the economy suck's, the poorer are poorer an the rich are richer,, which is backing up the economy bad enough where them not spending so much on helping the counrty's neccessaity bills.. we need to have the countries people grow there own food and degress the world's motion alittle bit. the governement is twisted sn incompetently using there power.. finaly obama is straighting thing's out abit, .. we'll see. but anyway, what about my question. what division sector researches alot and creates the most high tech? I'd like to researche biochemistry, and physic's along with acouple more. my uncle design's communication devices for the army, I'm more into the sonic sound wave weaponery and non-weaponery.", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-13 14:48:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "20907600"
    }, 
    {
        "content": "There are numerous \"Intel\" jobs in all branches of the service. In the Air Force, there is an Enlisted AFSC called Intelligence Specialist. The individual goes to tech school to learn various skills dealing with classified information and giving briefings on such. It is a good position, usually in the Operations Section of a Squadron. The briefings are given directly to personnel dealing with all aspects of flying missions. You have to have a high school education, with good academic grades in the more rigorous classes of math, science, history, and writing. You also have to have a clean legal slate so that you can obtain at least a Secret Clearance. I'm certain, again, that all branches of service have jobs in Intelligence Gathering, Handling, and Dissemination. Good communication and computer skills would help greatly also... Which branch of service are you interested most in? Wandering and Wondering", 
        "intTime": 20090313, 
        "postID": 2, 
        "quote": "", 
        "reply": "There are numerous \"Intel\" jobs in all branches of the service. In the Air Force, there is an Enlisted AFSC called Intelligence Specialist. The individual goes to tech school to learn various skills dealing with classified information and giving briefings on such. It is a good position, usually in the Operations Section of a Squadron. The briefings are given directly to personnel dealing with all aspects of flying missions. You have to have a high school education, with good academic grades in the more rigorous classes of math, science, history, and writing. You also have to have a clean legal slate so that you can obtain at least a Secret Clearance. I'm certain, again, that all branches of service have jobs in Intelligence Gathering, Handling, and Dissemination. Good communication and computer skills would help greatly also... Which branch of service are you interested most in? Wandering and Wondering", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-13 15:46:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "What is your level of education? Have you taken any courses which help you advance to your goal? The military would be very interested in talking to you if you have something to offer them. You seem to be very impressed with presidnet Obama. Maybe you could ask him to help you, if you have PI, Political Influence, stamped on your service record could go a long way to help you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "", 
        "reply": "What is your level of education? Have you taken any courses which help you advance to your goal? The military would be very interested in talking to you if you have something to offer them. You seem to be very impressed with presidnet Obama. Maybe you could ask him to help you, if you have PI, Political Influence, stamped on your service record could go a long way to help you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-13 17:44:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Most devices are not created by the military The creation of devices, systems, and the like are by private companys. Sometimes the military will issue a list of requirements (for say an aircraft) Private companys will then design and build prototype aircraft for the military to approve and buy or reject and look at another design from another company. Sometimes if a company has a realy good idea they will build it and go to the military and say HAY LOOK AT THIS if the military likes it they buy it. In general this procedure is in effect thruout the military procurement process for all systems and devices. The realy highend technology is in the hands of civilian companys. The highend intel is gathered by machines provided by civilian companys Shockey", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "", 
        "reply": "Most devices are not created by the military The creation of devices, systems, and the like are by private companys. Sometimes the military will issue a list of requirements (for say an aircraft) Private companys will then design and build prototype aircraft for the military to approve and buy or reject and look at another design from another company. Sometimes if a company has a realy good idea they will build it and go to the military and say HAY LOOK AT THIS if the military likes it they buy it. In general this procedure is in effect thruout the military procurement process for all systems and devices. The realy highend technology is in the hands of civilian companys. The highend intel is gathered by machines provided by civilian companys Shockey", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-13 18:06:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "shockey"
    }, 
    {
        "content": "quote: Originally posted by 20907600: how would I get to a position of working on high end technology not yet implemented into society? Intellgience stuff, I'd like to join If I can make thing's. That's not intelligence stuff; it's engineer stuff. In a very simplified way, intel geeks find out what other guys are making. Counterintel folks prevent the other guys from finding out what we are making. The engineers are the folks who are doing the making. Enlisting isn't the only (or most direct) route to do this. We have lots of civilian engineers with clearances, both as defense contractors and government employees. Shockey is right that the contractors do the building, but also there are some army engineers who get into the muck of it as well, particularly when we need some problem solving, and they are of course heavily involved in field testing of new technology. As greywolfghost noted, you can figure on needing a clearance, either secret or higher, so you'd need a squeaky clean background to even be considered. Based on the politics expressed in your post, you might also look into foreign service if you aren't set on making things, and possibly also peace corps. I know less about peace corps, but if you are looking to help countries with food security that might be a good option - just stay away from the Monsanto crap, eh? That stuff isn't helping anyone in the long run. (Apologies for the editorial note there.)", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "Originally posted by 20907600: how would I get to a position of working on high end technology not yet implemented into society? Intellgience stuff, I'd like to join If I can make thing's.", 
        "reply": " That's not intelligence stuff; it's engineer stuff. In a very simplified way, intel geeks find out what other guys are making. Counterintel folks prevent the other guys from finding out what we are making. The engineers are the folks who are doing the making. Enlisting isn't the only (or most direct) route to do this. We have lots of civilian engineers with clearances, both as defense contractors and government employees. Shockey is right that the contractors do the building, but also there are some army engineers who get into the muck of it as well, particularly when we need some problem solving, and they are of course heavily involved in field testing of new technology. As greywolfghost noted, you can figure on needing a clearance, either secret or higher, so you'd need a squeaky clean background to even be considered. Based on the politics expressed in your post, you might also look into foreign service if you aren't set on making things, and possibly also peace corps. I know less about peace corps, but if you are looking to help countries with food security that might be a good option - just stay away from the Monsanto crap, eh? That stuff isn't helping anyone in the long run. (Apologies for the editorial note there.)", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-13 18:28:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "jake98c"
    }, 
    {
        "content": "I forgot Some things are in the governments hands Your Physics and biomed stuff are both in civilian hands and at places like Brookhaven National Labs (operated by the Department of Energy) They got things for research like a particle accelerater, A reacter, light source lab biomed stuff. civilians and Even people from other countrys come there to research stuff. They got a web site, search it. It's kind of a scarry place Shockey", 
        "intTime": 20090313, 
        "postID": 6, 
        "quote": "", 
        "reply": "I forgot Some things are in the governments hands Your Physics and biomed stuff are both in civilian hands and at places like Brookhaven National Labs (operated by the Department of Energy) They got things for research like a particle accelerater, A reacter, light source lab biomed stuff. civilians and Even people from other countrys come there to research stuff. They got a web site, search it. It's kind of a scarry place Shockey", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-13 18:47:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "shockey"
    }, 
    {
        "content": "Look into DARPA. Do you have a high school diploma yet?", 
        "intTime": 20090316, 
        "postID": 7, 
        "quote": "", 
        "reply": "Look into DARPA. Do you have a high school diploma yet?", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-16 08:27:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Bump! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090316, 
        "postID": 8, 
        "quote": "", 
        "reply": "Bump! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7100097712001", 
        "time": "2009-03-16 08:34:00", 
        "title": "Government jobs in creating technology, world analysis... etc..", 
        "userID": "Bergy46"
    }
]