[
    {
        "content": "I am curious what sort of background check is done? My brother went through a alcohol treatment center about 1.5 years ago. And i dont think he wrote it down on his questioneere for meps. I warned him that this could cause trouble for him but he told me they will never find out. However he still owes the treatment center a big chunk of change so wont they find out eventually?", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "", 
        "reply": "I am curious what sort of background check is done? My brother went through a alcohol treatment center about 1.5 years ago. And i dont think he wrote it down on his questioneere for meps. I warned him that this could cause trouble for him but he told me they will never find out. However he still owes the treatment center a big chunk of change so wont they find out eventually?", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-30 15:42:00", 
        "title": "Background Checks?", 
        "userID": "Reidlinger"
    }, 
    {
        "content": "They will find out, if it's in his medical records, they will find it! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "They will find out, if it's in his medical records, they will find it! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-30 15:47:00", 
        "title": "Background Checks?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "is there a way of obtaining your own medical records? My bro told me that the amry can only access what you tell them about. This doesnt sound quite right to me", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "", 
        "reply": "is there a way of obtaining your own medical records? My bro told me that the amry can only access what you tell them about. This doesnt sound quite right to me", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-30 17:07:00", 
        "title": "Background Checks?", 
        "userID": "Reidlinger"
    }, 
    {
        "content": "Most likely they wont find it or care. They really dont request your civilian medical records if they do they will still need signed consent from you.", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "", 
        "reply": "Most likely they wont find it or care. They really dont request your civilian medical records if they do they will still need signed consent from you.", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-30 17:41:00", 
        "title": "Background Checks?", 
        "userID": "DIABLO_OPSGRP"
    }, 
    {
        "content": "what about the credit check? cause he owes like 15 grand or something but my dad is the Cosigner.", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "what about the credit check? cause he owes like 15 grand or something but my dad is the Cosigner.", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-30 17:46:00", 
        "title": "Background Checks?", 
        "userID": "Reidlinger"
    }, 
    {
        "content": "why do I get the impression that it is the o'it's-my-brother trick... and you would be very surprised what they can dig up pending the type of clearance.. they'll even know about the teacher you had the hots for in Jr.High. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "", 
        "reply": "why do I get the impression that it is the o'it's-my-brother trick... and you would be very surprised what they can dig up pending the type of clearance.. they'll even know about the teacher you had the hots for in Jr.High. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-30 17:51:00", 
        "title": "Background Checks?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "They'll find out anything they want about you, really. Besides, why would your brother take the risk and not tell them? Full disclosure or none at all. Pick one. And of course you can get your own records. Call the doc and tell 'em you want to pick them up or have them mailed to you. However, I don't imagine the military taking your copies as good. They're gonna want them straight from the doc's office. And the credit check? His best bet is to be upfront and honest. The way it was explained to me by my husband was if you carry too much debt, you're a security risk. Someone could offer to pay off everything for you, or give you a nice chunk of change in exchange for info. If he's serious about being in the military, he'll be serious about being upfront and honest on his paperwork. It wouldn't hurt, either, to start cracking away at his credit file to get it cleaned up.", 
        "intTime": 20090531, 
        "postID": 7, 
        "quote": "", 
        "reply": "They'll find out anything they want about you, really. Besides, why would your brother take the risk and not tell them? Full disclosure or none at all. Pick one. And of course you can get your own records. Call the doc and tell 'em you want to pick them up or have them mailed to you. However, I don't imagine the military taking your copies as good. They're gonna want them straight from the doc's office. And the credit check? His best bet is to be upfront and honest. The way it was explained to me by my husband was if you carry too much debt, you're a security risk. Someone could offer to pay off everything for you, or give you a nice chunk of change in exchange for info. If he's serious about being in the military, he'll be serious about being upfront and honest on his paperwork. It wouldn't hurt, either, to start cracking away at his credit file to get it cleaned up.", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 04:35:00", 
        "title": "Background Checks?", 
        "userID": "MrsCamo"
    }, 
    {
        "content": "Its not a big deal unless your just an average person. Then they will deny your clearance. However, if you know how to talk and you have something they want or need your in like flint. Look at Pelosi and the rest of her side kicks in office now. Prime example of \"who cares or so what\".", 
        "intTime": 20090531, 
        "postID": 8, 
        "quote": "", 
        "reply": "Its not a big deal unless your just an average person. Then they will deny your clearance. However, if you know how to talk and you have something they want or need your in like flint. Look at Pelosi and the rest of her side kicks in office now. Prime example of \"who cares or so what\".", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 07:17:00", 
        "title": "Background Checks?", 
        "userID": "Duster6"
    }, 
    {
        "content": "As technical as the Military is today, just to use a radio or study a weapons system, if you can't get a clearance, you're military career is dead - - And they dig into everything and talk to everybody. I'd get a kick out of neighbors coming to me and asking me why a government agent was asking questions to everyone about me... I'd just laugh about the \"men in black\" and tell them about security clearances and periodic background checks. But that's the way it is - - Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 9, 
        "quote": "", 
        "reply": "As technical as the Military is today, just to use a radio or study a weapons system, if you can't get a clearance, you're military career is dead - - And they dig into everything and talk to everybody. I'd get a kick out of neighbors coming to me and asking me why a government agent was asking questions to everyone about me... I'd just laugh about the \"men in black\" and tell them about security clearances and periodic background checks. But that's the way it is - - Wandering and Wondering", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 07:58:00", 
        "title": "Background Checks?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Who checks on the people who divulge the information about the person being investigated? The info is only as reliable as the informant. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090531, 
        "postID": 10, 
        "quote": "", 
        "reply": "Who checks on the people who divulge the information about the person being investigated? The info is only as reliable as the informant. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 08:10:00", 
        "title": "Background Checks?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Obviuously, the big players are financial history, police record, and medical problems (drugs and alcohol). If there are things that show a lack of reliability, self-discipline, and obedience to laws - goodbye... Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 11, 
        "quote": "", 
        "reply": "Obviuously, the big players are financial history, police record, and medical problems (drugs and alcohol). If there are things that show a lack of reliability, self-discipline, and obedience to laws - goodbye... Wandering and Wondering", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 08:18:00", 
        "title": "Background Checks?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Obviuously, the big players are financial history, police record, and medical problems (drugs and alcohol). If there are things that show a lack of reliability, self-discipline, and obedience to laws - goodbye... Do you play along with unquestioning and unwavering loyalty? But from experience we know that it doesn't always work. We still get those who despite being \"cleared\" will attempt to make money from their status. We have those who have once been cleared who are now in prison or on parole. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090531, 
        "postID": 12, 
        "quote": "Originally posted by greywolfghost: Obviuously, the big players are financial history, police record, and medical problems (drugs and alcohol). If there are things that show a lack of reliability, self-discipline, and obedience to laws - goodbye...", 
        "reply": " Do you play along with unquestioning and unwavering loyalty? But from experience we know that it doesn't always work. We still get those who despite being \"cleared\" will attempt to make money from their status. We have those who have once been cleared who are now in prison or on parole. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 08:48:00", 
        "title": "Background Checks?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: financial history, police record, and medical problems (drugs and alcohol). Financial History: A person in deep dept, or with a history of risky \"get rich quick\" ventures is susceptible to offers of large sums of money. Police Record: A person who had a record of defying the law, especially in attempt to gain wealth, is not trustworthy and is susceptible to offers of large sums of money. Medical History: A person with a history of substance abuse can be trapped, through addiction, for extortion of materials and information. Moral Laxity (Adultery, frequenting of Prostitutes, etc.): A person with such a history is again lacking in trustworthiness and is susceptible to offers of large sums of money and/or extortion for information and materials. THAT is the Mantra - like it or not. Once a person compromises his/her Honor and Honesty, can he or she EVER be Trusted with Secrets that the compromise of which could cause Grave Damage to the Security of this Country??? The answer is simply - NO! I spent nearly 10 years as a Security Manager dealing with these kinds of questions. I've seen people lose Security Clearances for the above reasons. That's the way it is... Wandering and Wondering", 
        "intTime": 20090531, 
        "postID": 13, 
        "quote": "financial history, police record, and medical problems (drugs and alcohol).", 
        "reply": " Financial History: A person in deep dept, or with a history of risky \"get rich quick\" ventures is susceptible to offers of large sums of money. Police Record: A person who had a record of defying the law, especially in attempt to gain wealth, is not trustworthy and is susceptible to offers of large sums of money. Medical History: A person with a history of substance abuse can be trapped, through addiction, for extortion of materials and information. Moral Laxity (Adultery, frequenting of Prostitutes, etc.): A person with such a history is again lacking in trustworthiness and is susceptible to offers of large sums of money and/or extortion for information and materials. THAT is the Mantra - like it or not. Once a person compromises his/her Honor and Honesty, can he or she EVER be Trusted with Secrets that the compromise of which could cause Grave Damage to the Security of this Country??? The answer is simply - NO! I spent nearly 10 years as a Security Manager dealing with these kinds of questions. I've seen people lose Security Clearances for the above reasons. That's the way it is... Wandering and Wondering", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 09:33:00", 
        "title": "Background Checks?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "As a former Military Intelligence Sergeant, I can tell you that you can't hide anything. Remember George Orwell's \"1984\"...Big Brother is watching? HE IS! IF THERE'S NOT A PAPER TRAIL, THERE'S A MONEY TRAIL! Between credit bureaus, MIBS (Medical Information Bureaus), and other agencies, it's near impossible to hide anything. And since 9-11, it's more comprehensive and intrusive. One of the many incentives for a given individual to live his or her life as a \"straight arrow\".", 
        "intTime": 20090531, 
        "postID": 14, 
        "quote": "", 
        "reply": "As a former Military Intelligence Sergeant, I can tell you that you can't hide anything. Remember George Orwell's \"1984\"...Big Brother is watching? HE IS! IF THERE'S NOT A PAPER TRAIL, THERE'S A MONEY TRAIL! Between credit bureaus, MIBS (Medical Information Bureaus), and other agencies, it's near impossible to hide anything. And since 9-11, it's more comprehensive and intrusive. One of the many incentives for a given individual to live his or her life as a \"straight arrow\".", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 09:38:00", 
        "title": "Background Checks?", 
        "userID": "20802653"
    }, 
    {
        "content": "Moral laxity, That one covers a lot of people in the military. At least the ones I was familiar with. Seems like there was more going around on the base than anywhere else. Maybe their a different breed now right? The seventies and eighties were the stage I observed. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090531, 
        "postID": 15, 
        "quote": "", 
        "reply": "Moral laxity, That one covers a lot of people in the military. At least the ones I was familiar with. Seems like there was more going around on the base than anywhere else. Maybe their a different breed now right? The seventies and eighties were the stage I observed. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-05-31 09:41:00", 
        "title": "Background Checks?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: They will find out, if it's in his medical records, they will find it! How? Medical records are not part of public record? \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "intTime": 20090601, 
        "postID": 16, 
        "quote": "Originally posted by Bergy46: They will find out, if it's in his medical records, they will find it!", 
        "reply": " How? Medical records are not part of public record? \"When you look into an abyss, the abyss also looks into you.\" ~~ Friedrich Nietzsche", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-06-01 08:57:00", 
        "title": "Background Checks?", 
        "userID": "sethkonigsbergrn"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: Moral laxity, That one covers a lot of people in the military. At least the ones I was familiar with. Seems like there was more going around on the base than anywhere else. Maybe their a different breed now right? The seventies and eighties were the stage I observed. That is absolutely true. Had a situation where an officer was sneaking around with the COs wife ! Well, when the shyyt hit the fan, turned out that the CO was sneaking around with the officer's wife!! !! Sometimes truth is weirder than ANY soap opera!! Both lost their TS Security Clearances. Without their Clearances, they could no longer proceed in their assignments. Both had to resign their positions. One had enough years for a retirement. The other got the boot - - Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "Originally posted by sargeant_green: Moral laxity, That one covers a lot of people in the military. At least the ones I was familiar with. Seems like there was more going around on the base than anywhere else. Maybe their a different breed now right? The seventies and eighties were the stage I observed.", 
        "reply": " That is absolutely true. Had a situation where an officer was sneaking around with the COs wife ! Well, when the shyyt hit the fan, turned out that the CO was sneaking around with the officer's wife!! !! Sometimes truth is weirder than ANY soap opera!! Both lost their TS Security Clearances. Without their Clearances, they could no longer proceed in their assignments. Both had to resign their positions. One had enough years for a retirement. The other got the boot - - Wandering and Wondering", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-06-01 11:40:00", 
        "title": "Background Checks?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Reidlinger New Member Posted Sat 30 May 2009 03:42 PM I am curious what sort of background check is done? My brother went through a alcohol treatment center about 1.5 years ago. And i dont think he wrote it down on his questioneere for meps. I warned him that this could cause trouble for him but he told me they will never find out. However he still owes the treatment center a big chunk of change so wont they find out eventually? Depending on the level of security clearance required...the Govt may well learn of this history when they do a financial check to see if there are any outstanding debts, so if the treatment agency reports this debt to any of the standard consumer credit companies...Yes...I'm pretty sure the Govt will learn he has an outstanding debt for a health care treatment and may well ask him what the treatment was for and ask him to produce medical records to confirm that he does not have a preexisting condition that would prevent his ability to serve in the military.", 
        "intTime": 20090601, 
        "postID": 18, 
        "quote": "Reidlinger New Member Posted Sat 30 May 2009 03:42 PM I am curious what sort of background check is done? My brother went through a alcohol treatment center about 1.5 years ago. And i dont think he wrote it down on his questioneere for meps. I warned him that this could cause trouble for him but he told me they will never find out. However he still owes the treatment center a big chunk of change so wont they find out eventually?", 
        "reply": " Depending on the level of security clearance required...the Govt may well learn of this history when they do a financial check to see if there are any outstanding debts, so if the treatment agency reports this debt to any of the standard consumer credit companies...Yes...I'm pretty sure the Govt will learn he has an outstanding debt for a health care treatment and may well ask him what the treatment was for and ask him to produce medical records to confirm that he does not have a preexisting condition that would prevent his ability to serve in the military.", 
        "threadID": "5291911282_2710096422001", 
        "time": "2009-06-01 12:40:00", 
        "title": "Background Checks?", 
        "userID": "beatleh60"
    }
]