[
    {
        "content": "hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "", 
        "reply": "hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 18:03:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "cabby866"
    }, 
    {
        "content": "I;ve aksed someone special to visit this post to see if she can proived some answers for you. You also might want to post your question here: http://forums.military.com/eve/forums/a/frm/f/90600431813 A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "I;ve aksed someone special to visit this post to see if she can proived some answers for you. You also might want to post your question here: http://forums.military.com/eve/forums/a/frm/f/90600431813 A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 18:40:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "Hi. I had the full gastric bypass in 1995, back when no one had heard of it. I have several friends and a sister-in-law who had the lap band. I have lost and kept off more weight than they have, but I do have problems with anemia. I have had one firends mother pass away after the surgery due to leakage. It's one of those things that has it's pro's and con's. If you do have the gastric bypass, be sure to check how many surgery's the Doctor has performed and make sure you have a doctor that is going to do routine blood work. My anemia surprised me because I had lost so much weight and felt so good, that I didn't notice the symptoms of anemia. I ended up with a blood transfusion and was told by my doctor he was suprised I had not had a stroke. Again, I don't think I would go back and change the one I had, but I am very skeptical to tell people to go for it. Hope this helps.", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hi. I had the full gastric bypass in 1995, back when no one had heard of it. I have several friends and a sister-in-law who had the lap band. I have lost and kept off more weight than they have, but I do have problems with anemia. I have had one firends mother pass away after the surgery due to leakage. It's one of those things that has it's pro's and con's. If you do have the gastric bypass, be sure to check how many surgery's the Doctor has performed and make sure you have a doctor that is going to do routine blood work. My anemia surprised me because I had lost so much weight and felt so good, that I didn't notice the symptoms of anemia. I ended up with a blood transfusion and was told by my doctor he was suprised I had not had a stroke. Again, I don't think I would go back and change the one I had, but I am very skeptical to tell people to go for it. Hope this helps.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 18:53:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "9833317"
    }, 
    {
        "content": "Cabby, to expand on OldArmy's link to the Spouse House, scroll down to the TriCare Forum and browse through the posts until you hit the topics of LapBand and Bypass. You'll find a lot of info and personal experiences from some of our gals there. One in particular is BlondieLou--her personal story is very interesting indeed.", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "", 
        "reply": "Cabby, to expand on OldArmy's link to the Spouse House, scroll down to the TriCare Forum and browse through the posts until you hit the topics of LapBand and Bypass. You'll find a lot of info and personal experiences from some of our gals there. One in particular is BlondieLou--her personal story is very interesting indeed.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 19:10:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "bobbysangelwife"
    }, 
    {
        "content": "quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. This message has been edited. Last edited by: OldArmyWOPA, Fri 06 March 2009 06:12 AM", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all", 
        "reply": " How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. This message has been edited. Last edited by: OldArmyWOPA, Fri 06 March 2009 06:12 AM", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 19:39:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "CiviLegg"
    }, 
    {
        "content": "quote: Originally posted by CiviLegg: ... I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Watch for incoming email. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "Originally posted by CiviLegg: ... I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Watch for incoming email. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 19:59:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 20:13:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "cabby, I have heard bad things about this operation you're thinking of, especially after 5 years... take Jonsey's advice - you CAN do it. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "", 
        "reply": "cabby, I have heard bad things about this operation you're thinking of, especially after 5 years... take Jonsey's advice - you CAN do it. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:21:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Yup, you're right about that....not pizz off me personally, just disappointed.", 
        "intTime": 20090305, 
        "postID": 9, 
        "quote": "I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Yup, you're right about that....not pizz off me personally, just disappointed.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:30:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "bobbysangelwife"
    }, 
    {
        "content": "quote: Originally posted by Jonsey36: Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] Thank you. This is what I mean.", 
        "intTime": 20090305, 
        "postID": 10, 
        "quote": "Originally posted by Jonsey36:", 
        "reply": " Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] Thank you. This is what I mean.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:32:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "bobbysangelwife"
    }, 
    {
        "content": "quote: Originally posted by bobbysangelwife: quote: I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Yup, you're right about that....not pizz off me personally, just disappointed. Sorry to disappoint BAW. The friend I tried to help went through every fad diet possible and still never lost any weight, She saw me melting away pounds and I told her time and time again. Wrote up meal plan after meal plan and went through tons of food suggestions to find what she would eat. She was just too finicky to crap food that she wouldn't listen. So I gave up and ever time I read or hear about someone wanting to take this route I think they haven't tried hard enough. They dont want it enough.", 
        "intTime": 20090305, 
        "postID": 11, 
        "quote": "Originally posted by bobbysangelwife: quote: I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Yup, you're right about that....not pizz off me personally, just disappointed.", 
        "reply": " Sorry to disappoint BAW. The friend I tried to help went through every fad diet possible and still never lost any weight, She saw me melting away pounds and I told her time and time again. Wrote up meal plan after meal plan and went through tons of food suggestions to find what she would eat. She was just too finicky to crap food that she wouldn't listen. So I gave up and ever time I read or hear about someone wanting to take this route I think they haven't tried hard enough. They dont want it enough.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:49:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "CiviLegg"
    }, 
    {
        "content": "And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery.", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "", 
        "reply": "And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 00:43:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "ssg91B"
    }, 
    {
        "content": "Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "", 
        "reply": "Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:37:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "cabby866"
    }, 
    {
        "content": "quote: Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Civ, When you KNOW what your talking about then comment. Thats like telling a combat veteran with PTSD to stop whining and get over it. It aint easy and in some cases this is the only option open to people. I know I'm one of them. With out going thru my whole emdical history, 3 doctors have recommended me for it. I opted for the surgery rather than the lap band, but my insurnace company has refused to cover it.", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Civ, When you KNOW what your talking about then comment. Thats like telling a combat veteran with PTSD to stop whining and get over it. It aint easy and in some cases this is the only option open to people. I know I'm one of them. With out going thru my whole emdical history, 3 doctors have recommended me for it. I opted for the surgery rather than the lap band, but my insurnace company has refused to cover it.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:44:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by ssg91B: And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery. You can CHEAT with the lap band by eating / drinking hi cal food (IE: milk shakes). You can't with the bypass, you'll throw up if you do.", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "Originally posted by ssg91B: And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery.", 
        "reply": " You can CHEAT with the lap band by eating / drinking hi cal food (IE: milk shakes). You can't with the bypass, you'll throw up if you do.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:49:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by cabby866: Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder. yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.[/QUOTE] Cabby, You need to do the research, find out the pros and cons of each surgery, talk to more than one doctor that perform the surgery. There are also support groups you can talk to, they're usually connected to your local hospital. Which every way you decide, AND THIS IS CRITICAL - BE SURE YOU HAVE ON-GOING SUPPORT BEFORE, DURING AND AFTER THE SURGERY. The docore I went to insisted on following me for 3 month before and minimum 1 year after the surgery. He also had a pre-op program that included a Cardiac, Respiratory, Psych and Dietary work up. Good luck to you.", 
        "intTime": 20090306, 
        "postID": 16, 
        "quote": "Originally posted by cabby866: Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.", 
        "reply": " yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.[/QUOTE] Cabby, You need to do the research, find out the pros and cons of each surgery, talk to more than one doctor that perform the surgery. There are also support groups you can talk to, they're usually connected to your local hospital. Which every way you decide, AND THIS IS CRITICAL - BE SURE YOU HAVE ON-GOING SUPPORT BEFORE, DURING AND AFTER THE SURGERY. The docore I went to insisted on following me for 3 month before and minimum 1 year after the surgery. He also had a pre-op program that included a Cardiac, Respiratory, Psych and Dietary work up. Good luck to you.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:55:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ...", 
        "intTime": 20090306, 
        "postID": 17, 
        "quote": "", 
        "reply": "Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ...", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:59:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "Way to go, Navy! A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090306, 
        "postID": 18, 
        "quote": "", 
        "reply": "Way to go, Navy! A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 09:06:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ... navy8086, I will be reading this thread to see if I can learn some tips/info. I have a lifelong weight battle to overcome as well. i have considered hypnosis (not done it yet though) and counseling (not there yet, either). i have also been diagnosed w/depression and PTSD (non- mil related). I am still in the employ of our Uncle Sam and will have to retire in 5 years due to age. I am hoping to find something after that to stay in contact with the military. (I just can't get enough of this schtuff!!) IMHO cabby, you may wish to check into counseling prior to any surgery. Not saying that this WILL be the solution, but sometimes we just don't realize WHY we do some of the things we do or why we just CAN'T seem to be able to do what we KNOW to be right. Hope you find the correct answer for you. God's blessings on you. These are my opinions. Yours may differ.", 
        "intTime": 20090306, 
        "postID": 19, 
        "quote": "Originally posted by navy8086: Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ...", 
        "reply": " navy8086, I will be reading this thread to see if I can learn some tips/info. I have a lifelong weight battle to overcome as well. i have considered hypnosis (not done it yet though) and counseling (not there yet, either). i have also been diagnosed w/depression and PTSD (non- mil related). I am still in the employ of our Uncle Sam and will have to retire in 5 years due to age. I am hoping to find something after that to stay in contact with the military. (I just can't get enough of this schtuff!!) IMHO cabby, you may wish to check into counseling prior to any surgery. Not saying that this WILL be the solution, but sometimes we just don't realize WHY we do some of the things we do or why we just CAN'T seem to be able to do what we KNOW to be right. Hope you find the correct answer for you. God's blessings on you. These are my opinions. Yours may differ.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 09:44:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "4403771"
    }, 
    {
        "content": "Cabby, I understand about Hypo-thyroid. Yes it will cause weight gain. Also,have your blood sugar checked for Sydrome x. That's what I have, It's a pre-diabetic condition. Your pancreas pumps way more insulin into your body trying to break down CARBS. Your body doesn't except those carbs into your system for energy--Then eventually gets stored as fat around the middle. A dietician figured it out for me. Since I have been on a low- Carb diet,Iv'e lost the weight that I had gained in about 4 mths. Ask about it.....", 
        "intTime": 20090306, 
        "postID": 20, 
        "quote": "", 
        "reply": "Cabby, I understand about Hypo-thyroid. Yes it will cause weight gain. Also,have your blood sugar checked for Sydrome x. That's what I have, It's a pre-diabetic condition. Your pancreas pumps way more insulin into your body trying to break down CARBS. Your body doesn't except those carbs into your system for energy--Then eventually gets stored as fat around the middle. A dietician figured it out for me. Since I have been on a low- Carb diet,Iv'e lost the weight that I had gained in about 4 mths. Ask about it.....", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 10:31:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all", 
        "intTime": 20090305, 
        "postID": 21, 
        "quote": "", 
        "reply": "hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 18:03:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "cabby866"
    }, 
    {
        "content": "I;ve aksed someone special to visit this post to see if she can proived some answers for you. You also might want to post your question here: http://forums.military.com/eve/forums/a/frm/f/90600431813 A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090305, 
        "postID": 22, 
        "quote": "", 
        "reply": "I;ve aksed someone special to visit this post to see if she can proived some answers for you. You also might want to post your question here: http://forums.military.com/eve/forums/a/frm/f/90600431813 A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 18:40:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "Hi. I had the full gastric bypass in 1995, back when no one had heard of it. I have several friends and a sister-in-law who had the lap band. I have lost and kept off more weight than they have, but I do have problems with anemia. I have had one firends mother pass away after the surgery due to leakage. It's one of those things that has it's pro's and con's. If you do have the gastric bypass, be sure to check how many surgery's the Doctor has performed and make sure you have a doctor that is going to do routine blood work. My anemia surprised me because I had lost so much weight and felt so good, that I didn't notice the symptoms of anemia. I ended up with a blood transfusion and was told by my doctor he was suprised I had not had a stroke. Again, I don't think I would go back and change the one I had, but I am very skeptical to tell people to go for it. Hope this helps.", 
        "intTime": 20090305, 
        "postID": 23, 
        "quote": "", 
        "reply": "Hi. I had the full gastric bypass in 1995, back when no one had heard of it. I have several friends and a sister-in-law who had the lap band. I have lost and kept off more weight than they have, but I do have problems with anemia. I have had one firends mother pass away after the surgery due to leakage. It's one of those things that has it's pro's and con's. If you do have the gastric bypass, be sure to check how many surgery's the Doctor has performed and make sure you have a doctor that is going to do routine blood work. My anemia surprised me because I had lost so much weight and felt so good, that I didn't notice the symptoms of anemia. I ended up with a blood transfusion and was told by my doctor he was suprised I had not had a stroke. Again, I don't think I would go back and change the one I had, but I am very skeptical to tell people to go for it. Hope this helps.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 18:53:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "9833317"
    }, 
    {
        "content": "Cabby, to expand on OldArmy's link to the Spouse House, scroll down to the TriCare Forum and browse through the posts until you hit the topics of LapBand and Bypass. You'll find a lot of info and personal experiences from some of our gals there. One in particular is BlondieLou--her personal story is very interesting indeed.", 
        "intTime": 20090305, 
        "postID": 24, 
        "quote": "", 
        "reply": "Cabby, to expand on OldArmy's link to the Spouse House, scroll down to the TriCare Forum and browse through the posts until you hit the topics of LapBand and Bypass. You'll find a lot of info and personal experiences from some of our gals there. One in particular is BlondieLou--her personal story is very interesting indeed.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 19:10:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "bobbysangelwife"
    }, 
    {
        "content": "quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. This message has been edited. Last edited by: OldArmyWOPA, Fri 06 March 2009 06:12 AM", 
        "intTime": 20090305, 
        "postID": 25, 
        "quote": "Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all", 
        "reply": " How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. This message has been edited. Last edited by: OldArmyWOPA, Fri 06 March 2009 06:12 AM", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 19:39:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "CiviLegg"
    }, 
    {
        "content": "quote: Originally posted by CiviLegg: ... I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Watch for incoming email. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090305, 
        "postID": 26, 
        "quote": "Originally posted by CiviLegg: ... I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Watch for incoming email. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 19:59:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.", 
        "intTime": 20090305, 
        "postID": 27, 
        "quote": "Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 20:13:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "cabby, I have heard bad things about this operation you're thinking of, especially after 5 years... take Jonsey's advice - you CAN do it. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090305, 
        "postID": 28, 
        "quote": "", 
        "reply": "cabby, I have heard bad things about this operation you're thinking of, especially after 5 years... take Jonsey's advice - you CAN do it. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:21:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Yup, you're right about that....not pizz off me personally, just disappointed.", 
        "intTime": 20090305, 
        "postID": 29, 
        "quote": "I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Yup, you're right about that....not pizz off me personally, just disappointed.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:30:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "bobbysangelwife"
    }, 
    {
        "content": "quote: Originally posted by Jonsey36: Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] Thank you. This is what I mean.", 
        "intTime": 20090305, 
        "postID": 30, 
        "quote": "Originally posted by Jonsey36:", 
        "reply": " Follow-up Question for the OP. Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] Thank you. This is what I mean.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:32:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "bobbysangelwife"
    }, 
    {
        "content": "quote: Originally posted by bobbysangelwife: quote: I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Yup, you're right about that....not pizz off me personally, just disappointed. Sorry to disappoint BAW. The friend I tried to help went through every fad diet possible and still never lost any weight, She saw me melting away pounds and I told her time and time again. Wrote up meal plan after meal plan and went through tons of food suggestions to find what she would eat. She was just too finicky to crap food that she wouldn't listen. So I gave up and ever time I read or hear about someone wanting to take this route I think they haven't tried hard enough. They dont want it enough.", 
        "intTime": 20090305, 
        "postID": 31, 
        "quote": "Originally posted by bobbysangelwife: quote: I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Yup, you're right about that....not pizz off me personally, just disappointed.", 
        "reply": " Sorry to disappoint BAW. The friend I tried to help went through every fad diet possible and still never lost any weight, She saw me melting away pounds and I told her time and time again. Wrote up meal plan after meal plan and went through tons of food suggestions to find what she would eat. She was just too finicky to crap food that she wouldn't listen. So I gave up and ever time I read or hear about someone wanting to take this route I think they haven't tried hard enough. They dont want it enough.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-05 21:49:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "CiviLegg"
    }, 
    {
        "content": "And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery.", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "", 
        "reply": "And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 00:43:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "ssg91B"
    }, 
    {
        "content": "Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "", 
        "reply": "Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.[/QUOTE] yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:37:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "cabby866"
    }, 
    {
        "content": "quote: Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease. Civ, When you KNOW what your talking about then comment. Thats like telling a combat veteran with PTSD to stop whining and get over it. It aint easy and in some cases this is the only option open to people. I know I'm one of them. With out going thru my whole emdical history, 3 doctors have recommended me for it. I opted for the surgery rather than the lap band, but my insurnace company has refused to cover it.", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "Originally posted by CiviLegg: quote: Originally posted by cabby866: hi everyone, im a dependant and i have struggled with my weight my whole life. i have recenlty been approved for bariatric surgery. im struggling over which one to pick. with the lap band i would have to get fills and have it replaced every 20 years and since im relatively young that would just be multiple surgeries. along with PCSing i would have to get fills and new patient histories every time we moved. then there is the gastric bypass wich is a one time surgery and a life long commitment in itself. so my question for all of you is do any of you have the lap band and how do you deal with it with all the traveling that we do. also peoples opinion on one or the other. thanks all How bout neither.Get your butt up and go outside and exercise. Quit eating fast foods, quit eating sweets so much, dont guzzle big gulps by the gallons, better yet avoid soda period, eat fresh fruits and veggies, stop smoking and learn to enjoy sweating. Jeeeezus! Stop trying to take the easy way out. I had a friend that kept asking me advice on how to lose weight. She was 350 pounds and couldn't avoid eating jack in the crack for breakfast everyday. She had the lap band done and now she has to eat all the food I told her to eat before the surgery that she said she couldn't stand(ie... fruits, veggies, yogurt, no bread, yadda yadda yadda). All I could do was LMAO and say I told you so. I'm prolly gonna pizz some people off with this post but I find it terribly hard for people to be able to risk a potential life threatening surgery just because they have no self control on their \"hoof to mouf\" disease.", 
        "reply": " Civ, When you KNOW what your talking about then comment. Thats like telling a combat veteran with PTSD to stop whining and get over it. It aint easy and in some cases this is the only option open to people. I know I'm one of them. With out going thru my whole emdical history, 3 doctors have recommended me for it. I opted for the surgery rather than the lap band, but my insurnace company has refused to cover it.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:44:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by ssg91B: And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery. You can CHEAT with the lap band by eating / drinking hi cal food (IE: milk shakes). You can't with the bypass, you'll throw up if you do.", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "Originally posted by ssg91B: And let's not forget that you can gain the weight back even after having the lap-band/Gastric by-pass surgery.", 
        "reply": " You can CHEAT with the lap band by eating / drinking hi cal food (IE: milk shakes). You can't with the bypass, you'll throw up if you do.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:49:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "quote: Originally posted by cabby866: Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder. yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.[/QUOTE] Cabby, You need to do the research, find out the pros and cons of each surgery, talk to more than one doctor that perform the surgery. There are also support groups you can talk to, they're usually connected to your local hospital. Which every way you decide, AND THIS IS CRITICAL - BE SURE YOU HAVE ON-GOING SUPPORT BEFORE, DURING AND AFTER THE SURGERY. The docore I went to insisted on following me for 3 month before and minimum 1 year after the surgery. He also had a pre-op program that included a Cardiac, Respiratory, Psych and Dietary work up. Good luck to you.", 
        "intTime": 20090306, 
        "postID": 36, 
        "quote": "Originally posted by cabby866: Have you honestly tried everything in your power to lose weight naturaly? I.E. fruits,vegs,exercise? I understand that some people have a disorder that keeps the weight on. But if you can exercise,eat a decent diet,then do so--surgery should be for those individuals that have that type of disorder.", 
        "reply": " yes i have tried everything. the reason i got up to the weight i am at is because i had a thyroid issue that i have to take medication for everyday. even with the medication i can only maintain my weight. my doctor recommended looking into the surgeries for helth reasons. i always believed myself to be a helthy person I DO eat right and excersize but when your body is against you, you can only do so much until drastic measures have to be taken. i was in the navy for 3 1/2 yrs. i got kicked out for weight standards after i begged the doctor to do some tests. no one belived me that something was wrong. i have lost so much from having this problem including a job i loved. So before you judge ( CiviLegg ) you should really ask more questions. going from in highschool playing volleyball and basketball, then to the navy, to this blob was not a choice. i just want my old self back. yes i have always struggled with my weight, but it was never like this.granted i should have put my medical condition in the first post but it is no subsitute for manors. This was more of a question for people who have had the surgeries and could give me advise. and i don't smoke or drink.[/QUOTE] Cabby, You need to do the research, find out the pros and cons of each surgery, talk to more than one doctor that perform the surgery. There are also support groups you can talk to, they're usually connected to your local hospital. Which every way you decide, AND THIS IS CRITICAL - BE SURE YOU HAVE ON-GOING SUPPORT BEFORE, DURING AND AFTER THE SURGERY. The docore I went to insisted on following me for 3 month before and minimum 1 year after the surgery. He also had a pre-op program that included a Cardiac, Respiratory, Psych and Dietary work up. Good luck to you.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:55:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ...", 
        "intTime": 20090306, 
        "postID": 37, 
        "quote": "", 
        "reply": "Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ...", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 08:59:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "navy8086"
    }, 
    {
        "content": "Way to go, Navy! A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090306, 
        "postID": 38, 
        "quote": "", 
        "reply": "Way to go, Navy! A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 09:06:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "quote: Originally posted by navy8086: Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ... navy8086, I will be reading this thread to see if I can learn some tips/info. I have a lifelong weight battle to overcome as well. i have considered hypnosis (not done it yet though) and counseling (not there yet, either). i have also been diagnosed w/depression and PTSD (non- mil related). I am still in the employ of our Uncle Sam and will have to retire in 5 years due to age. I am hoping to find something after that to stay in contact with the military. (I just can't get enough of this schtuff!!) IMHO cabby, you may wish to check into counseling prior to any surgery. Not saying that this WILL be the solution, but sometimes we just don't realize WHY we do some of the things we do or why we just CAN'T seem to be able to do what we KNOW to be right. Hope you find the correct answer for you. God's blessings on you. These are my opinions. Yours may differ.", 
        "intTime": 20090306, 
        "postID": 39, 
        "quote": "Originally posted by navy8086: Cabby,,, Here, I started this thread to documentthe whole thing: The Obeisty thread I hope it helps ...", 
        "reply": " navy8086, I will be reading this thread to see if I can learn some tips/info. I have a lifelong weight battle to overcome as well. i have considered hypnosis (not done it yet though) and counseling (not there yet, either). i have also been diagnosed w/depression and PTSD (non- mil related). I am still in the employ of our Uncle Sam and will have to retire in 5 years due to age. I am hoping to find something after that to stay in contact with the military. (I just can't get enough of this schtuff!!) IMHO cabby, you may wish to check into counseling prior to any surgery. Not saying that this WILL be the solution, but sometimes we just don't realize WHY we do some of the things we do or why we just CAN'T seem to be able to do what we KNOW to be right. Hope you find the correct answer for you. God's blessings on you. These are my opinions. Yours may differ.", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 09:44:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "4403771"
    }, 
    {
        "content": "Cabby, I understand about Hypo-thyroid. Yes it will cause weight gain. Also,have your blood sugar checked for Sydrome x. That's what I have, It's a pre-diabetic condition. Your pancreas pumps way more insulin into your body trying to break down CARBS. Your body doesn't except those carbs into your system for energy--Then eventually gets stored as fat around the middle. A dietician figured it out for me. Since I have been on a low- Carb diet,Iv'e lost the weight that I had gained in about 4 mths. Ask about it.....", 
        "intTime": 20090306, 
        "postID": 40, 
        "quote": "", 
        "reply": "Cabby, I understand about Hypo-thyroid. Yes it will cause weight gain. Also,have your blood sugar checked for Sydrome x. That's what I have, It's a pre-diabetic condition. Your pancreas pumps way more insulin into your body trying to break down CARBS. Your body doesn't except those carbs into your system for energy--Then eventually gets stored as fat around the middle. A dietician figured it out for me. Since I have been on a low- Carb diet,Iv'e lost the weight that I had gained in about 4 mths. Ask about it.....", 
        "threadID": "5291911282_7210050712001", 
        "time": "2009-03-06 10:31:00", 
        "title": "Lap Band vs. Gastric Bypass", 
        "userID": "Jonsey36"
    }
]