[
    {
        "content": "Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is: quote: But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends. Therefore, as mentioned, we have a British citizen, sitting in the White House. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends.", 
        "reply": "Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is:  Therefore, as mentioned, we have a British citizen, sitting in the White House. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 11:47:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated?", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "", 
        "reply": "Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:01:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:14:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "bugsy48"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated? At this point, it's way past not 'checking' him out. Some may not be comfortable with them..but the facts are: 1. He was born with British citizenship. Something he freely admitted to on his own campaign web site. 2. There is no known record of him renouncing his British citizenship, that again, he freely admitted to having. 3. When Kenyan gained independence from G.B., those with British citizenship (i.e. Barry), never lost it. It's right their in their own (Kenyan) Constitution. Some folks my choose to ignore this. Some folks may choose to remain indifferent. Some folks may believe that something like this only happens to other countries...that it couldn't possibly happen here. No way, not here. But that doesn't change the fact that he continues to be a British citizen to this day. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by armywifefigueroa: Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated?", 
        "reply": " At this point, it's way past not 'checking' him out. Some may not be comfortable with them..but the facts are: 1. He was born with British citizenship. Something he freely admitted to on his own campaign web site. 2. There is no known record of him renouncing his British citizenship, that again, he freely admitted to having. 3. When Kenyan gained independence from G.B., those with British citizenship (i.e. Barry), never lost it. It's right their in their own (Kenyan) Constitution. Some folks my choose to ignore this. Some folks may choose to remain indifferent. Some folks may believe that something like this only happens to other countries...that it couldn't possibly happen here. No way, not here. But that doesn't change the fact that he continues to be a British citizen to this day. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:17:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "This is getting really old. Read my lips. If there was anything wrong with President Obamas citizenship the GOP with all their money, resources and the ability to hire any expert they please would have found out and would have raised the biggest stink in history and President Obama would be out of office and possibly in jail. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "", 
        "reply": "This is getting really old. Read my lips. If there was anything wrong with President Obamas citizenship the GOP with all their money, resources and the ability to hire any expert they please would have found out and would have raised the biggest stink in history and President Obama would be out of office and possibly in jail. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:19:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Ditto the getting old part. He won. He's there. Get over it.", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "", 
        "reply": "Ditto the getting old part. He won. He's there. Get over it.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:21:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfamily2004"
    }, 
    {
        "content": "quote: Originally posted by bugsy48: Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG Although you give no source (because your replying in jest of course), I wouldn't doubt it. Bush was absolutely horrible on border security. Furthermore, he should have pardoned Ramos and Compean WAY before a few days until he left office. That was a travesty of justice IMO. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "Originally posted by bugsy48: Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG", 
        "reply": " Although you give no source (because your replying in jest of course), I wouldn't doubt it. Bush was absolutely horrible on border security. Furthermore, he should have pardoned Ramos and Compean WAY before a few days until he left office. That was a travesty of justice IMO. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:22:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it.", 
        "reply": " This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:25:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "\"....will never get old.\" Well, maybe just to YOU then.", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "\"....will never get old.\" Well, maybe just to YOU then.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:27:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfamily2004"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. I notice you didn't mention Austrians. So Arnie's OK in California, is he? MsG", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old.", 
        "reply": " I notice you didn't mention Austrians. So Arnie's OK in California, is he? MsG", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:30:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "bugsy48"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. For crying out loud, I know we're supposed to be nice to newbies and also we're not allowed to make personal attacks. Let me see how I can express my self concerning your \"theory\" while being nice and not attacking you. Sir, with all due respect and in a truly loving manner please allow me to say that your premise that President Obama is not an American citizen is asinine. Not you, you understand but your theory. It has been talked to death a thousand times in a hundred forums all throughout the media and over millions of breakfast tables. After all that not a scintilla of truth was found in the accusation. However if you have some special knowledge that the entire Republican party, the CIA, the FBI and the US Supreme court, not to mention every media outlet in the world doesn't know about please step forward with unassailable proof and assure your place in history. If not, why not just drop it? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old.", 
        "reply": " For crying out loud, I know we're supposed to be nice to newbies and also we're not allowed to make personal attacks. Let me see how I can express my self concerning your \"theory\" while being nice and not attacking you. Sir, with all due respect and in a truly loving manner please allow me to say that your premise that President Obama is not an American citizen is asinine. Not you, you understand but your theory. It has been talked to death a thousand times in a hundred forums all throughout the media and over millions of breakfast tables. After all that not a scintilla of truth was found in the accusation. However if you have some special knowledge that the entire Republican party, the CIA, the FBI and the US Supreme court, not to mention every media outlet in the world doesn't know about please step forward with unassailable proof and assure your place in history. If not, why not just drop it? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 14:05:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "", 
        "reply": "I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 14:50:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51 We need to have some sort of touch hole screens. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "Originally posted by mfdaniels_rph: I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51", 
        "reply": " We need to have some sort of touch hole screens. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:00:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Technically George Washington was a British Citizen, as were the Founding Fathers At most he might have Dual Citizenship IF he wanted it (Which I highly doubt he would) Sort of a Non-Issue", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "", 
        "reply": "Technically George Washington was a British Citizen, as were the Founding Fathers At most he might have Dual Citizenship IF he wanted it (Which I highly doubt he would) Sort of a Non-Issue", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:20:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Oh. get over it, he won. Demos were whining about GWB stealing the election in 2000 and whined for 8 years. Do you have to follow their example? McCain's Republic opponents tried to argue that he wasn't an American citizen, because he was born in Panama. Besides that 7 or 8 first POTUS were born British citizens. The British have always felt that anyone born a British citizen was always a British citizen.", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "", 
        "reply": "Oh. get over it, he won. Demos were whining about GWB stealing the election in 2000 and whined for 8 years. Do you have to follow their example? McCain's Republic opponents tried to argue that he wasn't an American citizen, because he was born in Panama. Besides that 7 or 8 first POTUS were born British citizens. The British have always felt that anyone born a British citizen was always a British citizen.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:27:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "[The British have always felt that anyone born a British citizen was always a British citizen.[/QUOTE] Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "", 
        "reply": "[The British have always felt that anyone born a British citizen was always a British citizen.[/QUOTE] Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:33:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?[/QUOTE] Yes, but by the time war was declared the British had stopped that practice.", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen.", 
        "reply": " Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?[/QUOTE] Yes, but by the time war was declared the British had stopped that practice.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:41:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "quote: Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen? Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] And the Battle of New Orleans took place after the war was over too. Makes you wonder if that battle had not taken place would Andrew Jackson been elected President.", 
        "intTime": 20090416, 
        "postID": 18, 
        "quote": "Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "reply": " Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] And the Battle of New Orleans took place after the war was over too. Makes you wonder if that battle had not taken place would Andrew Jackson been elected President.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 16:00:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen? Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] I notice that Americans can be a bit cagey about what sort of trade many those US ships were engaged in. (That said the whole issue about Britain's unilateral enforcement of the 1808 Slave Trade ban has always reminded me of the zealous convert trying to assuage his guilt.) I certainly have the feeling that until 1808 many of those American Citizens and American Ships flew the Union Jack and hurriedly changed allegiance somewhere between Bristol and West Africa. As to whether he could claim British citizenship that's probably a bit murky, there were a couple of Acts that restricted the rights of Colonial and Commonwealth citizens to claim full British citizenship back in the Eighties (Thatcher was worried about several million Hong Kong Chinese suddenly rocking up before the 1997 handover). As I recall the right to say civis Britannicus sum was restricted to those who actually had ancestors from the UK and there were secondary tests even for them. Anyway even if he is we don't want him - or the rest of you for that matter - you're more trouble than you're worth.", 
        "intTime": 20090416, 
        "postID": 19, 
        "quote": "Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "reply": " Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] I notice that Americans can be a bit cagey about what sort of trade many those US ships were engaged in. (That said the whole issue about Britain's unilateral enforcement of the 1808 Slave Trade ban has always reminded me of the zealous convert trying to assuage his guilt.) I certainly have the feeling that until 1808 many of those American Citizens and American Ships flew the Union Jack and hurriedly changed allegiance somewhere between Bristol and West Africa. As to whether he could claim British citizenship that's probably a bit murky, there were a couple of Acts that restricted the rights of Colonial and Commonwealth citizens to claim full British citizenship back in the Eighties (Thatcher was worried about several million Hong Kong Chinese suddenly rocking up before the 1997 handover). As I recall the right to say civis Britannicus sum was restricted to those who actually had ancestors from the UK and there were secondary tests even for them. Anyway even if he is we don't want him - or the rest of you for that matter - you're more trouble than you're worth.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 16:40:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is: quote: But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends. Therefore, as mentioned, we have a British citizen, sitting in the White House. Unfortunately, the same argument applies to everyone in the Original 13 Colonies, including George Washington... Britain has NEVER recognized a person's ability to give up British Citizenship. It would too easily unravel the Empire as they were and are . .. Wandering and Wondering", 
        "intTime": 20090416, 
        "postID": 20, 
        "quote": "Originally posted by rxsid4: Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is: quote: But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends. Therefore, as mentioned, we have a British citizen, sitting in the White House.", 
        "reply": " Unfortunately, the same argument applies to everyone in the Original 13 Colonies, including George Washington... Britain has NEVER recognized a person's ability to give up British Citizenship. It would too easily unravel the Empire as they were and are . .. Wandering and Wondering", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 16:45:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is: quote: But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends. Therefore, as mentioned, we have a British citizen, sitting in the White House. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 21, 
        "quote": "But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends.", 
        "reply": "Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is:  Therefore, as mentioned, we have a British citizen, sitting in the White House. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 11:47:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated?", 
        "intTime": 20090416, 
        "postID": 22, 
        "quote": "", 
        "reply": "Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:01:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG", 
        "intTime": 20090416, 
        "postID": 23, 
        "quote": "", 
        "reply": "Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:14:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "bugsy48"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated? At this point, it's way past not 'checking' him out. Some may not be comfortable with them..but the facts are: 1. He was born with British citizenship. Something he freely admitted to on his own campaign web site. 2. There is no known record of him renouncing his British citizenship, that again, he freely admitted to having. 3. When Kenyan gained independence from G.B., those with British citizenship (i.e. Barry), never lost it. It's right their in their own (Kenyan) Constitution. Some folks my choose to ignore this. Some folks may choose to remain indifferent. Some folks may believe that something like this only happens to other countries...that it couldn't possibly happen here. No way, not here. But that doesn't change the fact that he continues to be a British citizen to this day. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 24, 
        "quote": "Originally posted by armywifefigueroa: Look, I don't like the guy either, but do you REALLY think that he wasn't checked out to the fullest before being inaugurated?", 
        "reply": " At this point, it's way past not 'checking' him out. Some may not be comfortable with them..but the facts are: 1. He was born with British citizenship. Something he freely admitted to on his own campaign web site. 2. There is no known record of him renouncing his British citizenship, that again, he freely admitted to having. 3. When Kenyan gained independence from G.B., those with British citizenship (i.e. Barry), never lost it. It's right their in their own (Kenyan) Constitution. Some folks my choose to ignore this. Some folks may choose to remain indifferent. Some folks may believe that something like this only happens to other countries...that it couldn't possibly happen here. No way, not here. But that doesn't change the fact that he continues to be a British citizen to this day. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:17:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "This is getting really old. Read my lips. If there was anything wrong with President Obamas citizenship the GOP with all their money, resources and the ability to hire any expert they please would have found out and would have raised the biggest stink in history and President Obama would be out of office and possibly in jail. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 25, 
        "quote": "", 
        "reply": "This is getting really old. Read my lips. If there was anything wrong with President Obamas citizenship the GOP with all their money, resources and the ability to hire any expert they please would have found out and would have raised the biggest stink in history and President Obama would be out of office and possibly in jail. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:19:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Ditto the getting old part. He won. He's there. Get over it.", 
        "intTime": 20090416, 
        "postID": 26, 
        "quote": "", 
        "reply": "Ditto the getting old part. He won. He's there. Get over it.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:21:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfamily2004"
    }, 
    {
        "content": "quote: Originally posted by bugsy48: Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG Although you give no source (because your replying in jest of course), I wouldn't doubt it. Bush was absolutely horrible on border security. Furthermore, he should have pardoned Ramos and Compean WAY before a few days until he left office. That was a travesty of justice IMO. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 27, 
        "quote": "Originally posted by bugsy48: Now I AM disappointed! I always thought he was a Mick, like me. No wonder he won't take my calls. By the way, did you know that Bush secretly adopted Mexican nationality and never relinquished it? MsG", 
        "reply": " Although you give no source (because your replying in jest of course), I wouldn't doubt it. Bush was absolutely horrible on border security. Furthermore, he should have pardoned Ramos and Compean WAY before a few days until he left office. That was a travesty of justice IMO. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:22:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 28, 
        "quote": "Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it.", 
        "reply": " This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:25:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rxsid4"
    }, 
    {
        "content": "\"....will never get old.\" Well, maybe just to YOU then.", 
        "intTime": 20090416, 
        "postID": 29, 
        "quote": "", 
        "reply": "\"....will never get old.\" Well, maybe just to YOU then.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:27:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfamily2004"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. I notice you didn't mention Austrians. So Arnie's OK in California, is he? MsG", 
        "intTime": 20090416, 
        "postID": 30, 
        "quote": "Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old.", 
        "reply": " I notice you didn't mention Austrians. So Arnie's OK in California, is he? MsG", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 12:30:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "bugsy48"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old. For crying out loud, I know we're supposed to be nice to newbies and also we're not allowed to make personal attacks. Let me see how I can express my self concerning your \"theory\" while being nice and not attacking you. Sir, with all due respect and in a truly loving manner please allow me to say that your premise that President Obama is not an American citizen is asinine. Not you, you understand but your theory. It has been talked to death a thousand times in a hundred forums all throughout the media and over millions of breakfast tables. After all that not a scintilla of truth was found in the accusation. However if you have some special knowledge that the entire Republican party, the CIA, the FBI and the US Supreme court, not to mention every media outlet in the world doesn't know about please step forward with unassailable proof and assure your place in history. If not, why not just drop it? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "Originally posted by rxsid4: quote: Originally posted by mfamily2004: Ditto the getting old part. He won. He's there. Get over it. This issue of allowing British (or Russian or Chinese or Spanish, etc) citizens to become our POTUS...will never get old.", 
        "reply": " For crying out loud, I know we're supposed to be nice to newbies and also we're not allowed to make personal attacks. Let me see how I can express my self concerning your \"theory\" while being nice and not attacking you. Sir, with all due respect and in a truly loving manner please allow me to say that your premise that President Obama is not an American citizen is asinine. Not you, you understand but your theory. It has been talked to death a thousand times in a hundred forums all throughout the media and over millions of breakfast tables. After all that not a scintilla of truth was found in the accusation. However if you have some special knowledge that the entire Republican party, the CIA, the FBI and the US Supreme court, not to mention every media outlet in the world doesn't know about please step forward with unassailable proof and assure your place in history. If not, why not just drop it? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 14:05:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "", 
        "reply": "I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 14:50:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51 We need to have some sort of touch hole screens. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "Originally posted by mfdaniels_rph: I have not posted on here for a few weeks. Mainly because I have been busy with outside stuff and work has been busier too. But another reason is because of these kinds of topics. It seems like alot of these post just want to rip on the CIC. It is getting old. I second you Vicdude. Time to send this Urban Legend to Area 51", 
        "reply": " We need to have some sort of touch hole screens. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:00:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Technically George Washington was a British Citizen, as were the Founding Fathers At most he might have Dual Citizenship IF he wanted it (Which I highly doubt he would) Sort of a Non-Issue", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "", 
        "reply": "Technically George Washington was a British Citizen, as were the Founding Fathers At most he might have Dual Citizenship IF he wanted it (Which I highly doubt he would) Sort of a Non-Issue", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:20:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Oh. get over it, he won. Demos were whining about GWB stealing the election in 2000 and whined for 8 years. Do you have to follow their example? McCain's Republic opponents tried to argue that he wasn't an American citizen, because he was born in Panama. Besides that 7 or 8 first POTUS were born British citizens. The British have always felt that anyone born a British citizen was always a British citizen.", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "", 
        "reply": "Oh. get over it, he won. Demos were whining about GWB stealing the election in 2000 and whined for 8 years. Do you have to follow their example? McCain's Republic opponents tried to argue that he wasn't an American citizen, because he was born in Panama. Besides that 7 or 8 first POTUS were born British citizens. The British have always felt that anyone born a British citizen was always a British citizen.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:27:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "[The British have always felt that anyone born a British citizen was always a British citizen.[/QUOTE] Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "", 
        "reply": "[The British have always felt that anyone born a British citizen was always a British citizen.[/QUOTE] Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:33:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?[/QUOTE] Yes, but by the time war was declared the British had stopped that practice.", 
        "intTime": 20090416, 
        "postID": 37, 
        "quote": "Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen.", 
        "reply": " Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?[/QUOTE] Yes, but by the time war was declared the British had stopped that practice.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 15:41:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "quote: Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen? Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] And the Battle of New Orleans took place after the war was over too. Makes you wonder if that battle had not taken place would Andrew Jackson been elected President.", 
        "intTime": 20090416, 
        "postID": 38, 
        "quote": "Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: [The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "reply": " Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] And the Battle of New Orleans took place after the war was over too. Makes you wonder if that battle had not taken place would Andrew Jackson been elected President.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 16:00:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen? Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] I notice that Americans can be a bit cagey about what sort of trade many those US ships were engaged in. (That said the whole issue about Britain's unilateral enforcement of the 1808 Slave Trade ban has always reminded me of the zealous convert trying to assuage his guilt.) I certainly have the feeling that until 1808 many of those American Citizens and American Ships flew the Union Jack and hurriedly changed allegiance somewhere between Bristol and West Africa. As to whether he could claim British citizenship that's probably a bit murky, there were a couple of Acts that restricted the rights of Colonial and Commonwealth citizens to claim full British citizenship back in the Eighties (Thatcher was worried about several million Hong Kong Chinese suddenly rocking up before the 1997 handover). As I recall the right to say civis Britannicus sum was restricted to those who actually had ancestors from the UK and there were secondary tests even for them. Anyway even if he is we don't want him - or the rest of you for that matter - you're more trouble than you're worth.", 
        "intTime": 20090416, 
        "postID": 39, 
        "quote": "Originally posted by rangerdoug: quote: Originally posted by mfdaniels_rph: The British have always felt that anyone born a British citizen was always a British citizen. Isn't that one of the reasons for the war of 1812. The British were stopping American ships and taking American citizens by saying once a British citizen, always a citizen?", 
        "reply": " Yes, but by the time war was declared the British had stopped that practice.[/QUOTE] I notice that Americans can be a bit cagey about what sort of trade many those US ships were engaged in. (That said the whole issue about Britain's unilateral enforcement of the 1808 Slave Trade ban has always reminded me of the zealous convert trying to assuage his guilt.) I certainly have the feeling that until 1808 many of those American Citizens and American Ships flew the Union Jack and hurriedly changed allegiance somewhere between Bristol and West Africa. As to whether he could claim British citizenship that's probably a bit murky, there were a couple of Acts that restricted the rights of Colonial and Commonwealth citizens to claim full British citizenship back in the Eighties (Thatcher was worried about several million Hong Kong Chinese suddenly rocking up before the 1997 handover). As I recall the right to say civis Britannicus sum was restricted to those who actually had ancestors from the UK and there were secondary tests even for them. Anyway even if he is we don't want him - or the rest of you for that matter - you're more trouble than you're worth.", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 16:40:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is: quote: But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends. Therefore, as mentioned, we have a British citizen, sitting in the White House. Unfortunately, the same argument applies to everyone in the Original 13 Colonies, including George Washington... Britain has NEVER recognized a person's ability to give up British Citizenship. It would too easily unravel the Empire as they were and are . .. Wandering and Wondering", 
        "intTime": 20090416, 
        "postID": 40, 
        "quote": "Originally posted by rxsid4: Barry, to this day, remains a British Citizen. There is no proof he ever renounced his British citizenship. Furthermore, it's a popular myth amongst those who are familiar with this issue, that he somehow lost his British citizenship somewhere along the way. That's completely false, and Mario Apuzzo explains it well with facts (and citations from the Kenyan Constitution itself). A lengthy, but important read: \"http://puzo1.blogspot.com/2009/04/obama-president-of-us-is-currently-also_07.html\" The 'gist' of it is: quote: But neither Kenya’s independence from Great Britain nor the Kenyan Constitution caused Obama to lose his British citizenship with which he was born. ... There are no known statements from either Obama or his campaign contending that he eventually lost his British citizenship. Rather, the statements have been that his British citizenship converted to Kenyan citizenship when Kenya obtained its independence from Great Britain in 1963 and that he then lost Kenyan citizenship under the Kenyan constitution and laws when he did not renounce U.S. citizenship at age 21. But since Obama never lost his British citizenship, it does not matter that Obama may have lost his Kenyan citizenship as he contends. Therefore, as mentioned, we have a British citizen, sitting in the White House.", 
        "reply": " Unfortunately, the same argument applies to everyone in the Original 13 Colonies, including George Washington... Britain has NEVER recognized a person's ability to give up British Citizenship. It would too easily unravel the Empire as they were and are . .. Wandering and Wondering", 
        "threadID": "5291911282_9530039022001", 
        "time": "2009-04-16 16:45:00", 
        "title": "The British Citizen sitting in the White House!", 
        "userID": "greywolfghost"
    }
]