[
    {
        "content": "Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "intTime": 20090423, 
        "postID": 1, 
        "quote": "", 
        "reply": "Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 16:20:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "http://www.attorney-help.us/?gclid=CNH1__WZiJoCFRwDagod9W05Fg Just a guess - never needed one...so far - - Wandering and Wondering", 
        "intTime": 20090423, 
        "postID": 2, 
        "quote": "", 
        "reply": "http://www.attorney-help.us/?gclid=CNH1__WZiJoCFRwDagod9W05Fg Just a guess - never needed one...so far - - Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 16:58:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "thanks will check it out i appreciate it much", 
        "intTime": 20090423, 
        "postID": 3, 
        "quote": "", 
        "reply": "thanks will check it out i appreciate it much", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 17:23:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights? 1. Google \"internet law library\". 2. Select the state from which you want the advice. 3. Type in the subject matter, i.e., \"non married property rights\". Another option is to read the Lee Marvin decision. Just google it. Also, you may try ** remember NO HOT links ** This message has been edited. Last edited by: OldArmyLove, Thu 23 April 2009 05:56 PM", 
        "intTime": 20090423, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "reply": " 1. Google \"internet law library\". 2. Select the state from which you want the advice. 3. Type in the subject matter, i.e., \"non married property rights\". Another option is to read the Lee Marvin decision. Just google it. Also, you may try ** remember NO HOT links ** This message has been edited. Last edited by: OldArmyLove, Thu 23 April 2009 05:56 PM", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 17:26:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "GW, did you just break a TOS rule? you too f5....... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 5, 
        "quote": "", 
        "reply": "GW, did you just break a TOS rule? you too f5....... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 17:43:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!! Wandering and Wondering", 
        "intTime": 20090423, 
        "postID": 6, 
        "quote": "", 
        "reply": "Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!! Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 21:48:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!! There is nothing more annoying than some yacking-azz dog and it's the dog's owner's responsibility to maintain his animal in the proper manner. Most towns have animal and noise ordinances. The animal barking statutes are usually not handled by the police, but by the dog warden or animal control officer. They know the statutes better than cops and are entrusted to summons dog owners for violations. Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. They have asked for evidence, such as a video of the violation. Your information will be kept confidential because they know most complainants don't want a confrontation with a knucklehead dog owner. By all means call animal control soon. Tell them your friend Kevin told you to.", 
        "intTime": 20090423, 
        "postID": 7, 
        "quote": "Originally posted by greywolfghost: Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!!", 
        "reply": " There is nothing more annoying than some yacking-azz dog and it's the dog's owner's responsibility to maintain his animal in the proper manner. Most towns have animal and noise ordinances. The animal barking statutes are usually not handled by the police, but by the dog warden or animal control officer. They know the statutes better than cops and are entrusted to summons dog owners for violations. Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. They have asked for evidence, such as a video of the violation. Your information will be kept confidential because they know most complainants don't want a confrontation with a knucklehead dog owner. By all means call animal control soon. Tell them your friend Kevin told you to.", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 22:06:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house! Wandering and Wondering", 
        "intTime": 20090423, 
        "postID": 8, 
        "quote": "Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved.", 
        "reply": " This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house! Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 22:18:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house! I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090424, 
        "postID": 9, 
        "quote": "Originally posted by greywolfghost: quote: Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house!", 
        "reply": " I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 05:27:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . . Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 10, 
        "quote": "", 
        "reply": "Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . . Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 07:15:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Some people are jerks, they don't give a rip! People like that shouldn't be allowed to breathe the air that we do! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090424, 
        "postID": 11, 
        "quote": "", 
        "reply": "Some people are jerks, they don't give a rip! People like that shouldn't be allowed to breathe the air that we do! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 07:33:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it)", 
        "intTime": 20090424, 
        "postID": 12, 
        "quote": "", 
        "reply": "Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it)", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 08:00:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise. What is a white noise generator? This sounds like something I want for sleeping in the daytime. (midnight shifts) Thanks", 
        "intTime": 20090424, 
        "postID": 13, 
        "quote": "Originally posted by Vicdude: I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise.", 
        "reply": " What is a white noise generator? This sounds like something I want for sleeping in the daytime. (midnight shifts) Thanks", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 08:50:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights? www. freeadvice .com \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090424, 
        "postID": 14, 
        "quote": "Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "reply": " www. freeadvice .com \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 16:17:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . . Do you know your neighbors? If not, perhaps it would be a good time to get to know them. Try first to start out on a friendly basis. Take over a some veggies from your garden or a cake (if the wife is a good baker). Lead the conversation to the point where you mention that their dog must be very unhappy. Try to find out why it is so unhappy. Perhaps the dog is sick or maybe they have a sick child or baby in the house. Surely the barking is loud to them as well as you. (It would not be recommended to say \"your stupid dog barks all night and keeps me awake, I'm going to *****....******!\") If the people are just downright rude...well then, start: dog barks = phone call (every time) If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. Obviously you are being annoyed by the dog barking and the dog owners are oblivious to your annoyance. When they become inconvenienced or annoyed you will get their attention and be able to resolve the problem. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090424, 
        "postID": 15, 
        "quote": "Originally posted by greywolfghost: Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . .", 
        "reply": " Do you know your neighbors? If not, perhaps it would be a good time to get to know them. Try first to start out on a friendly basis. Take over a some veggies from your garden or a cake (if the wife is a good baker). Lead the conversation to the point where you mention that their dog must be very unhappy. Try to find out why it is so unhappy. Perhaps the dog is sick or maybe they have a sick child or baby in the house. Surely the barking is loud to them as well as you. (It would not be recommended to say \"your stupid dog barks all night and keeps me awake, I'm going to *****....******!\") If the people are just downright rude...well then, start: dog barks = phone call (every time) If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. Obviously you are being annoyed by the dog barking and the dog owners are oblivious to your annoyance. When they become inconvenienced or annoyed you will get their attention and be able to resolve the problem. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 16:30:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it) I have no problem shooting an animal, if it's attacking me, my family, or my pets. Where I live, the law states I can do that and I would not hesitate to do it. To kill an animal just to kill it, is totally wrong! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090424, 
        "postID": 16, 
        "quote": "Originally posted by armywifefigueroa: Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it)", 
        "reply": " I have no problem shooting an animal, if it's attacking me, my family, or my pets. Where I live, the law states I can do that and I would not hesitate to do it. To kill an animal just to kill it, is totally wrong! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 16:40:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 17, 
        "quote": "If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness.", 
        "reply": " A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 17:20:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - GW, File a restraining order with the court. You will have to submit evidence of the annoying barking. When the court grants the order, any subsequent barking will be a violation of the court order, ie, contempt of court, and the neighbor will be fined. If it continues, after about three violations, the court will order the dog removed by animal control. You do not need a lawyer to do this. It is just a matter of filling out the forms and appearing in court. The sheriff can serve the neighbor with the notice to appear.", 
        "intTime": 20090424, 
        "postID": 18, 
        "quote": "Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - -", 
        "reply": " GW, File a restraining order with the court. You will have to submit evidence of the annoying barking. When the court grants the order, any subsequent barking will be a violation of the court order, ie, contempt of court, and the neighbor will be fined. If it continues, after about three violations, the court will order the dog removed by animal control. You do not need a lawyer to do this. It is just a matter of filling out the forms and appearing in court. The sheriff can serve the neighbor with the notice to appear.", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 18:07:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: GW, did you just break a TOS rule? you too f5....... Nope. When I sent it, it was pretty cold.", 
        "intTime": 20090424, 
        "postID": 19, 
        "quote": "Originally posted by m551sheridan: GW, did you just break a TOS rule? you too f5.......", 
        "reply": " Nope. When I sent it, it was pretty cold.", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 18:22:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. I take it the cake didn't work... It is always better to have a civil relationship with the neighbors if at all possible. You must live in town. I live in the country and can do all that I listed. If I take down the fence...it's my fence....but, I wouldn't want to do that as the cows would go visiting. I have enough trouble with Dumber as she figured out how to get across the cattleguard. She wants to wander.... So had to have the son go dig out the ditch. He wasn't too happy. Ended up that he had to use a hoe between the bars dragging dirt to one side. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090426, 
        "postID": 20, 
        "quote": "Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. I take it the cake didn't work... It is always better to have a civil relationship with the neighbors if at all possible. You must live in town. I live in the country and can do all that I listed. If I take down the fence...it's my fence....but, I wouldn't want to do that as the cows would go visiting. I have enough trouble with Dumber as she figured out how to get across the cattleguard. She wants to wander.... So had to have the son go dig out the ditch. He wasn't too happy. Ended up that he had to use a hoe between the bars dragging dirt to one side. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - -", 
        "reply": " \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-26 16:50:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "intTime": 20090423, 
        "postID": 21, 
        "quote": "", 
        "reply": "Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 16:20:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "http://www.attorney-help.us/?gclid=CNH1__WZiJoCFRwDagod9W05Fg Just a guess - never needed one...so far - - Wandering and Wondering", 
        "intTime": 20090423, 
        "postID": 22, 
        "quote": "", 
        "reply": "http://www.attorney-help.us/?gclid=CNH1__WZiJoCFRwDagod9W05Fg Just a guess - never needed one...so far - - Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 16:58:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "thanks will check it out i appreciate it much", 
        "intTime": 20090423, 
        "postID": 23, 
        "quote": "", 
        "reply": "thanks will check it out i appreciate it much", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 17:23:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights? 1. Google \"internet law library\". 2. Select the state from which you want the advice. 3. Type in the subject matter, i.e., \"non married property rights\". Another option is to read the Lee Marvin decision. Just google it. Also, you may try ** remember NO HOT links ** This message has been edited. Last edited by: OldArmyLove, Thu 23 April 2009 05:56 PM", 
        "intTime": 20090423, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "reply": " 1. Google \"internet law library\". 2. Select the state from which you want the advice. 3. Type in the subject matter, i.e., \"non married property rights\". Another option is to read the Lee Marvin decision. Just google it. Also, you may try ** remember NO HOT links ** This message has been edited. Last edited by: OldArmyLove, Thu 23 April 2009 05:56 PM", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 17:26:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "GW, did you just break a TOS rule? you too f5....... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090423, 
        "postID": 25, 
        "quote": "", 
        "reply": "GW, did you just break a TOS rule? you too f5....... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 17:43:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!! Wandering and Wondering", 
        "intTime": 20090423, 
        "postID": 26, 
        "quote": "", 
        "reply": "Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!! Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 21:48:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!! There is nothing more annoying than some yacking-azz dog and it's the dog's owner's responsibility to maintain his animal in the proper manner. Most towns have animal and noise ordinances. The animal barking statutes are usually not handled by the police, but by the dog warden or animal control officer. They know the statutes better than cops and are entrusted to summons dog owners for violations. Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. They have asked for evidence, such as a video of the violation. Your information will be kept confidential because they know most complainants don't want a confrontation with a knucklehead dog owner. By all means call animal control soon. Tell them your friend Kevin told you to.", 
        "intTime": 20090423, 
        "postID": 27, 
        "quote": "Originally posted by greywolfghost: Nope, it's just red - and probably a dead end, but I'm thinking of talking to a lawyer about suing my neighbors about their dog. there's got to be a legal recourse beyond just complaining to the police about the noise. the thing just as well be in our kitchen barking all the time - what an annoying racket!!", 
        "reply": " There is nothing more annoying than some yacking-azz dog and it's the dog's owner's responsibility to maintain his animal in the proper manner. Most towns have animal and noise ordinances. The animal barking statutes are usually not handled by the police, but by the dog warden or animal control officer. They know the statutes better than cops and are entrusted to summons dog owners for violations. Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. They have asked for evidence, such as a video of the violation. Your information will be kept confidential because they know most complainants don't want a confrontation with a knucklehead dog owner. By all means call animal control soon. Tell them your friend Kevin told you to.", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 22:06:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house! Wandering and Wondering", 
        "intTime": 20090423, 
        "postID": 28, 
        "quote": "Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved.", 
        "reply": " This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house! Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-23 22:18:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house! I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090424, 
        "postID": 29, 
        "quote": "Originally posted by greywolfghost: quote: Our statute prohibits \"prolonged barking\". A court ruling said prolonged exceeded 15 or 20 minutes. The animal control officer also will see if the dog is licensed. Unlicensed would be another violation. If summonses go unanswered, I have seen them confiscate an animal till the situation is resolved. This thing barks for 2 or 3 hours at a time! Until they take the damned thing in the house!", 
        "reply": " I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 05:27:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . . Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 30, 
        "quote": "", 
        "reply": "Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . . Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 07:15:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Some people are jerks, they don't give a rip! People like that shouldn't be allowed to breathe the air that we do! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090424, 
        "postID": 31, 
        "quote": "", 
        "reply": "Some people are jerks, they don't give a rip! People like that shouldn't be allowed to breathe the air that we do! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 07:33:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it)", 
        "intTime": 20090424, 
        "postID": 32, 
        "quote": "", 
        "reply": "Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it)", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 08:00:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise. What is a white noise generator? This sounds like something I want for sleeping in the daytime. (midnight shifts) Thanks", 
        "intTime": 20090424, 
        "postID": 33, 
        "quote": "Originally posted by Vicdude: I ended up buying a white noise generator. I have it set to \"Rain\" and it blocks out almost of the noise.", 
        "reply": " What is a white noise generator? This sounds like something I want for sleeping in the daytime. (midnight shifts) Thanks", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 08:50:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights? www. freeadvice .com \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090424, 
        "postID": 34, 
        "quote": "Originally posted by crackerjacks61: Anyone know of a good place to get some online legal advice concerning domestic relationship (non-married) and property rights?", 
        "reply": " www. freeadvice .com \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 16:17:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . . Do you know your neighbors? If not, perhaps it would be a good time to get to know them. Try first to start out on a friendly basis. Take over a some veggies from your garden or a cake (if the wife is a good baker). Lead the conversation to the point where you mention that their dog must be very unhappy. Try to find out why it is so unhappy. Perhaps the dog is sick or maybe they have a sick child or baby in the house. Surely the barking is loud to them as well as you. (It would not be recommended to say \"your stupid dog barks all night and keeps me awake, I'm going to *****....******!\") If the people are just downright rude...well then, start: dog barks = phone call (every time) If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. Obviously you are being annoyed by the dog barking and the dog owners are oblivious to your annoyance. When they become inconvenienced or annoyed you will get their attention and be able to resolve the problem. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090424, 
        "postID": 35, 
        "quote": "Originally posted by greywolfghost: Bought one of these - seems to have some affect. It listens for the dog to bark, then emits a high=frequency irritating sound that only the dog can here to cause it to stop. Seems to have some affect at times...but I think the dog develops a tolerance after a time... Costs 50 dollars, so I'm paying paying to train their dog - ain't right! If I could sue them bad enough to take the property, I'd bulldoze the house . . .", 
        "reply": " Do you know your neighbors? If not, perhaps it would be a good time to get to know them. Try first to start out on a friendly basis. Take over a some veggies from your garden or a cake (if the wife is a good baker). Lead the conversation to the point where you mention that their dog must be very unhappy. Try to find out why it is so unhappy. Perhaps the dog is sick or maybe they have a sick child or baby in the house. Surely the barking is loud to them as well as you. (It would not be recommended to say \"your stupid dog barks all night and keeps me awake, I'm going to *****....******!\") If the people are just downright rude...well then, start: dog barks = phone call (every time) If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. Obviously you are being annoyed by the dog barking and the dog owners are oblivious to your annoyance. When they become inconvenienced or annoyed you will get their attention and be able to resolve the problem. \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 16:30:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it) I have no problem shooting an animal, if it's attacking me, my family, or my pets. Where I live, the law states I can do that and I would not hesitate to do it. To kill an animal just to kill it, is totally wrong! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090424, 
        "postID": 36, 
        "quote": "Originally posted by armywifefigueroa: Go buy an electric collar, walk up to the front door and tell them to use it or you'll permanently silence him... maybe that would ge the point across (btw, I'm no advacate for shooting animals unless it's for dinner, but sometimes the threat is enough to make the owners think about it)", 
        "reply": " I have no problem shooting an animal, if it's attacking me, my family, or my pets. Where I live, the law states I can do that and I would not hesitate to do it. To kill an animal just to kill it, is totally wrong! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 16:40:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 37, 
        "quote": "If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness.", 
        "reply": " A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - Wandering and Wondering", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 17:20:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - GW, File a restraining order with the court. You will have to submit evidence of the annoying barking. When the court grants the order, any subsequent barking will be a violation of the court order, ie, contempt of court, and the neighbor will be fined. If it continues, after about three violations, the court will order the dog removed by animal control. You do not need a lawyer to do this. It is just a matter of filling out the forms and appearing in court. The sheriff can serve the neighbor with the notice to appear.", 
        "intTime": 20090424, 
        "postID": 38, 
        "quote": "Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - -", 
        "reply": " GW, File a restraining order with the court. You will have to submit evidence of the annoying barking. When the court grants the order, any subsequent barking will be a violation of the court order, ie, contempt of court, and the neighbor will be fined. If it continues, after about three violations, the court will order the dog removed by animal control. You do not need a lawyer to do this. It is just a matter of filling out the forms and appearing in court. The sheriff can serve the neighbor with the notice to appear.", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 18:07:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: GW, did you just break a TOS rule? you too f5....... Nope. When I sent it, it was pretty cold.", 
        "intTime": 20090424, 
        "postID": 39, 
        "quote": "Originally posted by m551sheridan: GW, did you just break a TOS rule? you too f5.......", 
        "reply": " Nope. When I sent it, it was pretty cold.", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-24 18:22:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "f5rst3t"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. I take it the cake didn't work... It is always better to have a civil relationship with the neighbors if at all possible. You must live in town. I live in the country and can do all that I listed. If I take down the fence...it's my fence....but, I wouldn't want to do that as the cows would go visiting. I have enough trouble with Dumber as she figured out how to get across the cattleguard. She wants to wander.... So had to have the son go dig out the ditch. He wasn't too happy. Ended up that he had to use a hoe between the bars dragging dirt to one side. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - - \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090426, 
        "postID": 40, 
        "quote": "Originally posted by greywolfghost: quote: If they ignore or unplug the phone, then do something that annoys the neighbor. Target practice in the back yard, annoying music, running a chainsaw, firecrackers...etc. Or perhaps you could remove parts of the fence so the unhappy dog be free from his unhappiness. I take it the cake didn't work... It is always better to have a civil relationship with the neighbors if at all possible. You must live in town. I live in the country and can do all that I listed. If I take down the fence...it's my fence....but, I wouldn't want to do that as the cows would go visiting. I have enough trouble with Dumber as she figured out how to get across the cattleguard. She wants to wander.... So had to have the son go dig out the ditch. He wasn't too happy. Ended up that he had to use a hoe between the bars dragging dirt to one side. A good portion of that can cause the charges to go the other way - I just keep E-mailing the police, the mayor and the city council about the problem. They'll either fix it, or I'll have one helluva paper trail when the shyyt finally hits the fan - -", 
        "reply": " \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_9830085122001", 
        "time": "2009-04-26 16:50:00", 
        "title": "Are there any lawyers in the house?", 
        "userID": "aggie_swife"
    }
]