[
    {
        "content": "I had a stroke December 29th. An know I am no longer confident riding my motorcycle I have had for 10 years. I thought about selling it, but can't do it. You see it's painted in Army dress Blue, with the front of the gas tank in Blue chord blue,pin striped flames in gold like on them chevrons and pant stipe & belt. 1940 Ford tail-light up-side down=E-5,and Infantry crossed rifles under it. My great nephew is in the Infantry in Iraq as I type this. I decided to give it to him. Man this sucks,It's like I just lost a freind", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "I had a stroke December 29th. An know I am no longer confident riding my motorcycle I have had for 10 years. I thought about selling it, but can't do it. You see it's painted in Army dress Blue, with the front of the gas tank in Blue chord blue,pin striped flames in gold like on them chevrons and pant stipe & belt. 1940 Ford tail-light up-side down=E-5,and Infantry crossed rifles under it. My great nephew is in the Infantry in Iraq as I type this. I decided to give it to him. Man this sucks,It's like I just lost a freind", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-10 20:35:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "Damn, that's one of those decisions none of us want to ever have to make. You could sit on it for a while. My neighbor had a stroke about 2 years ago, and he's able to drive his cage again.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "Damn, that's one of those decisions none of us want to ever have to make. You could sit on it for a while. My neighbor had a stroke about 2 years ago, and he's able to drive his cage again.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-10 20:45:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by azmax64: Damn, that's one of those decisions none of us want to ever have to make. You could sit on it for a while. My neighbor had a stroke about 2 years ago, and he's able to drive his cage again. Agreed... Give ur self a lil' time, P.T. who knows, alot of people have regained strength,and agility.....(sigh) my kigdom for a Harley......", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "Originally posted by azmax64: Damn, that's one of those decisions none of us want to ever have to make. You could sit on it for a while. My neighbor had a stroke about 2 years ago, and he's able to drive his cage again.", 
        "reply": " Agreed... Give ur self a lil' time, P.T. who knows, alot of people have regained strength,and agility.....(sigh) my kigdom for a Harley......", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-10 20:48:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "quote: My neighbor had a stroke about 2 years ago, and he's able to drive his cage again. I drive the cage with no problem, but I dropped the bike 3 times ,so far,softley, but droped just the same. An I cant lift it up by myself any more.", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "My neighbor had a stroke about 2 years ago, and he's able to drive his cage again.", 
        "reply": " I drive the cage with no problem, but I dropped the bike 3 times ,so far,softley, but droped just the same. An I cant lift it up by myself any more.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-10 22:55:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "", 
        "reply": "GOD BLESS AMERICA! GOD BLESS OUR MILITARY!", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-10 23:05:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "peaceforall"
    }, 
    {
        "content": "quote: My great nephew is in the Infantry in Iraq as I type this. I decided to give it to him. Man this sucks,It's like I just lost a freind No, you will pass along a friend to your nephew. Whether it's with your or him, it will always be part of your life. Your passing along a treasure that someone you care about will hopefully treasure. If you sell it to some stranger who you know nothing about, then you would be losing a friend.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "My great nephew is in the Infantry in Iraq as I type this. I decided to give it to him. Man this sucks,It's like I just lost a freind", 
        "reply": " No, you will pass along a friend to your nephew. Whether it's with your or him, it will always be part of your life. Your passing along a treasure that someone you care about will hopefully treasure. If you sell it to some stranger who you know nothing about, then you would be losing a friend.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 06:53:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by YankeeeSgt: I had a stroke December 29th. An know I am no longer confident riding my motorcycle I have had for 10 years. I thought about selling it, but can't do it. You see it's painted in Army dress Blue, with the front of the gas tank in Blue chord blue,pin striped flames in gold like on them chevrons and pant stipe & belt. 1940 Ford tail-light up-side down=E-5,and Infantry crossed rifles under it. My great nephew is in the Infantry in Iraq as I type this. I decided to give it to him. Man this sucks,It's like I just lost a freind Wow, what an awesome gift! This past summer, I went to Hampton Beach, NH on my bike. There was a retired Marine there who had a beautiful Harley. He had it painted the same blue and red colors of the Marine Dress Blue uniforms. There was a painting of guys in Vietnam on the gas tank, his ribbons on the front of the fairing, US flag, USMC flag and I think a POW flag on the back by the saddle bags. The only photo I took came out crappy because it was taken with my cellphone camera. Wish I could post a nice, clear photo of it. Sorry your health caused you to loose a friend. Last year, I restored a 1980 Yamaha XS1100 Special for me. This year I'm restoring a 1981 XS1100 Special for when my brother or son are home from the military. (brother - USCG, son - USMC) Don This message has been edited. Last edited by: 21yrsUSCGUSCS, Wed 11 March 2009 07:32 AM", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by YankeeeSgt: I had a stroke December 29th. An know I am no longer confident riding my motorcycle I have had for 10 years. I thought about selling it, but can't do it. You see it's painted in Army dress Blue, with the front of the gas tank in Blue chord blue,pin striped flames in gold like on them chevrons and pant stipe & belt. 1940 Ford tail-light up-side down=E-5,and Infantry crossed rifles under it. My great nephew is in the Infantry in Iraq as I type this. I decided to give it to him. Man this sucks,It's like I just lost a freind", 
        "reply": " Wow, what an awesome gift! This past summer, I went to Hampton Beach, NH on my bike. There was a retired Marine there who had a beautiful Harley. He had it painted the same blue and red colors of the Marine Dress Blue uniforms. There was a painting of guys in Vietnam on the gas tank, his ribbons on the front of the fairing, US flag, USMC flag and I think a POW flag on the back by the saddle bags. The only photo I took came out crappy because it was taken with my cellphone camera. Wish I could post a nice, clear photo of it. Sorry your health caused you to loose a friend. Last year, I restored a 1980 Yamaha XS1100 Special for me. This year I'm restoring a 1981 XS1100 Special for when my brother or son are home from the military. (brother - USCG, son - USMC) Don This message has been edited. Last edited by: 21yrsUSCGUSCS, Wed 11 March 2009 07:32 AM", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 06:59:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "my uncle had a pretty bad stroke about 2 years back and he got pulled over one day. the officer thought he was drunk and attepmted to arrest him for dui. he walks with a limp and has slurred speech, he even offered to do a breathalizer and was denied. when it went up the chain and 2 other officers showed up and let him do a breathalizer he was let go. i was pretty ****ed to hear that.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "my uncle had a pretty bad stroke about 2 years back and he got pulled over one day. the officer thought he was drunk and attepmted to arrest him for dui. he walks with a limp and has slurred speech, he even offered to do a breathalizer and was denied. when it went up the chain and 2 other officers showed up and let him do a breathalizer he was let go. i was pretty ****ed to hear that.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 07:24:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "88miker"
    }, 
    {
        "content": "Why not get a trike? You can put a lot more paint on a trike and then you could ride with your nephew. I had a friend who built trikes and only trikes. He was in love with them. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "", 
        "reply": "Why not get a trike? You can put a lot more paint on a trike and then you could ride with your nephew. I had a friend who built trikes and only trikes. He was in love with them. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 07:31:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "It's hard for guy to have to give up driving. I have had my license suspended due to seizures. I'd rather stay off the road than put somone at risk. I have voluntarily given up driving, I'm having a lot of double vision and my coordination is bad! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "", 
        "reply": "It's hard for guy to have to give up driving. I have had my license suspended due to seizures. I'd rather stay off the road than put somone at risk. I have voluntarily given up driving, I'm having a lot of double vision and my coordination is bad! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 08:14:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "How about a Can-Am Spyder? ....", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "", 
        "reply": "How about a Can-Am Spyder? ....", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 08:37:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "navy8086"
    }, 
    {
        "content": "....and end up like this guy because of a seizure? Don", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "....and end up like this guy because of a seizure? Don", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 08:44:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by YankeeeSgt: I drive the cage with no problem, but I dropped the bike 3 times ,so far,softley, but droped just the same. An I cant lift it up by myself any more. I have a friend about 6'5\", 250#, can't pick up his 1100 Star by himself, neither can I. We can team up and lift it. Bikes're heavier these days. Sport bikes are lighter but the seating position is hard on old coots like me, too many loose parts getting jarred around.", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "Originally posted by YankeeeSgt: I drive the cage with no problem, but I dropped the bike 3 times ,so far,softley, but droped just the same. An I cant lift it up by myself any more.", 
        "reply": " I have a friend about 6'5\", 250#, can't pick up his 1100 Star by himself, neither can I. We can team up and lift it. Bikes're heavier these days. Sport bikes are lighter but the seating position is hard on old coots like me, too many loose parts getting jarred around.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 08:46:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: ....and end up like this guy because of a seizure? Don Ouch! did he survive? Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "Originally posted by 21yrsUSCGUSCS: ....and end up like this guy because of a seizure? Don", 
        "reply": " Ouch! did he survive? Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 10:27:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: quote: Originally posted by 21yrsUSCGUSCS: ....and end up like this guy because of a seizure? Don Ouch! did he survive? I most respectfully submit to you sir that, that was a rhetorical question. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "Originally posted by Bergy46: quote: Originally posted by 21yrsUSCGUSCS: ....and end up like this guy because of a seizure? Don Ouch! did he survive?", 
        "reply": " I most respectfully submit to you sir that, that was a rhetorical question. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-11 14:47:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "How about a Toyota Tundra? Its big, fast, and rides very comfortable. Get the Limited model with four wheel drive like I have.", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "", 
        "reply": "How about a Toyota Tundra? Its big, fast, and rides very comfortable. Get the Limited model with four wheel drive like I have.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-12 04:27:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "Duster6"
    }, 
    {
        "content": "I already have a Ranger. Anyway, I'll have to give it to the nephew. Other wise some civilian poser would be riding it an makeing up war stories.", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "", 
        "reply": "I already have a Ranger. Anyway, I'll have to give it to the nephew. Other wise some civilian poser would be riding it an makeing up war stories.", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-12 18:30:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "quote: Originally posted by YankeeeSgt: I already have a Ranger. Anyway, I'll have to give it to the nephew. Other wise some civilian poser would be riding it an makeing up war stories. That's a noble statement for sure and your right it just wouldn't be right for some Vet to walk up to it in a rest area and say \"sweet bike, where did you serve?\" and get a reply like \"Oh I bought it from a Vet\" and a sheepish grin. It could be a verification for some poser as you said and the purchaser may just delight in making up some stories and get a few from you to point out features on the bike. Make a deal with your Nephew to pass the machine off to another relative who has served. It could be a family heirloom and something the young members of your clan can look forward to. My older brother has a rifle (cap and ball) that has been passed down from the Civil War. I know that a few silver and paper dollars get passed around at the academies to junior candidates/cadets when a senior graduates. You might start a family tradition. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090312, 
        "postID": 18, 
        "quote": "Originally posted by YankeeeSgt: I already have a Ranger. Anyway, I'll have to give it to the nephew. Other wise some civilian poser would be riding it an makeing up war stories.", 
        "reply": " That's a noble statement for sure and your right it just wouldn't be right for some Vet to walk up to it in a rest area and say \"sweet bike, where did you serve?\" and get a reply like \"Oh I bought it from a Vet\" and a sheepish grin. It could be a verification for some poser as you said and the purchaser may just delight in making up some stories and get a few from you to point out features on the bike. Make a deal with your Nephew to pass the machine off to another relative who has served. It could be a family heirloom and something the young members of your clan can look forward to. My older brother has a rifle (cap and ball) that has been passed down from the Civil War. I know that a few silver and paper dollars get passed around at the academies to junior candidates/cadets when a senior graduates. You might start a family tradition. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_4180094712001", 
        "time": "2009-03-12 19:42:00", 
        "title": "Why not, It'll still be in the family,and he is Infantry?", 
        "userID": "sargeant_green"
    }
]