[
    {
        "content": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "", 
        "reply": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 02:52:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "reply": " Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 04:52:00", 
        "title": "disrespecting an nco", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:06:00", 
        "title": "disrespecting an nco", 
        "userID": "Boats22151"
    }, 
    {
        "content": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "intTime": 20090310, 
        "postID": 4, 
        "quote": "", 
        "reply": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "intTime": 20090310, 
        "postID": 5, 
        "quote": "Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "reply": " Don't know what you did but it sounds like you need to shut-up and listen !", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:39:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "", 
        "reply": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:43:00", 
        "title": "disrespecting an nco", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "", 
        "reply": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:51:00", 
        "title": "disrespecting an nco", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you. I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "reply": " I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Vicdude"
    }, 
    {
        "content": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "intTime": 20090310, 
        "postID": 9, 
        "quote": "", 
        "reply": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:26:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "intTime": 20090310, 
        "postID": 10, 
        "quote": "", 
        "reply": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:57:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Heck, you can get the same simply be getting married. Don", 
        "intTime": 20090310, 
        "postID": 11, 
        "quote": "Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI.", 
        "reply": " Heck, you can get the same simply be getting married. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:04:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen ! i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "intTime": 20090310, 
        "postID": 12, 
        "quote": "Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "reply": " i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:26:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "intTime": 20090310, 
        "postID": 13, 
        "quote": "", 
        "reply": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:29:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "intTime": 20090310, 
        "postID": 14, 
        "quote": "", 
        "reply": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:31:00", 
        "title": "disrespecting an nco", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "intTime": 20090310, 
        "postID": 15, 
        "quote": "", 
        "reply": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:50:00", 
        "title": "disrespecting an nco", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "intTime": 20090310, 
        "postID": 16, 
        "quote": "", 
        "reply": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:54:00", 
        "title": "disrespecting an nco", 
        "userID": "Phadzia"
    }, 
    {
        "content": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "intTime": 20090310, 
        "postID": 17, 
        "quote": "", 
        "reply": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:17:00", 
        "title": "disrespecting an nco", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination. That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 18, 
        "quote": "Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination.", 
        "reply": " That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:48:00", 
        "title": "disrespecting an nco", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "intTime": 20090310, 
        "postID": 19, 
        "quote": "", 
        "reply": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:57:00", 
        "title": "disrespecting an nco", 
        "userID": "VDoP"
    }, 
    {
        "content": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 20, 
        "quote": "", 
        "reply": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 11:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Bergy46"
    }, 
    {
        "content": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "intTime": 20090310, 
        "postID": 21, 
        "quote": "", 
        "reply": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 02:52:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "intTime": 20090310, 
        "postID": 22, 
        "quote": "Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "reply": " Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 04:52:00", 
        "title": "disrespecting an nco", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "intTime": 20090310, 
        "postID": 23, 
        "quote": "", 
        "reply": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:06:00", 
        "title": "disrespecting an nco", 
        "userID": "Boats22151"
    }, 
    {
        "content": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "intTime": 20090310, 
        "postID": 24, 
        "quote": "", 
        "reply": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "intTime": 20090310, 
        "postID": 25, 
        "quote": "Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "reply": " Don't know what you did but it sounds like you need to shut-up and listen !", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:39:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "intTime": 20090310, 
        "postID": 26, 
        "quote": "", 
        "reply": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:43:00", 
        "title": "disrespecting an nco", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "intTime": 20090310, 
        "postID": 27, 
        "quote": "", 
        "reply": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:51:00", 
        "title": "disrespecting an nco", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you. I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090310, 
        "postID": 28, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "reply": " I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Vicdude"
    }, 
    {
        "content": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "intTime": 20090310, 
        "postID": 29, 
        "quote": "", 
        "reply": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:26:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "intTime": 20090310, 
        "postID": 30, 
        "quote": "", 
        "reply": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:57:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Heck, you can get the same simply be getting married. Don", 
        "intTime": 20090310, 
        "postID": 31, 
        "quote": "Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI.", 
        "reply": " Heck, you can get the same simply be getting married. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:04:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen ! i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "intTime": 20090310, 
        "postID": 32, 
        "quote": "Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "reply": " i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:26:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "intTime": 20090310, 
        "postID": 33, 
        "quote": "", 
        "reply": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:29:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "intTime": 20090310, 
        "postID": 34, 
        "quote": "", 
        "reply": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:31:00", 
        "title": "disrespecting an nco", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "intTime": 20090310, 
        "postID": 35, 
        "quote": "", 
        "reply": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:50:00", 
        "title": "disrespecting an nco", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "intTime": 20090310, 
        "postID": 36, 
        "quote": "", 
        "reply": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:54:00", 
        "title": "disrespecting an nco", 
        "userID": "Phadzia"
    }, 
    {
        "content": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "intTime": 20090310, 
        "postID": 37, 
        "quote": "", 
        "reply": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:17:00", 
        "title": "disrespecting an nco", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination. That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 38, 
        "quote": "Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination.", 
        "reply": " That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:48:00", 
        "title": "disrespecting an nco", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "intTime": 20090310, 
        "postID": 39, 
        "quote": "", 
        "reply": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:57:00", 
        "title": "disrespecting an nco", 
        "userID": "VDoP"
    }, 
    {
        "content": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 40, 
        "quote": "", 
        "reply": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 11:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Bergy46"
    }, 
    {
        "content": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "intTime": 20090310, 
        "postID": 41, 
        "quote": "", 
        "reply": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 02:52:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "intTime": 20090310, 
        "postID": 42, 
        "quote": "Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "reply": " Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 04:52:00", 
        "title": "disrespecting an nco", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "intTime": 20090310, 
        "postID": 43, 
        "quote": "", 
        "reply": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:06:00", 
        "title": "disrespecting an nco", 
        "userID": "Boats22151"
    }, 
    {
        "content": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "intTime": 20090310, 
        "postID": 44, 
        "quote": "", 
        "reply": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "intTime": 20090310, 
        "postID": 45, 
        "quote": "Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "reply": " Don't know what you did but it sounds like you need to shut-up and listen !", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:39:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "intTime": 20090310, 
        "postID": 46, 
        "quote": "", 
        "reply": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:43:00", 
        "title": "disrespecting an nco", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "intTime": 20090310, 
        "postID": 47, 
        "quote": "", 
        "reply": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:51:00", 
        "title": "disrespecting an nco", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you. I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090310, 
        "postID": 48, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "reply": " I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Vicdude"
    }, 
    {
        "content": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "intTime": 20090310, 
        "postID": 49, 
        "quote": "", 
        "reply": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:26:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "intTime": 20090310, 
        "postID": 50, 
        "quote": "", 
        "reply": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:57:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Heck, you can get the same simply be getting married. Don", 
        "intTime": 20090310, 
        "postID": 51, 
        "quote": "Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI.", 
        "reply": " Heck, you can get the same simply be getting married. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:04:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen ! i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "intTime": 20090310, 
        "postID": 52, 
        "quote": "Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "reply": " i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:26:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "intTime": 20090310, 
        "postID": 53, 
        "quote": "", 
        "reply": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:29:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "intTime": 20090310, 
        "postID": 54, 
        "quote": "", 
        "reply": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:31:00", 
        "title": "disrespecting an nco", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "intTime": 20090310, 
        "postID": 55, 
        "quote": "", 
        "reply": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:50:00", 
        "title": "disrespecting an nco", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "intTime": 20090310, 
        "postID": 56, 
        "quote": "", 
        "reply": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:54:00", 
        "title": "disrespecting an nco", 
        "userID": "Phadzia"
    }, 
    {
        "content": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "intTime": 20090310, 
        "postID": 57, 
        "quote": "", 
        "reply": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:17:00", 
        "title": "disrespecting an nco", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination. That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 58, 
        "quote": "Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination.", 
        "reply": " That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:48:00", 
        "title": "disrespecting an nco", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "intTime": 20090310, 
        "postID": 59, 
        "quote": "", 
        "reply": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:57:00", 
        "title": "disrespecting an nco", 
        "userID": "VDoP"
    }, 
    {
        "content": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 60, 
        "quote": "", 
        "reply": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 11:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Bergy46"
    }, 
    {
        "content": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "intTime": 20090310, 
        "postID": 61, 
        "quote": "", 
        "reply": "now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 02:52:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "intTime": 20090310, 
        "postID": 62, 
        "quote": "Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something.", 
        "reply": " Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 04:52:00", 
        "title": "disrespecting an nco", 
        "userID": "billdawg24"
    }, 
    {
        "content": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "intTime": 20090310, 
        "postID": 63, 
        "quote": "", 
        "reply": "Ditto on what billdawg is saying - not sure what you are trying to state. However, it sounds like you were being dressed down. Without a lot more information it's hard to answer your concerns.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:06:00", 
        "title": "disrespecting an nco", 
        "userID": "Boats22151"
    }, 
    {
        "content": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "intTime": 20090310, 
        "postID": 64, 
        "quote": "", 
        "reply": "sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 05:56:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "intTime": 20090310, 
        "postID": 65, 
        "quote": "Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist.", 
        "reply": " Don't know what you did but it sounds like you need to shut-up and listen !", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:39:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "intTime": 20090310, 
        "postID": 66, 
        "quote": "", 
        "reply": "It's Article 91 of the UCMJ. That's called Insubordination.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:43:00", 
        "title": "disrespecting an nco", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "intTime": 20090310, 
        "postID": 67, 
        "quote": "", 
        "reply": "Learn to use tact. Just be glad they don't do wall to wall counceling like they used to. I loved giving wall to wall counceling. Seemed to work better than a counceling statement.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 07:51:00", 
        "title": "disrespecting an nco", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you. I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090310, 
        "postID": 68, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by 88miker: now im not the kind to get all butt hurt, but.. i have seen nco's go way out of line like calling people doo doo bags and morons. im sure we all have. but just the other day there was an e5 who ticked me off really bad so i said this is peoples motivation, not to get demorolized by you.. then it came out.. well im an nco and thats subject to ucmj with a smartass mouth like yours.. now maybe i was out of line but.. i dont talk like that to anyone. so why is it disrespecting an nco but spec and below are called getting ass hurt or suck it up? yes i understand they are the backbone as it is put, but i dont think anyone deserves that kind of talk unless its an extreme case. so basically i can be talked to like that and nothing would come of it but 3 rockers makes it a horese of another color.. anyone see something wrong with that? im not trying to ruffle feathers with this just trying to make sense of something. Actually, after reading this long, rambling abortion of a grammatical essay, I'm not real sure what you're talking about. Are you the the name caller or name callee? Who is going up on UCMJ? Re write a little more clearly, and maybe someone can help you.", 
        "reply": " I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. Yes, sometimes people ranked above one might cross the line and be abusive. Get over it! Remember that those outranking you are only human. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Vicdude"
    }, 
    {
        "content": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "intTime": 20090310, 
        "postID": 69, 
        "quote": "", 
        "reply": "No offense 88miker, Some may not like it but I guess I am a bit relieved to hear the military hasn't gone totally soft and cuddly as the PC crowd would like. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:26:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "intTime": 20090310, 
        "postID": 70, 
        "quote": "", 
        "reply": "I'm glad you wrote that. I read his post twice and can't make heads or tails of it. I actually thought I had gone senile over night. Now that I have some sort of handle on it here are my thoughts. The military like a lot of organizations. Structurally resembles a pine tree. Way at the top is the CinC and at the bottom is the lowly private. Only instead of having needles this pine tree has little birds covering it. All the birds are eating and all the birds are crapping. Crap flows down, not up. The little bird at the top craps on all the other birds but none of the other birds can crap on him. The lower in the tree the bird is, the more he's crapped on. It is what's known as an immutable fact. Sometimes the crap may get a little heavy but, hopefully the birds are smart enough to know that's just how it is so they suck it up and keep their bills closed. QUOTE] Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Right now you’re a little bird, keep your mouth shut except at the mess hall and then eat quick and get out ! Just keep trying to get a little higher on the limb.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 08:57:00", 
        "title": "disrespecting an nco", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI. Heck, you can get the same simply be getting married. Don", 
        "intTime": 20090310, 
        "postID": 71, 
        "quote": "Originally posted by Wolfhound_1968: Vicdude I like that metaphor ! 88 did you ever play school sports ? If so you should have learned a little about being yelled at. Actually my football coach jerked me around and yell a lot louder than my DI.", 
        "reply": " Heck, you can get the same simply be getting married. Don", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:04:00", 
        "title": "disrespecting an nco", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen ! i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "intTime": 20090310, 
        "postID": 72, 
        "quote": "Originally posted by Wolfhound_1968: quote: Originally posted by 88miker: sorry, with my medication sometimes i dont make sense. basically an nco can down talk me or threaten me. example, i call an e5 a jackass and i can be written up or so forth. but if your an e4 nothing happens. its in the title. if i call an e5 a jackass its disrespecting an nco. but if i get called a jackass theres nothing that says disrespecting a specialist. Don't know what you did but it sounds like you need to shut-up and listen !", 
        "reply": " i didnt do anything, all i did was say this is the only motivation people have and thats why they dont go above and beyond. all this nco does is piont out negative stuff. never, hey man good job. all im saying is, treat me with respect and i treat you the same.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:26:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "intTime": 20090310, 
        "postID": 73, 
        "quote": "", 
        "reply": "when i was a corporal and a squad leader i always looked out for people ( im back to spec because my now company doesnt use them ). and i learned just *****ing at people for messing up isnt going to motivate them. i only have one neg. counseling in my career. im not out to get into trouble. i just get annoyed when they play the \" you cant talk to an nco like that\" just like they dont like the \" i cant im on profile\". i show nothing but respect for those above me.. its not like i told him to eff himself. was just making a point the best way i could.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:29:00", 
        "title": "disrespecting an nco", 
        "userID": "88miker"
    }, 
    {
        "content": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "intTime": 20090310, 
        "postID": 74, 
        "quote": "", 
        "reply": "Surprise, the military is just like civilian life. You have effective leaders and you have buttholes. The difference is that during wartime the effective leaders get results while the others hunker down so their own people don't shoot them. Endure the jerk, it ain't forever.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:31:00", 
        "title": "disrespecting an nco", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "intTime": 20090310, 
        "postID": 75, 
        "quote": "", 
        "reply": "With all due respect 88miker... the military doesn't work that way. Your NCO's do not have to show you respect to earn yours, they've earned it by out ranking you. Truth is, you were out of line talking back to your NCO and you should know that by now, especially if you did it in front of everyone else. If you have a problem with one of your NCO's or how he does things, then you take it up through the proper channels, not call him out as you did. You CAN'T talk to an NCO like that just like you wouldn't talk to an officer like that. My Dad told me a story about him trying to do that once, his NCO punched him in the mouth. He learned about chain of command real quick from that.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:50:00", 
        "title": "disrespecting an nco", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "intTime": 20090310, 
        "postID": 76, 
        "quote": "", 
        "reply": "Suck it up. When you're the boss, do things your way. If that hurts your feelings and you want a gentler answer, here goes: you got sh*t on about talking to an NCO the WAY you did. There are ways to address a problem with TACT. If one of my Marines said, \"Sgt. you suck and you're demotivating everybody. I could do a lot better at motivating the shop than you can,\" They can stand the fark by for an arse chewing. But, if they asked to speak with me in my office and then said, \"Sgt. we completed the task you asked us to do, but I think it would make us work a lot harder if you gave us a few motovating words when we do a good job so we know when we're doing right, not just when we screw up,\" I would tell that devil dog I appreciate the concern for shop morale and I would think about incorporating his idea into the way I run the shop. I may or may not actually do what he wants, but I wouldn't write him up for disrespect either. I may even be pyssed that he had the nerve to question me, but in the end at least he will feel better cause he said something. Plus, you can always request mast if you think the Sgt. sucks so bad. This message has been edited. Last edited by: Phadzia, Tue 10 March 2009 10:14 AM", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 09:54:00", 
        "title": "disrespecting an nco", 
        "userID": "Phadzia"
    }, 
    {
        "content": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "intTime": 20090310, 
        "postID": 77, 
        "quote": "", 
        "reply": "Personally, I'de tell him/her to stick it up their ass and take a counseling statement. Any E-5 who dishes it out but cannot take an occassional backtalk needs his/her ass kicked. There's flat out disrespect and questioning authority, then there's questioning what seems wrong. Sounds like you questioned what seems wrong and they are on a power trip. You earn respect by treating people the way you want to be treated, apparently this NCO missed that class in grade school. C.R.", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:17:00", 
        "title": "disrespecting an nco", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination. That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090310, 
        "postID": 78, 
        "quote": "Originally posted by mcgreer: It's Article 91 of the UCMJ. That's called Insubordination.", 
        "reply": " That's when a subordinate calls an NCO a name, but what is it when an NCO calls a subordinate a name? Would that be a Outsubordination? Or would it be an Inhyperordination? Maybe a... Man just buck up and do what your told. I can't spend all my gray matter on this... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:48:00", 
        "title": "disrespecting an nco", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "intTime": 20090310, 
        "postID": 79, 
        "quote": "", 
        "reply": "....maybe a wall-to-wall counseling would help his literary skills....", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 10:57:00", 
        "title": "disrespecting an nco", 
        "userID": "VDoP"
    }, 
    {
        "content": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090310, 
        "postID": 80, 
        "quote": "", 
        "reply": "When I was in the Navy, I never disrespected any of the guys I out ranked. They never disrespected me. They would go above and beyond what I asked them to do, notice, I said I asked them, I did not order them. I never had to write anyone up, except on e one occasion, I could have written up an E3 for stealing. He was not on my crew, albeit he was in the same division as me. He was quite taller than me. I noticed the pants he was wearing were real short. I could see where he tried to block the name of the person they belonged to. It was my name, I asked him why he had my pants. He didn't say anything. I told him he would pay me for new pants, or I'd write him up. He gave me the money and said he would give my pants back to me. I told him to keep them, they were no good to me! What surprised me, he was always reading his Bible and always said grace before he had chow! You just never know people, they will surprise you! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_7820024712001", 
        "time": "2009-03-10 11:12:00", 
        "title": "disrespecting an nco", 
        "userID": "Bergy46"
    }
]