[
    {
        "content": "TO: The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States . You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were 0all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain , our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you! You can't find the time to visit the graves of our greatest generation because you don't want to offend the Germans but make time to visit a mosque in Turkey . You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. What's the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members – on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. Some Americans took a 5% or more cut in thier pay to save jobs with Thier employers. You haven't said anything about that. Who authorized that? We surely didn,t! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million – not a bad take. Who authorized that and why haven't you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a second chance to spend two terms destroying my beautiful country. Sincerely, Every real American To those that are ok with what is happening please disregard this letter and learn to live with the fact that in the first 100 days the deficit was tripled over the last year of the Bush Presidency..Not to worry your Grandchildren can pay it......... If by cahance you are elected to a 2nd term I am afraid I won't be allowed to write a letter like this.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "", 
        "reply": "TO: The White House 1600 Pennsylvania Avenue NW Washington , DC 20500 Mr. Obama: I have had it with you and your administration, sir. Your conduct on your recent trip overseas has convinced me that you are not an adequate representative of the United States of America collectively or of me personally. You are so obsessed with appeasing the Europeans and the Muslim world that you have abdicated the responsibilities of the President of the United States of America . You are responsible to the citizens of the United States . You are not responsible to the peoples of any other country on earth. I personally resent that you go around the world apologizing for the United States telling Europeans that we are arrogant and do not care about their status in the world. Sir, what do you think the First World War and the Second World War were 0all about if not the consideration of the peoples of Europe ? Are you brain dead? What do you think the Marshall Plan was all about? Do you not understand or know the history of the 20th century? Where do you get off telling a Muslim country that the United States does not consider itself a Christian country? Have you not read the Declaration of Independence or the Constitution of the United States ? This country was founded on Judeo-Christian ethics and the principles governing this country, at least until you came along, come directly from this heritage. Do you not understand this? Your bowing to the king of Saudi Arabia is an affront to all Americans. Our President does not bow down to anyone, let alone the king of Saudi Arabia. You don't show Great Britain , our best and one of our oldest allies, the respect they deserve yet you bow down to the king of Saudi Arabia . How dare you, sir! How dare you! You can't find the time to visit the graves of our greatest generation because you don't want to offend the Germans but make time to visit a mosque in Turkey . You offended our dead and every veteran when you give the Germans more respect than the people who saved the German people from themselves. What's the matter with you? I am convinced that you and the members of your administration have the historical and intellectual depth of a mud puddle and should be ashamed of yourselves, all of you. You are so self-righteously offended by the big bankers and the American automobile manufacturers yet do nothing about the real thieves in this situation, Mr. Dodd, Mr. Frank, Franklin Raines, Jamie Gorelic, the Fannie Mae bonuses, and the Freddie Mac bonuses. What do you intend to do about them? Anything? I seriously doubt it. What about the U.S. House members passing out $9.1 million in bonuses to their staff members – on top of the $2.5 million in automatic pay raises that lawmakers gave themselves? I understand the average House aide got a 17% bonus. Some Americans took a 5% or more cut in thier pay to save jobs with Thier employers. You haven't said anything about that. Who authorized that? We surely didn,t! Executives at Fannie Mae and Freddie Mac will be receiving $210 million in bonuses over an eighteen-month period, that's $45 million more than the AIG bonuses. In fact, Fannie and Freddie executives have already been awarded $51 million – not a bad take. Who authorized that and why haven't you expressed your outrage at this group who are largely responsible for the economic mess we have right now. I resent that you take me and my fellow citizens as brain-dead and not caring about what you idiots do. We are watching what you are doing and we are getting increasingly fed up with all of you. I also want you to know that I personally find just about everything you do and say to be offensive to every one of my sensibilities. I promise you that I will work tirelessly to see that you do not get a second chance to spend two terms destroying my beautiful country. Sincerely, Every real American To those that are ok with what is happening please disregard this letter and learn to live with the fact that in the first 100 days the deficit was tripled over the last year of the Bush Presidency..Not to worry your Grandchildren can pay it......... If by cahance you are elected to a 2nd term I am afraid I won't be allowed to write a letter like this.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-13 11:23:00", 
        "title": "A Letter To The White House", 
        "userID": "EOCRon"
    }, 
    {
        "content": "You need to take a chill pill, my friend. Why are you offended when the President bows to a leader in the middle east, a greeting that is considered standard over there? Were you also offended when our President walked hand-in-hand with a Saudi dictator in our own country? His failure to visit American graves in Normandy was in consideration of Germany and Britain. Britain...that country you claim he was slighting. And unfortunately, many Americans are arrogant. I think it's a good thing for us if he builds some good relationships with countries in the middle east, since we could use their help in the GWOT. Or are you arrogant enough to think we can do it all on our own? A President can say what he wants to have done, but he still has to rely on congress to agree, unless the American people foolishly give him carte blanche to do things without congressional approval. We wouldn't ever do that, would we? I didn't see, among all the names of companies or agencies you find fault with, the names of the major oil corporations who have continued to enjoy record profits every single quarter since the war began, while Americans struggle with raising gas prices. I don't like everything the President is doing, but at least he didn't go on vacation for 30 days after being told an attack against our country was imminent. You don't speak for all Americans, and you are in no position to decide what \"offended our dead and every veteran\". I'm a veteran, and you certainly don't speak for me.", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "You need to take a chill pill, my friend. Why are you offended when the President bows to a leader in the middle east, a greeting that is considered standard over there? Were you also offended when our President walked hand-in-hand with a Saudi dictator in our own country? His failure to visit American graves in Normandy was in consideration of Germany and Britain. Britain...that country you claim he was slighting. And unfortunately, many Americans are arrogant. I think it's a good thing for us if he builds some good relationships with countries in the middle east, since we could use their help in the GWOT. Or are you arrogant enough to think we can do it all on our own? A President can say what he wants to have done, but he still has to rely on congress to agree, unless the American people foolishly give him carte blanche to do things without congressional approval. We wouldn't ever do that, would we? I didn't see, among all the names of companies or agencies you find fault with, the names of the major oil corporations who have continued to enjoy record profits every single quarter since the war began, while Americans struggle with raising gas prices. I don't like everything the President is doing, but at least he didn't go on vacation for 30 days after being told an attack against our country was imminent. You don't speak for all Americans, and you are in no position to decide what \"offended our dead and every veteran\". I'm a veteran, and you certainly don't speak for me.", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-13 13:57:00", 
        "title": "A Letter To The White House", 
        "userID": "witko1"
    }, 
    {
        "content": "EOCRon, speaks for me loud and clear!!! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "EOCRon, speaks for me loud and clear!!! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-13 19:50:00", 
        "title": "A Letter To The White House", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I find it amusing that the only counter to attacks on Obama's way of doing things thus far is to directly compare it with Bush's presidency... well since you're into that, in Bush's first 100 days he didn't TRIPLE OUR NATIONAL DEBT. That's a pretty big one. And the old \"evil oil companies\" bit is really old. Those oil companies have repeatedly lobbied for Congress to allow them to drill, safely and environmentally friendly, in our waters so as to bring the price of oil down... Congress said no. Every attempt the oil industry has made to decrease the cost of and decrease our dependency on foreign oil has been swatted down by Congress. That's the Democrat majority Congress, by the way. Obama isn't building good relationships, he's turning the metaphorical back of America towards those that would GLADLY stab a knife into it. Oh and by the way, there is a distinct difference in BOWING to a King (as in getting on knees) and bending at the waste in a salutation. No American outraged by how our newly elected President chooses to run things needs to \"take a chill pill\". Quite the contrary actually. They/we need to rise up and take our country back from those that wish to see it become \"just another country\". I take pride in the fact that in EVERY generation of my family there have been those that were in the military, and I find distinct honor that They fought for not only mine, my son's and my family's freedom, but for the freedoms of ALL AMERICANS. I WILL NOT allow some rich city boy from Chicago that thinks he's entitled to anything he wants spit on the sacrifices of those that gave their service and some their lives to keep this country how our founding fathers established it.", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "", 
        "reply": "I find it amusing that the only counter to attacks on Obama's way of doing things thus far is to directly compare it with Bush's presidency... well since you're into that, in Bush's first 100 days he didn't TRIPLE OUR NATIONAL DEBT. That's a pretty big one. And the old \"evil oil companies\" bit is really old. Those oil companies have repeatedly lobbied for Congress to allow them to drill, safely and environmentally friendly, in our waters so as to bring the price of oil down... Congress said no. Every attempt the oil industry has made to decrease the cost of and decrease our dependency on foreign oil has been swatted down by Congress. That's the Democrat majority Congress, by the way. Obama isn't building good relationships, he's turning the metaphorical back of America towards those that would GLADLY stab a knife into it. Oh and by the way, there is a distinct difference in BOWING to a King (as in getting on knees) and bending at the waste in a salutation. No American outraged by how our newly elected President chooses to run things needs to \"take a chill pill\". Quite the contrary actually. They/we need to rise up and take our country back from those that wish to see it become \"just another country\". I take pride in the fact that in EVERY generation of my family there have been those that were in the military, and I find distinct honor that They fought for not only mine, my son's and my family's freedom, but for the freedoms of ALL AMERICANS. I WILL NOT allow some rich city boy from Chicago that thinks he's entitled to anything he wants spit on the sacrifices of those that gave their service and some their lives to keep this country how our founding fathers established it.", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-15 09:44:00", 
        "title": "A Letter To The White House", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by armywifefigueroa: I find it amusing that the only counter to attacks on Obama's way of doing things thus far is to directly compare it with Bush's presidency... well since you're into that, in Bush's first 100 days he didn't TRIPLE OUR NATIONAL DEBT. That's a pretty big one. And the old \"evil oil companies\" bit is really old. Those oil companies have repeatedly lobbied for Congress to allow them to drill, safely and environmentally friendly, in our waters so as to bring the price of oil down... Congress said no. Every attempt the oil industry has made to decrease the cost of and decrease our dependency on foreign oil has been swatted down by Congress. That's the Democrat majority Congress, by the way. Obama isn't building good relationships, he's turning the metaphorical back of America towards those that would GLADLY stab a knife into it. Oh and by the way, there is a distinct difference in BOWING to a King (as in getting on knees) and bending at the waste in a salutation. No American outraged by how our newly elected President chooses to run things needs to \"take a chill pill\". Quite the contrary actually. They/we need to rise up and take our country back from those that wish to see it become \"just another country\". I take pride in the fact that in EVERY generation of my family there have been those that were in the military, and I find distinct honor that They fought for not only mine, my son's and my family's freedom, but for the freedoms of ALL AMERICANS. I WILL NOT allow some rich city boy from Chicago that thinks he's entitled to anything he wants spit on the sacrifices of those that gave their service and some their lives to keep this country how our founding fathers established it. ============================================ The problem with witco1 is that he didn't read the signature.. Sincerely-Every Real American He is obviously one of the passive Americans That don't care that our great Grand Children will be paying for the money that Obama and the Democratic Congress gave to the Fat-Cats for Bonuses so when they declared Bankrupcy they could live out there lives in Luxury on our Grand Children and Great Granchildren's Backs. There is nothing that can be said to make that sound ok to me. BTW witco1 that king bows to no one he put out his hand and OBAMA bowed before taking it. the King did not bow back,It looked like 1 muslim showing respect to a senior muslim...IMO SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "Originally posted by armywifefigueroa: I find it amusing that the only counter to attacks on Obama's way of doing things thus far is to directly compare it with Bush's presidency... well since you're into that, in Bush's first 100 days he didn't TRIPLE OUR NATIONAL DEBT. That's a pretty big one. And the old \"evil oil companies\" bit is really old. Those oil companies have repeatedly lobbied for Congress to allow them to drill, safely and environmentally friendly, in our waters so as to bring the price of oil down... Congress said no. Every attempt the oil industry has made to decrease the cost of and decrease our dependency on foreign oil has been swatted down by Congress. That's the Democrat majority Congress, by the way. Obama isn't building good relationships, he's turning the metaphorical back of America towards those that would GLADLY stab a knife into it. Oh and by the way, there is a distinct difference in BOWING to a King (as in getting on knees) and bending at the waste in a salutation. No American outraged by how our newly elected President chooses to run things needs to \"take a chill pill\". Quite the contrary actually. They/we need to rise up and take our country back from those that wish to see it become \"just another country\". I take pride in the fact that in EVERY generation of my family there have been those that were in the military, and I find distinct honor that They fought for not only mine, my son's and my family's freedom, but for the freedoms of ALL AMERICANS. I WILL NOT allow some rich city boy from Chicago that thinks he's entitled to anything he wants spit on the sacrifices of those that gave their service and some their lives to keep this country how our founding fathers established it.", 
        "reply": " ============================================ The problem with witco1 is that he didn't read the signature.. Sincerely-Every Real American He is obviously one of the passive Americans That don't care that our great Grand Children will be paying for the money that Obama and the Democratic Congress gave to the Fat-Cats for Bonuses so when they declared Bankrupcy they could live out there lives in Luxury on our Grand Children and Great Granchildren's Backs. There is nothing that can be said to make that sound ok to me. BTW witco1 that king bows to no one he put out his hand and OBAMA bowed before taking it. the King did not bow back,It looked like 1 muslim showing respect to a senior muslim...IMO SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-15 10:50:00", 
        "title": "A Letter To The White House", 
        "userID": "EOCRon"
    }, 
    {
        "content": "EOCRon, I don't think it's necessary to suggest I'm not a \"real American\" because I don't agree with you. Of course I don't want my grandchildren to be burdened with a huge debt. Nor do I want them to run in a panic every time someone drops and envelope in a parking lot. I don't want them to see some of our most beautiful landscape marred with oil rigs and oil spills. Safe and environmentally friendly? You trust them to do that? The sad part is, we won't know if it was a mistake to allow more drilling until a spill occurs. Are we really willing to risk that, rather than to push for alternatives? I'd rather see scientists and oil company executives come up with a viable alternative to oil-based fuel. I suspect they have already done so. But they'll wait until gas is $10.00 a gallon, then they'll announce this wonderful alternative that we can have for only $5.00 a gallon. Americans will cheer and praise the new product and will never ask how much it costs the oil companies to produce. And they'll continue to reap the profits, every single quarter. Do you really think the CEOs of these big oil companies care what will happen with future generations? Think of what they could do RIGHT NOW to help all of us. How much would it cut into their profits if starting tomorrow, they declared ALL GAS prices would be lowered by $1.00? Gas here, right now, is $2.29 a gallon. Wouldn't it be nice to wake up and find it was only $1.29 a gallon, because the oil companies, in the interest of helping all of us, lowered it by $1.00? Americans use about $142.5 billion gallons of gas a year. It's been reported that Exxon Mobile alone made $75,000 a minute in 2008. But let’s open up more areas to drilling, risk more oil spills, so they can make even more money. And your focus is on Barack Obama? However, if its congress stifling the oil companies quest for even greater profits, how is that Obama's fault? And why is Obama being characterized as a \"rich city boy\"? He may have money now, but he didn't grow up with it as so many other politicians, on both sides of the aisle have. You're making a big deal of the fact that Obama bowed to the king. In your opinion, it was 1 muslim showing respect to a senior muslim. Never mind that Obama is not a muslim. We wouldn't want any facts to get in the way of perceptions! The U.S. government has a long history of supporting dictators and bloody guerilla forces, if we felt it was in our best interests to do so at the time. Did you protest when Rumsfeld shook hands with Saddham Hussein in 1983 and promised him military equipment? I'll bet you really burned up the airwaves with your anger when Reagan opposed any congressional sanction of the attack on Halabja! Did you protest our support of Noriega or the Samozas? Somehow, a bow to the Saudi king pales in comparison to some of the past actions of our government.", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "", 
        "reply": "EOCRon, I don't think it's necessary to suggest I'm not a \"real American\" because I don't agree with you. Of course I don't want my grandchildren to be burdened with a huge debt. Nor do I want them to run in a panic every time someone drops and envelope in a parking lot. I don't want them to see some of our most beautiful landscape marred with oil rigs and oil spills. Safe and environmentally friendly? You trust them to do that? The sad part is, we won't know if it was a mistake to allow more drilling until a spill occurs. Are we really willing to risk that, rather than to push for alternatives? I'd rather see scientists and oil company executives come up with a viable alternative to oil-based fuel. I suspect they have already done so. But they'll wait until gas is $10.00 a gallon, then they'll announce this wonderful alternative that we can have for only $5.00 a gallon. Americans will cheer and praise the new product and will never ask how much it costs the oil companies to produce. And they'll continue to reap the profits, every single quarter. Do you really think the CEOs of these big oil companies care what will happen with future generations? Think of what they could do RIGHT NOW to help all of us. How much would it cut into their profits if starting tomorrow, they declared ALL GAS prices would be lowered by $1.00? Gas here, right now, is $2.29 a gallon. Wouldn't it be nice to wake up and find it was only $1.29 a gallon, because the oil companies, in the interest of helping all of us, lowered it by $1.00? Americans use about $142.5 billion gallons of gas a year. It's been reported that Exxon Mobile alone made $75,000 a minute in 2008. But let’s open up more areas to drilling, risk more oil spills, so they can make even more money. And your focus is on Barack Obama? However, if its congress stifling the oil companies quest for even greater profits, how is that Obama's fault? And why is Obama being characterized as a \"rich city boy\"? He may have money now, but he didn't grow up with it as so many other politicians, on both sides of the aisle have. You're making a big deal of the fact that Obama bowed to the king. In your opinion, it was 1 muslim showing respect to a senior muslim. Never mind that Obama is not a muslim. We wouldn't want any facts to get in the way of perceptions! The U.S. government has a long history of supporting dictators and bloody guerilla forces, if we felt it was in our best interests to do so at the time. Did you protest when Rumsfeld shook hands with Saddham Hussein in 1983 and promised him military equipment? I'll bet you really burned up the airwaves with your anger when Reagan opposed any congressional sanction of the attack on Halabja! Did you protest our support of Noriega or the Samozas? Somehow, a bow to the Saudi king pales in comparison to some of the past actions of our government.", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-15 14:36:00", 
        "title": "A Letter To The White House", 
        "userID": "witko1"
    }, 
    {
        "content": "OK, guys and gals, some of the posts are getting close to stepping over the edge of going from legitimate post against post to member against member. It would be well if all could remember personal attacks, name calling and challenging (calling out) another is against the rules. This is not an “official warning” It is just a little “reminder.” You might even call it a “Love Note.” What is it the boxing referees say, “Now shake hands and come out fighting.” Thanks for listening. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "", 
        "reply": "OK, guys and gals, some of the posts are getting close to stepping over the edge of going from legitimate post against post to member against member. It would be well if all could remember personal attacks, name calling and challenging (calling out) another is against the rules. This is not an “official warning” It is just a little “reminder.” You might even call it a “Love Note.” What is it the boxing referees say, “Now shake hands and come out fighting.” Thanks for listening. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-15 15:20:00", 
        "title": "A Letter To The White House", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Actually from my perspective, this guy can stick his butt in the air for some homeless bum on the street, if he wants to. After all, it underlines just what he and his wife have said they think of this country, and the office he holds. T", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "", 
        "reply": "Actually from my perspective, this guy can stick his butt in the air for some homeless bum on the street, if he wants to. After all, it underlines just what he and his wife have said they think of this country, and the office he holds. T", 
        "threadID": "5291911282_1930022322001", 
        "time": "2009-05-15 15:57:00", 
        "title": "A Letter To The White House", 
        "userID": "tawodi"
    }
]