[
    {
        "content": "The quetion is, after two consecutive apft failures, you can be barred from reenlistment, or possible separated from service, is it possible to reduce someone in rank for apft failure, what regs support this if it is.", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "", 
        "reply": "The quetion is, after two consecutive apft failures, you can be barred from reenlistment, or possible separated from service, is it possible to reduce someone in rank for apft failure, what regs support this if it is.", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 01:00:00", 
        "title": "apft demotion", 
        "userID": "15955936"
    }, 
    {
        "content": "Anything can happen. Yes, after 2 failures, you can be barred. Just wait till the Army starts implementing peacetime, or worse yet, draw down rules. I suggest you move your post to the Army forum to get better feedback.", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "Anything can happen. Yes, after 2 failures, you can be barred. Just wait till the Army starts implementing peacetime, or worse yet, draw down rules. I suggest you move your post to the Army forum to get better feedback.", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 01:49:00", 
        "title": "apft demotion", 
        "userID": "azmax64"
    }, 
    {
        "content": "I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 02:27:00", 
        "title": "apft demotion", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. I put in 13 years and never saw anyone lose rank. Saw plenty get Barred and some booted out.", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "Originally posted by jrnh5150: I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums.", 
        "reply": " I put in 13 years and never saw anyone lose rank. Saw plenty get Barred and some booted out.", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 04:09:00", 
        "title": "apft demotion", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by azmax64: quote: Originally posted by jrnh5150: I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. I put in 13 years and never saw anyone lose rank. Saw plenty get Barred and some booted out. Times change, bodies are needed. I've personally witnessed this latest \"Fad\" in my Squadron. I've seen over ten soldiers lose rank over PT. It is not \"legal\" per se, per the regs. You are supposed to be processed out. Instead you are charged with failure to perform, and demoted under those auspices. No one really raises a ruckus. In the old days they'd just boot you out. Alot of troops have tried failing PT tests purposefully in order to get out, and out of deploying. So now they just reduce you.", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "Originally posted by azmax64: quote: Originally posted by jrnh5150: I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. I put in 13 years and never saw anyone lose rank. Saw plenty get Barred and some booted out.", 
        "reply": " Times change, bodies are needed. I've personally witnessed this latest \"Fad\" in my Squadron. I've seen over ten soldiers lose rank over PT. It is not \"legal\" per se, per the regs. You are supposed to be processed out. Instead you are charged with failure to perform, and demoted under those auspices. No one really raises a ruckus. In the old days they'd just boot you out. Alot of troops have tried failing PT tests purposefully in order to get out, and out of deploying. So now they just reduce you.", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 04:16:00", 
        "title": "apft demotion", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: Times change, bodies are needed. I've personally witnessed this latest \"Fad\" in my Squadron. I've seen over ten soldiers lose rank over PT. It is not \"legal\" per se, per the regs. You are supposed to be processed out. Instead you are charged with failure to perform, and demoted under those auspices. No one really raises a ruckus. In the old days they'd just boot you out. Alot of troops have tried failing PT tests purposefully in order to get out, and out of deploying. So now they just reduce you. Cool. If nothing else will motivate someone to get their act together, a hit to the paycheck will do it. I actually like that idea! Wish they had that in my time. Seen too many duds wasting the Army's time and money.", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Originally posted by M1Lase_n_Blaze: Times change, bodies are needed. I've personally witnessed this latest \"Fad\" in my Squadron. I've seen over ten soldiers lose rank over PT. It is not \"legal\" per se, per the regs. You are supposed to be processed out. Instead you are charged with failure to perform, and demoted under those auspices. No one really raises a ruckus. In the old days they'd just boot you out. Alot of troops have tried failing PT tests purposefully in order to get out, and out of deploying. So now they just reduce you.", 
        "reply": " Cool. If nothing else will motivate someone to get their act together, a hit to the paycheck will do it. I actually like that idea! Wish they had that in my time. Seen too many duds wasting the Army's time and money.", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 04:26:00", 
        "title": "apft demotion", 
        "userID": "azmax64"
    }, 
    {
        "content": "I would call and make an appoint with JAG. Every thing else we tell you is based on opinion and experence. JAG can speak from the manual. We wish you the best and please keep us posted. OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "", 
        "reply": "I would call and make an appoint with JAG. Every thing else we tell you is based on opinion and experence. JAG can speak from the manual. We wish you the best and please keep us posted. OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 07:57:00", 
        "title": "apft demotion", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Bump! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "", 
        "reply": "Bump! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 11:56:00", 
        "title": "apft demotion", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by M1Lase_n_Blaze: quote: Originally posted by azmax64: quote: Originally posted by jrnh5150: I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. I put in 13 years and never saw anyone lose rank. Saw plenty get Barred and some booted out. Times change, bodies are needed. I've personally witnessed this latest \"Fad\" in my Squadron. I've seen over ten soldiers lose rank over PT. It is not \"legal\" per se, per the regs. You are supposed to be processed out. Instead you are charged with failure to perform, and demoted under those auspices. No one really raises a ruckus. In the old days they'd just boot you out. Alot of troops have tried failing PT tests purposefully in order to get out, and out of deploying. So now they just reduce you. The reg doesn't allow that legally. Could give the demotee leverage over the Co - - http://www.army.mil/USAPA/epubs/pdf/r600_8_2.pdf I see the APFT only includes pushups, situps, and a 2 mile run now (No more 60 yard lowcrawl, 150 yard man carry, 20+ pullups and 72 overhead ladder bars). So what is so hard about that? Wandering and Wondering", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "Originally posted by M1Lase_n_Blaze: quote: Originally posted by azmax64: quote: Originally posted by jrnh5150: I haven't found anything about being demoted. I'm not saying you can't be, I'm just saying I haven't found anything. I'm sure if you had stripes pinned before going to whatever school (BNOC, ANOC, etc.....) they could take your stripes away. Other than that I have no idea. Like max said, try posting in the Army forums. I put in 13 years and never saw anyone lose rank. Saw plenty get Barred and some booted out. Times change, bodies are needed. I've personally witnessed this latest \"Fad\" in my Squadron. I've seen over ten soldiers lose rank over PT. It is not \"legal\" per se, per the regs. You are supposed to be processed out. Instead you are charged with failure to perform, and demoted under those auspices. No one really raises a ruckus. In the old days they'd just boot you out. Alot of troops have tried failing PT tests purposefully in order to get out, and out of deploying. So now they just reduce you.", 
        "reply": " The reg doesn't allow that legally. Could give the demotee leverage over the Co - - http://www.army.mil/USAPA/epubs/pdf/r600_8_2.pdf I see the APFT only includes pushups, situps, and a 2 mile run now (No more 60 yard lowcrawl, 150 yard man carry, 20+ pullups and 72 overhead ladder bars). So what is so hard about that? Wandering and Wondering", 
        "threadID": "5291911282_8670038812001", 
        "time": "2009-03-25 18:58:00", 
        "title": "apft demotion", 
        "userID": "greywolfghost"
    }
]