[
    {
        "content": "Hey, can you help me? I've started a blog, hot links to unapproved sites are not authorized on blogger.com. It's a purpose-driven, moderated blog where active duty or veterans can present stories of being injured/ill in the service and being abused or neglected by the military medical or by their supervisors, leading to long-term or permanent harm or disability. Also for suggestions of possible solutions to this common problem. Not a site for complaining, it's intended to raise awareness - hopefully, eventually - by senior military, who are the only ones who can bring about change. Now, I don't know where to put this blog. Milblogging.com insists on 2-3 months history of steady activity before they will take it. Could it be one of the threads/forums/whatever the right term is on this site? I looked through the list of topics and it didn't seem to fit anywhere. Could you lend a shipmate a hand? Thanks! P.S. The threads seem to be awfully repetitive, quotes and requotes. Hard for me to moderate. Could some general note be put, hey, check out this blog, it's a topic affecting all of us? (And not highly controversial, like some here.) This message has been edited. Last edited by: OldArmyLove, Sat 30 May 2009 05:54 PM", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "", 
        "reply": "Hey, can you help me? I've started a blog, hot links to unapproved sites are not authorized on blogger.com. It's a purpose-driven, moderated blog where active duty or veterans can present stories of being injured/ill in the service and being abused or neglected by the military medical or by their supervisors, leading to long-term or permanent harm or disability. Also for suggestions of possible solutions to this common problem. Not a site for complaining, it's intended to raise awareness - hopefully, eventually - by senior military, who are the only ones who can bring about change. Now, I don't know where to put this blog. Milblogging.com insists on 2-3 months history of steady activity before they will take it. Could it be one of the threads/forums/whatever the right term is on this site? I looked through the list of topics and it didn't seem to fit anywhere. Could you lend a shipmate a hand? Thanks! P.S. The threads seem to be awfully repetitive, quotes and requotes. Hard for me to moderate. Could some general note be put, hey, check out this blog, it's a topic affecting all of us? (And not highly controversial, like some here.) This message has been edited. Last edited by: OldArmyLove, Sat 30 May 2009 05:54 PM", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 17:42:00", 
        "title": "military medical abuse stories", 
        "userID": "beringsea"
    }, 
    {
        "content": "I put a comma too close to the URL, it goes to MyFreeze. (Avoid this virus like the plague.) The URL is hot links to unapproved sites are not authorized You need to read the Terms of Service at the bottom of this page and follow the instruction please do not post other such links This message has been edited. Last edited by: OldArmyLove, Sat 30 May 2009 05:56 PM", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "I put a comma too close to the URL, it goes to MyFreeze. (Avoid this virus like the plague.) The URL is hot links to unapproved sites are not authorized You need to read the Terms of Service at the bottom of this page and follow the instruction please do not post other such links This message has been edited. Last edited by: OldArmyLove, Sat 30 May 2009 05:56 PM", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 17:46:00", 
        "title": "military medical abuse stories", 
        "userID": "beringsea"
    }, 
    {
        "content": "I do believe you are going to be visited by the sheriff...... soon PS. best change that 'hot link', they're not allowed. Read the TOS One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "", 
        "reply": "I do believe you are going to be visited by the sheriff...... soon PS. best change that 'hot link', they're not allowed. Read the TOS One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 17:46:00", 
        "title": "military medical abuse stories", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Okay, I'm sorry about the hot link, I told you I'm new to all this. What do you mean by the sheriff remark? Are you joking, in which case it's not jokes I asked for, but help. Or are you saying the webmaster is going to kick me off the site? or what? This is a genuine military issue and ongoing. I lost partial use of my own hand and it was my best friend who now has two kids instead of three. How about some genuine advice and suggestions? quote: Originally posted by m551sheridan: I do believe you are going to be visited by the sheriff...... soon PS. best change that 'hot link', they're not allowed. Read the TOS", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "Originally posted by m551sheridan: I do believe you are going to be visited by the sheriff...... soon PS. best change that 'hot link', they're not allowed. Read the TOS", 
        "reply": "Okay, I'm sorry about the hot link, I told you I'm new to all this. What do you mean by the sheriff remark? Are you joking, in which case it's not jokes I asked for, but help. Or are you saying the webmaster is going to kick me off the site? or what? This is a genuine military issue and ongoing. I lost partial use of my own hand and it was my best friend who now has two kids instead of three. How about some genuine advice and suggestions? ", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 18:47:00", 
        "title": "military medical abuse stories", 
        "userID": "beringsea"
    }, 
    {
        "content": "quote: Originally posted by beringsea: Okay, I'm sorry about the hot link, I told you I'm new to all this. What do you mean by the sheriff remark? Are you joking, in which case it's not jokes I asked for, but help. Or are you saying the webmaster is going to kick me off the site? or what? This is a genuine military issue and ongoing. I lost partial use of my own hand and it was my best friend who now has two kids instead of three. How about some genuine advice and suggestions? quote: Originally posted by m551sheridan: I do believe you are going to be visited by the sheriff...... soon PS. best change that 'hot link', they're not allowed. Read the TOS calm down pard, my reference to the sheriff is one of the mods will usually visit and tell you about the hot links and delete it. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "Originally posted by beringsea: Okay, I'm sorry about the hot link, I told you I'm new to all this. What do you mean by the sheriff remark? Are you joking, in which case it's not jokes I asked for, but help. Or are you saying the webmaster is going to kick me off the site? or what? This is a genuine military issue and ongoing. I lost partial use of my own hand and it was my best friend who now has two kids instead of three. How about some genuine advice and suggestions? quote: Originally posted by m551sheridan: I do believe you are going to be visited by the sheriff...... soon PS. best change that 'hot link', they're not allowed. Read the TOS", 
        "reply": " calm down pard, my reference to the sheriff is one of the mods will usually visit and tell you about the hot links and delete it. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 19:09:00", 
        "title": "military medical abuse stories", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Phew! Dang, Tank...I'm glad you said the Sheriff is one of the Mods! Ya had me scarit, I thought they was comin fer mah still! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "", 
        "reply": "Phew! Dang, Tank...I'm glad you said the Sheriff is one of the Mods! Ya had me scarit, I thought they was comin fer mah still! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 19:19:00", 
        "title": "military medical abuse stories", 
        "userID": "Bergy46"
    }, 
    {
        "content": "No your not going to be kicked off the boards, bearing. Break TOS multiple times-or once in grand fashion will. I don't recommend it though, once you get banned you can't really come back. You may want to repost this in the Sound OFF Forums. Welcome to the Forums!", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "", 
        "reply": "No your not going to be kicked off the boards, bearing. Break TOS multiple times-or once in grand fashion will. I don't recommend it though, once you get banned you can't really come back. You may want to repost this in the Sound OFF Forums. Welcome to the Forums!", 
        "threadID": "5291911282_8340096422001", 
        "time": "2009-05-30 19:20:00", 
        "title": "military medical abuse stories", 
        "userID": "pipedreamsandbabies"
    }
]