[
    {
        "content": "Ok, so I got bored today, and am getting ready for a road trip out to Texas to visit some family. That means a few things, namely I won't be getting to screw around on my games, and I will likely have plenty of time on the net since there isn't much to do on vacation when you are lazy. That being the case, I feel the need to have a good discussion/debate. The subject, secession of states from the union, is it legal, when is is justifiable, and lastly, based on what evidence. I intend to refrain from putting my own views out there for the time being as I got some serious eye strain going at the moment from excessiove trolling. Also, I'll ask that we keep this civil, I want a debate/discussion, not a flame war or a locked thread. Question: Does a state, part of a state, or group of people have the right to leave a nation, state, or part of a state? Discuss with evidence. Choices: Yes, the right of secession is a fundamental right of free people Yes, but with certain limits Unsure No, a people, region, or state never have the right to leave a state or nation of which they are a part   “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ok, so I got bored today, and am getting ready for a road trip out to Texas to visit some family. That means a few things, namely I won't be getting to screw around on my games, and I will likely have plenty of time on the net since there isn't much to do on vacation when you are lazy. That being the case, I feel the need to have a good discussion/debate. The subject, secession of states from the union, is it legal, when is is justifiable, and lastly, based on what evidence. I intend to refrain from putting my own views out there for the time being as I got some serious eye strain going at the moment from excessiove trolling. Also, I'll ask that we keep this civil, I want a debate/discussion, not a flame war or a locked thread. Question: Does a state, part of a state, or group of people have the right to leave a nation, state, or part of a state? Discuss with evidence. Choices: Yes, the right of secession is a fundamental right of free people Yes, but with certain limits Unsure No, a people, region, or state never have the right to leave a state or nation of which they are a part   “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 16:41:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Okay, here is the conundrum, the Constitution does not even consider the possibility, so it is a \"loophole.\" But the Constitution is the Law of the Land, since Ratification. The President of the United States is the Chief of all Police - Military and Civil - of this Nation, and he has no choice but to enforce the Law, or be treasonous to his Oath, his Office, and the Constitution itself. That is the view Abraham Lincoln, a lawyer by training, took. The Constitution doesn't even give Congress the option to debate or vote for a State to secede. So, a state can declare for secession, but the President MUST consider that an act of Grand Larceny against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... The only way that secession could be legal and not involve Civil War would be for a Constitutional Amendment to first be passed and ratified allowing secession without War. The steps would have to be civil and basically follow in reverse the application for statehood, with no prior hostilities.... Some states, prior to the Civil War, on the advice of Thomas Jefferson, a continual foe of the Constitution and the Federal Government, passed \"Nullification Acts\" against various Federal Laws, thus saying those Laws do not apply within the boundaries of the \"nullifying\" state. The Constitution, and all Laws passed under it, defines the Law of the Land, and cannot be nullified. Only the Supreme Court can determine a Law as \"unconstitutional, null, and void,\" or the People and Congress can vote out a Law. But no state can pick and chose or \"nullify\" a law. Thus, an \"Act of Nullification\" by a state is actually an illegal attempt to partially or wholly secede - an act of theft of Federal property and or treasure - a declaration of war, even if accidental... If you study closely the events leading to the Civil War, right from the Ratification of the Constitution 1789 (and all the problems brought in by not outlawing slavery then) right up until shots are fire at Ft Sumter in 1861, you will see all of the above being discussed, done, and causal to the deaths of some 650,000 souls - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "Okay, here is the conundrum, the Constitution does not even consider the possibility, so it is a \"loophole.\" But the Constitution is the Law of the Land, since Ratification. The President of the United States is the Chief of all Police - Military and Civil - of this Nation, and he has no choice but to enforce the Law, or be treasonous to his Oath, his Office, and the Constitution itself. That is the view Abraham Lincoln, a lawyer by training, took. The Constitution doesn't even give Congress the option to debate or vote for a State to secede. So, a state can declare for secession, but the President MUST consider that an act of Grand Larceny against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... The only way that secession could be legal and not involve Civil War would be for a Constitutional Amendment to first be passed and ratified allowing secession without War. The steps would have to be civil and basically follow in reverse the application for statehood, with no prior hostilities.... Some states, prior to the Civil War, on the advice of Thomas Jefferson, a continual foe of the Constitution and the Federal Government, passed \"Nullification Acts\" against various Federal Laws, thus saying those Laws do not apply within the boundaries of the \"nullifying\" state. The Constitution, and all Laws passed under it, defines the Law of the Land, and cannot be nullified. Only the Supreme Court can determine a Law as \"unconstitutional, null, and void,\" or the People and Congress can vote out a Law. But no state can pick and chose or \"nullify\" a law. Thus, an \"Act of Nullification\" by a state is actually an illegal attempt to partially or wholly secede - an act of theft of Federal property and or treasure - a declaration of war, even if accidental... If you study closely the events leading to the Civil War, right from the Ratification of the Constitution 1789 (and all the problems brought in by not outlawing slavery then) right up until shots are fire at Ft Sumter in 1861, you will see all of the above being discussed, done, and causal to the deaths of some 650,000 souls - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:18:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The issue of secession was pretty well settled by the Civil War. Of course people have the right to emigrate, but it doesn't mean they have the right to take land (and/or people who don't want to secede) with them.", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "", 
        "reply": "The issue of secession was pretty well settled by the Civil War. Of course people have the right to emigrate, but it doesn't mean they have the right to take land (and/or people who don't want to secede) with them.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:21:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "liberal90"
    }, 
    {
        "content": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. I would argue that based on the Declaration of Independance, an individual state, and by association, parts of a state(West Virginia), and the people therin have the option to leave a state or union and take their possesions with them, including the land which they own. Secondly I would argue that the Federal Government has NO right to utilize force of arms to prevent a state from leaving the union. President Buchanan supported this view as well. Thirdly, I argue that the Constitution is in place for the purpose of limiting the Federal government, and that document supports my claim in the 10th amendment, which states, \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" As the Constitution exist to limit the government at the federal level by defining the powers and authority allowed to it, and the document does not grant the Federal government over the matter of secession, I believe that power rest with the states and the people of the states. Additionally, amendment 9 makes it clear that the Constitution not mentioning a right does not equate to it not being a right. \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. 2. Congress shall have power to enforce this article by appropriate legislation.\" Now, based on these citations, I suggest that the right of a people, or state to leave the union, in full possesion of all their property exist. In regards to the state aquiring military material, bases, and other government property being grand larceny, I would suggest that a form of restitution would be appropriate, or else the state could require the removal of such federal property from their borders, though how to move a fort may be another matter. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "", 
        "reply": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. I would argue that based on the Declaration of Independance, an individual state, and by association, parts of a state(West Virginia), and the people therin have the option to leave a state or union and take their possesions with them, including the land which they own. Secondly I would argue that the Federal Government has NO right to utilize force of arms to prevent a state from leaving the union. President Buchanan supported this view as well. Thirdly, I argue that the Constitution is in place for the purpose of limiting the Federal government, and that document supports my claim in the 10th amendment, which states, \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" As the Constitution exist to limit the government at the federal level by defining the powers and authority allowed to it, and the document does not grant the Federal government over the matter of secession, I believe that power rest with the states and the people of the states. Additionally, amendment 9 makes it clear that the Constitution not mentioning a right does not equate to it not being a right. \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. 2. Congress shall have power to enforce this article by appropriate legislation.\" Now, based on these citations, I suggest that the right of a people, or state to leave the union, in full possesion of all their property exist. In regards to the state aquiring military material, bases, and other government property being grand larceny, I would suggest that a form of restitution would be appropriate, or else the state could require the removal of such federal property from their borders, though how to move a fort may be another matter. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:46:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. Nope - The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out. Furthermore, by sending the Declaration of Independence, the \"United States of America\" (a phrase coined therein) declared war...the risk that any seceding or rebelling group takes, thus breaking with ANY and ALL Laws of England and its Empire, at risk of losing said War, being over-run by a hostile force, and potentially ALL being put to the sword! America won, England lost - so English domination and law was dissolved. Of course it took the War of 1812, and the Civil War (England backed the South until 1863) to get the separation from England, and the total end of English Ownership/Jurisdiction recognized and resolved - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government.", 
        "reply": " Nope - The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out. Furthermore, by sending the Declaration of Independence, the \"United States of America\" (a phrase coined therein) declared war...the risk that any seceding or rebelling group takes, thus breaking with ANY and ALL Laws of England and its Empire, at risk of losing said War, being over-run by a hostile force, and potentially ALL being put to the sword! America won, England lost - so English domination and law was dissolved. Of course it took the War of 1812, and the Civil War (England backed the South until 1863) to get the separation from England, and the total end of English Ownership/Jurisdiction recognized and resolved - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Quote: Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction - - End Quote;;; So, a state can declare for secession, but the President MUST consider that as an Act of Grand Larceny (WAR) against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. The original 13 states gave that up when they ratified, and all ensuing states, which were first Federal Territories, as per the Land Ordinance of 1765 and the North West Ordinance 0f 1767 (Created under the old Articles of Confederation, but considered legal under the new Constitution), became States already owned by Federal annexation - all the way to Hawaii and Alaska - - You are free but the Ground under you isn't. The deed to your ground is just like the dollar in your pocket. It may be legal and have value, which you claim - but it is backed by the Federal Government and can be called in at any time by portion (Taxes) or all together (Eminent Domain). If you refuse payment wholly or in part, who will show up in force?? You and I are but renters of Federal Territory - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "", 
        "reply": "Quote: Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction - - End Quote;;; So, a state can declare for secession, but the President MUST consider that as an Act of Grand Larceny (WAR) against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. The original 13 states gave that up when they ratified, and all ensuing states, which were first Federal Territories, as per the Land Ordinance of 1765 and the North West Ordinance 0f 1767 (Created under the old Articles of Confederation, but considered legal under the new Constitution), became States already owned by Federal annexation - all the way to Hawaii and Alaska - - You are free but the Ground under you isn't. The deed to your ground is just like the dollar in your pocket. It may be legal and have value, which you claim - but it is backed by the Federal Government and can be called in at any time by portion (Taxes) or all together (Eminent Domain). If you refuse payment wholly or in part, who will show up in force?? You and I are but renters of Federal Territory - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:23:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "", 
        "reply": "In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:37:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. Oh my. You see, we have a Federal Government, not a national government, there is a bit of differance between them. You see, the people compose the states, and the states created the Federal government, not the other way around. Indeed a stronger case can be made for state ownership of lands than federal ownership. Noone is involuntarily included in the Union? Read US Public Law 103-150, it acknowledges the forced subjugation of Hawai'i. Then the matter of the vote that brought Hawai'i into the Union, in which only US Citizen could vote, provided they had lived there for one year or greater, and denied native Hawai'ians the right to vote unless they had applied for US Citizenship... Now, let us look at the States the left the union in the period of the War Between the States. After the war ended, and the reconstruction period happened, states were required to vote with two basic options, rejoin the union or remain under military occupation. An agreement utilizing coercion is hardly considered binding by any court, and so those states have a legitimate argument to forced servitude as well, being offered the option to remain under military control or join the Union under conditions imposed my the Federal government. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them.", 
        "reply": " Oh my. You see, we have a Federal Government, not a national government, there is a bit of differance between them. You see, the people compose the states, and the states created the Federal government, not the other way around. Indeed a stronger case can be made for state ownership of lands than federal ownership. Noone is involuntarily included in the Union? Read US Public Law 103-150, it acknowledges the forced subjugation of Hawai'i. Then the matter of the vote that brought Hawai'i into the Union, in which only US Citizen could vote, provided they had lived there for one year or greater, and denied native Hawai'ians the right to vote unless they had applied for US Citizenship... Now, let us look at the States the left the union in the period of the War Between the States. After the war ended, and the reconstruction period happened, states were required to vote with two basic options, rejoin the union or remain under military occupation. An agreement utilizing coercion is hardly considered binding by any court, and so those states have a legitimate argument to forced servitude as well, being offered the option to remain under military control or join the Union under conditions imposed my the Federal government. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:53:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. What a king \"takes\" he must hold. George III didn't. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. The Red Coats and Hessians came to arrest them, but got arrested Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Go ahead, declare independence and seced, if you think you have the force to survive. There will be a fight Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. The Contitution says \"We the People\" not \"We the States.\" It therefore a representative governement of humans, not dirt or boundaries - ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. Not when it came to killing people to save the union \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" This is getting boring, so go ahead and secede. Maybe you'll get a statue with a guy on a horse over where they bury you - maybe in your front yard, like Lee got all the Union Dead in his front yard at Arlington. Possession is 9/10th of the Law, and the Federal Government possesses all the military to enforce the Law. Anyone can defy the Law. Bank robbers rob Federal Banks all the time, but the cops can and do shoot them down like dogs with all authority to do so. Defy the Law of the Land and you buy into everything that will come with it. If you have more fire power, up to and including a MERV ICBM carrying ten 20 megaton nuclear warheads, then have at it, because that, potentially, is what Uncle Sam can come back at you with - about 500 of them...not a bunch of sailing boats and a few redcoats with muskets... Secession ain't no joke - and the next Civil War could be Total War... Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "Originally posted by MM2_ss_Lewis: In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. What a king \"takes\" he must hold. George III didn't. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. The Red Coats and Hessians came to arrest them, but got arrested Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Go ahead, declare independence and seced, if you think you have the force to survive. There will be a fight Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. The Contitution says \"We the People\" not \"We the States.\" It therefore a representative governement of humans, not dirt or boundaries - ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. Not when it came to killing people to save the union \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\"", 
        "reply": " This is getting boring, so go ahead and secede. Maybe you'll get a statue with a guy on a horse over where they bury you - maybe in your front yard, like Lee got all the Union Dead in his front yard at Arlington. Possession is 9/10th of the Law, and the Federal Government possesses all the military to enforce the Law. Anyone can defy the Law. Bank robbers rob Federal Banks all the time, but the cops can and do shoot them down like dogs with all authority to do so. Defy the Law of the Land and you buy into everything that will come with it. If you have more fire power, up to and including a MERV ICBM carrying ten 20 megaton nuclear warheads, then have at it, because that, potentially, is what Uncle Sam can come back at you with - about 500 of them...not a bunch of sailing boats and a few redcoats with muskets... Secession ain't no joke - and the next Civil War could be Total War... Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:55:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "", 
        "reply": "The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. It, secession, is not considered, defined, or recognized by the Constitution, just like compulsory taxation was not considered, defined, or recognized under the old Articles of Confederation, therefore; secession cannot happen under the Constitution any more than taxation could happen under the Articles of Confederation. Both were illegal by lack of definition. Once taxation was defined under the Constitution, tariffs and excise taxes could be created, and when the backwoodsmen of Pennsylvania refused to pay the Whiskey Excise Tax, President Washington had every right and obligation under the Constitution to put down the rebellion by force and make people obey the tax - reference the 17000 troops sent to put down the whiskey rebellion. \"secession\" would have to be considered, defined, and ratified into the Constitution via amendment before it could become an action any state could take without defying the Constitution which creates the \"United\" States of America. Nowhere in the Constitution is there allowance for \"United, as long as I'm happy\"... It is a marriage of \"Until (massive) DEATH do U.S. part\"... Empires are always held together more by the ominous and omnivorous than the omnibus - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by MM2_ss_Lewis: The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states.", 
        "reply": " It, secession, is not considered, defined, or recognized by the Constitution, just like compulsory taxation was not considered, defined, or recognized under the old Articles of Confederation, therefore; secession cannot happen under the Constitution any more than taxation could happen under the Articles of Confederation. Both were illegal by lack of definition. Once taxation was defined under the Constitution, tariffs and excise taxes could be created, and when the backwoodsmen of Pennsylvania refused to pay the Whiskey Excise Tax, President Washington had every right and obligation under the Constitution to put down the rebellion by force and make people obey the tax - reference the 17000 troops sent to put down the whiskey rebellion. \"secession\" would have to be considered, defined, and ratified into the Constitution via amendment before it could become an action any state could take without defying the Constitution which creates the \"United\" States of America. Nowhere in the Constitution is there allowance for \"United, as long as I'm happy\"... It is a marriage of \"Until (massive) DEATH do U.S. part\"... Empires are always held together more by the ominous and omnivorous than the omnibus - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:23:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I take it, and correct me if I am wrong please, that you feel that unless an option, right, or power is not listed in the Constitution then it does not have legal standing. If such is the case, then the 9th and 10th amendments would have no purpose at all. The 9th for aluding to unenumerated rights, and the 10th for saying unlisted rights remain the perview of the people and states. Such a concept I cannot agree with, as I believe the founding fathers understood the concept of secession, and that freedom to choose ones' form of government was a right held by the people. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "", 
        "reply": "I take it, and correct me if I am wrong please, that you feel that unless an option, right, or power is not listed in the Constitution then it does not have legal standing. If such is the case, then the 9th and 10th amendments would have no purpose at all. The 9th for aluding to unenumerated rights, and the 10th for saying unlisted rights remain the perview of the people and states. Such a concept I cannot agree with, as I believe the founding fathers understood the concept of secession, and that freedom to choose ones' form of government was a right held by the people. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:28:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "MM2-ss-Lewis:--- I voted Yes on your Poll, and the reason is very simple. It is now called \"West Virginia\". Six counties in North and Western Virginia, voted to secede from The Commonwealth of Virginia... {Interestingly - certain voters were not allowed to vote in those counties... }. Those six counties were allowed to form a \"State'... and sshhaazzaamm! guess what..? They became a Federal \"State\"... presto-magico! But... when South Carolina voted to \"secede\" from the Federal monster headquartered in Washington D.C., they were called \"Rebels\" and then the other States which desired to leave the tentacles of D.C. also seceded, they to were called \"Rebels\"... largely from the two-faced North-Easterners whose parents and grandparents had started riots/rebellion against The Crown in 1774,'75,'76... Since you might have some reading time while on vacation, I'll suggest a title or two that might be informative on this topic. \"A Constitutional view of the War between the States.\" by Alexander Stephens {If memory serves- I think he was the Vice-President of the C.S.A.} isbn # 159442067X \"A defense of Virginia and the South\". by R.L. Dabney {Lt.Gen. T.J.\"Stonewall\" Jackson's Chaplain} isbn # 1594420408", 
        "intTime": 20090313, 
        "postID": 13, 
        "quote": "", 
        "reply": "MM2-ss-Lewis:--- I voted Yes on your Poll, and the reason is very simple. It is now called \"West Virginia\". Six counties in North and Western Virginia, voted to secede from The Commonwealth of Virginia... {Interestingly - certain voters were not allowed to vote in those counties... }. Those six counties were allowed to form a \"State'... and sshhaazzaamm! guess what..? They became a Federal \"State\"... presto-magico! But... when South Carolina voted to \"secede\" from the Federal monster headquartered in Washington D.C., they were called \"Rebels\" and then the other States which desired to leave the tentacles of D.C. also seceded, they to were called \"Rebels\"... largely from the two-faced North-Easterners whose parents and grandparents had started riots/rebellion against The Crown in 1774,'75,'76... Since you might have some reading time while on vacation, I'll suggest a title or two that might be informative on this topic. \"A Constitutional view of the War between the States.\" by Alexander Stephens {If memory serves- I think he was the Vice-President of the C.S.A.} isbn # 159442067X \"A defense of Virginia and the South\". by R.L. Dabney {Lt.Gen. T.J.\"Stonewall\" Jackson's Chaplain} isbn # 1594420408", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 00:43:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "swremwin"
    }, 
    {
        "content": "This is what I Googled U.S. Constitution \"The Right To Secede\" March 4, 1789 The first union of the original 13 colonies was effected by the Articles of Confederation, adopted in 1781. The articles established a confederation of sovereign states in a permanent union. The \"permanence\" lasted only until 1788, when 11 states withdrew from the confederation and ratified the new Constitution, which became effective on March 4, 1789. The founding fathers recognized the defects in the Articles of Confederation, learned from these defects, and scrapped the articles in favor of the \"more perfect union\" found in the Constitution. Nowhere in the Constitution is there any mention of the union of the states being permanent. This was not an oversight by any means. Indeed, when New York, Rhode Island, and Virginia ratified the Constitution, they specifically stated that they reserved the right to resume the governmental powers granted to the United States. Their claim to the right of secession was understood and agreed to by the other ratifiers, including George Washington, who presided over the Constitutional Convention and was also a delegate from Virginia. In his book Life of Webster Sen. Henry Cabot Lodge writes, \"It is safe to say that there was not a man in the country, from Washington and Hamilton to Clinton and Mason, who did not regard the new system as an experiment from which each and every State had a right to peaceably withdraw.\" A textbook used at West Point before the Civil War, A View of the Constitution, written by Judge William Rawle, states, \"The secession of a State depends on the will of the people of such a State.\" Well into the 19th century, the United States was still viewed by many as an experimental confederation from which states could secede just as they had earlier acceded to it. It took a bloody war to prove them wrong. Fascinating Fact: It is significant that no Confederate leader was ever brought to trial for treason. A trial would have brought a verdict on the constitutional legality of secession. Federal prosecutors were satisfied with the verdict that had been decided in battle. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 14, 
        "quote": "", 
        "reply": "This is what I Googled U.S. Constitution \"The Right To Secede\" March 4, 1789 The first union of the original 13 colonies was effected by the Articles of Confederation, adopted in 1781. The articles established a confederation of sovereign states in a permanent union. The \"permanence\" lasted only until 1788, when 11 states withdrew from the confederation and ratified the new Constitution, which became effective on March 4, 1789. The founding fathers recognized the defects in the Articles of Confederation, learned from these defects, and scrapped the articles in favor of the \"more perfect union\" found in the Constitution. Nowhere in the Constitution is there any mention of the union of the states being permanent. This was not an oversight by any means. Indeed, when New York, Rhode Island, and Virginia ratified the Constitution, they specifically stated that they reserved the right to resume the governmental powers granted to the United States. Their claim to the right of secession was understood and agreed to by the other ratifiers, including George Washington, who presided over the Constitutional Convention and was also a delegate from Virginia. In his book Life of Webster Sen. Henry Cabot Lodge writes, \"It is safe to say that there was not a man in the country, from Washington and Hamilton to Clinton and Mason, who did not regard the new system as an experiment from which each and every State had a right to peaceably withdraw.\" A textbook used at West Point before the Civil War, A View of the Constitution, written by Judge William Rawle, states, \"The secession of a State depends on the will of the people of such a State.\" Well into the 19th century, the United States was still viewed by many as an experimental confederation from which states could secede just as they had earlier acceded to it. It took a bloody war to prove them wrong. Fascinating Fact: It is significant that no Confederate leader was ever brought to trial for treason. A trial would have brought a verdict on the constitutional legality of secession. Federal prosecutors were satisfied with the verdict that had been decided in battle. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 07:17:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "", 
        "reply": "I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 13:34:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress. I doubt that is there after the Civil War. All southern states had to re-write their Constitutions to agree with and be subservient to the Constitution in order to be re-admitted into the Union. THE TEXAS CONSTITUTION ARTICLE 1. BILL OF RIGHTS Sec. 1. FREEDOM AND SOVEREIGNTY OF STATE. Texas is a free and independent State, subject only to the Constitution of the United States, and the maintenance of our free institutions and the perpetuity of the Union depend upon the preservation of the right of local self-government, unimpaired to all the States. Wandering and Wondering", 
        "intTime": 20090313, 
        "postID": 16, 
        "quote": "Originally posted by RetiredMarineWife: I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "reply": " I doubt that is there after the Civil War. All southern states had to re-write their Constitutions to agree with and be subservient to the Constitution in order to be re-admitted into the Union. THE TEXAS CONSTITUTION ARTICLE 1. BILL OF RIGHTS Sec. 1. FREEDOM AND SOVEREIGNTY OF STATE. Texas is a free and independent State, subject only to the Constitution of the United States, and the maintenance of our free institutions and the perpetuity of the Union depend upon the preservation of the right of local self-government, unimpaired to all the States. Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 14:11:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG - Incoming message from moi. Have to go to work soon, so I probably can't respond. Check Proverbs 2. Out.", 
        "intTime": 20090314, 
        "postID": 17, 
        "quote": "", 
        "reply": "GWG - Incoming message from moi. Have to go to work soon, so I probably can't respond. Check Proverbs 2. Out.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-14 10:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "swremwin"
    }, 
    {
        "content": "In GENERAL, splinter states are a bad idea, on a global scale. Internationally, splinter states often have an ethnic basis, and in order for a splinter state to guarantee its ethnic majority, they often involuntarily clear out the minorities. This often turns pretty nasty. I'm not a great advocate of self-determination without limits. There's a time for it, but if your government is reasonably representative and not too repressive, you don't really have a leg to stand on as far as breaking off and forming a new nation. Your responsibility in that case it work within the system.", 
        "intTime": 20090316, 
        "postID": 18, 
        "quote": "", 
        "reply": "In GENERAL, splinter states are a bad idea, on a global scale. Internationally, splinter states often have an ethnic basis, and in order for a splinter state to guarantee its ethnic majority, they often involuntarily clear out the minorities. This often turns pretty nasty. I'm not a great advocate of self-determination without limits. There's a time for it, but if your government is reasonably representative and not too repressive, you don't really have a leg to stand on as far as breaking off and forming a new nation. Your responsibility in that case it work within the system.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 08:25:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Ruanne"
    }, 
    {
        "content": "I don't think it such a move would be wise! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090316, 
        "postID": 19, 
        "quote": "", 
        "reply": "I don't think it such a move would be wise! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 08:40:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Bergy46"
    }, 
    {
        "content": "US Constitution Article 1 Section 10 Clause 3 No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. This part of the Constitution states several things which states are explicitly prevented from doing. These are rights that the states voluntarily ceded to the Federal Government. It seems that the Constitution which states ratified does prohibit them from creating alliances with themselves or other countries. Since this is a fundamental right of nation states this de facto prevents states from becoming independent nations.", 
        "intTime": 20090316, 
        "postID": 20, 
        "quote": "", 
        "reply": "US Constitution Article 1 Section 10 Clause 3 No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. This part of the Constitution states several things which states are explicitly prevented from doing. These are rights that the states voluntarily ceded to the Federal Government. It seems that the Constitution which states ratified does prohibit them from creating alliances with themselves or other countries. Since this is a fundamental right of nation states this de facto prevents states from becoming independent nations.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 10:14:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "jyoung77"
    }, 
    {
        "content": "Ok, so I got bored today, and am getting ready for a road trip out to Texas to visit some family. That means a few things, namely I won't be getting to screw around on my games, and I will likely have plenty of time on the net since there isn't much to do on vacation when you are lazy. That being the case, I feel the need to have a good discussion/debate. The subject, secession of states from the union, is it legal, when is is justifiable, and lastly, based on what evidence. I intend to refrain from putting my own views out there for the time being as I got some serious eye strain going at the moment from excessiove trolling. Also, I'll ask that we keep this civil, I want a debate/discussion, not a flame war or a locked thread. Question: Does a state, part of a state, or group of people have the right to leave a nation, state, or part of a state? Discuss with evidence. Choices: Yes, the right of secession is a fundamental right of free people Yes, but with certain limits Unsure No, a people, region, or state never have the right to leave a state or nation of which they are a part   “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 21, 
        "quote": "", 
        "reply": "Ok, so I got bored today, and am getting ready for a road trip out to Texas to visit some family. That means a few things, namely I won't be getting to screw around on my games, and I will likely have plenty of time on the net since there isn't much to do on vacation when you are lazy. That being the case, I feel the need to have a good discussion/debate. The subject, secession of states from the union, is it legal, when is is justifiable, and lastly, based on what evidence. I intend to refrain from putting my own views out there for the time being as I got some serious eye strain going at the moment from excessiove trolling. Also, I'll ask that we keep this civil, I want a debate/discussion, not a flame war or a locked thread. Question: Does a state, part of a state, or group of people have the right to leave a nation, state, or part of a state? Discuss with evidence. Choices: Yes, the right of secession is a fundamental right of free people Yes, but with certain limits Unsure No, a people, region, or state never have the right to leave a state or nation of which they are a part   “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 16:41:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Okay, here is the conundrum, the Constitution does not even consider the possibility, so it is a \"loophole.\" But the Constitution is the Law of the Land, since Ratification. The President of the United States is the Chief of all Police - Military and Civil - of this Nation, and he has no choice but to enforce the Law, or be treasonous to his Oath, his Office, and the Constitution itself. That is the view Abraham Lincoln, a lawyer by training, took. The Constitution doesn't even give Congress the option to debate or vote for a State to secede. So, a state can declare for secession, but the President MUST consider that an act of Grand Larceny against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... The only way that secession could be legal and not involve Civil War would be for a Constitutional Amendment to first be passed and ratified allowing secession without War. The steps would have to be civil and basically follow in reverse the application for statehood, with no prior hostilities.... Some states, prior to the Civil War, on the advice of Thomas Jefferson, a continual foe of the Constitution and the Federal Government, passed \"Nullification Acts\" against various Federal Laws, thus saying those Laws do not apply within the boundaries of the \"nullifying\" state. The Constitution, and all Laws passed under it, defines the Law of the Land, and cannot be nullified. Only the Supreme Court can determine a Law as \"unconstitutional, null, and void,\" or the People and Congress can vote out a Law. But no state can pick and chose or \"nullify\" a law. Thus, an \"Act of Nullification\" by a state is actually an illegal attempt to partially or wholly secede - an act of theft of Federal property and or treasure - a declaration of war, even if accidental... If you study closely the events leading to the Civil War, right from the Ratification of the Constitution 1789 (and all the problems brought in by not outlawing slavery then) right up until shots are fire at Ft Sumter in 1861, you will see all of the above being discussed, done, and causal to the deaths of some 650,000 souls - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 22, 
        "quote": "", 
        "reply": "Okay, here is the conundrum, the Constitution does not even consider the possibility, so it is a \"loophole.\" But the Constitution is the Law of the Land, since Ratification. The President of the United States is the Chief of all Police - Military and Civil - of this Nation, and he has no choice but to enforce the Law, or be treasonous to his Oath, his Office, and the Constitution itself. That is the view Abraham Lincoln, a lawyer by training, took. The Constitution doesn't even give Congress the option to debate or vote for a State to secede. So, a state can declare for secession, but the President MUST consider that an act of Grand Larceny against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... The only way that secession could be legal and not involve Civil War would be for a Constitutional Amendment to first be passed and ratified allowing secession without War. The steps would have to be civil and basically follow in reverse the application for statehood, with no prior hostilities.... Some states, prior to the Civil War, on the advice of Thomas Jefferson, a continual foe of the Constitution and the Federal Government, passed \"Nullification Acts\" against various Federal Laws, thus saying those Laws do not apply within the boundaries of the \"nullifying\" state. The Constitution, and all Laws passed under it, defines the Law of the Land, and cannot be nullified. Only the Supreme Court can determine a Law as \"unconstitutional, null, and void,\" or the People and Congress can vote out a Law. But no state can pick and chose or \"nullify\" a law. Thus, an \"Act of Nullification\" by a state is actually an illegal attempt to partially or wholly secede - an act of theft of Federal property and or treasure - a declaration of war, even if accidental... If you study closely the events leading to the Civil War, right from the Ratification of the Constitution 1789 (and all the problems brought in by not outlawing slavery then) right up until shots are fire at Ft Sumter in 1861, you will see all of the above being discussed, done, and causal to the deaths of some 650,000 souls - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:18:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The issue of secession was pretty well settled by the Civil War. Of course people have the right to emigrate, but it doesn't mean they have the right to take land (and/or people who don't want to secede) with them.", 
        "intTime": 20090312, 
        "postID": 23, 
        "quote": "", 
        "reply": "The issue of secession was pretty well settled by the Civil War. Of course people have the right to emigrate, but it doesn't mean they have the right to take land (and/or people who don't want to secede) with them.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:21:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "liberal90"
    }, 
    {
        "content": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. I would argue that based on the Declaration of Independance, an individual state, and by association, parts of a state(West Virginia), and the people therin have the option to leave a state or union and take their possesions with them, including the land which they own. Secondly I would argue that the Federal Government has NO right to utilize force of arms to prevent a state from leaving the union. President Buchanan supported this view as well. Thirdly, I argue that the Constitution is in place for the purpose of limiting the Federal government, and that document supports my claim in the 10th amendment, which states, \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" As the Constitution exist to limit the government at the federal level by defining the powers and authority allowed to it, and the document does not grant the Federal government over the matter of secession, I believe that power rest with the states and the people of the states. Additionally, amendment 9 makes it clear that the Constitution not mentioning a right does not equate to it not being a right. \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. 2. Congress shall have power to enforce this article by appropriate legislation.\" Now, based on these citations, I suggest that the right of a people, or state to leave the union, in full possesion of all their property exist. In regards to the state aquiring military material, bases, and other government property being grand larceny, I would suggest that a form of restitution would be appropriate, or else the state could require the removal of such federal property from their borders, though how to move a fort may be another matter. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 24, 
        "quote": "", 
        "reply": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. I would argue that based on the Declaration of Independance, an individual state, and by association, parts of a state(West Virginia), and the people therin have the option to leave a state or union and take their possesions with them, including the land which they own. Secondly I would argue that the Federal Government has NO right to utilize force of arms to prevent a state from leaving the union. President Buchanan supported this view as well. Thirdly, I argue that the Constitution is in place for the purpose of limiting the Federal government, and that document supports my claim in the 10th amendment, which states, \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" As the Constitution exist to limit the government at the federal level by defining the powers and authority allowed to it, and the document does not grant the Federal government over the matter of secession, I believe that power rest with the states and the people of the states. Additionally, amendment 9 makes it clear that the Constitution not mentioning a right does not equate to it not being a right. \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. 2. Congress shall have power to enforce this article by appropriate legislation.\" Now, based on these citations, I suggest that the right of a people, or state to leave the union, in full possesion of all their property exist. In regards to the state aquiring military material, bases, and other government property being grand larceny, I would suggest that a form of restitution would be appropriate, or else the state could require the removal of such federal property from their borders, though how to move a fort may be another matter. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:46:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. Nope - The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out. Furthermore, by sending the Declaration of Independence, the \"United States of America\" (a phrase coined therein) declared war...the risk that any seceding or rebelling group takes, thus breaking with ANY and ALL Laws of England and its Empire, at risk of losing said War, being over-run by a hostile force, and potentially ALL being put to the sword! America won, England lost - so English domination and law was dissolved. Of course it took the War of 1812, and the Civil War (England backed the South until 1863) to get the separation from England, and the total end of English Ownership/Jurisdiction recognized and resolved - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 25, 
        "quote": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government.", 
        "reply": " Nope - The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out. Furthermore, by sending the Declaration of Independence, the \"United States of America\" (a phrase coined therein) declared war...the risk that any seceding or rebelling group takes, thus breaking with ANY and ALL Laws of England and its Empire, at risk of losing said War, being over-run by a hostile force, and potentially ALL being put to the sword! America won, England lost - so English domination and law was dissolved. Of course it took the War of 1812, and the Civil War (England backed the South until 1863) to get the separation from England, and the total end of English Ownership/Jurisdiction recognized and resolved - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Quote: Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction - - End Quote;;; So, a state can declare for secession, but the President MUST consider that as an Act of Grand Larceny (WAR) against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. The original 13 states gave that up when they ratified, and all ensuing states, which were first Federal Territories, as per the Land Ordinance of 1765 and the North West Ordinance 0f 1767 (Created under the old Articles of Confederation, but considered legal under the new Constitution), became States already owned by Federal annexation - all the way to Hawaii and Alaska - - You are free but the Ground under you isn't. The deed to your ground is just like the dollar in your pocket. It may be legal and have value, which you claim - but it is backed by the Federal Government and can be called in at any time by portion (Taxes) or all together (Eminent Domain). If you refuse payment wholly or in part, who will show up in force?? You and I are but renters of Federal Territory - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 26, 
        "quote": "", 
        "reply": "Quote: Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction - - End Quote;;; So, a state can declare for secession, but the President MUST consider that as an Act of Grand Larceny (WAR) against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. The original 13 states gave that up when they ratified, and all ensuing states, which were first Federal Territories, as per the Land Ordinance of 1765 and the North West Ordinance 0f 1767 (Created under the old Articles of Confederation, but considered legal under the new Constitution), became States already owned by Federal annexation - all the way to Hawaii and Alaska - - You are free but the Ground under you isn't. The deed to your ground is just like the dollar in your pocket. It may be legal and have value, which you claim - but it is backed by the Federal Government and can be called in at any time by portion (Taxes) or all together (Eminent Domain). If you refuse payment wholly or in part, who will show up in force?? You and I are but renters of Federal Territory - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:23:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 27, 
        "quote": "", 
        "reply": "In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:37:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. Oh my. You see, we have a Federal Government, not a national government, there is a bit of differance between them. You see, the people compose the states, and the states created the Federal government, not the other way around. Indeed a stronger case can be made for state ownership of lands than federal ownership. Noone is involuntarily included in the Union? Read US Public Law 103-150, it acknowledges the forced subjugation of Hawai'i. Then the matter of the vote that brought Hawai'i into the Union, in which only US Citizen could vote, provided they had lived there for one year or greater, and denied native Hawai'ians the right to vote unless they had applied for US Citizenship... Now, let us look at the States the left the union in the period of the War Between the States. After the war ended, and the reconstruction period happened, states were required to vote with two basic options, rejoin the union or remain under military occupation. An agreement utilizing coercion is hardly considered binding by any court, and so those states have a legitimate argument to forced servitude as well, being offered the option to remain under military control or join the Union under conditions imposed my the Federal government. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 28, 
        "quote": "No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them.", 
        "reply": " Oh my. You see, we have a Federal Government, not a national government, there is a bit of differance between them. You see, the people compose the states, and the states created the Federal government, not the other way around. Indeed a stronger case can be made for state ownership of lands than federal ownership. Noone is involuntarily included in the Union? Read US Public Law 103-150, it acknowledges the forced subjugation of Hawai'i. Then the matter of the vote that brought Hawai'i into the Union, in which only US Citizen could vote, provided they had lived there for one year or greater, and denied native Hawai'ians the right to vote unless they had applied for US Citizenship... Now, let us look at the States the left the union in the period of the War Between the States. After the war ended, and the reconstruction period happened, states were required to vote with two basic options, rejoin the union or remain under military occupation. An agreement utilizing coercion is hardly considered binding by any court, and so those states have a legitimate argument to forced servitude as well, being offered the option to remain under military control or join the Union under conditions imposed my the Federal government. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:53:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. What a king \"takes\" he must hold. George III didn't. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. The Red Coats and Hessians came to arrest them, but got arrested Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Go ahead, declare independence and seced, if you think you have the force to survive. There will be a fight Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. The Contitution says \"We the People\" not \"We the States.\" It therefore a representative governement of humans, not dirt or boundaries - ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. Not when it came to killing people to save the union \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" This is getting boring, so go ahead and secede. Maybe you'll get a statue with a guy on a horse over where they bury you - maybe in your front yard, like Lee got all the Union Dead in his front yard at Arlington. Possession is 9/10th of the Law, and the Federal Government possesses all the military to enforce the Law. Anyone can defy the Law. Bank robbers rob Federal Banks all the time, but the cops can and do shoot them down like dogs with all authority to do so. Defy the Law of the Land and you buy into everything that will come with it. If you have more fire power, up to and including a MERV ICBM carrying ten 20 megaton nuclear warheads, then have at it, because that, potentially, is what Uncle Sam can come back at you with - about 500 of them...not a bunch of sailing boats and a few redcoats with muskets... Secession ain't no joke - and the next Civil War could be Total War... Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 29, 
        "quote": "Originally posted by MM2_ss_Lewis: In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. What a king \"takes\" he must hold. George III didn't. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. The Red Coats and Hessians came to arrest them, but got arrested Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Go ahead, declare independence and seced, if you think you have the force to survive. There will be a fight Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. The Contitution says \"We the People\" not \"We the States.\" It therefore a representative governement of humans, not dirt or boundaries - ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. Not when it came to killing people to save the union \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\"", 
        "reply": " This is getting boring, so go ahead and secede. Maybe you'll get a statue with a guy on a horse over where they bury you - maybe in your front yard, like Lee got all the Union Dead in his front yard at Arlington. Possession is 9/10th of the Law, and the Federal Government possesses all the military to enforce the Law. Anyone can defy the Law. Bank robbers rob Federal Banks all the time, but the cops can and do shoot them down like dogs with all authority to do so. Defy the Law of the Land and you buy into everything that will come with it. If you have more fire power, up to and including a MERV ICBM carrying ten 20 megaton nuclear warheads, then have at it, because that, potentially, is what Uncle Sam can come back at you with - about 500 of them...not a bunch of sailing boats and a few redcoats with muskets... Secession ain't no joke - and the next Civil War could be Total War... Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:55:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 30, 
        "quote": "", 
        "reply": "The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. It, secession, is not considered, defined, or recognized by the Constitution, just like compulsory taxation was not considered, defined, or recognized under the old Articles of Confederation, therefore; secession cannot happen under the Constitution any more than taxation could happen under the Articles of Confederation. Both were illegal by lack of definition. Once taxation was defined under the Constitution, tariffs and excise taxes could be created, and when the backwoodsmen of Pennsylvania refused to pay the Whiskey Excise Tax, President Washington had every right and obligation under the Constitution to put down the rebellion by force and make people obey the tax - reference the 17000 troops sent to put down the whiskey rebellion. \"secession\" would have to be considered, defined, and ratified into the Constitution via amendment before it could become an action any state could take without defying the Constitution which creates the \"United\" States of America. Nowhere in the Constitution is there allowance for \"United, as long as I'm happy\"... It is a marriage of \"Until (massive) DEATH do U.S. part\"... Empires are always held together more by the ominous and omnivorous than the omnibus - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 31, 
        "quote": "Originally posted by MM2_ss_Lewis: The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states.", 
        "reply": " It, secession, is not considered, defined, or recognized by the Constitution, just like compulsory taxation was not considered, defined, or recognized under the old Articles of Confederation, therefore; secession cannot happen under the Constitution any more than taxation could happen under the Articles of Confederation. Both were illegal by lack of definition. Once taxation was defined under the Constitution, tariffs and excise taxes could be created, and when the backwoodsmen of Pennsylvania refused to pay the Whiskey Excise Tax, President Washington had every right and obligation under the Constitution to put down the rebellion by force and make people obey the tax - reference the 17000 troops sent to put down the whiskey rebellion. \"secession\" would have to be considered, defined, and ratified into the Constitution via amendment before it could become an action any state could take without defying the Constitution which creates the \"United\" States of America. Nowhere in the Constitution is there allowance for \"United, as long as I'm happy\"... It is a marriage of \"Until (massive) DEATH do U.S. part\"... Empires are always held together more by the ominous and omnivorous than the omnibus - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:23:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I take it, and correct me if I am wrong please, that you feel that unless an option, right, or power is not listed in the Constitution then it does not have legal standing. If such is the case, then the 9th and 10th amendments would have no purpose at all. The 9th for aluding to unenumerated rights, and the 10th for saying unlisted rights remain the perview of the people and states. Such a concept I cannot agree with, as I believe the founding fathers understood the concept of secession, and that freedom to choose ones' form of government was a right held by the people. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 32, 
        "quote": "", 
        "reply": "I take it, and correct me if I am wrong please, that you feel that unless an option, right, or power is not listed in the Constitution then it does not have legal standing. If such is the case, then the 9th and 10th amendments would have no purpose at all. The 9th for aluding to unenumerated rights, and the 10th for saying unlisted rights remain the perview of the people and states. Such a concept I cannot agree with, as I believe the founding fathers understood the concept of secession, and that freedom to choose ones' form of government was a right held by the people. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:28:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "MM2-ss-Lewis:--- I voted Yes on your Poll, and the reason is very simple. It is now called \"West Virginia\". Six counties in North and Western Virginia, voted to secede from The Commonwealth of Virginia... {Interestingly - certain voters were not allowed to vote in those counties... }. Those six counties were allowed to form a \"State'... and sshhaazzaamm! guess what..? They became a Federal \"State\"... presto-magico! But... when South Carolina voted to \"secede\" from the Federal monster headquartered in Washington D.C., they were called \"Rebels\" and then the other States which desired to leave the tentacles of D.C. also seceded, they to were called \"Rebels\"... largely from the two-faced North-Easterners whose parents and grandparents had started riots/rebellion against The Crown in 1774,'75,'76... Since you might have some reading time while on vacation, I'll suggest a title or two that might be informative on this topic. \"A Constitutional view of the War between the States.\" by Alexander Stephens {If memory serves- I think he was the Vice-President of the C.S.A.} isbn # 159442067X \"A defense of Virginia and the South\". by R.L. Dabney {Lt.Gen. T.J.\"Stonewall\" Jackson's Chaplain} isbn # 1594420408", 
        "intTime": 20090313, 
        "postID": 33, 
        "quote": "", 
        "reply": "MM2-ss-Lewis:--- I voted Yes on your Poll, and the reason is very simple. It is now called \"West Virginia\". Six counties in North and Western Virginia, voted to secede from The Commonwealth of Virginia... {Interestingly - certain voters were not allowed to vote in those counties... }. Those six counties were allowed to form a \"State'... and sshhaazzaamm! guess what..? They became a Federal \"State\"... presto-magico! But... when South Carolina voted to \"secede\" from the Federal monster headquartered in Washington D.C., they were called \"Rebels\" and then the other States which desired to leave the tentacles of D.C. also seceded, they to were called \"Rebels\"... largely from the two-faced North-Easterners whose parents and grandparents had started riots/rebellion against The Crown in 1774,'75,'76... Since you might have some reading time while on vacation, I'll suggest a title or two that might be informative on this topic. \"A Constitutional view of the War between the States.\" by Alexander Stephens {If memory serves- I think he was the Vice-President of the C.S.A.} isbn # 159442067X \"A defense of Virginia and the South\". by R.L. Dabney {Lt.Gen. T.J.\"Stonewall\" Jackson's Chaplain} isbn # 1594420408", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 00:43:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "swremwin"
    }, 
    {
        "content": "This is what I Googled U.S. Constitution \"The Right To Secede\" March 4, 1789 The first union of the original 13 colonies was effected by the Articles of Confederation, adopted in 1781. The articles established a confederation of sovereign states in a permanent union. The \"permanence\" lasted only until 1788, when 11 states withdrew from the confederation and ratified the new Constitution, which became effective on March 4, 1789. The founding fathers recognized the defects in the Articles of Confederation, learned from these defects, and scrapped the articles in favor of the \"more perfect union\" found in the Constitution. Nowhere in the Constitution is there any mention of the union of the states being permanent. This was not an oversight by any means. Indeed, when New York, Rhode Island, and Virginia ratified the Constitution, they specifically stated that they reserved the right to resume the governmental powers granted to the United States. Their claim to the right of secession was understood and agreed to by the other ratifiers, including George Washington, who presided over the Constitutional Convention and was also a delegate from Virginia. In his book Life of Webster Sen. Henry Cabot Lodge writes, \"It is safe to say that there was not a man in the country, from Washington and Hamilton to Clinton and Mason, who did not regard the new system as an experiment from which each and every State had a right to peaceably withdraw.\" A textbook used at West Point before the Civil War, A View of the Constitution, written by Judge William Rawle, states, \"The secession of a State depends on the will of the people of such a State.\" Well into the 19th century, the United States was still viewed by many as an experimental confederation from which states could secede just as they had earlier acceded to it. It took a bloody war to prove them wrong. Fascinating Fact: It is significant that no Confederate leader was ever brought to trial for treason. A trial would have brought a verdict on the constitutional legality of secession. Federal prosecutors were satisfied with the verdict that had been decided in battle. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 34, 
        "quote": "", 
        "reply": "This is what I Googled U.S. Constitution \"The Right To Secede\" March 4, 1789 The first union of the original 13 colonies was effected by the Articles of Confederation, adopted in 1781. The articles established a confederation of sovereign states in a permanent union. The \"permanence\" lasted only until 1788, when 11 states withdrew from the confederation and ratified the new Constitution, which became effective on March 4, 1789. The founding fathers recognized the defects in the Articles of Confederation, learned from these defects, and scrapped the articles in favor of the \"more perfect union\" found in the Constitution. Nowhere in the Constitution is there any mention of the union of the states being permanent. This was not an oversight by any means. Indeed, when New York, Rhode Island, and Virginia ratified the Constitution, they specifically stated that they reserved the right to resume the governmental powers granted to the United States. Their claim to the right of secession was understood and agreed to by the other ratifiers, including George Washington, who presided over the Constitutional Convention and was also a delegate from Virginia. In his book Life of Webster Sen. Henry Cabot Lodge writes, \"It is safe to say that there was not a man in the country, from Washington and Hamilton to Clinton and Mason, who did not regard the new system as an experiment from which each and every State had a right to peaceably withdraw.\" A textbook used at West Point before the Civil War, A View of the Constitution, written by Judge William Rawle, states, \"The secession of a State depends on the will of the people of such a State.\" Well into the 19th century, the United States was still viewed by many as an experimental confederation from which states could secede just as they had earlier acceded to it. It took a bloody war to prove them wrong. Fascinating Fact: It is significant that no Confederate leader was ever brought to trial for treason. A trial would have brought a verdict on the constitutional legality of secession. Federal prosecutors were satisfied with the verdict that had been decided in battle. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 07:17:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "intTime": 20090313, 
        "postID": 35, 
        "quote": "", 
        "reply": "I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 13:34:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress. I doubt that is there after the Civil War. All southern states had to re-write their Constitutions to agree with and be subservient to the Constitution in order to be re-admitted into the Union. THE TEXAS CONSTITUTION ARTICLE 1. BILL OF RIGHTS Sec. 1. FREEDOM AND SOVEREIGNTY OF STATE. Texas is a free and independent State, subject only to the Constitution of the United States, and the maintenance of our free institutions and the perpetuity of the Union depend upon the preservation of the right of local self-government, unimpaired to all the States. Wandering and Wondering", 
        "intTime": 20090313, 
        "postID": 36, 
        "quote": "Originally posted by RetiredMarineWife: I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "reply": " I doubt that is there after the Civil War. All southern states had to re-write their Constitutions to agree with and be subservient to the Constitution in order to be re-admitted into the Union. THE TEXAS CONSTITUTION ARTICLE 1. BILL OF RIGHTS Sec. 1. FREEDOM AND SOVEREIGNTY OF STATE. Texas is a free and independent State, subject only to the Constitution of the United States, and the maintenance of our free institutions and the perpetuity of the Union depend upon the preservation of the right of local self-government, unimpaired to all the States. Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 14:11:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG - Incoming message from moi. Have to go to work soon, so I probably can't respond. Check Proverbs 2. Out.", 
        "intTime": 20090314, 
        "postID": 37, 
        "quote": "", 
        "reply": "GWG - Incoming message from moi. Have to go to work soon, so I probably can't respond. Check Proverbs 2. Out.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-14 10:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "swremwin"
    }, 
    {
        "content": "In GENERAL, splinter states are a bad idea, on a global scale. Internationally, splinter states often have an ethnic basis, and in order for a splinter state to guarantee its ethnic majority, they often involuntarily clear out the minorities. This often turns pretty nasty. I'm not a great advocate of self-determination without limits. There's a time for it, but if your government is reasonably representative and not too repressive, you don't really have a leg to stand on as far as breaking off and forming a new nation. Your responsibility in that case it work within the system.", 
        "intTime": 20090316, 
        "postID": 38, 
        "quote": "", 
        "reply": "In GENERAL, splinter states are a bad idea, on a global scale. Internationally, splinter states often have an ethnic basis, and in order for a splinter state to guarantee its ethnic majority, they often involuntarily clear out the minorities. This often turns pretty nasty. I'm not a great advocate of self-determination without limits. There's a time for it, but if your government is reasonably representative and not too repressive, you don't really have a leg to stand on as far as breaking off and forming a new nation. Your responsibility in that case it work within the system.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 08:25:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Ruanne"
    }, 
    {
        "content": "I don't think it such a move would be wise! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090316, 
        "postID": 39, 
        "quote": "", 
        "reply": "I don't think it such a move would be wise! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 08:40:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Bergy46"
    }, 
    {
        "content": "US Constitution Article 1 Section 10 Clause 3 No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. This part of the Constitution states several things which states are explicitly prevented from doing. These are rights that the states voluntarily ceded to the Federal Government. It seems that the Constitution which states ratified does prohibit them from creating alliances with themselves or other countries. Since this is a fundamental right of nation states this de facto prevents states from becoming independent nations.", 
        "intTime": 20090316, 
        "postID": 40, 
        "quote": "", 
        "reply": "US Constitution Article 1 Section 10 Clause 3 No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. This part of the Constitution states several things which states are explicitly prevented from doing. These are rights that the states voluntarily ceded to the Federal Government. It seems that the Constitution which states ratified does prohibit them from creating alliances with themselves or other countries. Since this is a fundamental right of nation states this de facto prevents states from becoming independent nations.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 10:14:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "jyoung77"
    }, 
    {
        "content": "Ok, so I got bored today, and am getting ready for a road trip out to Texas to visit some family. That means a few things, namely I won't be getting to screw around on my games, and I will likely have plenty of time on the net since there isn't much to do on vacation when you are lazy. That being the case, I feel the need to have a good discussion/debate. The subject, secession of states from the union, is it legal, when is is justifiable, and lastly, based on what evidence. I intend to refrain from putting my own views out there for the time being as I got some serious eye strain going at the moment from excessiove trolling. Also, I'll ask that we keep this civil, I want a debate/discussion, not a flame war or a locked thread. Question: Does a state, part of a state, or group of people have the right to leave a nation, state, or part of a state? Discuss with evidence. Choices: Yes, the right of secession is a fundamental right of free people Yes, but with certain limits Unsure No, a people, region, or state never have the right to leave a state or nation of which they are a part   “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 41, 
        "quote": "", 
        "reply": "Ok, so I got bored today, and am getting ready for a road trip out to Texas to visit some family. That means a few things, namely I won't be getting to screw around on my games, and I will likely have plenty of time on the net since there isn't much to do on vacation when you are lazy. That being the case, I feel the need to have a good discussion/debate. The subject, secession of states from the union, is it legal, when is is justifiable, and lastly, based on what evidence. I intend to refrain from putting my own views out there for the time being as I got some serious eye strain going at the moment from excessiove trolling. Also, I'll ask that we keep this civil, I want a debate/discussion, not a flame war or a locked thread. Question: Does a state, part of a state, or group of people have the right to leave a nation, state, or part of a state? Discuss with evidence. Choices: Yes, the right of secession is a fundamental right of free people Yes, but with certain limits Unsure No, a people, region, or state never have the right to leave a state or nation of which they are a part   “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 16:41:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Okay, here is the conundrum, the Constitution does not even consider the possibility, so it is a \"loophole.\" But the Constitution is the Law of the Land, since Ratification. The President of the United States is the Chief of all Police - Military and Civil - of this Nation, and he has no choice but to enforce the Law, or be treasonous to his Oath, his Office, and the Constitution itself. That is the view Abraham Lincoln, a lawyer by training, took. The Constitution doesn't even give Congress the option to debate or vote for a State to secede. So, a state can declare for secession, but the President MUST consider that an act of Grand Larceny against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... The only way that secession could be legal and not involve Civil War would be for a Constitutional Amendment to first be passed and ratified allowing secession without War. The steps would have to be civil and basically follow in reverse the application for statehood, with no prior hostilities.... Some states, prior to the Civil War, on the advice of Thomas Jefferson, a continual foe of the Constitution and the Federal Government, passed \"Nullification Acts\" against various Federal Laws, thus saying those Laws do not apply within the boundaries of the \"nullifying\" state. The Constitution, and all Laws passed under it, defines the Law of the Land, and cannot be nullified. Only the Supreme Court can determine a Law as \"unconstitutional, null, and void,\" or the People and Congress can vote out a Law. But no state can pick and chose or \"nullify\" a law. Thus, an \"Act of Nullification\" by a state is actually an illegal attempt to partially or wholly secede - an act of theft of Federal property and or treasure - a declaration of war, even if accidental... If you study closely the events leading to the Civil War, right from the Ratification of the Constitution 1789 (and all the problems brought in by not outlawing slavery then) right up until shots are fire at Ft Sumter in 1861, you will see all of the above being discussed, done, and causal to the deaths of some 650,000 souls - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 42, 
        "quote": "", 
        "reply": "Okay, here is the conundrum, the Constitution does not even consider the possibility, so it is a \"loophole.\" But the Constitution is the Law of the Land, since Ratification. The President of the United States is the Chief of all Police - Military and Civil - of this Nation, and he has no choice but to enforce the Law, or be treasonous to his Oath, his Office, and the Constitution itself. That is the view Abraham Lincoln, a lawyer by training, took. The Constitution doesn't even give Congress the option to debate or vote for a State to secede. So, a state can declare for secession, but the President MUST consider that an act of Grand Larceny against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... The only way that secession could be legal and not involve Civil War would be for a Constitutional Amendment to first be passed and ratified allowing secession without War. The steps would have to be civil and basically follow in reverse the application for statehood, with no prior hostilities.... Some states, prior to the Civil War, on the advice of Thomas Jefferson, a continual foe of the Constitution and the Federal Government, passed \"Nullification Acts\" against various Federal Laws, thus saying those Laws do not apply within the boundaries of the \"nullifying\" state. The Constitution, and all Laws passed under it, defines the Law of the Land, and cannot be nullified. Only the Supreme Court can determine a Law as \"unconstitutional, null, and void,\" or the People and Congress can vote out a Law. But no state can pick and chose or \"nullify\" a law. Thus, an \"Act of Nullification\" by a state is actually an illegal attempt to partially or wholly secede - an act of theft of Federal property and or treasure - a declaration of war, even if accidental... If you study closely the events leading to the Civil War, right from the Ratification of the Constitution 1789 (and all the problems brought in by not outlawing slavery then) right up until shots are fire at Ft Sumter in 1861, you will see all of the above being discussed, done, and causal to the deaths of some 650,000 souls - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:18:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The issue of secession was pretty well settled by the Civil War. Of course people have the right to emigrate, but it doesn't mean they have the right to take land (and/or people who don't want to secede) with them.", 
        "intTime": 20090312, 
        "postID": 43, 
        "quote": "", 
        "reply": "The issue of secession was pretty well settled by the Civil War. Of course people have the right to emigrate, but it doesn't mean they have the right to take land (and/or people who don't want to secede) with them.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:21:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "liberal90"
    }, 
    {
        "content": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. I would argue that based on the Declaration of Independance, an individual state, and by association, parts of a state(West Virginia), and the people therin have the option to leave a state or union and take their possesions with them, including the land which they own. Secondly I would argue that the Federal Government has NO right to utilize force of arms to prevent a state from leaving the union. President Buchanan supported this view as well. Thirdly, I argue that the Constitution is in place for the purpose of limiting the Federal government, and that document supports my claim in the 10th amendment, which states, \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" As the Constitution exist to limit the government at the federal level by defining the powers and authority allowed to it, and the document does not grant the Federal government over the matter of secession, I believe that power rest with the states and the people of the states. Additionally, amendment 9 makes it clear that the Constitution not mentioning a right does not equate to it not being a right. \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. 2. Congress shall have power to enforce this article by appropriate legislation.\" Now, based on these citations, I suggest that the right of a people, or state to leave the union, in full possesion of all their property exist. In regards to the state aquiring military material, bases, and other government property being grand larceny, I would suggest that a form of restitution would be appropriate, or else the state could require the removal of such federal property from their borders, though how to move a fort may be another matter. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 44, 
        "quote": "", 
        "reply": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. I would argue that based on the Declaration of Independance, an individual state, and by association, parts of a state(West Virginia), and the people therin have the option to leave a state or union and take their possesions with them, including the land which they own. Secondly I would argue that the Federal Government has NO right to utilize force of arms to prevent a state from leaving the union. President Buchanan supported this view as well. Thirdly, I argue that the Constitution is in place for the purpose of limiting the Federal government, and that document supports my claim in the 10th amendment, which states, \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\" As the Constitution exist to limit the government at the federal level by defining the powers and authority allowed to it, and the document does not grant the Federal government over the matter of secession, I believe that power rest with the states and the people of the states. Additionally, amendment 9 makes it clear that the Constitution not mentioning a right does not equate to it not being a right. \"The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\" Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. 2. Congress shall have power to enforce this article by appropriate legislation.\" Now, based on these citations, I suggest that the right of a people, or state to leave the union, in full possesion of all their property exist. In regards to the state aquiring military material, bases, and other government property being grand larceny, I would suggest that a form of restitution would be appropriate, or else the state could require the removal of such federal property from their borders, though how to move a fort may be another matter. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 17:46:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government. Nope - The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out. Furthermore, by sending the Declaration of Independence, the \"United States of America\" (a phrase coined therein) declared war...the risk that any seceding or rebelling group takes, thus breaking with ANY and ALL Laws of England and its Empire, at risk of losing said War, being over-run by a hostile force, and potentially ALL being put to the sword! America won, England lost - so English domination and law was dissolved. Of course it took the War of 1812, and the Civil War (England backed the South until 1863) to get the separation from England, and the total end of English Ownership/Jurisdiction recognized and resolved - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 45, 
        "quote": "By such logic, should not the original 13 colonies be returned to Great Britain then? As at the time of the signing of the Declaration of Independance the colonies were lands that belonged to Great Britain(hence the colonist took land) and on some of those lands were properties of the British Government.", 
        "reply": " Nope - The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out. Furthermore, by sending the Declaration of Independence, the \"United States of America\" (a phrase coined therein) declared war...the risk that any seceding or rebelling group takes, thus breaking with ANY and ALL Laws of England and its Empire, at risk of losing said War, being over-run by a hostile force, and potentially ALL being put to the sword! America won, England lost - so English domination and law was dissolved. Of course it took the War of 1812, and the Civil War (England backed the South until 1863) to get the separation from England, and the total end of English Ownership/Jurisdiction recognized and resolved - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Quote: Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction - - End Quote;;; So, a state can declare for secession, but the President MUST consider that as an Act of Grand Larceny (WAR) against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. The original 13 states gave that up when they ratified, and all ensuing states, which were first Federal Territories, as per the Land Ordinance of 1765 and the North West Ordinance 0f 1767 (Created under the old Articles of Confederation, but considered legal under the new Constitution), became States already owned by Federal annexation - all the way to Hawaii and Alaska - - You are free but the Ground under you isn't. The deed to your ground is just like the dollar in your pocket. It may be legal and have value, which you claim - but it is backed by the Federal Government and can be called in at any time by portion (Taxes) or all together (Eminent Domain). If you refuse payment wholly or in part, who will show up in force?? You and I are but renters of Federal Territory - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 46, 
        "quote": "", 
        "reply": "Quote: Next, I argue that the Constitution does not permit the Federal government to force a state to remain in the Union, as to force a people to do something against their will is involuntary servitude, which is not permitted under the 13th amendment, which states, \"1. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction - - End Quote;;; So, a state can declare for secession, but the President MUST consider that as an Act of Grand Larceny (WAR) against Federal Property: The Miltiary Forts (Ft. Sumter), the Installations, munitions, equipment, roads, and even the very land of the state itself. And the state must recognize that the Commander in Chief, the Federal Government, and all its Military Forces must stop that theft, or be in violation of ALL Oaths and Offices. The state might try to negotiate just payment for all the Federal Property, loss of income (taxes) and other losses the Federal Government might suffer in good faith, attempting to avoid conflict and War. But there is NOTHING in the Constitution which would even allow Congress or the President to proceed into such negotiations... No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. The original 13 states gave that up when they ratified, and all ensuing states, which were first Federal Territories, as per the Land Ordinance of 1765 and the North West Ordinance 0f 1767 (Created under the old Articles of Confederation, but considered legal under the new Constitution), became States already owned by Federal annexation - all the way to Hawaii and Alaska - - You are free but the Ground under you isn't. The deed to your ground is just like the dollar in your pocket. It may be legal and have value, which you claim - but it is backed by the Federal Government and can be called in at any time by portion (Taxes) or all together (Eminent Domain). If you refuse payment wholly or in part, who will show up in force?? You and I are but renters of Federal Territory - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:23:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 47, 
        "quote": "", 
        "reply": "In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:37:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them. Oh my. You see, we have a Federal Government, not a national government, there is a bit of differance between them. You see, the people compose the states, and the states created the Federal government, not the other way around. Indeed a stronger case can be made for state ownership of lands than federal ownership. Noone is involuntarily included in the Union? Read US Public Law 103-150, it acknowledges the forced subjugation of Hawai'i. Then the matter of the vote that brought Hawai'i into the Union, in which only US Citizen could vote, provided they had lived there for one year or greater, and denied native Hawai'ians the right to vote unless they had applied for US Citizenship... Now, let us look at the States the left the union in the period of the War Between the States. After the war ended, and the reconstruction period happened, states were required to vote with two basic options, rejoin the union or remain under military occupation. An agreement utilizing coercion is hardly considered binding by any court, and so those states have a legitimate argument to forced servitude as well, being offered the option to remain under military control or join the Union under conditions imposed my the Federal government. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 48, 
        "quote": "No one in any state \"Serves involuntarily.\" Every state either ratified the Constitution voluntarily or applied for statehood afterward and ratified statehood voluntarily thereafter.. Individuals are free to leave and live where ever they wish - They just can't take federal property (The dirt under their feet) with them.", 
        "reply": " Oh my. You see, we have a Federal Government, not a national government, there is a bit of differance between them. You see, the people compose the states, and the states created the Federal government, not the other way around. Indeed a stronger case can be made for state ownership of lands than federal ownership. Noone is involuntarily included in the Union? Read US Public Law 103-150, it acknowledges the forced subjugation of Hawai'i. Then the matter of the vote that brought Hawai'i into the Union, in which only US Citizen could vote, provided they had lived there for one year or greater, and denied native Hawai'ians the right to vote unless they had applied for US Citizenship... Now, let us look at the States the left the union in the period of the War Between the States. After the war ended, and the reconstruction period happened, states were required to vote with two basic options, rejoin the union or remain under military occupation. An agreement utilizing coercion is hardly considered binding by any court, and so those states have a legitimate argument to forced servitude as well, being offered the option to remain under military control or join the Union under conditions imposed my the Federal government. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:53:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. What a king \"takes\" he must hold. George III didn't. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. The Red Coats and Hessians came to arrest them, but got arrested Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Go ahead, declare independence and seced, if you think you have the force to survive. There will be a fight Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. The Contitution says \"We the People\" not \"We the States.\" It therefore a representative governement of humans, not dirt or boundaries - ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. Not when it came to killing people to save the union \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\" This is getting boring, so go ahead and secede. Maybe you'll get a statue with a guy on a horse over where they bury you - maybe in your front yard, like Lee got all the Union Dead in his front yard at Arlington. Possession is 9/10th of the Law, and the Federal Government possesses all the military to enforce the Law. Anyone can defy the Law. Bank robbers rob Federal Banks all the time, but the cops can and do shoot them down like dogs with all authority to do so. Defy the Law of the Land and you buy into everything that will come with it. If you have more fire power, up to and including a MERV ICBM carrying ten 20 megaton nuclear warheads, then have at it, because that, potentially, is what Uncle Sam can come back at you with - about 500 of them...not a bunch of sailing boats and a few redcoats with muskets... Secession ain't no joke - and the next Civil War could be Total War... Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 49, 
        "quote": "Originally posted by MM2_ss_Lewis: In regards to this, \"The \"colonies\" were never recognized as \"States\" by England, so they were never anything more to England than exploited territories, to be discarded once the resources had played out.\" The colonies were lands belonging to the British crown, correct? Thus, liberal90's claim that people have the right to emigrate, but not take land, would by his logic be unjust and illegal. What a king \"takes\" he must hold. George III didn't. Now, since on those lands then belonging to the British crown there existed properties of that nation, the colonist would, by your logic, be guilty of grand larceny against the British crown. The Red Coats and Hessians came to arrest them, but got arrested Your last post, I take umbrage with, as it seems to support tyranny by the Federal government should a state decide to leave the Union, yet the time which you refer to was when a group of people choose to leave a nation because of tyranny. You see, the real problem with secession is that it is not possible for it to be cut and dried, black and white, so to speak. Go ahead, declare independence and seced, if you think you have the force to survive. There will be a fight Now, is we assume that the Federal government is in fact limited to being a represenative of the several sovereign states, for purposes of order and negotiations with other nations, the issue becomes much simpler to deal with. As the lands within the border of the state properly belong to that state, and the people, the Federal government exist and is present at the leisure of the people. Should the people wish it, having invited the Federal government in, they have the concurrent right to un-invite the Federal government, should the people and the states feel that the Federal government has assumed a form harmful to their interest. The Contitution says \"We the People\" not \"We the States.\" It therefore a representative governement of humans, not dirt or boundaries - ...That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness... Thus, should a state or group of people determine that the government has become one contrary to their desires and is acting in a manner they deem destructive, the people have the right to cast it off. As for Mr. Lincoln, he flip floped on the matter of secession. Not when it came to killing people to save the union \"Any people, anywhere, being inclined and having the power, have the right to rise up and shake off the existing government, and form a new one that suits them better. This is a most valuable, a most sacred right, a right which we hope and believe is to liberate the world. Nor is this right confined to cases in which the whole people of an existing government may choose to exercise it. Any portion of such people, that can, may revolutionize, and make their own of so much of the territory as they inhabit. More than this, a majority of any portion of such people may revolutionize, putting down a minority, intermingled with, or near about them, who may oppose their movements.\" ~ Lincoln January 12 1848 Then again, he threw out the whole \"freedom of the press\" bit as well... If you should choose to review his instructions to General Dix on 18 May 1864. Or maybe you have read this? \"But what am I to do in the meantime with those men at Montgomery? Am I to let them go on... and open Charleston, etc., as ports of entry, with their ten-percent tariff. What, then, would become of my tariff?\" ~ Lincoln to Colonel John B. Baldwin, deputized by the Virginian Commissioners to determine whether Lincoln would use force, April 4, 1861 Yes, Mr. Lincoln is a great man to reflect upon, unless you wish to stick to the Constitution. Personally, I tend to agree with the London Times, \"Democracy broke down, not when the Union ceased to be agreeable to all its constituent States, but when it was upheld, like any other Empire, by force of arms\" and Cornhill Magazine, \"With what pretence of fairness, it is said, can you Americans object to the secession of the Southern States when your nation was founded on secession from the British Empire?\"", 
        "reply": " This is getting boring, so go ahead and secede. Maybe you'll get a statue with a guy on a horse over where they bury you - maybe in your front yard, like Lee got all the Union Dead in his front yard at Arlington. Possession is 9/10th of the Law, and the Federal Government possesses all the military to enforce the Law. Anyone can defy the Law. Bank robbers rob Federal Banks all the time, but the cops can and do shoot them down like dogs with all authority to do so. Defy the Law of the Land and you buy into everything that will come with it. If you have more fire power, up to and including a MERV ICBM carrying ten 20 megaton nuclear warheads, then have at it, because that, potentially, is what Uncle Sam can come back at you with - about 500 of them...not a bunch of sailing boats and a few redcoats with muskets... Secession ain't no joke - and the next Civil War could be Total War... Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 18:55:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 50, 
        "quote": "", 
        "reply": "The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states. It, secession, is not considered, defined, or recognized by the Constitution, just like compulsory taxation was not considered, defined, or recognized under the old Articles of Confederation, therefore; secession cannot happen under the Constitution any more than taxation could happen under the Articles of Confederation. Both were illegal by lack of definition. Once taxation was defined under the Constitution, tariffs and excise taxes could be created, and when the backwoodsmen of Pennsylvania refused to pay the Whiskey Excise Tax, President Washington had every right and obligation under the Constitution to put down the rebellion by force and make people obey the tax - reference the 17000 troops sent to put down the whiskey rebellion. \"secession\" would have to be considered, defined, and ratified into the Constitution via amendment before it could become an action any state could take without defying the Constitution which creates the \"United\" States of America. Nowhere in the Constitution is there allowance for \"United, as long as I'm happy\"... It is a marriage of \"Until (massive) DEATH do U.S. part\"... Empires are always held together more by the ominous and omnivorous than the omnibus - - Wandering and Wondering", 
        "intTime": 20090312, 
        "postID": 51, 
        "quote": "Originally posted by MM2_ss_Lewis: The point being GWG, not if the members of the Federal government would react to an act of secession with violence(we already know they would), or if robbing a bank is illegal(it is by law), and I am not suggesting that one or more people or states should leave the Union(I am not), the point being, what is the status of the legality of the claimed right of secession, when should or would it be permissible if it is legal, and what is the extent of the right of secession. I suggest there is a right of secession, that right not being mentioned in the US Constitution, is held by the states and the people of the states. I have offered some citations that I feel support that belief. I do not intend to degrade this to the level of attacks on another member, and hope you have not interpeted any of my comments as such. Yes, should a second episode of civil war happen in the US I am certain it would be utterly disaterous, however, that is not the subject at hand. The matter at hand is this, the Constitution alludes to rights belonging to the people and states, it additionally imposes limits on the Federal government. What are the rights not listed that remain to the people and the states, and when can the Federal government go beyond the defined authority of the Constitution in matters pertaining to those un-mentioned rights of the people and states.", 
        "reply": " It, secession, is not considered, defined, or recognized by the Constitution, just like compulsory taxation was not considered, defined, or recognized under the old Articles of Confederation, therefore; secession cannot happen under the Constitution any more than taxation could happen under the Articles of Confederation. Both were illegal by lack of definition. Once taxation was defined under the Constitution, tariffs and excise taxes could be created, and when the backwoodsmen of Pennsylvania refused to pay the Whiskey Excise Tax, President Washington had every right and obligation under the Constitution to put down the rebellion by force and make people obey the tax - reference the 17000 troops sent to put down the whiskey rebellion. \"secession\" would have to be considered, defined, and ratified into the Constitution via amendment before it could become an action any state could take without defying the Constitution which creates the \"United\" States of America. Nowhere in the Constitution is there allowance for \"United, as long as I'm happy\"... It is a marriage of \"Until (massive) DEATH do U.S. part\"... Empires are always held together more by the ominous and omnivorous than the omnibus - - Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:23:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I take it, and correct me if I am wrong please, that you feel that unless an option, right, or power is not listed in the Constitution then it does not have legal standing. If such is the case, then the 9th and 10th amendments would have no purpose at all. The 9th for aluding to unenumerated rights, and the 10th for saying unlisted rights remain the perview of the people and states. Such a concept I cannot agree with, as I believe the founding fathers understood the concept of secession, and that freedom to choose ones' form of government was a right held by the people. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 52, 
        "quote": "", 
        "reply": "I take it, and correct me if I am wrong please, that you feel that unless an option, right, or power is not listed in the Constitution then it does not have legal standing. If such is the case, then the 9th and 10th amendments would have no purpose at all. The 9th for aluding to unenumerated rights, and the 10th for saying unlisted rights remain the perview of the people and states. Such a concept I cannot agree with, as I believe the founding fathers understood the concept of secession, and that freedom to choose ones' form of government was a right held by the people. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-12 19:28:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "MM2-ss-Lewis:--- I voted Yes on your Poll, and the reason is very simple. It is now called \"West Virginia\". Six counties in North and Western Virginia, voted to secede from The Commonwealth of Virginia... {Interestingly - certain voters were not allowed to vote in those counties... }. Those six counties were allowed to form a \"State'... and sshhaazzaamm! guess what..? They became a Federal \"State\"... presto-magico! But... when South Carolina voted to \"secede\" from the Federal monster headquartered in Washington D.C., they were called \"Rebels\" and then the other States which desired to leave the tentacles of D.C. also seceded, they to were called \"Rebels\"... largely from the two-faced North-Easterners whose parents and grandparents had started riots/rebellion against The Crown in 1774,'75,'76... Since you might have some reading time while on vacation, I'll suggest a title or two that might be informative on this topic. \"A Constitutional view of the War between the States.\" by Alexander Stephens {If memory serves- I think he was the Vice-President of the C.S.A.} isbn # 159442067X \"A defense of Virginia and the South\". by R.L. Dabney {Lt.Gen. T.J.\"Stonewall\" Jackson's Chaplain} isbn # 1594420408", 
        "intTime": 20090313, 
        "postID": 53, 
        "quote": "", 
        "reply": "MM2-ss-Lewis:--- I voted Yes on your Poll, and the reason is very simple. It is now called \"West Virginia\". Six counties in North and Western Virginia, voted to secede from The Commonwealth of Virginia... {Interestingly - certain voters were not allowed to vote in those counties... }. Those six counties were allowed to form a \"State'... and sshhaazzaamm! guess what..? They became a Federal \"State\"... presto-magico! But... when South Carolina voted to \"secede\" from the Federal monster headquartered in Washington D.C., they were called \"Rebels\" and then the other States which desired to leave the tentacles of D.C. also seceded, they to were called \"Rebels\"... largely from the two-faced North-Easterners whose parents and grandparents had started riots/rebellion against The Crown in 1774,'75,'76... Since you might have some reading time while on vacation, I'll suggest a title or two that might be informative on this topic. \"A Constitutional view of the War between the States.\" by Alexander Stephens {If memory serves- I think he was the Vice-President of the C.S.A.} isbn # 159442067X \"A defense of Virginia and the South\". by R.L. Dabney {Lt.Gen. T.J.\"Stonewall\" Jackson's Chaplain} isbn # 1594420408", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 00:43:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "swremwin"
    }, 
    {
        "content": "This is what I Googled U.S. Constitution \"The Right To Secede\" March 4, 1789 The first union of the original 13 colonies was effected by the Articles of Confederation, adopted in 1781. The articles established a confederation of sovereign states in a permanent union. The \"permanence\" lasted only until 1788, when 11 states withdrew from the confederation and ratified the new Constitution, which became effective on March 4, 1789. The founding fathers recognized the defects in the Articles of Confederation, learned from these defects, and scrapped the articles in favor of the \"more perfect union\" found in the Constitution. Nowhere in the Constitution is there any mention of the union of the states being permanent. This was not an oversight by any means. Indeed, when New York, Rhode Island, and Virginia ratified the Constitution, they specifically stated that they reserved the right to resume the governmental powers granted to the United States. Their claim to the right of secession was understood and agreed to by the other ratifiers, including George Washington, who presided over the Constitutional Convention and was also a delegate from Virginia. In his book Life of Webster Sen. Henry Cabot Lodge writes, \"It is safe to say that there was not a man in the country, from Washington and Hamilton to Clinton and Mason, who did not regard the new system as an experiment from which each and every State had a right to peaceably withdraw.\" A textbook used at West Point before the Civil War, A View of the Constitution, written by Judge William Rawle, states, \"The secession of a State depends on the will of the people of such a State.\" Well into the 19th century, the United States was still viewed by many as an experimental confederation from which states could secede just as they had earlier acceded to it. It took a bloody war to prove them wrong. Fascinating Fact: It is significant that no Confederate leader was ever brought to trial for treason. A trial would have brought a verdict on the constitutional legality of secession. Federal prosecutors were satisfied with the verdict that had been decided in battle. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090313, 
        "postID": 54, 
        "quote": "", 
        "reply": "This is what I Googled U.S. Constitution \"The Right To Secede\" March 4, 1789 The first union of the original 13 colonies was effected by the Articles of Confederation, adopted in 1781. The articles established a confederation of sovereign states in a permanent union. The \"permanence\" lasted only until 1788, when 11 states withdrew from the confederation and ratified the new Constitution, which became effective on March 4, 1789. The founding fathers recognized the defects in the Articles of Confederation, learned from these defects, and scrapped the articles in favor of the \"more perfect union\" found in the Constitution. Nowhere in the Constitution is there any mention of the union of the states being permanent. This was not an oversight by any means. Indeed, when New York, Rhode Island, and Virginia ratified the Constitution, they specifically stated that they reserved the right to resume the governmental powers granted to the United States. Their claim to the right of secession was understood and agreed to by the other ratifiers, including George Washington, who presided over the Constitutional Convention and was also a delegate from Virginia. In his book Life of Webster Sen. Henry Cabot Lodge writes, \"It is safe to say that there was not a man in the country, from Washington and Hamilton to Clinton and Mason, who did not regard the new system as an experiment from which each and every State had a right to peaceably withdraw.\" A textbook used at West Point before the Civil War, A View of the Constitution, written by Judge William Rawle, states, \"The secession of a State depends on the will of the people of such a State.\" Well into the 19th century, the United States was still viewed by many as an experimental confederation from which states could secede just as they had earlier acceded to it. It took a bloody war to prove them wrong. Fascinating Fact: It is significant that no Confederate leader was ever brought to trial for treason. A trial would have brought a verdict on the constitutional legality of secession. Federal prosecutors were satisfied with the verdict that had been decided in battle. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 07:17:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Vicdude"
    }, 
    {
        "content": "I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "intTime": 20090313, 
        "postID": 55, 
        "quote": "", 
        "reply": "I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 13:34:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "RetiredMarineWife"
    }, 
    {
        "content": "quote: Originally posted by RetiredMarineWife: I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress. I doubt that is there after the Civil War. All southern states had to re-write their Constitutions to agree with and be subservient to the Constitution in order to be re-admitted into the Union. THE TEXAS CONSTITUTION ARTICLE 1. BILL OF RIGHTS Sec. 1. FREEDOM AND SOVEREIGNTY OF STATE. Texas is a free and independent State, subject only to the Constitution of the United States, and the maintenance of our free institutions and the perpetuity of the Union depend upon the preservation of the right of local self-government, unimpaired to all the States. Wandering and Wondering", 
        "intTime": 20090313, 
        "postID": 56, 
        "quote": "Originally posted by RetiredMarineWife: I believe Texas is the only state that has the \"right to secede from the Union at any time\" in their State Constitution, ratified by Congress.", 
        "reply": " I doubt that is there after the Civil War. All southern states had to re-write their Constitutions to agree with and be subservient to the Constitution in order to be re-admitted into the Union. THE TEXAS CONSTITUTION ARTICLE 1. BILL OF RIGHTS Sec. 1. FREEDOM AND SOVEREIGNTY OF STATE. Texas is a free and independent State, subject only to the Constitution of the United States, and the maintenance of our free institutions and the perpetuity of the Union depend upon the preservation of the right of local self-government, unimpaired to all the States. Wandering and Wondering", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-13 14:11:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG - Incoming message from moi. Have to go to work soon, so I probably can't respond. Check Proverbs 2. Out.", 
        "intTime": 20090314, 
        "postID": 57, 
        "quote": "", 
        "reply": "GWG - Incoming message from moi. Have to go to work soon, so I probably can't respond. Check Proverbs 2. Out.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-14 10:05:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "swremwin"
    }, 
    {
        "content": "In GENERAL, splinter states are a bad idea, on a global scale. Internationally, splinter states often have an ethnic basis, and in order for a splinter state to guarantee its ethnic majority, they often involuntarily clear out the minorities. This often turns pretty nasty. I'm not a great advocate of self-determination without limits. There's a time for it, but if your government is reasonably representative and not too repressive, you don't really have a leg to stand on as far as breaking off and forming a new nation. Your responsibility in that case it work within the system.", 
        "intTime": 20090316, 
        "postID": 58, 
        "quote": "", 
        "reply": "In GENERAL, splinter states are a bad idea, on a global scale. Internationally, splinter states often have an ethnic basis, and in order for a splinter state to guarantee its ethnic majority, they often involuntarily clear out the minorities. This often turns pretty nasty. I'm not a great advocate of self-determination without limits. There's a time for it, but if your government is reasonably representative and not too repressive, you don't really have a leg to stand on as far as breaking off and forming a new nation. Your responsibility in that case it work within the system.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 08:25:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Ruanne"
    }, 
    {
        "content": "I don't think it such a move would be wise! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090316, 
        "postID": 59, 
        "quote": "", 
        "reply": "I don't think it such a move would be wise! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 08:40:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "Bergy46"
    }, 
    {
        "content": "US Constitution Article 1 Section 10 Clause 3 No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. This part of the Constitution states several things which states are explicitly prevented from doing. These are rights that the states voluntarily ceded to the Federal Government. It seems that the Constitution which states ratified does prohibit them from creating alliances with themselves or other countries. Since this is a fundamental right of nation states this de facto prevents states from becoming independent nations.", 
        "intTime": 20090316, 
        "postID": 60, 
        "quote": "", 
        "reply": "US Constitution Article 1 Section 10 Clause 3 No State shall, without the Consent of Congress, lay any duty of Tonnage, keep Troops, or Ships of War in time of Peace, enter into any Agreement or Compact with another State, or with a foreign Power, or engage in War, unless actually invaded, or in such imminent Danger as will not admit of delay. This part of the Constitution states several things which states are explicitly prevented from doing. These are rights that the states voluntarily ceded to the Federal Government. It seems that the Constitution which states ratified does prohibit them from creating alliances with themselves or other countries. Since this is a fundamental right of nation states this de facto prevents states from becoming independent nations.", 
        "threadID": "5291911282_9770086712001", 
        "time": "2009-03-16 10:14:00", 
        "title": "Secession, and the legality thereof", 
        "userID": "jyoung77"
    }
]