[
    {
        "content": "My son is at Fort Knox in reception for another week or two or three. Do they accept express mail or overnight mail- sevice that has to be signed for when it is being sent to a person still in reception? thank you dgh", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "My son is at Fort Knox in reception for another week or two or three. Do they accept express mail or overnight mail- sevice that has to be signed for when it is being sent to a person still in reception? thank you dgh", 
        "threadID": "5291911282_9050049022001", 
        "time": "2009-04-16 13:25:00", 
        "title": "Express mail to Fort Knox ? ? ?", 
        "userID": "dghealy"
    }, 
    {
        "content": "NO. You have to send any packages by regular Parcel service.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "", 
        "reply": "NO. You have to send any packages by regular Parcel service.", 
        "threadID": "5291911282_9050049022001", 
        "time": "2009-04-16 13:42:00", 
        "title": "Express mail to Fort Knox ? ? ?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: dghealy I can't think of anything that should be mailed to someone in the reception center, other than possibly some legal papers. If that is the case you should contact the JAG (army legal office) at Ft. Knox. We wish him great success and you great pride in his service. Please keep us posted on his service. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "dghealy", 
        "reply": " I can't think of anything that should be mailed to someone in the reception center, other than possibly some legal papers. If that is the case you should contact the JAG (army legal office) at Ft. Knox. We wish him great success and you great pride in his service. Please keep us posted on his service. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_9050049022001", 
        "time": "2009-04-16 14:17:00", 
        "title": "Express mail to Fort Knox ? ? ?", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by dghealy: My son is at Fort Knox in reception for another week or two or three. Do they accept express mail or overnight mail- sevice that has to be signed for when it is being sent to a person still in reception? thank you dgh Reception Station is NOT a permanent resident for new arrivals, and 100s are passing through there. Until your son is in Basic Training, he is simply in transit, and has no real address to receive anything. Even if you sent him something, it wouldn't connect with him until Basic (maybe). There would be a real chance it would just be returned or get lost - - Wait a week or two until he is assigned to a Company and Platoon then he will have an address and postal point (Orderly Room) it can definitely be sent to - - Yup, I spent 15 months at Knox - - Wandering and Wondering", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by dghealy: My son is at Fort Knox in reception for another week or two or three. Do they accept express mail or overnight mail- sevice that has to be signed for when it is being sent to a person still in reception? thank you dgh", 
        "reply": " Reception Station is NOT a permanent resident for new arrivals, and 100s are passing through there. Until your son is in Basic Training, he is simply in transit, and has no real address to receive anything. Even if you sent him something, it wouldn't connect with him until Basic (maybe). There would be a real chance it would just be returned or get lost - - Wait a week or two until he is assigned to a Company and Platoon then he will have an address and postal point (Orderly Room) it can definitely be sent to - - Yup, I spent 15 months at Knox - - Wandering and Wondering", 
        "threadID": "5291911282_9050049022001", 
        "time": "2009-04-16 16:55:00", 
        "title": "Express mail to Fort Knox ? ? ?", 
        "userID": "greywolfghost"
    }
]