[
    {
        "content": "Ok my recruiter kinda gave me a short notice that I get to go to MEP's in about a week. And have to lose weight I'm 5'10\" 240lb's and gotta loose about 40ish pounds. I'v gone strickly water, fruits, veggys, situps, and pushups. Is there anything else I can do to lose weight faster I need to loose about 4\" off my waist to not have to do the ARMS step test. But have to lose 1\" to be able to do the ARMS step test. I want to stray away from doing the ARM's test cause of being worried I may not pass it.", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ok my recruiter kinda gave me a short notice that I get to go to MEP's in about a week. And have to lose weight I'm 5'10\" 240lb's and gotta loose about 40ish pounds. I'v gone strickly water, fruits, veggys, situps, and pushups. Is there anything else I can do to lose weight faster I need to loose about 4\" off my waist to not have to do the ARMS step test. But have to lose 1\" to be able to do the ARMS step test. I want to stray away from doing the ARM's test cause of being worried I may not pass it.", 
        "threadID": "5291911282_5230000912001", 
        "time": "2009-03-26 13:42:00", 
        "title": "MEPs help.", 
        "userID": "Cjeff88"
    }, 
    {
        "content": "WOW! That's a lot of weight to lose. Wrestlers used to use sauna suits, diuretics, and a whole lot of jogging in circles, including stadium stairs to cut that kind of weight in a hurry, but that can leave you very weak, and in a less than healthy condition. Cut way down on salt, as that makes you retain water, but drink lots of fruit juice. That will keep your hydration level up, while moving a whole lot out of your system. You're probably carrying 10-20 pounds of unneeded weight in you intestines and stomach right now that you could lose. The only way to burn off lots of fat is rigorous exercise of all the muscle groups. Alternating jogging and hitting the heavy bag (boxing) while wearing two layers of sweats is the best I've ever found besides wrestling one match after another of college style wrestling for several hours at a shot.... The big danger is heat prostration. If you push yourself too hard, your body's cooling system can go wacko and your temperature can go right through the roof, killing you of heat stroke. Do not work alone, and have plenty of cold water to drink and pour over yourself if you feel faint - - Good luck - - Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "", 
        "reply": "WOW! That's a lot of weight to lose. Wrestlers used to use sauna suits, diuretics, and a whole lot of jogging in circles, including stadium stairs to cut that kind of weight in a hurry, but that can leave you very weak, and in a less than healthy condition. Cut way down on salt, as that makes you retain water, but drink lots of fruit juice. That will keep your hydration level up, while moving a whole lot out of your system. You're probably carrying 10-20 pounds of unneeded weight in you intestines and stomach right now that you could lose. The only way to burn off lots of fat is rigorous exercise of all the muscle groups. Alternating jogging and hitting the heavy bag (boxing) while wearing two layers of sweats is the best I've ever found besides wrestling one match after another of college style wrestling for several hours at a shot.... The big danger is heat prostration. If you push yourself too hard, your body's cooling system can go wacko and your temperature can go right through the roof, killing you of heat stroke. Do not work alone, and have plenty of cold water to drink and pour over yourself if you feel faint - - Good luck - - Wandering and Wondering", 
        "threadID": "5291911282_5230000912001", 
        "time": "2009-03-26 13:57:00", 
        "title": "MEPs help.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Cjeff88: Ok my recruiter kinda gave me a short notice that I get to go to MEP's in about a week. And have to lose weight I'm 5'10\" 240lb's and gotta loose about 40ish pounds. I'v gone strickly water, fruits, veggys, situps, and pushups. Is there anything else I can do to lose weight faster I need to loose about 4\" off my waist to not have to do the ARMS step test. But have to lose 1\" to be able to do the ARMS step test. I want to stray away from doing the ARM's test cause of being worried I may not pass it. This is as a moderator. Any information you receive on this forum can not be consider as medical advice. The loss of that much weight in that short of a period of time or even a much longer period of time should be attempted under the supervision of a medical doctor. If you could meet the weight standard in that period of time you could end-up doing serious damage to the rest of your health. The date that you the recruiter gave you to meet that weight standard could not be the only date that MEPS would be open. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "Originally posted by Cjeff88: Ok my recruiter kinda gave me a short notice that I get to go to MEP's in about a week. And have to lose weight I'm 5'10\" 240lb's and gotta loose about 40ish pounds. I'v gone strickly water, fruits, veggys, situps, and pushups. Is there anything else I can do to lose weight faster I need to loose about 4\" off my waist to not have to do the ARMS step test. But have to lose 1\" to be able to do the ARMS step test. I want to stray away from doing the ARM's test cause of being worried I may not pass it.", 
        "reply": " This is as a moderator. Any information you receive on this forum can not be consider as medical advice. The loss of that much weight in that short of a period of time or even a much longer period of time should be attempted under the supervision of a medical doctor. If you could meet the weight standard in that period of time you could end-up doing serious damage to the rest of your health. The date that you the recruiter gave you to meet that weight standard could not be the only date that MEPS would be open. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_5230000912001", 
        "time": "2009-03-26 14:15:00", 
        "title": "MEPs help.", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by OldArmyLove: quote: Originally posted by Cjeff88: Ok my recruiter kinda gave me a short notice that I get to go to MEP's in about a week. And have to lose weight I'm 5'10\" 240lb's and gotta loose about 40ish pounds. I'v gone strickly water, fruits, veggys, situps, and pushups. Is there anything else I can do to lose weight faster I need to loose about 4\" off my waist to not have to do the ARMS step test. But have to lose 1\" to be able to do the ARMS step test. I want to stray away from doing the ARM's test cause of being worried I may not pass it. This is as a moderator. Any information you receive on this forum can not be consider as medical advice. The loss of that much weight in that short of a period of time or even a much longer period of time should be attempted under the supervision of a medical doctor. If you could meet the weight standard in that period of time you could end-up doing serious damage to the rest of your health. The date that you the recruiter gave you to meet that weight standard could not be the only date that MEPS would be open. So what would you say would be a safe time perioud to bump off that much weight? I need to head out ASAP thoe to be back home for my sons 1st birthday witch is in Oct.", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "Originally posted by OldArmyLove: quote: Originally posted by Cjeff88: Ok my recruiter kinda gave me a short notice that I get to go to MEP's in about a week. And have to lose weight I'm 5'10\" 240lb's and gotta loose about 40ish pounds. I'v gone strickly water, fruits, veggys, situps, and pushups. Is there anything else I can do to lose weight faster I need to loose about 4\" off my waist to not have to do the ARMS step test. But have to lose 1\" to be able to do the ARMS step test. I want to stray away from doing the ARM's test cause of being worried I may not pass it. This is as a moderator. Any information you receive on this forum can not be consider as medical advice. The loss of that much weight in that short of a period of time or even a much longer period of time should be attempted under the supervision of a medical doctor. If you could meet the weight standard in that period of time you could end-up doing serious damage to the rest of your health. The date that you the recruiter gave you to meet that weight standard could not be the only date that MEPS would be open.", 
        "reply": " So what would you say would be a safe time perioud to bump off that much weight? I need to head out ASAP thoe to be back home for my sons 1st birthday witch is in Oct.", 
        "threadID": "5291911282_5230000912001", 
        "time": "2009-03-26 15:21:00", 
        "title": "MEPs help.", 
        "userID": "Cjeff88"
    }
]