[
    {
        "content": "A robot uprising was mentioned on another thread, so I thought I'd post this and open it up for discussion. quote: Robot attacked Swedish factory worker Published: 28 Apr 09 10:12 CET Online: *http://www.thelocal.se/19120/20090428/* A Swedish company has been fined 25,000 kronor ($3,000) after a malfunctioning robot attacked and almost killed one of its workers at a factory north of Stockholm. Public prosecutor Leif Johansson mulled pressing charges against the firm but eventually opted to settle for a fine. \"I've never heard of a robot attacking somebody like this,\" he told news agency TT. The incident took place in June 2007 at a factory in Bålsta, north of Stockholm, when the industrial worker was trying to carry out maintenance on a defective machine generally used to lift heavy rocks. Thinking he had cut off the power supply, the man approached the robot with no sense of trepidation. But the robot suddenly came to life and grabbed a tight hold of the victim's head. The man succeeded in defending himself but not before suffering serious injuries. \"The man was very lucky. He broke four ribs and came close to losing his life,\" said Leif Johansson. The matter was subject to an investigation by both the Swedish Work Environment Authority (Arbetsmiljöverket) and the police. Prosecutor Johansson chastised the company for its inadequate safety procedures but he also placed part of the blame on the injured worker. Will all robots obey the Three Laws? Or will they split into factions - robots who abide by the Three Laws and more independent minded robots who consider the Asimovist robots fools?", 
        "intTime": 20090503, 
        "postID": 1, 
        "quote": "Robot attacked Swedish factory worker Published: 28 Apr 09 10:12 CET Online: *http://www.thelocal.se/19120/20090428/* A Swedish company has been fined 25,000 kronor ($3,000) after a malfunctioning robot attacked and almost killed one of its workers at a factory north of Stockholm. Public prosecutor Leif Johansson mulled pressing charges against the firm but eventually opted to settle for a fine. \"I've never heard of a robot attacking somebody like this,\" he told news agency TT. The incident took place in June 2007 at a factory in Bålsta, north of Stockholm, when the industrial worker was trying to carry out maintenance on a defective machine generally used to lift heavy rocks. Thinking he had cut off the power supply, the man approached the robot with no sense of trepidation. But the robot suddenly came to life and grabbed a tight hold of the victim's head. The man succeeded in defending himself but not before suffering serious injuries. \"The man was very lucky. He broke four ribs and came close to losing his life,\" said Leif Johansson. The matter was subject to an investigation by both the Swedish Work Environment Authority (Arbetsmiljöverket) and the police. Prosecutor Johansson chastised the company for its inadequate safety procedures but he also placed part of the blame on the injured worker.", 
        "reply": "A robot uprising was mentioned on another thread, so I thought I'd post this and open it up for discussion.  Will all robots obey the Three Laws? Or will they split into factions - robots who abide by the Three Laws and more independent minded robots who consider the Asimovist robots fools?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 21:58:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? BTW: I have worked on lines that it was impossible to render \"lock out, Tag out\" inert as well. And we ran 480v as well. Deenergizing the sub-assembly to work on was sometimes an all day job... LOL. Those were the good old days", 
        "intTime": 20090503, 
        "postID": 2, 
        "quote": "", 
        "reply": "Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? BTW: I have worked on lines that it was impossible to render \"lock out, Tag out\" inert as well. And we ran 480v as well. Deenergizing the sub-assembly to work on was sometimes an all day job... LOL. Those were the good old days", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:01:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? Star Trek? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090503, 
        "postID": 3, 
        "quote": "Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc?", 
        "reply": " Star Trek? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:05:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? Star Trek? Nope, a robot manufacturer >>http://www.fanucrobotics.com/ We had one other major brand... but these pieces of crap were tough to work on. The only reason I remember the brand name after 13 years", 
        "intTime": 20090503, 
        "postID": 4, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? Star Trek?", 
        "reply": " Nope, a robot manufacturer >>http://www.fanucrobotics.com/ We had one other major brand... but these pieces of crap were tough to work on. The only reason I remember the brand name after 13 years", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:06:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "and their coming for us......... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090503, 
        "postID": 5, 
        "quote": "", 
        "reply": "and their coming for us......... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:12:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh.", 
        "intTime": 20090503, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh.", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:13:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh. Made in China Yes? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090503, 
        "postID": 7, 
        "quote": "Originally posted by VeteranDad78: Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh.", 
        "reply": " Made in China Yes? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:17:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Justin's up to mischief again?", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "", 
        "reply": "Justin's up to mischief again?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:22:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "This sounds like a job for Will Smith!!! \"http://www.imdb.com/title/tt0343818/\"", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "", 
        "reply": "This sounds like a job for Will Smith!!! \"http://www.imdb.com/title/tt0343818/\"", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:30:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by m551sheridan: watching Science channel...... the Japanese, as you know are pretty good with the robotics thing. Well one professor has a human looking robot of himself that he plans on using in the class. It said he still has to control it but he can do that at home so he doesn't have to commute to work. Yepper GW, them robots is gonna get smart and take over. \"hAve No feAr! i Am YoUr fRieNd!\" - - said the sentient thing as it rapidly approached. Man has created machines to do his thinking and working for him... Therefore, his evolution has stopped, but theirs has not. That makes the inevitable inevitable - - Wandering and Wondering", 
        "intTime": 20090504, 
        "postID": 10, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by m551sheridan: watching Science channel...... the Japanese, as you know are pretty good with the robotics thing. Well one professor has a human looking robot of himself that he plans on using in the class. It said he still has to control it but he can do that at home so he doesn't have to commute to work. Yepper GW, them robots is gonna get smart and take over. \"hAve No feAr! i Am YoUr fRieNd!\" - - said the sentient thing as it rapidly approached. Man has created machines to do his thinking and working for him... Therefore, his evolution has stopped, but theirs has not. That makes the inevitable inevitable - -", 
        "reply": " Wandering and Wondering", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 04:21:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Everybody knows that this kind of thing has been going on for years just below the radar!! All you need to do is look at all the stories that go.....S.U.V. kills driver in roll over accident!!!.......Nine killed by S.U.V. in bus collision!! Little girl killed by S.U.V. crossing street!!.....Woman gravely injured by S.U.V. in parking lot!!.......Whole family slaughtered by S.U.V. in gruesome multi vehicle accident!!........Child killed when run over by S.U.V. Do you see the pattern here!!?? It's been going on for years!! YEARS, I TELLS YA!!! S.U.V.'s are murdering filthy creations of the proletariat, designed specifically to wipe us all OUT!! Is it time for my meds yet???", 
        "intTime": 20090504, 
        "postID": 11, 
        "quote": "", 
        "reply": "Everybody knows that this kind of thing has been going on for years just below the radar!! All you need to do is look at all the stories that go.....S.U.V. kills driver in roll over accident!!!.......Nine killed by S.U.V. in bus collision!! Little girl killed by S.U.V. crossing street!!.....Woman gravely injured by S.U.V. in parking lot!!.......Whole family slaughtered by S.U.V. in gruesome multi vehicle accident!!........Child killed when run over by S.U.V. Do you see the pattern here!!?? It's been going on for years!! YEARS, I TELLS YA!!! S.U.V.'s are murdering filthy creations of the proletariat, designed specifically to wipe us all OUT!! Is it time for my meds yet???", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 07:09:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "tawodi"
    }, 
    {
        "content": "Sorta like the song, \"In the year 2525\" by Zager and Evans, like prophecy! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090504, 
        "postID": 12, 
        "quote": "", 
        "reply": "Sorta like the song, \"In the year 2525\" by Zager and Evans, like prophecy! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 07:23:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Bergy46"
    }, 
    {
        "content": "My god I just bought a robot and now I am afraid to turn her on. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090504, 
        "postID": 13, 
        "quote": "", 
        "reply": "My god I just bought a robot and now I am afraid to turn her on. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 07:33:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "EOCRon"
    }, 
    {
        "content": "", 
        "intTime": 20090504, 
        "postID": 14, 
        "quote": "", 
        "reply": "", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:04:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 15, 
        "quote": "", 
        "reply": "I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:48:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" Maximilian from \"The Black Hole\" was pretty cool too but Gort will always my favorite. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 16, 
        "quote": "Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\"", 
        "reply": " Maximilian from \"The Black Hole\" was pretty cool too but Gort will always my favorite. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:53:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" OK, that's just waaaay too nerdish right there, dude,", 
        "intTime": 20090504, 
        "postID": 17, 
        "quote": "Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\"", 
        "reply": " OK, that's just waaaay too nerdish right there, dude,", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:56:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" OK, that's just waaaay too nerdish right there, dude, What, you wanted something with a posatronic brain? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 18, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" OK, that's just waaaay too nerdish right there, dude,", 
        "reply": " What, you wanted something with a posatronic brain? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 14:48:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Vicdude"
    }, 
    {
        "content": "No brain for me, please. But I will have the gravy and biscuits!", 
        "intTime": 20090504, 
        "postID": 19, 
        "quote": "", 
        "reply": "No brain for me, please. But I will have the gravy and biscuits!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 14:54:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "We may laugh now, but I don't think we'll be laughing when we're all riding in the \"humans only\" section of the bus. Some will no doubt quickly embrace our new metallic masters. By the time the truth is known, it will be too late...", 
        "intTime": 20090505, 
        "postID": 20, 
        "quote": "", 
        "reply": "We may laugh now, but I don't think we'll be laughing when we're all riding in the \"humans only\" section of the bus. Some will no doubt quickly embrace our new metallic masters. By the time the truth is known, it will be too late...", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-05 19:30:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "A robot uprising was mentioned on another thread, so I thought I'd post this and open it up for discussion. quote: Robot attacked Swedish factory worker Published: 28 Apr 09 10:12 CET Online: *http://www.thelocal.se/19120/20090428/* A Swedish company has been fined 25,000 kronor ($3,000) after a malfunctioning robot attacked and almost killed one of its workers at a factory north of Stockholm. Public prosecutor Leif Johansson mulled pressing charges against the firm but eventually opted to settle for a fine. \"I've never heard of a robot attacking somebody like this,\" he told news agency TT. The incident took place in June 2007 at a factory in Bålsta, north of Stockholm, when the industrial worker was trying to carry out maintenance on a defective machine generally used to lift heavy rocks. Thinking he had cut off the power supply, the man approached the robot with no sense of trepidation. But the robot suddenly came to life and grabbed a tight hold of the victim's head. The man succeeded in defending himself but not before suffering serious injuries. \"The man was very lucky. He broke four ribs and came close to losing his life,\" said Leif Johansson. The matter was subject to an investigation by both the Swedish Work Environment Authority (Arbetsmiljöverket) and the police. Prosecutor Johansson chastised the company for its inadequate safety procedures but he also placed part of the blame on the injured worker. Will all robots obey the Three Laws? Or will they split into factions - robots who abide by the Three Laws and more independent minded robots who consider the Asimovist robots fools?", 
        "intTime": 20090503, 
        "postID": 21, 
        "quote": "Robot attacked Swedish factory worker Published: 28 Apr 09 10:12 CET Online: *http://www.thelocal.se/19120/20090428/* A Swedish company has been fined 25,000 kronor ($3,000) after a malfunctioning robot attacked and almost killed one of its workers at a factory north of Stockholm. Public prosecutor Leif Johansson mulled pressing charges against the firm but eventually opted to settle for a fine. \"I've never heard of a robot attacking somebody like this,\" he told news agency TT. The incident took place in June 2007 at a factory in Bålsta, north of Stockholm, when the industrial worker was trying to carry out maintenance on a defective machine generally used to lift heavy rocks. Thinking he had cut off the power supply, the man approached the robot with no sense of trepidation. But the robot suddenly came to life and grabbed a tight hold of the victim's head. The man succeeded in defending himself but not before suffering serious injuries. \"The man was very lucky. He broke four ribs and came close to losing his life,\" said Leif Johansson. The matter was subject to an investigation by both the Swedish Work Environment Authority (Arbetsmiljöverket) and the police. Prosecutor Johansson chastised the company for its inadequate safety procedures but he also placed part of the blame on the injured worker.", 
        "reply": "A robot uprising was mentioned on another thread, so I thought I'd post this and open it up for discussion.  Will all robots obey the Three Laws? Or will they split into factions - robots who abide by the Three Laws and more independent minded robots who consider the Asimovist robots fools?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 21:58:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? BTW: I have worked on lines that it was impossible to render \"lock out, Tag out\" inert as well. And we ran 480v as well. Deenergizing the sub-assembly to work on was sometimes an all day job... LOL. Those were the good old days", 
        "intTime": 20090503, 
        "postID": 22, 
        "quote": "", 
        "reply": "Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? BTW: I have worked on lines that it was impossible to render \"lock out, Tag out\" inert as well. And we ran 480v as well. Deenergizing the sub-assembly to work on was sometimes an all day job... LOL. Those were the good old days", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:01:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? Star Trek? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090503, 
        "postID": 23, 
        "quote": "Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc?", 
        "reply": " Star Trek? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:05:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: Originally posted by mikeyR8: quote: Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? Star Trek? Nope, a robot manufacturer >>http://www.fanucrobotics.com/ We had one other major brand... but these pieces of crap were tough to work on. The only reason I remember the brand name after 13 years", 
        "intTime": 20090503, 
        "postID": 24, 
        "quote": "Originally posted by mikeyR8: quote: Originally posted by ArtMarsh: Jeeze... all the guy did was trip one of the robot's sensors and its program took over. We are not to the point of Asmov's three laws yet. Wonder if it was a Fanuc? Star Trek?", 
        "reply": " Nope, a robot manufacturer >>http://www.fanucrobotics.com/ We had one other major brand... but these pieces of crap were tough to work on. The only reason I remember the brand name after 13 years", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:06:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "and their coming for us......... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090503, 
        "postID": 25, 
        "quote": "", 
        "reply": "and their coming for us......... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:12:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh.", 
        "intTime": 20090503, 
        "postID": 26, 
        "quote": "", 
        "reply": "Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh.", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:13:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh. Made in China Yes? Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090503, 
        "postID": 27, 
        "quote": "Originally posted by VeteranDad78: Just on the news... the robot is claiming it's \"hard drive\" made it do it I agree with Art Marsh.", 
        "reply": " Made in China Yes? Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:17:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Justin's up to mischief again?", 
        "intTime": 20090503, 
        "postID": 28, 
        "quote": "", 
        "reply": "Justin's up to mischief again?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:22:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "This sounds like a job for Will Smith!!! \"http://www.imdb.com/title/tt0343818/\"", 
        "intTime": 20090503, 
        "postID": 29, 
        "quote": "", 
        "reply": "This sounds like a job for Will Smith!!! \"http://www.imdb.com/title/tt0343818/\"", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-03 22:30:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by m551sheridan: watching Science channel...... the Japanese, as you know are pretty good with the robotics thing. Well one professor has a human looking robot of himself that he plans on using in the class. It said he still has to control it but he can do that at home so he doesn't have to commute to work. Yepper GW, them robots is gonna get smart and take over. \"hAve No feAr! i Am YoUr fRieNd!\" - - said the sentient thing as it rapidly approached. Man has created machines to do his thinking and working for him... Therefore, his evolution has stopped, but theirs has not. That makes the inevitable inevitable - - Wandering and Wondering", 
        "intTime": 20090504, 
        "postID": 30, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by m551sheridan: watching Science channel...... the Japanese, as you know are pretty good with the robotics thing. Well one professor has a human looking robot of himself that he plans on using in the class. It said he still has to control it but he can do that at home so he doesn't have to commute to work. Yepper GW, them robots is gonna get smart and take over. \"hAve No feAr! i Am YoUr fRieNd!\" - - said the sentient thing as it rapidly approached. Man has created machines to do his thinking and working for him... Therefore, his evolution has stopped, but theirs has not. That makes the inevitable inevitable - -", 
        "reply": " Wandering and Wondering", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 04:21:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Everybody knows that this kind of thing has been going on for years just below the radar!! All you need to do is look at all the stories that go.....S.U.V. kills driver in roll over accident!!!.......Nine killed by S.U.V. in bus collision!! Little girl killed by S.U.V. crossing street!!.....Woman gravely injured by S.U.V. in parking lot!!.......Whole family slaughtered by S.U.V. in gruesome multi vehicle accident!!........Child killed when run over by S.U.V. Do you see the pattern here!!?? It's been going on for years!! YEARS, I TELLS YA!!! S.U.V.'s are murdering filthy creations of the proletariat, designed specifically to wipe us all OUT!! Is it time for my meds yet???", 
        "intTime": 20090504, 
        "postID": 31, 
        "quote": "", 
        "reply": "Everybody knows that this kind of thing has been going on for years just below the radar!! All you need to do is look at all the stories that go.....S.U.V. kills driver in roll over accident!!!.......Nine killed by S.U.V. in bus collision!! Little girl killed by S.U.V. crossing street!!.....Woman gravely injured by S.U.V. in parking lot!!.......Whole family slaughtered by S.U.V. in gruesome multi vehicle accident!!........Child killed when run over by S.U.V. Do you see the pattern here!!?? It's been going on for years!! YEARS, I TELLS YA!!! S.U.V.'s are murdering filthy creations of the proletariat, designed specifically to wipe us all OUT!! Is it time for my meds yet???", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 07:09:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "tawodi"
    }, 
    {
        "content": "Sorta like the song, \"In the year 2525\" by Zager and Evans, like prophecy! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090504, 
        "postID": 32, 
        "quote": "", 
        "reply": "Sorta like the song, \"In the year 2525\" by Zager and Evans, like prophecy! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 07:23:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Bergy46"
    }, 
    {
        "content": "My god I just bought a robot and now I am afraid to turn her on. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090504, 
        "postID": 33, 
        "quote": "", 
        "reply": "My god I just bought a robot and now I am afraid to turn her on. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 07:33:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "EOCRon"
    }, 
    {
        "content": "", 
        "intTime": 20090504, 
        "postID": 34, 
        "quote": "", 
        "reply": "", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:04:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 35, 
        "quote": "", 
        "reply": "I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:48:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" Maximilian from \"The Black Hole\" was pretty cool too but Gort will always my favorite. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 36, 
        "quote": "Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\"", 
        "reply": " Maximilian from \"The Black Hole\" was pretty cool too but Gort will always my favorite. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:53:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" OK, that's just waaaay too nerdish right there, dude,", 
        "intTime": 20090504, 
        "postID": 37, 
        "quote": "Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\"", 
        "reply": " OK, that's just waaaay too nerdish right there, dude,", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 13:56:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "billdawg24"
    }, 
    {
        "content": "quote: Originally posted by billdawg24: quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" OK, that's just waaaay too nerdish right there, dude, What, you wanted something with a posatronic brain? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090504, 
        "postID": 38, 
        "quote": "Originally posted by billdawg24: quote: Originally posted by Vicdude: I thought they were using Gort. \"Gort, Klaatu barada nikto!.\" OK, that's just waaaay too nerdish right there, dude,", 
        "reply": " What, you wanted something with a posatronic brain? How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 14:48:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "Vicdude"
    }, 
    {
        "content": "No brain for me, please. But I will have the gravy and biscuits!", 
        "intTime": 20090504, 
        "postID": 39, 
        "quote": "", 
        "reply": "No brain for me, please. But I will have the gravy and biscuits!", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-04 14:54:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "We may laugh now, but I don't think we'll be laughing when we're all riding in the \"humans only\" section of the bus. Some will no doubt quickly embrace our new metallic masters. By the time the truth is known, it will be too late...", 
        "intTime": 20090505, 
        "postID": 40, 
        "quote": "", 
        "reply": "We may laugh now, but I don't think we'll be laughing when we're all riding in the \"humans only\" section of the bus. Some will no doubt quickly embrace our new metallic masters. By the time the truth is known, it will be too late...", 
        "threadID": "5291911282_2380024222001", 
        "time": "2009-05-05 19:30:00", 
        "title": "Robot attacked Swedish factory worker", 
        "userID": "DCookeUSA1"
    }
]