[
    {
        "content": "What do Hoover , Truman & Eisenhower Have in Common? HOOVER , TRUMAN AND EISENHOWER Here is something that should be of great interest for you to pass around. I didn't know of this until it was pointed out to me. Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million=2 0Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! lf you have doubts about the veracity of this information, enter Operation Wetback into your favorite search engine and confirm it for yourself. Reminder. Don't forget to pay your taxes... 12 million Illegal Aliens are depending on you \"http://en.wikipedia.org/wiki/Operation_Wetback\" SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "", 
        "reply": "What do Hoover , Truman & Eisenhower Have in Common? HOOVER , TRUMAN AND EISENHOWER Here is something that should be of great interest for you to pass around. I didn't know of this until it was pointed out to me. Back during The Great Depression, President Herbert Hoover ordered the deportation of ALL illegal aliens in order to make jobs available to American citizens that desperately needed work. Harry Truman deported over two million=2 0Illegal's after WWII to create jobs for returning veterans. And then again in 1954, President Dwight Eisenhower deported 13 million Mexican nationals! The program was called 'Operation Wetback' so that American WWII and Korean veterans had a better chance at jobs. It took 2 Years, but they deported them! Now, if they could deport the illegal's back then, they can sure do it today!! lf you have doubts about the veracity of this information, enter Operation Wetback into your favorite search engine and confirm it for yourself. Reminder. Don't forget to pay your taxes... 12 million Illegal Aliens are depending on you \"http://en.wikipedia.org/wiki/Operation_Wetback\" SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 08:59:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Makes sense to me - If we bring back all the troops into a Depressed Economy - where do you put them??? 11 million illegals should be living off from the welfare of their own countries, not ours - - Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "", 
        "reply": "Makes sense to me - If we bring back all the troops into a Depressed Economy - where do you put them??? 11 million illegals should be living off from the welfare of their own countries, not ours - - Wandering and Wondering", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 09:06:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Let's not forget Hoover's treatment of the \"Bonus Army\"", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "", 
        "reply": "Let's not forget Hoover's treatment of the \"Bonus Army\"", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 10:27:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Makes sense to me - If we bring back all the troops into a Depressed Economy - where do you put them??? 11 million illegals should be living off from the welfare of their own countries, not ours - - As long as they're kept on active duty, there won't be a problem, except for housing. When the Soldiers from the Big Red One were re-based in Kansas, I think there was a problem with housing in the Ft. Riley area. One brigade went to Hood, but I don't know why. Actually, the local economy of wherever they go will see a nice boom.", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "Originally posted by greywolfghost: Makes sense to me - If we bring back all the troops into a Depressed Economy - where do you put them??? 11 million illegals should be living off from the welfare of their own countries, not ours - -", 
        "reply": " As long as they're kept on active duty, there won't be a problem, except for housing. When the Soldiers from the Big Red One were re-based in Kansas, I think there was a problem with housing in the Ft. Riley area. One brigade went to Hood, but I don't know why. Actually, the local economy of wherever they go will see a nice boom.", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 10:34:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party.", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party.", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 10:35:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "nn68"
    }, 
    {
        "content": "quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator", 
        "intTime": 20090326, 
        "postID": 6, 
        "quote": "Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party.", 
        "reply": " You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 10:40:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "Not necessarily an insult. The \"Know-Nothings\" more formally know as The American Party were nativists who were against American jobs going to arriving aliens/immigrants prior to the Civil War. They were also anti-slavery, because they did not want more slaves being brought into America to do jobs either. They were welcomed into the new Republican Party, along with the Whigs and other smaller groups to get a large enough consensus to elect a president. That President was Abraham Lincoln... Nativism always pops up in rough times, and the more recent arrivals are always targeted for return tickets when jobs get scarce. It just shows how bad things really are right now... \"Who do you want jobs for, your kids or the last group that crossed the border?\" The pie is only so big, and the population isn't getting any smaller... Something's got to give - - Oh, a homeless couple froze to death in a park in Salt Lake City last night. Wonder how many illegals have jobs there - - ( I'm trying to be the diplomat here...shortened sentence for good behavior?? ) Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 7, 
        "quote": "", 
        "reply": "Not necessarily an insult. The \"Know-Nothings\" more formally know as The American Party were nativists who were against American jobs going to arriving aliens/immigrants prior to the Civil War. They were also anti-slavery, because they did not want more slaves being brought into America to do jobs either. They were welcomed into the new Republican Party, along with the Whigs and other smaller groups to get a large enough consensus to elect a president. That President was Abraham Lincoln... Nativism always pops up in rough times, and the more recent arrivals are always targeted for return tickets when jobs get scarce. It just shows how bad things really are right now... \"Who do you want jobs for, your kids or the last group that crossed the border?\" The pie is only so big, and the population isn't getting any smaller... Something's got to give - - Oh, a homeless couple froze to death in a park in Salt Lake City last night. Wonder how many illegals have jobs there - - ( I'm trying to be the diplomat here...shortened sentence for good behavior?? ) Wandering and Wondering", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 11:12:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "GWG, re. 11 million, excellent idea, why should they take what belongs to legal citizens of our country? Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090326, 
        "postID": 8, 
        "quote": "", 
        "reply": "GWG, re. 11 million, excellent idea, why should they take what belongs to legal citizens of our country? Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 11:48:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator I am sorry, I am not trying to act like a jerk, but what insult did I say? I honestly have no idea.", 
        "intTime": 20090326, 
        "postID": 9, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator", 
        "reply": " I am sorry, I am not trying to act like a jerk, but what insult did I say? I honestly have no idea.", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 12:36:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "nn68"
    }, 
    {
        "content": "quote: Originally posted by nn68: quote: Originally posted by gypsysnipe: quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator I am sorry, I am not trying to act like a jerk, but what insult did I say? I honestly have no idea. After reading the entire topic, I withdraw my previous statement. I typed too quickly. My apologies. Gypsysnipe Moderator", 
        "intTime": 20090326, 
        "postID": 10, 
        "quote": "Originally posted by nn68: quote: Originally posted by gypsysnipe: quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator I am sorry, I am not trying to act like a jerk, but what insult did I say? I honestly have no idea.", 
        "reply": " After reading the entire topic, I withdraw my previous statement. I typed too quickly. My apologies. Gypsysnipe Moderator", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 12:41:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: quote: Originally posted by nn68: quote: Originally posted by gypsysnipe: quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator I am sorry, I am not trying to act like a jerk, but what insult did I say? I honestly have no idea. After reading the entire topic, I withdraw my previous statement. I typed too quickly. My apologies. Gypsysnipe Moderator No Problem, it is still party my fault. I need to tread with a lighter step. I am new on this forum and I have posted in a cavalier, pompous, manner. On topic, all immigrants that are here in this Country should be absolutely allowed to stay. The closing of our borders I support in totality but most of the people who have illegally immigrated are honest, poor, hard working people that do jobs that most American's think are below them. They should and must be allowed to stay, especially as most now have tangible roots in this country.", 
        "intTime": 20090326, 
        "postID": 11, 
        "quote": "Originally posted by gypsysnipe: quote: Originally posted by nn68: quote: Originally posted by gypsysnipe: quote: Originally posted by nn68: Shining example of our compactly for compassion to our fellow man. We should go back further and look at the great hero's of the know nothing party. You are already on warning, do you wish to be suspended? No? Then stop with the insults. Gypsysnipe Moderator I am sorry, I am not trying to act like a jerk, but what insult did I say? I honestly have no idea. After reading the entire topic, I withdraw my previous statement. I typed too quickly. My apologies. Gypsysnipe Moderator", 
        "reply": " No Problem, it is still party my fault. I need to tread with a lighter step. I am new on this forum and I have posted in a cavalier, pompous, manner. On topic, all immigrants that are here in this Country should be absolutely allowed to stay. The closing of our borders I support in totality but most of the people who have illegally immigrated are honest, poor, hard working people that do jobs that most American's think are below them. They should and must be allowed to stay, especially as most now have tangible roots in this country.", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 12:46:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "nn68"
    }, 
    {
        "content": "quote: On topic, all immigrants that are here in this Country should be absolutely allowed to stay. The closing of our borders I support in totality but most of the people who have illegally immigrated are honest, poor, hard working people that do jobs that most American's think are below them. They should and must be allowed to stay, especially as most now have tangible roots in this country. I'd have to disagree with the \"honest\" part, since they've done everything possible to hide their illegality, often including phony IDs, SS numbers and other such lies. The first to come, as path finders, then relay to others all the necessary tricks to circumvent and thwart the law back to others, who come as a flood. They often do everything they can to avoid assimilation and Americanization, creating a rift in the social fabric that could eventually lead to a shattering of the Southwest United States; and they ship millions and millions of dollars out of the economy to relatives back home - money that could and should be spent here... Wandering and Wondering", 
        "intTime": 20090326, 
        "postID": 12, 
        "quote": "On topic, all immigrants that are here in this Country should be absolutely allowed to stay. The closing of our borders I support in totality but most of the people who have illegally immigrated are honest, poor, hard working people that do jobs that most American's think are below them. They should and must be allowed to stay, especially as most now have tangible roots in this country.", 
        "reply": " I'd have to disagree with the \"honest\" part, since they've done everything possible to hide their illegality, often including phony IDs, SS numbers and other such lies. The first to come, as path finders, then relay to others all the necessary tricks to circumvent and thwart the law back to others, who come as a flood. They often do everything they can to avoid assimilation and Americanization, creating a rift in the social fabric that could eventually lead to a shattering of the Southwest United States; and they ship millions and millions of dollars out of the economy to relatives back home - money that could and should be spent here... Wandering and Wondering", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-26 14:20:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by mfdaniels_rph: Let's not forget Hoover's treatment of the \"Bonus Army\" If there is one villan it was Douglas MacArthur. He disobayed the president's orders and had his troops open fire on vets and their families. Hoover's big mistake was not firing MacArthur. The veterans fled across the Anacostia River, to their largest camp; President Hoover ordered the Army assault stopped, however, Gen. MacArthur—feeling this free-speech exercise was a Communist attempt at overthrowing the U.S. Government—ignored the President and ordered a new attack. Hundreds of veterans were injured, several were killed — including William Hushka and Eric Carlson; a veteran's wife miscarried; and many other veterans were hurt. \"http://en.wikipedia.org/wiki/Bonus_Army\" A footnote: The break-up of the Bonus Army in Washington was conducted by Army Chief of Staff and World War I veteran Douglas MacArthur, assisted by Majors George Patton and Dwight Eisenhower. MacArthur is considered to have exceeded President Hoover's intentions [and possibly his explicit instructions] with his heavy-handedness \"http://www.worldwar1.com/dbc/bonusm.htm\"", 
        "intTime": 20090327, 
        "postID": 13, 
        "quote": "Originally posted by mfdaniels_rph: Let's not forget Hoover's treatment of the \"Bonus Army\"", 
        "reply": " If there is one villan it was Douglas MacArthur. He disobayed the president's orders and had his troops open fire on vets and their families. Hoover's big mistake was not firing MacArthur. The veterans fled across the Anacostia River, to their largest camp; President Hoover ordered the Army assault stopped, however, Gen. MacArthur—feeling this free-speech exercise was a Communist attempt at overthrowing the U.S. Government—ignored the President and ordered a new attack. Hundreds of veterans were injured, several were killed — including William Hushka and Eric Carlson; a veteran's wife miscarried; and many other veterans were hurt. \"http://en.wikipedia.org/wiki/Bonus_Army\" A footnote: The break-up of the Bonus Army in Washington was conducted by Army Chief of Staff and World War I veteran Douglas MacArthur, assisted by Majors George Patton and Dwight Eisenhower. MacArthur is considered to have exceeded President Hoover's intentions [and possibly his explicit instructions] with his heavy-handedness \"http://www.worldwar1.com/dbc/bonusm.htm\"", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-27 01:34:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Yep, that is one of the most paradoxical events in American history - right in there with the Indian Removal/Trail of Tears (and all follow-on massacres) and the brutal expulsion of the Mormons. The \"Bonus Army\" Veterans actually cheered when they first saw the soldiers, since they thought they were looking at their peers in arms. Only when the tear gas came in did they realize what was about to happen. As for MacArthur, about the only justification for his actions can come from events such as Shay's Rebellion and the Whiskey Rebellion, where local militias rose up in defiance of laws passed by the Federal Government. Those were armed rebellions, and don't really apply, but MacArthur may have thought it was a similar defiance of authority - - But the Bonus Army had NOT brought their guns to town. They were loyal former soldiers/citizens who were unemployed, desperate, and only asking for what they thought was due them for service rendered. A short time later Franklin D. Roosevelt sat down with their leaders and figured out some solutions. A little talk, a listening ear and some needed help - the problem began to go away - - Wandering and Wondering", 
        "intTime": 20090327, 
        "postID": 14, 
        "quote": "", 
        "reply": "Yep, that is one of the most paradoxical events in American history - right in there with the Indian Removal/Trail of Tears (and all follow-on massacres) and the brutal expulsion of the Mormons. The \"Bonus Army\" Veterans actually cheered when they first saw the soldiers, since they thought they were looking at their peers in arms. Only when the tear gas came in did they realize what was about to happen. As for MacArthur, about the only justification for his actions can come from events such as Shay's Rebellion and the Whiskey Rebellion, where local militias rose up in defiance of laws passed by the Federal Government. Those were armed rebellions, and don't really apply, but MacArthur may have thought it was a similar defiance of authority - - But the Bonus Army had NOT brought their guns to town. They were loyal former soldiers/citizens who were unemployed, desperate, and only asking for what they thought was due them for service rendered. A short time later Franklin D. Roosevelt sat down with their leaders and figured out some solutions. A little talk, a listening ear and some needed help - the problem began to go away - - Wandering and Wondering", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-27 06:50:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by mfdaniels_rph: Let's not forget Hoover's treatment of the \"Bonus Army\" If there is one villan it was Douglas MacArthur. He disobayed the president's orders and had his troops open fire on vets and their families. Hoover's big mistake was not firing MacArthur. The veterans fled across the Anacostia River, to their largest camp; President Hoover ordered the Army assault stopped, however, Gen. MacArthur—feeling this free-speech exercise was a Communist attempt at overthrowing the U.S. Government—ignored the President and ordered a new attack. Hundreds of veterans were injured, several were killed — including William Hushka and Eric Carlson; a veteran's wife miscarried; and many other veterans were hurt. \"http://en.wikipedia.org/wiki/Bonus_Army\" A footnote: The break-up of the Bonus Army in Washington was conducted by Army Chief of Staff and World War I veteran Douglas MacArthur, assisted by Majors George Patton and Dwight Eisenhower. MacArthur is considered to have exceeded President Hoover's intentions [and possibly his explicit instructions] with his heavy-handedness \"http://www.worldwar1.com/dbc/bonusm.htm\" Yes it is very true that MacArthur disobeyed Hoover's order to stop the removal of veterans, that he had previously ordered earlier. On 28 July, 1932, Attorney General Mitchell ordered the police evacuation of the Bonus Army veterans, who resisted; the police shot at them, and killed two. When told of the killings, President Hoover ordered the U.S. Army to effect the evacuation of the Bonus Army from Washington, D.C. wikipedia.", 
        "intTime": 20090327, 
        "postID": 15, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by mfdaniels_rph: Let's not forget Hoover's treatment of the \"Bonus Army\" If there is one villan it was Douglas MacArthur. He disobayed the president's orders and had his troops open fire on vets and their families. Hoover's big mistake was not firing MacArthur. The veterans fled across the Anacostia River, to their largest camp; President Hoover ordered the Army assault stopped, however, Gen. MacArthur—feeling this free-speech exercise was a Communist attempt at overthrowing the U.S. Government—ignored the President and ordered a new attack. Hundreds of veterans were injured, several were killed — including William Hushka and Eric Carlson; a veteran's wife miscarried; and many other veterans were hurt. \"http://en.wikipedia.org/wiki/Bonus_Army\" A footnote: The break-up of the Bonus Army in Washington was conducted by Army Chief of Staff and World War I veteran Douglas MacArthur, assisted by Majors George Patton and Dwight Eisenhower. MacArthur is considered to have exceeded President Hoover's intentions [and possibly his explicit instructions] with his heavy-handedness \"http://www.worldwar1.com/dbc/bonusm.htm\"", 
        "reply": " Yes it is very true that MacArthur disobeyed Hoover's order to stop the removal of veterans, that he had previously ordered earlier. On 28 July, 1932, Attorney General Mitchell ordered the police evacuation of the Bonus Army veterans, who resisted; the police shot at them, and killed two. When told of the killings, President Hoover ordered the U.S. Army to effect the evacuation of the Bonus Army from Washington, D.C. wikipedia.", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-27 07:25:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "MacArthur's heavy handed actions that day pretty much sealed Hoover's fate in the election. From what I have read about MacArthur he was a real piece of work. They say the real driving force behind him was his mother. The woman moved to West Point for the sole purpose of promoting him. Later she would write letters to get him promoted, etc.", 
        "intTime": 20090327, 
        "postID": 16, 
        "quote": "", 
        "reply": "MacArthur's heavy handed actions that day pretty much sealed Hoover's fate in the election. From what I have read about MacArthur he was a real piece of work. They say the real driving force behind him was his mother. The woman moved to West Point for the sole purpose of promoting him. Later she would write letters to get him promoted, etc.", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-27 08:09:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "mfdaniels_rph"
    }, 
    {
        "content": "MacArthur, Patton, and Eisenhower were good, loyal, patriotic American soldiers with service in WW I, yet they turned their troops, many of which had probably fought in WW I also, on American citizens and drove them like cattle at bayonet point, supported by tear gas and tanks. I do not know for certain if the troops ever fired bullets at any of the Bonus Army - - But this does cause me to smirk a bit ryely any time I hear or see someone say that, if ordered to, Federal Troops would never turn on the American People! . . . . Since when? Wandering and Wondering", 
        "intTime": 20090327, 
        "postID": 17, 
        "quote": "", 
        "reply": "MacArthur, Patton, and Eisenhower were good, loyal, patriotic American soldiers with service in WW I, yet they turned their troops, many of which had probably fought in WW I also, on American citizens and drove them like cattle at bayonet point, supported by tear gas and tanks. I do not know for certain if the troops ever fired bullets at any of the Bonus Army - - But this does cause me to smirk a bit ryely any time I hear or see someone say that, if ordered to, Federal Troops would never turn on the American People! . . . . Since when? Wandering and Wondering", 
        "threadID": "5291911282_9550069812001", 
        "time": "2009-03-27 15:40:00", 
        "title": "What do Hoover , Truman & Eisenhower Have in Common?", 
        "userID": "greywolfghost"
    }
]