[
    {
        "content": "Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "", 
        "reply": "Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 04:30:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "FMI, try the Q&A on You Tube! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "", 
        "reply": "FMI, try the Q&A on You Tube! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 07:31:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: FMI, try the Q&A on You Tube! Duh. Did that. No luck. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 3, 
        "quote": "Originally posted by Bergy46: FMI, try the Q&A on You Tube!", 
        "reply": " Duh. Did that. No luck. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 07:53:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090523, 
        "postID": 4, 
        "quote": "Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\"", 
        "reply": " Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:01:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090523, 
        "postID": 5, 
        "quote": "The Perfect Game", 
        "reply": " \"The Perfect Game\" is episode 170 not 183. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:12:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "intTime": 20090523, 
        "postID": 6, 
        "quote": "Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183.", 
        "reply": " Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:35:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for.", 
        "intTime": 20090523, 
        "postID": 7, 
        "quote": "Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\"", 
        "reply": " Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:40:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball. Season 6, episode 133, production #615 aired 02/20/00 also called \"The Perfect Game\" or episode 170 and no production # listed, aired 10/06/01 also called \"The Perfect Game\"? The OP stated the air date and name. My error noted. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090523, 
        "postID": 8, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "reply": " Season 6, episode 133, production #615 aired 02/20/00 also called \"The Perfect Game\" or episode 170 and no production # listed, aired 10/06/01 also called \"The Perfect Game\"? The OP stated the air date and name. My error noted. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 12:01:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball. Ah, then that is why the description is wrong. I need the bowling one. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 9, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "reply": " Ah, then that is why the description is wrong. I need the bowling one. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 12:37:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all WOW! Cool sites! But, sadly, no - they don't help. I need the VIDEO that I can send via a link, like a YouTube. Thanks though, bro! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 10, 
        "quote": "Originally posted by sargeant_green: quote: Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all", 
        "reply": " WOW! Cool sites! But, sadly, no - they don't help. I need the VIDEO that I can send via a link, like a YouTube. Thanks though, bro! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 12:54:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for. Thank you, my friend. Alas, all those are the wrong episode, and trying to navigate from there in an associated search has produced nothing. Sigh It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 11, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for.", 
        "reply": " Thank you, my friend. Alas, all those are the wrong episode, and trying to navigate from there in an associated search has produced nothing. Sigh It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 13:00:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: FMI, try the Q&A on You Tube! Duh. Did that. No luck. Sorry bout that bro. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 12, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: FMI, try the Q&A on You Tube! Duh. Did that. No luck.", 
        "reply": " Sorry bout that bro. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 16:45:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "It don't freaking matter anymore. What I wanted to say no longer needs to be said. I'm just a dumb grunt. Mods, lock this, please. There is no sense in wasting energy to look for something that no one wants to hear. Thanks. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 13, 
        "quote": "", 
        "reply": "It don't freaking matter anymore. What I wanted to say no longer needs to be said. I'm just a dumb grunt. Mods, lock this, please. There is no sense in wasting energy to look for something that no one wants to hear. Thanks. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 17:10:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "\"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments.", 
        "intTime": 20090524, 
        "postID": 14, 
        "quote": "", 
        "reply": "\"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 01:49:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: \"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments. Thanks so much, Karl. But that is the wrong episode. The one I was looking for involved bowling, not baseball, and it appears that they named the two episodes the same thing. Rats! But, again, thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 15, 
        "quote": "Originally posted by karlhungusjr: \"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments.", 
        "reply": " Thanks so much, Karl. But that is the wrong episode. The one I was looking for involved bowling, not baseball, and it appears that they named the two episodes the same thing. Rats! But, again, thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 04:04:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090524, 
        "postID": 16, 
        "quote": "I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement.", 
        "reply": " Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 06:13:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 17, 
        "quote": "Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted.", 
        "reply": " I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 06:23:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage", 
        "intTime": 20090524, 
        "postID": 18, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that.", 
        "reply": " I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 08:36:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage Cool! Email sent! Thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 19, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage", 
        "reply": " Cool! Email sent! Thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 09:23:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage Cool! Email sent! Thank you! and its being shipped [uploaded] now. -- what you really needed was a pirate. [avast me mateys] --Savage", 
        "intTime": 20090524, 
        "postID": 20, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage Cool! Email sent! Thank you!", 
        "reply": " and its being shipped [uploaded] now. -- what you really needed was a pirate. [avast me mateys] --Savage", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 12:06:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 21, 
        "quote": "", 
        "reply": "Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 04:30:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "FMI, try the Q&A on You Tube! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 22, 
        "quote": "", 
        "reply": "FMI, try the Q&A on You Tube! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 07:31:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: FMI, try the Q&A on You Tube! Duh. Did that. No luck. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 23, 
        "quote": "Originally posted by Bergy46: FMI, try the Q&A on You Tube!", 
        "reply": " Duh. Did that. No luck. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 07:53:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090523, 
        "postID": 24, 
        "quote": "Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\"", 
        "reply": " Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:01:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090523, 
        "postID": 25, 
        "quote": "The Perfect Game", 
        "reply": " \"The Perfect Game\" is episode 170 not 183. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:12:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "intTime": 20090523, 
        "postID": 26, 
        "quote": "Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183.", 
        "reply": " Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:35:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for.", 
        "intTime": 20090523, 
        "postID": 27, 
        "quote": "Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\"", 
        "reply": " Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 11:40:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball. Season 6, episode 133, production #615 aired 02/20/00 also called \"The Perfect Game\" or episode 170 and no production # listed, aired 10/06/01 also called \"The Perfect Game\"? The OP stated the air date and name. My error noted. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090523, 
        "postID": 28, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "reply": " Season 6, episode 133, production #615 aired 02/20/00 also called \"The Perfect Game\" or episode 170 and no production # listed, aired 10/06/01 also called \"The Perfect Game\"? The OP stated the air date and name. My error noted. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 12:01:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball. Ah, then that is why the description is wrong. I need the bowling one. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 29, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by sargeant_green: quote: The Perfect Game \"The Perfect Game\" is episode 170 not 183. Season 6 episode 14 and season 8 episode 3 are both titled \"The Perfect Game\" Season 6 is bowling and season 8 is baseball.", 
        "reply": " Ah, then that is why the description is wrong. I need the bowling one. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 12:37:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all WOW! Cool sites! But, sadly, no - they don't help. I need the VIDEO that I can send via a link, like a YouTube. Thanks though, bro! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 30, 
        "quote": "Originally posted by sargeant_green: quote: Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Will this help? http://epguides.com/TouchedbyanAngel/ or http://www.tvrage.com/shows/id-6392/episode_list/all", 
        "reply": " WOW! Cool sites! But, sadly, no - they don't help. I need the VIDEO that I can send via a link, like a YouTube. Thanks though, bro! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 12:54:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for. Thank you, my friend. Alas, all those are the wrong episode, and trying to navigate from there in an associated search has produced nothing. Sigh It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 31, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by FollowMeInfantry: Man, I have been searching for a video all freaking morning long. I'm an electrician, not an Internet pro-boarder, and I am getting frustrated. I need to find a FREE and LEGAL video (like You Tube) of an episode of \"Touched By An Angel\" to link to a friend. There is a message in there that I cannot and will not say, choosing instead to let it speak for me in a certain segment towards the end of the episode. I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Can you help me dig up a YouTube-ish video of this, please? I'd be very grateful. Touched by an Angel Episode 183 Original air date: 06 Oct 2001 (10/06/01) \"The Perfect Game\" Do a google video search for \"touched by an angel the perfect game\" and there are 5 excerpts from the show, I don't know if any of them have the specific part you are looking for.", 
        "reply": " Thank you, my friend. Alas, all those are the wrong episode, and trying to navigate from there in an associated search has produced nothing. Sigh It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 13:00:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: FMI, try the Q&A on You Tube! Duh. Did that. No luck. Sorry bout that bro. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090523, 
        "postID": 32, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Bergy46: FMI, try the Q&A on You Tube! Duh. Did that. No luck.", 
        "reply": " Sorry bout that bro. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 16:45:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "Bergy46"
    }, 
    {
        "content": "It don't freaking matter anymore. What I wanted to say no longer needs to be said. I'm just a dumb grunt. Mods, lock this, please. There is no sense in wasting energy to look for something that no one wants to hear. Thanks. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 33, 
        "quote": "", 
        "reply": "It don't freaking matter anymore. What I wanted to say no longer needs to be said. I'm just a dumb grunt. Mods, lock this, please. There is no sense in wasting energy to look for something that no one wants to hear. Thanks. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-23 17:10:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "\"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments.", 
        "intTime": 20090524, 
        "postID": 34, 
        "quote": "", 
        "reply": "\"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 01:49:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: \"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments. Thanks so much, Karl. But that is the wrong episode. The one I was looking for involved bowling, not baseball, and it appears that they named the two episodes the same thing. Rats! But, again, thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 35, 
        "quote": "Originally posted by karlhungusjr: \"http://video.google.com/videosearch?hl=en&ie=UTF-8&q=%22touched%20by%20an%20angel%22%20bowling&sa=N&tab=wv&um=1#q=%22touched+by+an+angel%22+perfect+game&hl=en&emb=0\" It should be the entire episode in ten minute increments.", 
        "reply": " Thanks so much, Karl. But that is the wrong episode. The one I was looking for involved bowling, not baseball, and it appears that they named the two episodes the same thing. Rats! But, again, thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 04:04:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090524, 
        "postID": 36, 
        "quote": "I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement.", 
        "reply": " Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 06:13:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 37, 
        "quote": "Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted.", 
        "reply": " I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 06:23:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage", 
        "intTime": 20090524, 
        "postID": 38, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that.", 
        "reply": " I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 08:36:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage Cool! Email sent! Thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 39, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage", 
        "reply": " Cool! Email sent! Thank you! It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 09:23:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage Cool! Email sent! Thank you! and its being shipped [uploaded] now. -- what you really needed was a pirate. [avast me mateys] --Savage", 
        "intTime": 20090524, 
        "postID": 40, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by A_Savage: quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vicdude: quote: I recorded it via DVR, so I have its information. But I need something that I can link in an email and say, \"Fast forward to 47 minutes into it and watch from 0:47 to 0:52\" or some such statement. Do you have any way to burn a DVD from the DVR? If so just burn the part you want and upload it to Photobucket, hoping they don't kick it out for copyright infringement. Usually they allow small snippets to be posted. I actually called Dish about that, as Radio Shack sells an external storage drive for their equipment. According to the guy I spoke with, Dish encodes everything so that it can never be copied or burned. It is copyright enforcement, according to him. It appears that my only option is to buy the season and then send her the disk with instructions of where to look for the information I'd like her to have. Then again, I could just replay the episode in that time frame and type in an email the text... I'll probably just do that. I am downloading both right now. [bit busy so just scanned this thread] Email me at >savagestractor@yahoo.com let me know what part of which one you want and I will cut it out and upload it to rapidshare or the like.[or I can upload the whole show] --Savage Cool! Email sent! Thank you!", 
        "reply": " and its being shipped [uploaded] now. -- what you really needed was a pirate. [avast me mateys] --Savage", 
        "threadID": "5291911282_2620050422001", 
        "time": "2009-05-24 12:06:00", 
        "title": "Google and search geniuses - I need you!", 
        "userID": "A_Savage"
    }
]