[
    {
        "content": "Whatever happened to the cash sent to foreign banks? Just curious with all the hubbubb of the AIG news. Wasn't it something like 400 billion?", 
        "intTime": 20090319, 
        "postID": 1, 
        "quote": "", 
        "reply": "Whatever happened to the cash sent to foreign banks? Just curious with all the hubbubb of the AIG news. Wasn't it something like 400 billion?", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-19 01:46:00", 
        "title": "Question?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "I think they just print more money Tom. They have printing presses in a few different cities. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think they just print more money Tom. They have printing presses in a few different cities. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-19 12:47:00", 
        "title": "Question?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Now there's a job!! LOL I got in the wrong biz!", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "Now there's a job!! LOL I got in the wrong biz!", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-20 04:07:00", 
        "title": "Question?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "Well, I know how to make the paper... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well, I know how to make the paper... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-20 07:54:00", 
        "title": "Question?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "Right on Sarge! Looking at the way big \"G\" is spending, Inflation isn't far off! I think we'll need to start making our own! Maybe it's time to get some gold?!", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "", 
        "reply": "Right on Sarge! Looking at the way big \"G\" is spending, Inflation isn't far off! I think we'll need to start making our own! Maybe it's time to get some gold?!", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-20 22:00:00", 
        "title": "Question?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "My buddy Steve wants me to join the GPA (Gold Prospectors of America) with him and go looking for gold and gems. I've got the assay maps and gem maps for Oregon and Northern California. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "", 
        "reply": "My buddy Steve wants me to join the GPA (Gold Prospectors of America) with him and go looking for gold and gems. I've got the assay maps and gem maps for Oregon and Northern California. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-20 22:27:00", 
        "title": "Question?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: I think they just print more money Tom. They have printing presses in a few different cities. That's what I'm afraid of. When the Weimar Republic of Germany did this circa 1922 the resulting hyperinflation was a leading cause of Hitler coming to power. They were printing up so much cash that at one point the only printed the money on one side. Made for great scratch paper!", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "Originally posted by sargeant_green: I think they just print more money Tom. They have printing presses in a few different cities.", 
        "reply": " That's what I'm afraid of. When the Weimar Republic of Germany did this circa 1922 the resulting hyperinflation was a leading cause of Hitler coming to power. They were printing up so much cash that at one point the only printed the money on one side. Made for great scratch paper!", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-21 00:55:00", 
        "title": "Question?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Very good point scooter mech! Are the power's that be just trying something old with the thought that they can do it better? I hope they know what they're doing,hey wait a minute,you don't think,...they know,...this is the wrong thing to do? Conspiracy? UGH! makes me crazy!!", 
        "intTime": 20090321, 
        "postID": 8, 
        "quote": "", 
        "reply": "Very good point scooter mech! Are the power's that be just trying something old with the thought that they can do it better? I hope they know what they're doing,hey wait a minute,you don't think,...they know,...this is the wrong thing to do? Conspiracy? UGH! makes me crazy!!", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-21 03:09:00", 
        "title": "Question?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "I'm going to suggest Uncle send me some samples for a test. I can buy things I can't afford, would that help? Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090321, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'm going to suggest Uncle send me some samples for a test. I can buy things I can't afford, would that help? Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-21 08:52:00", 
        "title": "Question?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by TomGustafson: Very good point scooter mech! Are the power's that be just trying something old with the thought that they can do it better? I hope they know what they're doing,hey wait a minute,you don't think,...they know,...this is the wrong thing to do? Conspiracy? UGH! makes me crazy!! The important thing is we know the signs of the methods used then and we can use that knowledge to stop or slow down any harmful actions before they start in the future. Yes, we do learn from the past, some learn how to recreate it and some learn how to prevent it. Stay on your toe's ladies and gentlemen, let the young ones know the truths and the history as it really happened and teach them the pitfalls of blindly following a political personality. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090321, 
        "postID": 10, 
        "quote": "Originally posted by TomGustafson: Very good point scooter mech! Are the power's that be just trying something old with the thought that they can do it better? I hope they know what they're doing,hey wait a minute,you don't think,...they know,...this is the wrong thing to do? Conspiracy? UGH! makes me crazy!!", 
        "reply": " The important thing is we know the signs of the methods used then and we can use that knowledge to stop or slow down any harmful actions before they start in the future. Yes, we do learn from the past, some learn how to recreate it and some learn how to prevent it. Stay on your toe's ladies and gentlemen, let the young ones know the truths and the history as it really happened and teach them the pitfalls of blindly following a political personality. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-21 10:00:00", 
        "title": "Question?", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: I'm going to suggest Uncle send me some samples for a test. I can buy things I can't afford, would that help? Amen Bergy! I figure that's what they want us to keep doin' spendin' like there's no tomorrow!", 
        "intTime": 20090321, 
        "postID": 11, 
        "quote": "Originally posted by Bergy46: I'm going to suggest Uncle send me some samples for a test. I can buy things I can't afford, would that help?", 
        "reply": " Amen Bergy! I figure that's what they want us to keep doin' spendin' like there's no tomorrow!", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-21 21:33:00", 
        "title": "Question?", 
        "userID": "TomGustafson"
    }, 
    {
        "content": "quote: Originally posted by sargeant_green: quote: Originally posted by TomGustafson: Very good point scooter mech! Are the power's that be just trying something old with the thought that they can do it better? I hope they know what they're doing,hey wait a minute,you don't think,...they know,...this is the wrong thing to do? Conspiracy? UGH! makes me crazy!! The important thing is we know the signs of the methods used then and we can use that knowledge to stop or slow down any harmful actions before they start in the future. Yes, we do learn from the past, some learn how to recreate it and some learn how to prevent it. Stay on your toe's ladies and gentlemen, let the young ones know the truths and the history as it really happened and teach them the pitfalls of blindly following a political personality. Truer words have not been spoken Sarge! This message has been edited. Last edited by: TomGustafson, Sat 21 March 2009 11:46 PM", 
        "intTime": 20090321, 
        "postID": 12, 
        "quote": "Originally posted by sargeant_green: quote: Originally posted by TomGustafson: Very good point scooter mech! Are the power's that be just trying something old with the thought that they can do it better? I hope they know what they're doing,hey wait a minute,you don't think,...they know,...this is the wrong thing to do? Conspiracy? UGH! makes me crazy!! The important thing is we know the signs of the methods used then and we can use that knowledge to stop or slow down any harmful actions before they start in the future. Yes, we do learn from the past, some learn how to recreate it and some learn how to prevent it. Stay on your toe's ladies and gentlemen, let the young ones know the truths and the history as it really happened and teach them the pitfalls of blindly following a political personality.", 
        "reply": " Truer words have not been spoken Sarge! This message has been edited. Last edited by: TomGustafson, Sat 21 March 2009 11:46 PM", 
        "threadID": "5291911282_1360082812001", 
        "time": "2009-03-21 21:37:00", 
        "title": "Question?", 
        "userID": "TomGustafson"
    }
]