[
    {
        "content": "I ask my representative in Washington, to call for the resignation or firing of Janet Napolitano (Director of Homeland Security), for her release and support of the recent DHS report accusing patriotic Americans who are oppossed to such issues such as amnesty for illegal aliens, abortion, gun control, same sex marriage and out of control government spending, as being right wing extremists and potential domestic terrorists. Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. The DHS under the Obama administration and Janet Napolitano is overstepping its original purpose of monitoring foreign terrorist threats from abroad, and is now attacking and monitoring loyal Americans thru intimidation and monitoring domestic emails. This violates the First and Fifth Amendments to the US Constitution. Congressional hearings should be conducted on the Department of Homeland Security for it's recent activities. Janet Napolitano must be forced to resign or bipartisan pressue put on President Obama to fire her. Thank you.", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "I ask my representative in Washington, to call for the resignation or firing of Janet Napolitano (Director of Homeland Security), for her release and support of the recent DHS report accusing patriotic Americans who are oppossed to such issues such as amnesty for illegal aliens, abortion, gun control, same sex marriage and out of control government spending, as being right wing extremists and potential domestic terrorists. Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. The DHS under the Obama administration and Janet Napolitano is overstepping its original purpose of monitoring foreign terrorist threats from abroad, and is now attacking and monitoring loyal Americans thru intimidation and monitoring domestic emails. This violates the First and Fifth Amendments to the US Constitution. Congressional hearings should be conducted on the Department of Homeland Security for it's recent activities. Janet Napolitano must be forced to resign or bipartisan pressue put on President Obama to fire her. Thank you.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 00:14:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "maggieb6"
    }, 
    {
        "content": "quote: Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. 1. They released the report. But the report was wrote well over a year ago. 2. The report says “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” So how is saying that an extremist will attempt to recruit someone make that person an extremist also? Did Obama's campaign to get you to vote for him make you a democrat?", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this.", 
        "reply": " 1. They released the report. But the report was wrote well over a year ago. 2. The report says “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” So how is saying that an extremist will attempt to recruit someone make that person an extremist also? Did Obama's campaign to get you to vote for him make you a democrat?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 00:49:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "This is an insult to vets and Janet Napolitano was correct to apologise. I see nothing about groups trying to influence returning veterans. According to the Washington Post... In the report, dated April 7 but begun last year, the Department of Homeland Security's intelligence section stated, \"The return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" and... \"It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \"http://voices.washingtonpost.com/44/2009/04/16/napolitano_apologizes_to_veter.html?wprss=44\"", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "This is an insult to vets and Janet Napolitano was correct to apologise. I see nothing about groups trying to influence returning veterans. According to the Washington Post... In the report, dated April 7 but begun last year, the Department of Homeland Security's intelligence section stated, \"The return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" and... \"It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \"http://voices.washingtonpost.com/44/2009/04/16/napolitano_apologizes_to_veter.html?wprss=44\"", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 01:15:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: . I see nothing about groups trying to influence returning veterans. the quote “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” is from page three of the report.", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": ". I see nothing about groups trying to influence returning veterans.", 
        "reply": " the quote “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” is from page three of the report.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 02:03:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "", 
        "reply": "Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 03:32:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Her remarks didn't bother me. I expect people to voice their true feelings. I didn't vote for change.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "", 
        "reply": "Her remarks didn't bother me. I expect people to voice their true feelings. I didn't vote for change.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 04:04:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Duster6"
    }, 
    {
        "content": "She sounds more and more like an ultra-liberal fascist every time I hear her speak on a subject of any kind. Her solution to all of America's problems brings to mind that scene from \"Red Storm Rising\" where they have all the fathers/adult males in the outdoor theater area, surrounded by chain-link fences, barbed-wire, search lights, guard dogs and machinegun towers, while socialist propaganda is being blared at them from speakers and drilled into them by images on the huge screen. She wants to strong-arm America into submission to State authority - \"For the Good of the People\", and she will be the driving force behind gun control, ammunition control, and monitoring of anyone talking about individual rights and individual independence - Here we go - - Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "", 
        "reply": "She sounds more and more like an ultra-liberal fascist every time I hear her speak on a subject of any kind. Her solution to all of America's problems brings to mind that scene from \"Red Storm Rising\" where they have all the fathers/adult males in the outdoor theater area, surrounded by chain-link fences, barbed-wire, search lights, guard dogs and machinegun towers, while socialist propaganda is being blared at them from speakers and drilled into them by images on the huge screen. She wants to strong-arm America into submission to State authority - \"For the Good of the People\", and she will be the driving force behind gun control, ammunition control, and monitoring of anyone talking about individual rights and individual independence - Here we go - - Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 08:55:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Vets being pigeon-holed as criminals before they ever even think of committing a crime. Sounds like a really bad Sci-Fi plot. Is Washington D.C. using the example of hollyweird logic to make their decisions? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "", 
        "reply": "Vets being pigeon-holed as criminals before they ever even think of committing a crime. Sounds like a really bad Sci-Fi plot. Is Washington D.C. using the example of hollyweird logic to make their decisions? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 09:46:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "\"http://www.foxnews.com/projects/pdf/041609_extremism.pdf\" From the PDF File dated April 07,2009. \"(U) Disgruntled Military Veterans (U//FOUO) DHS/I&A assesses that rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat. These skills and knowledge have the potential to boost the capabilities of extremists—including lone wolves or small terrorist cells—to carry out violence. The willingness of a small percentage of military personnel to join extremist groups during the 1990s because they were disgruntled, disillusioned, or suffering from the psychological effects of war is being replicated today.\" On Page 7 of 9.", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "", 
        "reply": "\"http://www.foxnews.com/projects/pdf/041609_extremism.pdf\" From the PDF File dated April 07,2009. \"(U) Disgruntled Military Veterans (U//FOUO) DHS/I&A assesses that rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat. These skills and knowledge have the potential to boost the capabilities of extremists—including lone wolves or small terrorist cells—to carry out violence. The willingness of a small percentage of military personnel to join extremist groups during the 1990s because they were disgruntled, disillusioned, or suffering from the psychological effects of war is being replicated today.\" On Page 7 of 9.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 09:49:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals. The Washington Post article claimed to be quoting the report. The quotation marks were not mine. I did not add them. The fact is that Napolitano found it necessary to appologise. Either she did insult veterans as the Washington Post article indicates or she is weak and will not stand up for herself. Either way, this episode does not make her look good.", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "Originally posted by Cider33_Alpha: Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "reply": " The Washington Post article claimed to be quoting the report. The quotation marks were not mine. I did not add them. The fact is that Napolitano found it necessary to appologise. Either she did insult veterans as the Washington Post article indicates or she is weak and will not stand up for herself. Either way, this episode does not make her look good.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 15:07:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I'm not implying you did anything wrong, scooter. And I have no argument at all with your last statement!", 
        "intTime": 20090418, 
        "postID": 11, 
        "quote": "", 
        "reply": "I'm not implying you did anything wrong, scooter. And I have no argument at all with your last statement!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-18 10:54:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "bump Wandering and Wondering", 
        "intTime": 20090419, 
        "postID": 12, 
        "quote": "", 
        "reply": "bump Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:27:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "intTime": 20090419, 
        "postID": 13, 
        "quote": "", 
        "reply": "yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:51:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "liberal90"
    }, 
    {
        "content": "All this boils down to one thing. Don't pizz off the people you ask to risk their lives defending you. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090419, 
        "postID": 14, 
        "quote": "", 
        "reply": "All this boils down to one thing. Don't pizz off the people you ask to risk their lives defending you. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:54:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in AtlantaHmm, I thought this case was unsolved and the one that was so quickly accused by MSM ended up being innocent. yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized That kool aid must be yum yum yummy for you to spout off the MSNBC talking points. This was a blanket statement by her and she for some reason said that she SHOULD apologize for it. Why are you defending her? Ohhh, thats right, you're a hack. GRAYMAN", 
        "intTime": 20090419, 
        "postID": 15, 
        "quote": "Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in AtlantaHmm, I thought this case was unsolved and the one that was so quickly accused by MSM ended up being innocent. yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "reply": " That kool aid must be yum yum yummy for you to spout off the MSNBC talking points. This was a blanket statement by her and she for some reason said that she SHOULD apologize for it. Why are you defending her? Ohhh, thats right, you're a hack. GRAYMAN", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 10:03:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "it's not unsolved, the terrorist was eric robert rudolph, christian fundamentalist, white supremacist, and former explosives expert, US Army", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "", 
        "reply": "it's not unsolved, the terrorist was eric robert rudolph, christian fundamentalist, white supremacist, and former explosives expert, US Army", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 10:25:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized That is a damned cheap shot!! So maybe you're of the opinion that Vets should be handled like the Scout Dogs from Vet Nam and shot or left behind rather than letting them back into the states? If ya can't profile Mexicans as potential illegals, then don't start making excuses to profile Patriotic Vets as terrorists, especially if you've never walked in their shoes - - Wandering and Wondering", 
        "intTime": 20090419, 
        "postID": 17, 
        "quote": "Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "reply": " That is a damned cheap shot!! So maybe you're of the opinion that Vets should be handled like the Scout Dogs from Vet Nam and shot or left behind rather than letting them back into the states? If ya can't profile Mexicans as potential illegals, then don't start making excuses to profile Patriotic Vets as terrorists, especially if you've never walked in their shoes - - Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 11:30:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Napolitano sounds like another, get the govrenment involved in every facet of our lives! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090419, 
        "postID": 18, 
        "quote": "", 
        "reply": "Napolitano sounds like another, get the govrenment involved in every facet of our lives! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 12:07:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I am appalled. She should be fired. To release such a report, implying that some of our brave Men and Women could come home and become terrorists, after they have sacrificed so much in the face of terrorism to me is disrespectful. If we are at the point where our Gorvernment has to worry about its own Military members turning on them, then what does this say to all of you. Its not like this report suggests just a few might turn. This report suggests that many may turn. So whats the next step after this. Do we now distrust our Military, then our FBI, our CIA our NSA, our Police and law enforcement. The people who defend our nation, our families and friends. Do we no longer hold them with the upmost respect and value their efforts. It is those who defend our nation on all fronts that will hold you accountable, you Socialists and Communists.", 
        "intTime": 20090419, 
        "postID": 19, 
        "quote": "", 
        "reply": "I am appalled. She should be fired. To release such a report, implying that some of our brave Men and Women could come home and become terrorists, after they have sacrificed so much in the face of terrorism to me is disrespectful. If we are at the point where our Gorvernment has to worry about its own Military members turning on them, then what does this say to all of you. Its not like this report suggests just a few might turn. This report suggests that many may turn. So whats the next step after this. Do we now distrust our Military, then our FBI, our CIA our NSA, our Police and law enforcement. The people who defend our nation, our families and friends. Do we no longer hold them with the upmost respect and value their efforts. It is those who defend our nation on all fronts that will hold you accountable, you Socialists and Communists.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 14:39:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "TheGoodOne"
    }, 
    {
        "content": "DHS= Department of Horse Sheet!", 
        "intTime": 20090419, 
        "postID": 20, 
        "quote": "", 
        "reply": "DHS= Department of Horse Sheet!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 15:27:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "SGTBJH"
    }, 
    {
        "content": "I ask my representative in Washington, to call for the resignation or firing of Janet Napolitano (Director of Homeland Security), for her release and support of the recent DHS report accusing patriotic Americans who are oppossed to such issues such as amnesty for illegal aliens, abortion, gun control, same sex marriage and out of control government spending, as being right wing extremists and potential domestic terrorists. Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. The DHS under the Obama administration and Janet Napolitano is overstepping its original purpose of monitoring foreign terrorist threats from abroad, and is now attacking and monitoring loyal Americans thru intimidation and monitoring domestic emails. This violates the First and Fifth Amendments to the US Constitution. Congressional hearings should be conducted on the Department of Homeland Security for it's recent activities. Janet Napolitano must be forced to resign or bipartisan pressue put on President Obama to fire her. Thank you.", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "", 
        "reply": "I ask my representative in Washington, to call for the resignation or firing of Janet Napolitano (Director of Homeland Security), for her release and support of the recent DHS report accusing patriotic Americans who are oppossed to such issues such as amnesty for illegal aliens, abortion, gun control, same sex marriage and out of control government spending, as being right wing extremists and potential domestic terrorists. Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. The DHS under the Obama administration and Janet Napolitano is overstepping its original purpose of monitoring foreign terrorist threats from abroad, and is now attacking and monitoring loyal Americans thru intimidation and monitoring domestic emails. This violates the First and Fifth Amendments to the US Constitution. Congressional hearings should be conducted on the Department of Homeland Security for it's recent activities. Janet Napolitano must be forced to resign or bipartisan pressue put on President Obama to fire her. Thank you.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 00:14:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "maggieb6"
    }, 
    {
        "content": "quote: Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. 1. They released the report. But the report was wrote well over a year ago. 2. The report says “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” So how is saying that an extremist will attempt to recruit someone make that person an extremist also? Did Obama's campaign to get you to vote for him make you a democrat?", 
        "intTime": 20090417, 
        "postID": 22, 
        "quote": "Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this.", 
        "reply": " 1. They released the report. But the report was wrote well over a year ago. 2. The report says “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” So how is saying that an extremist will attempt to recruit someone make that person an extremist also? Did Obama's campaign to get you to vote for him make you a democrat?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 00:49:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "This is an insult to vets and Janet Napolitano was correct to apologise. I see nothing about groups trying to influence returning veterans. According to the Washington Post... In the report, dated April 7 but begun last year, the Department of Homeland Security's intelligence section stated, \"The return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" and... \"It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \"http://voices.washingtonpost.com/44/2009/04/16/napolitano_apologizes_to_veter.html?wprss=44\"", 
        "intTime": 20090417, 
        "postID": 23, 
        "quote": "", 
        "reply": "This is an insult to vets and Janet Napolitano was correct to apologise. I see nothing about groups trying to influence returning veterans. According to the Washington Post... In the report, dated April 7 but begun last year, the Department of Homeland Security's intelligence section stated, \"The return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" and... \"It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \"http://voices.washingtonpost.com/44/2009/04/16/napolitano_apologizes_to_veter.html?wprss=44\"", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 01:15:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: . I see nothing about groups trying to influence returning veterans. the quote “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” is from page three of the report.", 
        "intTime": 20090417, 
        "postID": 24, 
        "quote": ". I see nothing about groups trying to influence returning veterans.", 
        "reply": " the quote “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” is from page three of the report.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 02:03:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "intTime": 20090417, 
        "postID": 25, 
        "quote": "", 
        "reply": "Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 03:32:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Her remarks didn't bother me. I expect people to voice their true feelings. I didn't vote for change.", 
        "intTime": 20090417, 
        "postID": 26, 
        "quote": "", 
        "reply": "Her remarks didn't bother me. I expect people to voice their true feelings. I didn't vote for change.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 04:04:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Duster6"
    }, 
    {
        "content": "She sounds more and more like an ultra-liberal fascist every time I hear her speak on a subject of any kind. Her solution to all of America's problems brings to mind that scene from \"Red Storm Rising\" where they have all the fathers/adult males in the outdoor theater area, surrounded by chain-link fences, barbed-wire, search lights, guard dogs and machinegun towers, while socialist propaganda is being blared at them from speakers and drilled into them by images on the huge screen. She wants to strong-arm America into submission to State authority - \"For the Good of the People\", and she will be the driving force behind gun control, ammunition control, and monitoring of anyone talking about individual rights and individual independence - Here we go - - Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 27, 
        "quote": "", 
        "reply": "She sounds more and more like an ultra-liberal fascist every time I hear her speak on a subject of any kind. Her solution to all of America's problems brings to mind that scene from \"Red Storm Rising\" where they have all the fathers/adult males in the outdoor theater area, surrounded by chain-link fences, barbed-wire, search lights, guard dogs and machinegun towers, while socialist propaganda is being blared at them from speakers and drilled into them by images on the huge screen. She wants to strong-arm America into submission to State authority - \"For the Good of the People\", and she will be the driving force behind gun control, ammunition control, and monitoring of anyone talking about individual rights and individual independence - Here we go - - Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 08:55:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Vets being pigeon-holed as criminals before they ever even think of committing a crime. Sounds like a really bad Sci-Fi plot. Is Washington D.C. using the example of hollyweird logic to make their decisions? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090417, 
        "postID": 28, 
        "quote": "", 
        "reply": "Vets being pigeon-holed as criminals before they ever even think of committing a crime. Sounds like a really bad Sci-Fi plot. Is Washington D.C. using the example of hollyweird logic to make their decisions? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 09:46:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "\"http://www.foxnews.com/projects/pdf/041609_extremism.pdf\" From the PDF File dated April 07,2009. \"(U) Disgruntled Military Veterans (U//FOUO) DHS/I&A assesses that rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat. These skills and knowledge have the potential to boost the capabilities of extremists—including lone wolves or small terrorist cells—to carry out violence. The willingness of a small percentage of military personnel to join extremist groups during the 1990s because they were disgruntled, disillusioned, or suffering from the psychological effects of war is being replicated today.\" On Page 7 of 9.", 
        "intTime": 20090417, 
        "postID": 29, 
        "quote": "", 
        "reply": "\"http://www.foxnews.com/projects/pdf/041609_extremism.pdf\" From the PDF File dated April 07,2009. \"(U) Disgruntled Military Veterans (U//FOUO) DHS/I&A assesses that rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat. These skills and knowledge have the potential to boost the capabilities of extremists—including lone wolves or small terrorist cells—to carry out violence. The willingness of a small percentage of military personnel to join extremist groups during the 1990s because they were disgruntled, disillusioned, or suffering from the psychological effects of war is being replicated today.\" On Page 7 of 9.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 09:49:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals. The Washington Post article claimed to be quoting the report. The quotation marks were not mine. I did not add them. The fact is that Napolitano found it necessary to appologise. Either she did insult veterans as the Washington Post article indicates or she is weak and will not stand up for herself. Either way, this episode does not make her look good.", 
        "intTime": 20090417, 
        "postID": 30, 
        "quote": "Originally posted by Cider33_Alpha: Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "reply": " The Washington Post article claimed to be quoting the report. The quotation marks were not mine. I did not add them. The fact is that Napolitano found it necessary to appologise. Either she did insult veterans as the Washington Post article indicates or she is weak and will not stand up for herself. Either way, this episode does not make her look good.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 15:07:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I'm not implying you did anything wrong, scooter. And I have no argument at all with your last statement!", 
        "intTime": 20090418, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'm not implying you did anything wrong, scooter. And I have no argument at all with your last statement!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-18 10:54:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "bump Wandering and Wondering", 
        "intTime": 20090419, 
        "postID": 32, 
        "quote": "", 
        "reply": "bump Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:27:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "intTime": 20090419, 
        "postID": 33, 
        "quote": "", 
        "reply": "yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:51:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "liberal90"
    }, 
    {
        "content": "All this boils down to one thing. Don't pizz off the people you ask to risk their lives defending you. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090419, 
        "postID": 34, 
        "quote": "", 
        "reply": "All this boils down to one thing. Don't pizz off the people you ask to risk their lives defending you. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:54:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in AtlantaHmm, I thought this case was unsolved and the one that was so quickly accused by MSM ended up being innocent. yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized That kool aid must be yum yum yummy for you to spout off the MSNBC talking points. This was a blanket statement by her and she for some reason said that she SHOULD apologize for it. Why are you defending her? Ohhh, thats right, you're a hack. GRAYMAN", 
        "intTime": 20090419, 
        "postID": 35, 
        "quote": "Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in AtlantaHmm, I thought this case was unsolved and the one that was so quickly accused by MSM ended up being innocent. yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "reply": " That kool aid must be yum yum yummy for you to spout off the MSNBC talking points. This was a blanket statement by her and she for some reason said that she SHOULD apologize for it. Why are you defending her? Ohhh, thats right, you're a hack. GRAYMAN", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 10:03:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "it's not unsolved, the terrorist was eric robert rudolph, christian fundamentalist, white supremacist, and former explosives expert, US Army", 
        "intTime": 20090419, 
        "postID": 36, 
        "quote": "", 
        "reply": "it's not unsolved, the terrorist was eric robert rudolph, christian fundamentalist, white supremacist, and former explosives expert, US Army", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 10:25:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized That is a damned cheap shot!! So maybe you're of the opinion that Vets should be handled like the Scout Dogs from Vet Nam and shot or left behind rather than letting them back into the states? If ya can't profile Mexicans as potential illegals, then don't start making excuses to profile Patriotic Vets as terrorists, especially if you've never walked in their shoes - - Wandering and Wondering", 
        "intTime": 20090419, 
        "postID": 37, 
        "quote": "Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "reply": " That is a damned cheap shot!! So maybe you're of the opinion that Vets should be handled like the Scout Dogs from Vet Nam and shot or left behind rather than letting them back into the states? If ya can't profile Mexicans as potential illegals, then don't start making excuses to profile Patriotic Vets as terrorists, especially if you've never walked in their shoes - - Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 11:30:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Napolitano sounds like another, get the govrenment involved in every facet of our lives! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090419, 
        "postID": 38, 
        "quote": "", 
        "reply": "Napolitano sounds like another, get the govrenment involved in every facet of our lives! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 12:07:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I am appalled. She should be fired. To release such a report, implying that some of our brave Men and Women could come home and become terrorists, after they have sacrificed so much in the face of terrorism to me is disrespectful. If we are at the point where our Gorvernment has to worry about its own Military members turning on them, then what does this say to all of you. Its not like this report suggests just a few might turn. This report suggests that many may turn. So whats the next step after this. Do we now distrust our Military, then our FBI, our CIA our NSA, our Police and law enforcement. The people who defend our nation, our families and friends. Do we no longer hold them with the upmost respect and value their efforts. It is those who defend our nation on all fronts that will hold you accountable, you Socialists and Communists.", 
        "intTime": 20090419, 
        "postID": 39, 
        "quote": "", 
        "reply": "I am appalled. She should be fired. To release such a report, implying that some of our brave Men and Women could come home and become terrorists, after they have sacrificed so much in the face of terrorism to me is disrespectful. If we are at the point where our Gorvernment has to worry about its own Military members turning on them, then what does this say to all of you. Its not like this report suggests just a few might turn. This report suggests that many may turn. So whats the next step after this. Do we now distrust our Military, then our FBI, our CIA our NSA, our Police and law enforcement. The people who defend our nation, our families and friends. Do we no longer hold them with the upmost respect and value their efforts. It is those who defend our nation on all fronts that will hold you accountable, you Socialists and Communists.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 14:39:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "TheGoodOne"
    }, 
    {
        "content": "DHS= Department of Horse Sheet!", 
        "intTime": 20090419, 
        "postID": 40, 
        "quote": "", 
        "reply": "DHS= Department of Horse Sheet!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 15:27:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "SGTBJH"
    }, 
    {
        "content": "I ask my representative in Washington, to call for the resignation or firing of Janet Napolitano (Director of Homeland Security), for her release and support of the recent DHS report accusing patriotic Americans who are oppossed to such issues such as amnesty for illegal aliens, abortion, gun control, same sex marriage and out of control government spending, as being right wing extremists and potential domestic terrorists. Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. The DHS under the Obama administration and Janet Napolitano is overstepping its original purpose of monitoring foreign terrorist threats from abroad, and is now attacking and monitoring loyal Americans thru intimidation and monitoring domestic emails. This violates the First and Fifth Amendments to the US Constitution. Congressional hearings should be conducted on the Department of Homeland Security for it's recent activities. Janet Napolitano must be forced to resign or bipartisan pressue put on President Obama to fire her. Thank you.", 
        "intTime": 20090417, 
        "postID": 41, 
        "quote": "", 
        "reply": "I ask my representative in Washington, to call for the resignation or firing of Janet Napolitano (Director of Homeland Security), for her release and support of the recent DHS report accusing patriotic Americans who are oppossed to such issues such as amnesty for illegal aliens, abortion, gun control, same sex marriage and out of control government spending, as being right wing extremists and potential domestic terrorists. Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. The DHS under the Obama administration and Janet Napolitano is overstepping its original purpose of monitoring foreign terrorist threats from abroad, and is now attacking and monitoring loyal Americans thru intimidation and monitoring domestic emails. This violates the First and Fifth Amendments to the US Constitution. Congressional hearings should be conducted on the Department of Homeland Security for it's recent activities. Janet Napolitano must be forced to resign or bipartisan pressue put on President Obama to fire her. Thank you.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 00:14:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "maggieb6"
    }, 
    {
        "content": "quote: Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this. 1. They released the report. But the report was wrote well over a year ago. 2. The report says “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” So how is saying that an extremist will attempt to recruit someone make that person an extremist also? Did Obama's campaign to get you to vote for him make you a democrat?", 
        "intTime": 20090417, 
        "postID": 42, 
        "quote": "Worst of all, the DHS report has even accused returning military veterans from the wars in Iraq and Afghanistan as potential domestic terrorists because of their military training. As a military veteran myself, I am appalled by this.", 
        "reply": " 1. They released the report. But the report was wrote well over a year ago. 2. The report says “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” So how is saying that an extremist will attempt to recruit someone make that person an extremist also? Did Obama's campaign to get you to vote for him make you a democrat?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 00:49:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "This is an insult to vets and Janet Napolitano was correct to apologise. I see nothing about groups trying to influence returning veterans. According to the Washington Post... In the report, dated April 7 but begun last year, the Department of Homeland Security's intelligence section stated, \"The return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" and... \"It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \"http://voices.washingtonpost.com/44/2009/04/16/napolitano_apologizes_to_veter.html?wprss=44\"", 
        "intTime": 20090417, 
        "postID": 43, 
        "quote": "", 
        "reply": "This is an insult to vets and Janet Napolitano was correct to apologise. I see nothing about groups trying to influence returning veterans. According to the Washington Post... In the report, dated April 7 but begun last year, the Department of Homeland Security's intelligence section stated, \"The return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" and... \"It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \"http://voices.washingtonpost.com/44/2009/04/16/napolitano_apologizes_to_veter.html?wprss=44\"", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 01:15:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: . I see nothing about groups trying to influence returning veterans. the quote “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” is from page three of the report.", 
        "intTime": 20090417, 
        "postID": 44, 
        "quote": ". I see nothing about groups trying to influence returning veterans.", 
        "reply": " the quote “Rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat.” is from page three of the report.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 02:03:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "intTime": 20090417, 
        "postID": 45, 
        "quote": "", 
        "reply": "Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 03:32:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Her remarks didn't bother me. I expect people to voice their true feelings. I didn't vote for change.", 
        "intTime": 20090417, 
        "postID": 46, 
        "quote": "", 
        "reply": "Her remarks didn't bother me. I expect people to voice their true feelings. I didn't vote for change.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 04:04:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Duster6"
    }, 
    {
        "content": "She sounds more and more like an ultra-liberal fascist every time I hear her speak on a subject of any kind. Her solution to all of America's problems brings to mind that scene from \"Red Storm Rising\" where they have all the fathers/adult males in the outdoor theater area, surrounded by chain-link fences, barbed-wire, search lights, guard dogs and machinegun towers, while socialist propaganda is being blared at them from speakers and drilled into them by images on the huge screen. She wants to strong-arm America into submission to State authority - \"For the Good of the People\", and she will be the driving force behind gun control, ammunition control, and monitoring of anyone talking about individual rights and individual independence - Here we go - - Wandering and Wondering", 
        "intTime": 20090417, 
        "postID": 47, 
        "quote": "", 
        "reply": "She sounds more and more like an ultra-liberal fascist every time I hear her speak on a subject of any kind. Her solution to all of America's problems brings to mind that scene from \"Red Storm Rising\" where they have all the fathers/adult males in the outdoor theater area, surrounded by chain-link fences, barbed-wire, search lights, guard dogs and machinegun towers, while socialist propaganda is being blared at them from speakers and drilled into them by images on the huge screen. She wants to strong-arm America into submission to State authority - \"For the Good of the People\", and she will be the driving force behind gun control, ammunition control, and monitoring of anyone talking about individual rights and individual independence - Here we go - - Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 08:55:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Vets being pigeon-holed as criminals before they ever even think of committing a crime. Sounds like a really bad Sci-Fi plot. Is Washington D.C. using the example of hollyweird logic to make their decisions? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090417, 
        "postID": 48, 
        "quote": "", 
        "reply": "Vets being pigeon-holed as criminals before they ever even think of committing a crime. Sounds like a really bad Sci-Fi plot. Is Washington D.C. using the example of hollyweird logic to make their decisions? Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 09:46:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "\"http://www.foxnews.com/projects/pdf/041609_extremism.pdf\" From the PDF File dated April 07,2009. \"(U) Disgruntled Military Veterans (U//FOUO) DHS/I&A assesses that rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat. These skills and knowledge have the potential to boost the capabilities of extremists—including lone wolves or small terrorist cells—to carry out violence. The willingness of a small percentage of military personnel to join extremist groups during the 1990s because they were disgruntled, disillusioned, or suffering from the psychological effects of war is being replicated today.\" On Page 7 of 9.", 
        "intTime": 20090417, 
        "postID": 49, 
        "quote": "", 
        "reply": "\"http://www.foxnews.com/projects/pdf/041609_extremism.pdf\" From the PDF File dated April 07,2009. \"(U) Disgruntled Military Veterans (U//FOUO) DHS/I&A assesses that rightwing extremists will attempt to recruit and radicalize returning veterans in order to exploit their skills and knowledge derived from military training and combat. These skills and knowledge have the potential to boost the capabilities of extremists—including lone wolves or small terrorist cells—to carry out violence. The willingness of a small percentage of military personnel to join extremist groups during the 1990s because they were disgruntled, disillusioned, or suffering from the psychological effects of war is being replicated today.\" On Page 7 of 9.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 09:49:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals. The Washington Post article claimed to be quoting the report. The quotation marks were not mine. I did not add them. The fact is that Napolitano found it necessary to appologise. Either she did insult veterans as the Washington Post article indicates or she is weak and will not stand up for herself. Either way, this episode does not make her look good.", 
        "intTime": 20090417, 
        "postID": 50, 
        "quote": "Originally posted by Cider33_Alpha: Scooter_mech, sometimes it's best to go to the original document instead of a journalist's interpretation of what the document says. Take the Declaration of Independence or Constution as examples ... lots of interpretations, but the originals (and amendments, in the case of the Constitution) are the Real Deals.", 
        "reply": " The Washington Post article claimed to be quoting the report. The quotation marks were not mine. I did not add them. The fact is that Napolitano found it necessary to appologise. Either she did insult veterans as the Washington Post article indicates or she is weak and will not stand up for herself. Either way, this episode does not make her look good.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-17 15:07:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I'm not implying you did anything wrong, scooter. And I have no argument at all with your last statement!", 
        "intTime": 20090418, 
        "postID": 51, 
        "quote": "", 
        "reply": "I'm not implying you did anything wrong, scooter. And I have no argument at all with your last statement!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-18 10:54:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "bump Wandering and Wondering", 
        "intTime": 20090419, 
        "postID": 52, 
        "quote": "", 
        "reply": "bump Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:27:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "intTime": 20090419, 
        "postID": 53, 
        "quote": "", 
        "reply": "yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:51:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "liberal90"
    }, 
    {
        "content": "All this boils down to one thing. Don't pizz off the people you ask to risk their lives defending you. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090419, 
        "postID": 54, 
        "quote": "", 
        "reply": "All this boils down to one thing. Don't pizz off the people you ask to risk their lives defending you. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 09:54:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in AtlantaHmm, I thought this case was unsolved and the one that was so quickly accused by MSM ended up being innocent. yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized That kool aid must be yum yum yummy for you to spout off the MSNBC talking points. This was a blanket statement by her and she for some reason said that she SHOULD apologize for it. Why are you defending her? Ohhh, thats right, you're a hack. GRAYMAN", 
        "intTime": 20090419, 
        "postID": 55, 
        "quote": "Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in AtlantaHmm, I thought this case was unsolved and the one that was so quickly accused by MSM ended up being innocent. yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "reply": " That kool aid must be yum yum yummy for you to spout off the MSNBC talking points. This was a blanket statement by her and she for some reason said that she SHOULD apologize for it. Why are you defending her? Ohhh, thats right, you're a hack. GRAYMAN", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 10:03:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "GRAYMAN"
    }, 
    {
        "content": "it's not unsolved, the terrorist was eric robert rudolph, christian fundamentalist, white supremacist, and former explosives expert, US Army", 
        "intTime": 20090419, 
        "postID": 56, 
        "quote": "", 
        "reply": "it's not unsolved, the terrorist was eric robert rudolph, christian fundamentalist, white supremacist, and former explosives expert, US Army", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 10:25:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "liberal90"
    }, 
    {
        "content": "quote: Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized That is a damned cheap shot!! So maybe you're of the opinion that Vets should be handled like the Scout Dogs from Vet Nam and shot or left behind rather than letting them back into the states? If ya can't profile Mexicans as potential illegals, then don't start making excuses to profile Patriotic Vets as terrorists, especially if you've never walked in their shoes - - Wandering and Wondering", 
        "intTime": 20090419, 
        "postID": 57, 
        "quote": "Originally posted by liberal90: yeah I agree it is an insult to all veterans to suggest that they might be vulnerable to radicalization campaigns, perhaps moreso that the rest of the population I mean it's not like a former Marine ever assassinated a President of the United States or like a US Army Vet bombed a federal building or like a US Army Vet who had explosives training bombed the Olympic Park in Atlanta yeah since none of that ever happened I can see how it is entirely unreasonable to be especially concerned about veterans becoming radicalized", 
        "reply": " That is a damned cheap shot!! So maybe you're of the opinion that Vets should be handled like the Scout Dogs from Vet Nam and shot or left behind rather than letting them back into the states? If ya can't profile Mexicans as potential illegals, then don't start making excuses to profile Patriotic Vets as terrorists, especially if you've never walked in their shoes - - Wandering and Wondering", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 11:30:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Napolitano sounds like another, get the govrenment involved in every facet of our lives! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090419, 
        "postID": 58, 
        "quote": "", 
        "reply": "Napolitano sounds like another, get the govrenment involved in every facet of our lives! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 12:07:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "Bergy46"
    }, 
    {
        "content": "I am appalled. She should be fired. To release such a report, implying that some of our brave Men and Women could come home and become terrorists, after they have sacrificed so much in the face of terrorism to me is disrespectful. If we are at the point where our Gorvernment has to worry about its own Military members turning on them, then what does this say to all of you. Its not like this report suggests just a few might turn. This report suggests that many may turn. So whats the next step after this. Do we now distrust our Military, then our FBI, our CIA our NSA, our Police and law enforcement. The people who defend our nation, our families and friends. Do we no longer hold them with the upmost respect and value their efforts. It is those who defend our nation on all fronts that will hold you accountable, you Socialists and Communists.", 
        "intTime": 20090419, 
        "postID": 59, 
        "quote": "", 
        "reply": "I am appalled. She should be fired. To release such a report, implying that some of our brave Men and Women could come home and become terrorists, after they have sacrificed so much in the face of terrorism to me is disrespectful. If we are at the point where our Gorvernment has to worry about its own Military members turning on them, then what does this say to all of you. Its not like this report suggests just a few might turn. This report suggests that many may turn. So whats the next step after this. Do we now distrust our Military, then our FBI, our CIA our NSA, our Police and law enforcement. The people who defend our nation, our families and friends. Do we no longer hold them with the upmost respect and value their efforts. It is those who defend our nation on all fronts that will hold you accountable, you Socialists and Communists.", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 14:39:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "TheGoodOne"
    }, 
    {
        "content": "DHS= Department of Horse Sheet!", 
        "intTime": 20090419, 
        "postID": 60, 
        "quote": "", 
        "reply": "DHS= Department of Horse Sheet!", 
        "threadID": "5291911282_9380099022001", 
        "time": "2009-04-19 15:27:00", 
        "title": "An Insult from Janet Napolitano", 
        "userID": "SGTBJH"
    }
]