[
    {
        "content": "I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!?", 
        "intTime": 20090307, 
        "postID": 1, 
        "quote": "", 
        "reply": "I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!?", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:19:00", 
        "title": "Suicide", 
        "userID": "harleydavidsonman"
    }, 
    {
        "content": "I am truly sorry for your lose.... As for your question, I have no answers there. All I know is I have known 3 people who felt that it was the only answer for them. And it sucks.", 
        "intTime": 20090307, 
        "postID": 2, 
        "quote": "", 
        "reply": "I am truly sorry for your lose.... As for your question, I have no answers there. All I know is I have known 3 people who felt that it was the only answer for them. And it sucks.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:35:00", 
        "title": "Suicide", 
        "userID": "NLJailer"
    }, 
    {
        "content": "Harley, My condolences! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090307, 
        "postID": 3, 
        "quote": "", 
        "reply": "Harley, My condolences! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:39:00", 
        "title": "Suicide", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Who was pulling the trigger? Was he over 18 or 21? These aren't sarcastic ribs...just realities. Responsibility lies with the individual, unless he or she is absolutely crazy. Tragedies like this happen when hard times and conflicts come along. We had two \"suicide by cop\" events in this state just last week. People losing jobs and homes, people coming back to the world after seeing the wolf and the jackal... People can get lawyers and sue everybody on the perimeter and point the finger at everyone that ever walked near the guy with the gun. But who's finger was on the trigger? America has slid into this zone where they expect commanders, plt leaders, principals, teachers, police, everybody to be expert psychologists to sort everything out, wisely and prophetically with vision of forethought, for the individual - - Well, the simple fact is...They can't. How many times does it happen that the cops show up BEFORE the bank robbery or the Highway Patrol BEFORE the 90 car pile-up? It just don't happen - - Probably too injurious to ask, \"Where was the family......?\" Said deal... And don't think I'm talking through my hat. I got called home from work at about noon one day, and got to watch my Dad take his last breath after shooting himself in the head with a .38 - - Where was I - -? Wandering and Wondering", 
        "intTime": 20090307, 
        "postID": 4, 
        "quote": "", 
        "reply": "Who was pulling the trigger? Was he over 18 or 21? These aren't sarcastic ribs...just realities. Responsibility lies with the individual, unless he or she is absolutely crazy. Tragedies like this happen when hard times and conflicts come along. We had two \"suicide by cop\" events in this state just last week. People losing jobs and homes, people coming back to the world after seeing the wolf and the jackal... People can get lawyers and sue everybody on the perimeter and point the finger at everyone that ever walked near the guy with the gun. But who's finger was on the trigger? America has slid into this zone where they expect commanders, plt leaders, principals, teachers, police, everybody to be expert psychologists to sort everything out, wisely and prophetically with vision of forethought, for the individual - - Well, the simple fact is...They can't. How many times does it happen that the cops show up BEFORE the bank robbery or the Highway Patrol BEFORE the 90 car pile-up? It just don't happen - - Probably too injurious to ask, \"Where was the family......?\" Said deal... And don't think I'm talking through my hat. I got called home from work at about noon one day, and got to watch my Dad take his last breath after shooting himself in the head with a .38 - - Where was I - -? Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:42:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Sorry GW", 
        "intTime": 20090307, 
        "postID": 5, 
        "quote": "", 
        "reply": "Sorry GW", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:52:00", 
        "title": "Suicide", 
        "userID": "NLJailer"
    }, 
    {
        "content": "HarleyDavidsonMan and me are in a club that should have no members - - None need apply - - Wandering and Wondering", 
        "intTime": 20090307, 
        "postID": 6, 
        "quote": "", 
        "reply": "HarleyDavidsonMan and me are in a club that should have no members - - None need apply - - Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:58:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "No one can know the heart ache or questions that nag at you. Suicide has left it’s nasty scares all over my heart. Way back in 1954 my bunk mate use him M1 to take his own life on my bed. We had been together for four weeks and I thought he was just like the rest of us who hated basic. I was section leader at Dover AFB in 1959 when an airmen in my sections hung him self. We talked everyday and played poker together a couple of times a week. I never saw it coming. In 1963 my oldest brother killed himself. We knew he was sick with TB and we knew he was depressed but we could not watch him 24/7, he was 49 years old. In 1996 our then oldest DIL killed her self, she was only 25. I had known since she was nine years old. That was five years longer than my son had known her. I loved her, and still love her with all of my heart. We knew she had emotional problems and she was being seen by a counselor know one thought she was suicidal. I help my son for several hours on suspension of murder. They released him to me and it took three long days before they had the evidence they needed to prove she died by her own hand. And he was several miles away from home when it happened. It took my son five years before he could ever think of having another woman in his life. He has now been married to this fantastic lady who brought two more grandchildren into our lives. Again, none us can know the heart ache or answer the questions you have, but please know that our hearts, prayers and love goes out to you and his family and friends. You never get over it but you learn to live with it. This message has been edited. Last edited by: OldArmyLove, Sun 08 March 2009 01:44 PM A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090307, 
        "postID": 7, 
        "quote": "", 
        "reply": "No one can know the heart ache or questions that nag at you. Suicide has left it’s nasty scares all over my heart. Way back in 1954 my bunk mate use him M1 to take his own life on my bed. We had been together for four weeks and I thought he was just like the rest of us who hated basic. I was section leader at Dover AFB in 1959 when an airmen in my sections hung him self. We talked everyday and played poker together a couple of times a week. I never saw it coming. In 1963 my oldest brother killed himself. We knew he was sick with TB and we knew he was depressed but we could not watch him 24/7, he was 49 years old. In 1996 our then oldest DIL killed her self, she was only 25. I had known since she was nine years old. That was five years longer than my son had known her. I loved her, and still love her with all of my heart. We knew she had emotional problems and she was being seen by a counselor know one thought she was suicidal. I help my son for several hours on suspension of murder. They released him to me and it took three long days before they had the evidence they needed to prove she died by her own hand. And he was several miles away from home when it happened. It took my son five years before he could ever think of having another woman in his life. He has now been married to this fantastic lady who brought two more grandchildren into our lives. Again, none us can know the heart ache or answer the questions you have, but please know that our hearts, prayers and love goes out to you and his family and friends. You never get over it but you learn to live with it. This message has been edited. Last edited by: OldArmyLove, Sun 08 March 2009 01:44 PM A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 09:55:00", 
        "title": "Suicide", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "We can sometimes see little changes that may lead to serious consequences but not always. Some people have the ability to keep everything inside until they reach the point of no return and then no one can reach them with assistance. Had a sp/4 in my platoon over in Nam. Nice guy, did his job got along well with everyone was on the promotion list. Went out behind the bunker and shot himself. While going through his personal effects I found a letter from his girlfriend saying she was dating another guy (dear John). Didn't show any signs so we didn't know anything was wrong. One never knows!", 
        "intTime": 20090307, 
        "postID": 8, 
        "quote": "", 
        "reply": "We can sometimes see little changes that may lead to serious consequences but not always. Some people have the ability to keep everything inside until they reach the point of no return and then no one can reach them with assistance. Had a sp/4 in my platoon over in Nam. Nice guy, did his job got along well with everyone was on the promotion list. Went out behind the bunker and shot himself. While going through his personal effects I found a letter from his girlfriend saying she was dating another guy (dear John). Didn't show any signs so we didn't know anything was wrong. One never knows!", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 14:21:00", 
        "title": "Suicide", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Please remember this number, cary it with you. You never know when you maight meet a vet who needs it. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090307, 
        "postID": 9, 
        "quote": "", 
        "reply": "Please remember this number, cary it with you. You never know when you maight meet a vet who needs it. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 14:35:00", 
        "title": "Suicide", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "First, my condolences, thoughts and prayers to you and your family. I, too, have had the misfortune of personally dealing with this. Doing the typical male thing, I spent a lot of time trying to figure it out. I finally came to this conclusion: I was trying to apply rationale to an irrational act. Can't be done... I went thru the anger faze also. Mad at him. Mad at me. Mad at the system. Finally I just had to let it be... It was not rational. And it would never make sense.", 
        "intTime": 20090307, 
        "postID": 10, 
        "quote": "", 
        "reply": "First, my condolences, thoughts and prayers to you and your family. I, too, have had the misfortune of personally dealing with this. Doing the typical male thing, I spent a lot of time trying to figure it out. I finally came to this conclusion: I was trying to apply rationale to an irrational act. Can't be done... I went thru the anger faze also. Mad at him. Mad at me. Mad at the system. Finally I just had to let it be... It was not rational. And it would never make sense.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 15:20:00", 
        "title": "Suicide", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by HarleyDavidsonMan: I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!? I'm so sorry about your nephew and you as well. It is all too common and I do truly understand your anger. I would imagine it's at least partially fueled by frustration. There are so many returning solders with problems and too few to help them. also they're dealing with the human mind Every single one of us is different. It's not like we're some mass produced thing that reacts and responds to everything the same way. I'm not passing myself off as any sort of expert but I do think I've spoken with enough returning solders over the past years to have some sort of handle as to what's going on. Every one of the vets are different and every one of them needs custom tailored treatment. there just aren't enough people to do that. As I think deeper into this I'm coming to the conclusion that those MDs., PHds and all the other dudes with more degrees than a thermometer lack one essential qualification to be helpful. How can any of them know what it was like to be there? They might as well try to treat a Martian. I'm thinking about some sort organized group of former combat veterans with professional guidance possibly being their best hope. I've been shooting my mouth off for too long. I think it's time to end this. I'll do so by again expressing my sympathy to all involved and again thanking all those brave men and women that keep us here at home safe. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090307, 
        "postID": 11, 
        "quote": "Originally posted by HarleyDavidsonMan: I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!?", 
        "reply": " I'm so sorry about your nephew and you as well. It is all too common and I do truly understand your anger. I would imagine it's at least partially fueled by frustration. There are so many returning solders with problems and too few to help them. also they're dealing with the human mind Every single one of us is different. It's not like we're some mass produced thing that reacts and responds to everything the same way. I'm not passing myself off as any sort of expert but I do think I've spoken with enough returning solders over the past years to have some sort of handle as to what's going on. Every one of the vets are different and every one of them needs custom tailored treatment. there just aren't enough people to do that. As I think deeper into this I'm coming to the conclusion that those MDs., PHds and all the other dudes with more degrees than a thermometer lack one essential qualification to be helpful. How can any of them know what it was like to be there? They might as well try to treat a Martian. I'm thinking about some sort organized group of former combat veterans with professional guidance possibly being their best hope. I've been shooting my mouth off for too long. I think it's time to end this. I'll do so by again expressing my sympathy to all involved and again thanking all those brave men and women that keep us here at home safe. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 15:39:00", 
        "title": "Suicide", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Harley. GWG and WOPA, my heart is with you. I don't know exactly what you are going through, but I lost my only daughter eight years ago ... not exactly the same thing, but the unexpected just slams you in the gut and heart and you are never the same. That, too, is an exclusive club that no one should want to join. Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****. Two currently-serving general officers (one the CG of USAREUR) have come forward and said THEY sought counseling for issues related to their deployments. Did I do enough as a commander to ensure the safety of my troops? Could I have ordered that mission sooner - or later? The kid whose life I saw bleed out before me ... I dream about him all the time. And so on - GOs and other commanders are not immune, and if THEY can benefit from counseling, why not the Joes? Unless and until it becomes acceptable in the eyes of company-level leadership and below, this situation will not improve. NCOs, much of the onus for providing support for those who need counseling - in the form of time for their appointments, mostly - is on YOU. Seems to me that it would be a helluva lot easier to let one Joe go to counseling and have to spread his/her workload around for an hour or two ... than to answer for that person's suicide because while the post hospital staff was helping, the unit dropped the ball. Sorry ... I get a bit carried away on this subject. GWG said it very well when he said no one is omnitient, the Army doesn't issue a crystal ball, and we have to do the best we can. Some of us need to do better than we have been.", 
        "intTime": 20090308, 
        "postID": 12, 
        "quote": "", 
        "reply": "Harley. GWG and WOPA, my heart is with you. I don't know exactly what you are going through, but I lost my only daughter eight years ago ... not exactly the same thing, but the unexpected just slams you in the gut and heart and you are never the same. That, too, is an exclusive club that no one should want to join. Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****. Two currently-serving general officers (one the CG of USAREUR) have come forward and said THEY sought counseling for issues related to their deployments. Did I do enough as a commander to ensure the safety of my troops? Could I have ordered that mission sooner - or later? The kid whose life I saw bleed out before me ... I dream about him all the time. And so on - GOs and other commanders are not immune, and if THEY can benefit from counseling, why not the Joes? Unless and until it becomes acceptable in the eyes of company-level leadership and below, this situation will not improve. NCOs, much of the onus for providing support for those who need counseling - in the form of time for their appointments, mostly - is on YOU. Seems to me that it would be a helluva lot easier to let one Joe go to counseling and have to spread his/her workload around for an hour or two ... than to answer for that person's suicide because while the post hospital staff was helping, the unit dropped the ball. Sorry ... I get a bit carried away on this subject. GWG said it very well when he said no one is omnitient, the Army doesn't issue a crystal ball, and we have to do the best we can. Some of us need to do better than we have been.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 05:56:00", 
        "title": "Suicide", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "im sorry to hear about the tragedy you have had to endure. sadly the first encounter i had was when i was in highschool with a friend of mine. the most disturbing part was that the same people who drove him to it, went to the funeral which i thought was paying their respects.. the next day in school ( catholic ) the same spent peices of used jet trash were at the counciling for his friends and there they were, saying on how such good friends they all were and they dont know how they would get over it.. they went to councilings because it got them out of classes for almost a month.. to this day it sickens me..", 
        "intTime": 20090308, 
        "postID": 13, 
        "quote": "", 
        "reply": "im sorry to hear about the tragedy you have had to endure. sadly the first encounter i had was when i was in highschool with a friend of mine. the most disturbing part was that the same people who drove him to it, went to the funeral which i thought was paying their respects.. the next day in school ( catholic ) the same spent peices of used jet trash were at the counciling for his friends and there they were, saying on how such good friends they all were and they dont know how they would get over it.. they went to councilings because it got them out of classes for almost a month.. to this day it sickens me..", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 07:47:00", 
        "title": "Suicide", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****. Something that the Army tried back in the 70s was a \"Transitional Period\" at the end of a soldier's enlistment (3 months)in which the soldier could find a civilian occupation and OJT into it, while still remaining in the military. There were a lot of people screwed up by Viet Nam, and a lot of people like myself, who were deciding to get out because of the rapid crazy changes that were taking place in the Army. This \"Transition Period\" gave people a chance to ease out of the pressure cooker and learn how to be civilians again, while still having the safety net of the military to fall back on. I became a teacher's aid at an elementary school in Germany. I wanted something in welding or machinists, but it wasn't available; so I jumped into whatever was - because I wanted OUT! Well, I worked with kids and found I could do it... It also gave me the confidence that something besides being a Tank Commander could be in my future - - For others, this Transition Period could be used to get away from the \"Formation and Drill\" grind and get some help with their mental twists. Instead of going to the motorpool to check end-connectors on tracks every day, they could go to sessions to sort out their problems. We had a lot of people back from Nam with 4 or 5 months to go who had some real problems - - I don't know if it helped for them to attend this sessions, because I didn't go to them, but at least the military started reaching out in a big way, because it was obvious there was a major problem. The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - As for admitting mental problems and going for help - there is a BIG stigma against that every where you go... For one thing, good-bye 2nd Amendment rights! Good-bye driving jobs and many occupations. Good-bye National Guard and Reserves as secondary incomes - - With the exploding unemployment numbers right now, what employer is going to take a person who is seeing a shrink, when there are hundreds of over-qualified people out of work who aren't - - Wandering and Wondering", 
        "intTime": 20090308, 
        "postID": 14, 
        "quote": "Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****.", 
        "reply": " Something that the Army tried back in the 70s was a \"Transitional Period\" at the end of a soldier's enlistment (3 months)in which the soldier could find a civilian occupation and OJT into it, while still remaining in the military. There were a lot of people screwed up by Viet Nam, and a lot of people like myself, who were deciding to get out because of the rapid crazy changes that were taking place in the Army. This \"Transition Period\" gave people a chance to ease out of the pressure cooker and learn how to be civilians again, while still having the safety net of the military to fall back on. I became a teacher's aid at an elementary school in Germany. I wanted something in welding or machinists, but it wasn't available; so I jumped into whatever was - because I wanted OUT! Well, I worked with kids and found I could do it... It also gave me the confidence that something besides being a Tank Commander could be in my future - - For others, this Transition Period could be used to get away from the \"Formation and Drill\" grind and get some help with their mental twists. Instead of going to the motorpool to check end-connectors on tracks every day, they could go to sessions to sort out their problems. We had a lot of people back from Nam with 4 or 5 months to go who had some real problems - - I don't know if it helped for them to attend this sessions, because I didn't go to them, but at least the military started reaching out in a big way, because it was obvious there was a major problem. The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - As for admitting mental problems and going for help - there is a BIG stigma against that every where you go... For one thing, good-bye 2nd Amendment rights! Good-bye driving jobs and many occupations. Good-bye National Guard and Reserves as secondary incomes - - With the exploding unemployment numbers right now, what employer is going to take a person who is seeing a shrink, when there are hundreds of over-qualified people out of work who aren't - - Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 08:57:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "intTime": 20090308, 
        "postID": 15, 
        "quote": "The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - -", 
        "reply": " The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 09:32:00", 
        "title": "Suicide", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. I stand corrected. Thank you for the heads up. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090308, 
        "postID": 16, 
        "quote": "Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them.", 
        "reply": " I stand corrected. Thank you for the heads up. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 09:36:00", 
        "title": "Suicide", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else. A week is not enough. This was On the Job Training in a Civilian Occupation for 3 months. I was right there teaching little kids how to read and do math in a 5th Grade Class for that amount of time - grading work, taking roll, dealing with discipline problems. When I came back to the world, I welded for a few years, but then jumped on the GI Bill, got a degree, and taught High School for 30 years. I would have never considered that option had it not been for that OJT period. I'm certain I'd fit into that category called \"maniac depressive\". It's not unusual for me to consider suicide several times a day at times. I'm certain that the chance the Army gave me to go in that other direction made a big difference. When I showed up the last day of my OJT in my Sgt. uniform to tell the kids I was going home, one little black kid, who had been a absolute pain in the azz every day, wrapped himself around my leg, started crying and screaming,\"Don't go! Don't go!\" His father was a high-ranking NCO that didn't treat him very well, but I'd tried to - - That was a life-changing experience, teaching others and coming outside of myself, that may have kept me alive all these years - - Wandering and Wondering", 
        "intTime": 20090308, 
        "postID": 17, 
        "quote": "Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "reply": " A week is not enough. This was On the Job Training in a Civilian Occupation for 3 months. I was right there teaching little kids how to read and do math in a 5th Grade Class for that amount of time - grading work, taking roll, dealing with discipline problems. When I came back to the world, I welded for a few years, but then jumped on the GI Bill, got a degree, and taught High School for 30 years. I would have never considered that option had it not been for that OJT period. I'm certain I'd fit into that category called \"maniac depressive\". It's not unusual for me to consider suicide several times a day at times. I'm certain that the chance the Army gave me to go in that other direction made a big difference. When I showed up the last day of my OJT in my Sgt. uniform to tell the kids I was going home, one little black kid, who had been a absolute pain in the azz every day, wrapped himself around my leg, started crying and screaming,\"Don't go! Don't go!\" His father was a high-ranking NCO that didn't treat him very well, but I'd tried to - - That was a life-changing experience, teaching others and coming outside of myself, that may have kept me alive all these years - - Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 09:51:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else. I like your last statement a lot. HarleyDavidsonMan, nothing about this is ever going to make sense to you. Obviously, someone dropped the ball. But it's possible that your nephew DID see someone. I don't know all the details. Nothing anyone says is going to make it okay. Death is always wrong, doubly so when someone so young dies. The only thing you can do is get some little positive thing out of it by advocating for suicide prevention and mental health awareness. I do know that it is the responsibility of every member of a unit to look out for each other. And that sometimes you need to think outside the rank box to do it. If your Sergeant Major has left his weapon off safe inside the perimeter, you don't need to ask permission from God, point it out to him yourself, respectfully and calmly. He'll thank you for it. The Chain of Command is the rule we all live by, but sometimes you need to jump it. If a person senior to you is in trouble, maybe you need to talk to someone senior to HIM. If a peer is having problems, maybe you need to go to someone with some influence (chaplain, Sergeant Major, whoever) YOURSELF, instead of WAITING for the problem to go up the chain. If you have time, use the Chain of Command. If your instincts tell you that things are moving too fast, do what you need to. Just keep your Chain of Command informed \"Sergeant, I went and talked to the Chaplain about somebody today. Sorry I didn't wait and get your go-ahead, but I had a really bad feeling about his situation.\" Do the right thing, and damn the consequences. If you get in trouble, you get in trouble. Look out for your guys. But sometimes people just WON'T ask for help. I've been in some situations myself ( I was never suicidal though ), and I don't know why exactly, but I didn't want to ask for help. I tell you what though, that MOUNTAIN of #$%* I was dealing with suddenly seemed manageable, the minute I walked into Combat Mental Health in Kirkuk, Iraq and just said, \"Hey, I'm not handling this very well.\" You want to talk about a weight off your chest. . . Getting help is not necessarily a career-ender. I'm glad some very senior guys in the military have come forward to admit they went and got help. It's a good sign. None of us need to go it alone. We don't go it alone on the job in the military now do we? This message has been edited. Last edited by: Ruanne, Mon 09 March 2009 12:18 PM", 
        "intTime": 20090309, 
        "postID": 18, 
        "quote": "Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "reply": " I like your last statement a lot. HarleyDavidsonMan, nothing about this is ever going to make sense to you. Obviously, someone dropped the ball. But it's possible that your nephew DID see someone. I don't know all the details. Nothing anyone says is going to make it okay. Death is always wrong, doubly so when someone so young dies. The only thing you can do is get some little positive thing out of it by advocating for suicide prevention and mental health awareness. I do know that it is the responsibility of every member of a unit to look out for each other. And that sometimes you need to think outside the rank box to do it. If your Sergeant Major has left his weapon off safe inside the perimeter, you don't need to ask permission from God, point it out to him yourself, respectfully and calmly. He'll thank you for it. The Chain of Command is the rule we all live by, but sometimes you need to jump it. If a person senior to you is in trouble, maybe you need to talk to someone senior to HIM. If a peer is having problems, maybe you need to go to someone with some influence (chaplain, Sergeant Major, whoever) YOURSELF, instead of WAITING for the problem to go up the chain. If you have time, use the Chain of Command. If your instincts tell you that things are moving too fast, do what you need to. Just keep your Chain of Command informed \"Sergeant, I went and talked to the Chaplain about somebody today. Sorry I didn't wait and get your go-ahead, but I had a really bad feeling about his situation.\" Do the right thing, and damn the consequences. If you get in trouble, you get in trouble. Look out for your guys. But sometimes people just WON'T ask for help. I've been in some situations myself ( I was never suicidal though ), and I don't know why exactly, but I didn't want to ask for help. I tell you what though, that MOUNTAIN of #$%* I was dealing with suddenly seemed manageable, the minute I walked into Combat Mental Health in Kirkuk, Iraq and just said, \"Hey, I'm not handling this very well.\" You want to talk about a weight off your chest. . . Getting help is not necessarily a career-ender. I'm glad some very senior guys in the military have come forward to admit they went and got help. It's a good sign. None of us need to go it alone. We don't go it alone on the job in the military now do we? This message has been edited. Last edited by: Ruanne, Mon 09 March 2009 12:18 PM", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-09 11:47:00", 
        "title": "Suicide", 
        "userID": "Ruanne"
    }, 
    {
        "content": "It's a permanent solution to a temporary problem. I work with a professional here who is adamant that her generation (she was a WAC) went to Church. This gives one the impressional that suicide is NEVER an option no matter how bad it gets. The professionals don't teach a reliance on G-d. They want them to become depenedant on the profession. It's good business. Today's youth don't have the foundations of religion which used to get taught on a regular basis. If he were an ongoing churchmember, I would be shocked.", 
        "intTime": 20090309, 
        "postID": 19, 
        "quote": "", 
        "reply": "It's a permanent solution to a temporary problem. I work with a professional here who is adamant that her generation (she was a WAC) went to Church. This gives one the impressional that suicide is NEVER an option no matter how bad it gets. The professionals don't teach a reliance on G-d. They want them to become depenedant on the profession. It's good business. Today's youth don't have the foundations of religion which used to get taught on a regular basis. If he were an ongoing churchmember, I would be shocked.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-09 12:00:00", 
        "title": "Suicide", 
        "userID": "Crateman"
    }, 
    {
        "content": "I am very, very sorry to hear about your loss. It's almost impossible to find a legitimate reason for a person taking their own life, and for those of us left behind, that's a difficult piece to deal with. For me, my loss from a suicide was never reconciled. Even though there was a note, it still didn't erase the grief of the loss, the anger in the selfishness and what I perceived as lack of trust in me by the loved one who took their life, and the guilt I felt for something I thought I did or didn't do. Just know that, whatever it was that drove him to kill himself, it no longer plagues him, and he's at peace. It's hard - damned hard. I'll pray for him, and your family.", 
        "intTime": 20090309, 
        "postID": 20, 
        "quote": "", 
        "reply": "I am very, very sorry to hear about your loss. It's almost impossible to find a legitimate reason for a person taking their own life, and for those of us left behind, that's a difficult piece to deal with. For me, my loss from a suicide was never reconciled. Even though there was a note, it still didn't erase the grief of the loss, the anger in the selfishness and what I perceived as lack of trust in me by the loved one who took their life, and the guilt I felt for something I thought I did or didn't do. Just know that, whatever it was that drove him to kill himself, it no longer plagues him, and he's at peace. It's hard - damned hard. I'll pray for him, and your family.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-09 12:04:00", 
        "title": "Suicide", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!?", 
        "intTime": 20090307, 
        "postID": 21, 
        "quote": "", 
        "reply": "I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!?", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:19:00", 
        "title": "Suicide", 
        "userID": "harleydavidsonman"
    }, 
    {
        "content": "I am truly sorry for your lose.... As for your question, I have no answers there. All I know is I have known 3 people who felt that it was the only answer for them. And it sucks.", 
        "intTime": 20090307, 
        "postID": 22, 
        "quote": "", 
        "reply": "I am truly sorry for your lose.... As for your question, I have no answers there. All I know is I have known 3 people who felt that it was the only answer for them. And it sucks.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:35:00", 
        "title": "Suicide", 
        "userID": "NLJailer"
    }, 
    {
        "content": "Harley, My condolences! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090307, 
        "postID": 23, 
        "quote": "", 
        "reply": "Harley, My condolences! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:39:00", 
        "title": "Suicide", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Who was pulling the trigger? Was he over 18 or 21? These aren't sarcastic ribs...just realities. Responsibility lies with the individual, unless he or she is absolutely crazy. Tragedies like this happen when hard times and conflicts come along. We had two \"suicide by cop\" events in this state just last week. People losing jobs and homes, people coming back to the world after seeing the wolf and the jackal... People can get lawyers and sue everybody on the perimeter and point the finger at everyone that ever walked near the guy with the gun. But who's finger was on the trigger? America has slid into this zone where they expect commanders, plt leaders, principals, teachers, police, everybody to be expert psychologists to sort everything out, wisely and prophetically with vision of forethought, for the individual - - Well, the simple fact is...They can't. How many times does it happen that the cops show up BEFORE the bank robbery or the Highway Patrol BEFORE the 90 car pile-up? It just don't happen - - Probably too injurious to ask, \"Where was the family......?\" Said deal... And don't think I'm talking through my hat. I got called home from work at about noon one day, and got to watch my Dad take his last breath after shooting himself in the head with a .38 - - Where was I - -? Wandering and Wondering", 
        "intTime": 20090307, 
        "postID": 24, 
        "quote": "", 
        "reply": "Who was pulling the trigger? Was he over 18 or 21? These aren't sarcastic ribs...just realities. Responsibility lies with the individual, unless he or she is absolutely crazy. Tragedies like this happen when hard times and conflicts come along. We had two \"suicide by cop\" events in this state just last week. People losing jobs and homes, people coming back to the world after seeing the wolf and the jackal... People can get lawyers and sue everybody on the perimeter and point the finger at everyone that ever walked near the guy with the gun. But who's finger was on the trigger? America has slid into this zone where they expect commanders, plt leaders, principals, teachers, police, everybody to be expert psychologists to sort everything out, wisely and prophetically with vision of forethought, for the individual - - Well, the simple fact is...They can't. How many times does it happen that the cops show up BEFORE the bank robbery or the Highway Patrol BEFORE the 90 car pile-up? It just don't happen - - Probably too injurious to ask, \"Where was the family......?\" Said deal... And don't think I'm talking through my hat. I got called home from work at about noon one day, and got to watch my Dad take his last breath after shooting himself in the head with a .38 - - Where was I - -? Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:42:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Sorry GW", 
        "intTime": 20090307, 
        "postID": 25, 
        "quote": "", 
        "reply": "Sorry GW", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:52:00", 
        "title": "Suicide", 
        "userID": "NLJailer"
    }, 
    {
        "content": "HarleyDavidsonMan and me are in a club that should have no members - - None need apply - - Wandering and Wondering", 
        "intTime": 20090307, 
        "postID": 26, 
        "quote": "", 
        "reply": "HarleyDavidsonMan and me are in a club that should have no members - - None need apply - - Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 08:58:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "No one can know the heart ache or questions that nag at you. Suicide has left it’s nasty scares all over my heart. Way back in 1954 my bunk mate use him M1 to take his own life on my bed. We had been together for four weeks and I thought he was just like the rest of us who hated basic. I was section leader at Dover AFB in 1959 when an airmen in my sections hung him self. We talked everyday and played poker together a couple of times a week. I never saw it coming. In 1963 my oldest brother killed himself. We knew he was sick with TB and we knew he was depressed but we could not watch him 24/7, he was 49 years old. In 1996 our then oldest DIL killed her self, she was only 25. I had known since she was nine years old. That was five years longer than my son had known her. I loved her, and still love her with all of my heart. We knew she had emotional problems and she was being seen by a counselor know one thought she was suicidal. I help my son for several hours on suspension of murder. They released him to me and it took three long days before they had the evidence they needed to prove she died by her own hand. And he was several miles away from home when it happened. It took my son five years before he could ever think of having another woman in his life. He has now been married to this fantastic lady who brought two more grandchildren into our lives. Again, none us can know the heart ache or answer the questions you have, but please know that our hearts, prayers and love goes out to you and his family and friends. You never get over it but you learn to live with it. This message has been edited. Last edited by: OldArmyLove, Sun 08 March 2009 01:44 PM A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090307, 
        "postID": 27, 
        "quote": "", 
        "reply": "No one can know the heart ache or questions that nag at you. Suicide has left it’s nasty scares all over my heart. Way back in 1954 my bunk mate use him M1 to take his own life on my bed. We had been together for four weeks and I thought he was just like the rest of us who hated basic. I was section leader at Dover AFB in 1959 when an airmen in my sections hung him self. We talked everyday and played poker together a couple of times a week. I never saw it coming. In 1963 my oldest brother killed himself. We knew he was sick with TB and we knew he was depressed but we could not watch him 24/7, he was 49 years old. In 1996 our then oldest DIL killed her self, she was only 25. I had known since she was nine years old. That was five years longer than my son had known her. I loved her, and still love her with all of my heart. We knew she had emotional problems and she was being seen by a counselor know one thought she was suicidal. I help my son for several hours on suspension of murder. They released him to me and it took three long days before they had the evidence they needed to prove she died by her own hand. And he was several miles away from home when it happened. It took my son five years before he could ever think of having another woman in his life. He has now been married to this fantastic lady who brought two more grandchildren into our lives. Again, none us can know the heart ache or answer the questions you have, but please know that our hearts, prayers and love goes out to you and his family and friends. You never get over it but you learn to live with it. This message has been edited. Last edited by: OldArmyLove, Sun 08 March 2009 01:44 PM A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 09:55:00", 
        "title": "Suicide", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "We can sometimes see little changes that may lead to serious consequences but not always. Some people have the ability to keep everything inside until they reach the point of no return and then no one can reach them with assistance. Had a sp/4 in my platoon over in Nam. Nice guy, did his job got along well with everyone was on the promotion list. Went out behind the bunker and shot himself. While going through his personal effects I found a letter from his girlfriend saying she was dating another guy (dear John). Didn't show any signs so we didn't know anything was wrong. One never knows!", 
        "intTime": 20090307, 
        "postID": 28, 
        "quote": "", 
        "reply": "We can sometimes see little changes that may lead to serious consequences but not always. Some people have the ability to keep everything inside until they reach the point of no return and then no one can reach them with assistance. Had a sp/4 in my platoon over in Nam. Nice guy, did his job got along well with everyone was on the promotion list. Went out behind the bunker and shot himself. While going through his personal effects I found a letter from his girlfriend saying she was dating another guy (dear John). Didn't show any signs so we didn't know anything was wrong. One never knows!", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 14:21:00", 
        "title": "Suicide", 
        "userID": "Vanir97"
    }, 
    {
        "content": "Please remember this number, cary it with you. You never know when you maight meet a vet who needs it. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "intTime": 20090307, 
        "postID": 29, 
        "quote": "", 
        "reply": "Please remember this number, cary it with you. You never know when you maight meet a vet who needs it. A listening ear, a caring heart, an open mind and an extend hand may be all I can offer, but they are yours without charge or judgment.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 14:35:00", 
        "title": "Suicide", 
        "userID": "OldArmyWOPA"
    }, 
    {
        "content": "First, my condolences, thoughts and prayers to you and your family. I, too, have had the misfortune of personally dealing with this. Doing the typical male thing, I spent a lot of time trying to figure it out. I finally came to this conclusion: I was trying to apply rationale to an irrational act. Can't be done... I went thru the anger faze also. Mad at him. Mad at me. Mad at the system. Finally I just had to let it be... It was not rational. And it would never make sense.", 
        "intTime": 20090307, 
        "postID": 30, 
        "quote": "", 
        "reply": "First, my condolences, thoughts and prayers to you and your family. I, too, have had the misfortune of personally dealing with this. Doing the typical male thing, I spent a lot of time trying to figure it out. I finally came to this conclusion: I was trying to apply rationale to an irrational act. Can't be done... I went thru the anger faze also. Mad at him. Mad at me. Mad at the system. Finally I just had to let it be... It was not rational. And it would never make sense.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 15:20:00", 
        "title": "Suicide", 
        "userID": "2494906"
    }, 
    {
        "content": "quote: Originally posted by HarleyDavidsonMan: I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!? I'm so sorry about your nephew and you as well. It is all too common and I do truly understand your anger. I would imagine it's at least partially fueled by frustration. There are so many returning solders with problems and too few to help them. also they're dealing with the human mind Every single one of us is different. It's not like we're some mass produced thing that reacts and responds to everything the same way. I'm not passing myself off as any sort of expert but I do think I've spoken with enough returning solders over the past years to have some sort of handle as to what's going on. Every one of the vets are different and every one of them needs custom tailored treatment. there just aren't enough people to do that. As I think deeper into this I'm coming to the conclusion that those MDs., PHds and all the other dudes with more degrees than a thermometer lack one essential qualification to be helpful. How can any of them know what it was like to be there? They might as well try to treat a Martian. I'm thinking about some sort organized group of former combat veterans with professional guidance possibly being their best hope. I've been shooting my mouth off for too long. I think it's time to end this. I'll do so by again expressing my sympathy to all involved and again thanking all those brave men and women that keep us here at home safe. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090307, 
        "postID": 31, 
        "quote": "Originally posted by HarleyDavidsonMan: I have to say a bit on this subject as the reality of it hit very close to home with me recently. My Nephew from my first marriage had returned from Iraq to Ft Carson. He had recieved the Purple Heart and Arcom w/ Valor device. He was apparently having difficulties in the life back home with his wife. In January he finally had tried and rie dto get the leadership within his unit to help him but to nno avail. He pulled out his semi auto weapon and began firing within the confines of his home. His wife escaped but even after a standoff with police he still did the final act of crying for help--killed himself. My issue is WHY and WHERE were the squad leaders and platoon sgts and 1sgs and the commanders to help him along. He was seeking treatment at the hospital. What is the issue here that our Soldiers find it so hard to seek help and have to feel that the only way out to end it all? WHY!?", 
        "reply": " I'm so sorry about your nephew and you as well. It is all too common and I do truly understand your anger. I would imagine it's at least partially fueled by frustration. There are so many returning solders with problems and too few to help them. also they're dealing with the human mind Every single one of us is different. It's not like we're some mass produced thing that reacts and responds to everything the same way. I'm not passing myself off as any sort of expert but I do think I've spoken with enough returning solders over the past years to have some sort of handle as to what's going on. Every one of the vets are different and every one of them needs custom tailored treatment. there just aren't enough people to do that. As I think deeper into this I'm coming to the conclusion that those MDs., PHds and all the other dudes with more degrees than a thermometer lack one essential qualification to be helpful. How can any of them know what it was like to be there? They might as well try to treat a Martian. I'm thinking about some sort organized group of former combat veterans with professional guidance possibly being their best hope. I've been shooting my mouth off for too long. I think it's time to end this. I'll do so by again expressing my sympathy to all involved and again thanking all those brave men and women that keep us here at home safe. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-07 15:39:00", 
        "title": "Suicide", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Harley. GWG and WOPA, my heart is with you. I don't know exactly what you are going through, but I lost my only daughter eight years ago ... not exactly the same thing, but the unexpected just slams you in the gut and heart and you are never the same. That, too, is an exclusive club that no one should want to join. Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****. Two currently-serving general officers (one the CG of USAREUR) have come forward and said THEY sought counseling for issues related to their deployments. Did I do enough as a commander to ensure the safety of my troops? Could I have ordered that mission sooner - or later? The kid whose life I saw bleed out before me ... I dream about him all the time. And so on - GOs and other commanders are not immune, and if THEY can benefit from counseling, why not the Joes? Unless and until it becomes acceptable in the eyes of company-level leadership and below, this situation will not improve. NCOs, much of the onus for providing support for those who need counseling - in the form of time for their appointments, mostly - is on YOU. Seems to me that it would be a helluva lot easier to let one Joe go to counseling and have to spread his/her workload around for an hour or two ... than to answer for that person's suicide because while the post hospital staff was helping, the unit dropped the ball. Sorry ... I get a bit carried away on this subject. GWG said it very well when he said no one is omnitient, the Army doesn't issue a crystal ball, and we have to do the best we can. Some of us need to do better than we have been.", 
        "intTime": 20090308, 
        "postID": 32, 
        "quote": "", 
        "reply": "Harley. GWG and WOPA, my heart is with you. I don't know exactly what you are going through, but I lost my only daughter eight years ago ... not exactly the same thing, but the unexpected just slams you in the gut and heart and you are never the same. That, too, is an exclusive club that no one should want to join. Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****. Two currently-serving general officers (one the CG of USAREUR) have come forward and said THEY sought counseling for issues related to their deployments. Did I do enough as a commander to ensure the safety of my troops? Could I have ordered that mission sooner - or later? The kid whose life I saw bleed out before me ... I dream about him all the time. And so on - GOs and other commanders are not immune, and if THEY can benefit from counseling, why not the Joes? Unless and until it becomes acceptable in the eyes of company-level leadership and below, this situation will not improve. NCOs, much of the onus for providing support for those who need counseling - in the form of time for their appointments, mostly - is on YOU. Seems to me that it would be a helluva lot easier to let one Joe go to counseling and have to spread his/her workload around for an hour or two ... than to answer for that person's suicide because while the post hospital staff was helping, the unit dropped the ball. Sorry ... I get a bit carried away on this subject. GWG said it very well when he said no one is omnitient, the Army doesn't issue a crystal ball, and we have to do the best we can. Some of us need to do better than we have been.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 05:56:00", 
        "title": "Suicide", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "im sorry to hear about the tragedy you have had to endure. sadly the first encounter i had was when i was in highschool with a friend of mine. the most disturbing part was that the same people who drove him to it, went to the funeral which i thought was paying their respects.. the next day in school ( catholic ) the same spent peices of used jet trash were at the counciling for his friends and there they were, saying on how such good friends they all were and they dont know how they would get over it.. they went to councilings because it got them out of classes for almost a month.. to this day it sickens me..", 
        "intTime": 20090308, 
        "postID": 33, 
        "quote": "", 
        "reply": "im sorry to hear about the tragedy you have had to endure. sadly the first encounter i had was when i was in highschool with a friend of mine. the most disturbing part was that the same people who drove him to it, went to the funeral which i thought was paying their respects.. the next day in school ( catholic ) the same spent peices of used jet trash were at the counciling for his friends and there they were, saying on how such good friends they all were and they dont know how they would get over it.. they went to councilings because it got them out of classes for almost a month.. to this day it sickens me..", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 07:47:00", 
        "title": "Suicide", 
        "userID": "88miker"
    }, 
    {
        "content": "quote: Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****. Something that the Army tried back in the 70s was a \"Transitional Period\" at the end of a soldier's enlistment (3 months)in which the soldier could find a civilian occupation and OJT into it, while still remaining in the military. There were a lot of people screwed up by Viet Nam, and a lot of people like myself, who were deciding to get out because of the rapid crazy changes that were taking place in the Army. This \"Transition Period\" gave people a chance to ease out of the pressure cooker and learn how to be civilians again, while still having the safety net of the military to fall back on. I became a teacher's aid at an elementary school in Germany. I wanted something in welding or machinists, but it wasn't available; so I jumped into whatever was - because I wanted OUT! Well, I worked with kids and found I could do it... It also gave me the confidence that something besides being a Tank Commander could be in my future - - For others, this Transition Period could be used to get away from the \"Formation and Drill\" grind and get some help with their mental twists. Instead of going to the motorpool to check end-connectors on tracks every day, they could go to sessions to sort out their problems. We had a lot of people back from Nam with 4 or 5 months to go who had some real problems - - I don't know if it helped for them to attend this sessions, because I didn't go to them, but at least the military started reaching out in a big way, because it was obvious there was a major problem. The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - As for admitting mental problems and going for help - there is a BIG stigma against that every where you go... For one thing, good-bye 2nd Amendment rights! Good-bye driving jobs and many occupations. Good-bye National Guard and Reserves as secondary incomes - - With the exploding unemployment numbers right now, what employer is going to take a person who is seeing a shrink, when there are hundreds of over-qualified people out of work who aren't - - Wandering and Wondering", 
        "intTime": 20090308, 
        "postID": 34, 
        "quote": "Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. The other problem is that while the medical community is busting its collective ballz trying to screen people before, during and after deployment, AND support their families, AND treat those who have diagnosed PTSD or mTBI ... the line still stubbornly clings to the notion that seeking help for emotional/mental health issues is somehow unmanly or un-soldierlike. What utter bull****.", 
        "reply": " Something that the Army tried back in the 70s was a \"Transitional Period\" at the end of a soldier's enlistment (3 months)in which the soldier could find a civilian occupation and OJT into it, while still remaining in the military. There were a lot of people screwed up by Viet Nam, and a lot of people like myself, who were deciding to get out because of the rapid crazy changes that were taking place in the Army. This \"Transition Period\" gave people a chance to ease out of the pressure cooker and learn how to be civilians again, while still having the safety net of the military to fall back on. I became a teacher's aid at an elementary school in Germany. I wanted something in welding or machinists, but it wasn't available; so I jumped into whatever was - because I wanted OUT! Well, I worked with kids and found I could do it... It also gave me the confidence that something besides being a Tank Commander could be in my future - - For others, this Transition Period could be used to get away from the \"Formation and Drill\" grind and get some help with their mental twists. Instead of going to the motorpool to check end-connectors on tracks every day, they could go to sessions to sort out their problems. We had a lot of people back from Nam with 4 or 5 months to go who had some real problems - - I don't know if it helped for them to attend this sessions, because I didn't go to them, but at least the military started reaching out in a big way, because it was obvious there was a major problem. The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - As for admitting mental problems and going for help - there is a BIG stigma against that every where you go... For one thing, good-bye 2nd Amendment rights! Good-bye driving jobs and many occupations. Good-bye National Guard and Reserves as secondary incomes - - With the exploding unemployment numbers right now, what employer is going to take a person who is seeing a shrink, when there are hundreds of over-qualified people out of work who aren't - - Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 08:57:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "intTime": 20090308, 
        "postID": 35, 
        "quote": "The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - -", 
        "reply": " The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 09:32:00", 
        "title": "Suicide", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them. I stand corrected. Thank you for the heads up. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090308, 
        "postID": 36, 
        "quote": "Vicdude, many (probably most) of the military psychologists and psychiatrists dealing with today's returning servicemembers HAVE been there and done that. Today's military docs are not the coddled and swaddled prima donnas of days gone by. The problem is that there are not enough of them.", 
        "reply": " I stand corrected. Thank you for the heads up. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 09:36:00", 
        "title": "Suicide", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else. A week is not enough. This was On the Job Training in a Civilian Occupation for 3 months. I was right there teaching little kids how to read and do math in a 5th Grade Class for that amount of time - grading work, taking roll, dealing with discipline problems. When I came back to the world, I welded for a few years, but then jumped on the GI Bill, got a degree, and taught High School for 30 years. I would have never considered that option had it not been for that OJT period. I'm certain I'd fit into that category called \"maniac depressive\". It's not unusual for me to consider suicide several times a day at times. I'm certain that the chance the Army gave me to go in that other direction made a big difference. When I showed up the last day of my OJT in my Sgt. uniform to tell the kids I was going home, one little black kid, who had been a absolute pain in the azz every day, wrapped himself around my leg, started crying and screaming,\"Don't go! Don't go!\" His father was a high-ranking NCO that didn't treat him very well, but I'd tried to - - That was a life-changing experience, teaching others and coming outside of myself, that may have kept me alive all these years - - Wandering and Wondering", 
        "intTime": 20090308, 
        "postID": 37, 
        "quote": "Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "reply": " A week is not enough. This was On the Job Training in a Civilian Occupation for 3 months. I was right there teaching little kids how to read and do math in a 5th Grade Class for that amount of time - grading work, taking roll, dealing with discipline problems. When I came back to the world, I welded for a few years, but then jumped on the GI Bill, got a degree, and taught High School for 30 years. I would have never considered that option had it not been for that OJT period. I'm certain I'd fit into that category called \"maniac depressive\". It's not unusual for me to consider suicide several times a day at times. I'm certain that the chance the Army gave me to go in that other direction made a big difference. When I showed up the last day of my OJT in my Sgt. uniform to tell the kids I was going home, one little black kid, who had been a absolute pain in the azz every day, wrapped himself around my leg, started crying and screaming,\"Don't go! Don't go!\" His father was a high-ranking NCO that didn't treat him very well, but I'd tried to - - That was a life-changing experience, teaching others and coming outside of myself, that may have kept me alive all these years - - Wandering and Wondering", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-08 09:51:00", 
        "title": "Suicide", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else. I like your last statement a lot. HarleyDavidsonMan, nothing about this is ever going to make sense to you. Obviously, someone dropped the ball. But it's possible that your nephew DID see someone. I don't know all the details. Nothing anyone says is going to make it okay. Death is always wrong, doubly so when someone so young dies. The only thing you can do is get some little positive thing out of it by advocating for suicide prevention and mental health awareness. I do know that it is the responsibility of every member of a unit to look out for each other. And that sometimes you need to think outside the rank box to do it. If your Sergeant Major has left his weapon off safe inside the perimeter, you don't need to ask permission from God, point it out to him yourself, respectfully and calmly. He'll thank you for it. The Chain of Command is the rule we all live by, but sometimes you need to jump it. If a person senior to you is in trouble, maybe you need to talk to someone senior to HIM. If a peer is having problems, maybe you need to go to someone with some influence (chaplain, Sergeant Major, whoever) YOURSELF, instead of WAITING for the problem to go up the chain. If you have time, use the Chain of Command. If your instincts tell you that things are moving too fast, do what you need to. Just keep your Chain of Command informed \"Sergeant, I went and talked to the Chaplain about somebody today. Sorry I didn't wait and get your go-ahead, but I had a really bad feeling about his situation.\" Do the right thing, and damn the consequences. If you get in trouble, you get in trouble. Look out for your guys. But sometimes people just WON'T ask for help. I've been in some situations myself ( I was never suicidal though ), and I don't know why exactly, but I didn't want to ask for help. I tell you what though, that MOUNTAIN of #$%* I was dealing with suddenly seemed manageable, the minute I walked into Combat Mental Health in Kirkuk, Iraq and just said, \"Hey, I'm not handling this very well.\" You want to talk about a weight off your chest. . . Getting help is not necessarily a career-ender. I'm glad some very senior guys in the military have come forward to admit they went and got help. It's a good sign. None of us need to go it alone. We don't go it alone on the job in the military now do we? This message has been edited. Last edited by: Ruanne, Mon 09 March 2009 12:18 PM", 
        "intTime": 20090309, 
        "postID": 38, 
        "quote": "Originally posted by foxred03: quote: The military ought to be doing these kinds of things to Transition people back to civilian life NOW, instead of just kicking them out the door with a head full of bent wires and no clue how to be a civilian - - The military does do that. I had to go through a week or so of job fairs and counseling when my NG unit got back from Iraq. The Army is also revamping its suicide prevention classes. The thing is, mental problems may or may not affect a career. Many soldiers have sought help, recieved it, and continued on. Suicide however permanently ends a career and everything else.", 
        "reply": " I like your last statement a lot. HarleyDavidsonMan, nothing about this is ever going to make sense to you. Obviously, someone dropped the ball. But it's possible that your nephew DID see someone. I don't know all the details. Nothing anyone says is going to make it okay. Death is always wrong, doubly so when someone so young dies. The only thing you can do is get some little positive thing out of it by advocating for suicide prevention and mental health awareness. I do know that it is the responsibility of every member of a unit to look out for each other. And that sometimes you need to think outside the rank box to do it. If your Sergeant Major has left his weapon off safe inside the perimeter, you don't need to ask permission from God, point it out to him yourself, respectfully and calmly. He'll thank you for it. The Chain of Command is the rule we all live by, but sometimes you need to jump it. If a person senior to you is in trouble, maybe you need to talk to someone senior to HIM. If a peer is having problems, maybe you need to go to someone with some influence (chaplain, Sergeant Major, whoever) YOURSELF, instead of WAITING for the problem to go up the chain. If you have time, use the Chain of Command. If your instincts tell you that things are moving too fast, do what you need to. Just keep your Chain of Command informed \"Sergeant, I went and talked to the Chaplain about somebody today. Sorry I didn't wait and get your go-ahead, but I had a really bad feeling about his situation.\" Do the right thing, and damn the consequences. If you get in trouble, you get in trouble. Look out for your guys. But sometimes people just WON'T ask for help. I've been in some situations myself ( I was never suicidal though ), and I don't know why exactly, but I didn't want to ask for help. I tell you what though, that MOUNTAIN of #$%* I was dealing with suddenly seemed manageable, the minute I walked into Combat Mental Health in Kirkuk, Iraq and just said, \"Hey, I'm not handling this very well.\" You want to talk about a weight off your chest. . . Getting help is not necessarily a career-ender. I'm glad some very senior guys in the military have come forward to admit they went and got help. It's a good sign. None of us need to go it alone. We don't go it alone on the job in the military now do we? This message has been edited. Last edited by: Ruanne, Mon 09 March 2009 12:18 PM", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-09 11:47:00", 
        "title": "Suicide", 
        "userID": "Ruanne"
    }, 
    {
        "content": "It's a permanent solution to a temporary problem. I work with a professional here who is adamant that her generation (she was a WAC) went to Church. This gives one the impressional that suicide is NEVER an option no matter how bad it gets. The professionals don't teach a reliance on G-d. They want them to become depenedant on the profession. It's good business. Today's youth don't have the foundations of religion which used to get taught on a regular basis. If he were an ongoing churchmember, I would be shocked.", 
        "intTime": 20090309, 
        "postID": 39, 
        "quote": "", 
        "reply": "It's a permanent solution to a temporary problem. I work with a professional here who is adamant that her generation (she was a WAC) went to Church. This gives one the impressional that suicide is NEVER an option no matter how bad it gets. The professionals don't teach a reliance on G-d. They want them to become depenedant on the profession. It's good business. Today's youth don't have the foundations of religion which used to get taught on a regular basis. If he were an ongoing churchmember, I would be shocked.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-09 12:00:00", 
        "title": "Suicide", 
        "userID": "Crateman"
    }, 
    {
        "content": "I am very, very sorry to hear about your loss. It's almost impossible to find a legitimate reason for a person taking their own life, and for those of us left behind, that's a difficult piece to deal with. For me, my loss from a suicide was never reconciled. Even though there was a note, it still didn't erase the grief of the loss, the anger in the selfishness and what I perceived as lack of trust in me by the loved one who took their life, and the guilt I felt for something I thought I did or didn't do. Just know that, whatever it was that drove him to kill himself, it no longer plagues him, and he's at peace. It's hard - damned hard. I'll pray for him, and your family.", 
        "intTime": 20090309, 
        "postID": 40, 
        "quote": "", 
        "reply": "I am very, very sorry to hear about your loss. It's almost impossible to find a legitimate reason for a person taking their own life, and for those of us left behind, that's a difficult piece to deal with. For me, my loss from a suicide was never reconciled. Even though there was a note, it still didn't erase the grief of the loss, the anger in the selfishness and what I perceived as lack of trust in me by the loved one who took their life, and the guilt I felt for something I thought I did or didn't do. Just know that, whatever it was that drove him to kill himself, it no longer plagues him, and he's at peace. It's hard - damned hard. I'll pray for him, and your family.", 
        "threadID": "5291911282_5550081712001", 
        "time": "2009-03-09 12:04:00", 
        "title": "Suicide", 
        "userID": "mcgreer"
    }
]