[
    {
        "content": "I was talking to a friend of mine today and he said that in obama's TV speech a couple weeks ago that Obama said The United States is no longer a Christian Nation. My Friend Said His Pastor was really upset about that. My Question is Did anyone else hear it..???? This message has been edited. Last edited by: EOCRon, Mon 04 May 2009 06:14 PM SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "", 
        "reply": "I was talking to a friend of mine today and he said that in obama's TV speech a couple weeks ago that Obama said The United States is no longer a Christian Nation. My Friend Said His Pastor was really upset about that. My Question is Did anyone else hear it..???? This message has been edited. Last edited by: EOCRon, Mon 04 May 2009 06:14 PM SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_7570094222001", 
        "time": "2009-05-04 17:36:00", 
        "title": "I Have A Question--Important", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Not me, then again, I don't watch the world News too much, (get Mad)", 
        "intTime": 20090504, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not me, then again, I don't watch the world News too much, (get Mad)", 
        "threadID": "5291911282_7570094222001", 
        "time": "2009-05-04 17:38:00", 
        "title": "I Have A Question--Important", 
        "userID": "Jonsey36"
    }, 
    {
        "content": "Yeh, he said it while addressing a bunch of Arab leaders in the Middle East, and he is right - Though the American People may be 70% Christian and declining, the Country's academic institutions and governmental agencies/departments are consistently run, and all their agendas are set by members of the upper class 25% who mostly boast no religious affiliation of any kind. Since they are the ones that set the tone, push the agendas and pass the laws which consistently move this country past secularism to a near-antagonistic stance towards our Judeo-Christian heritage, it would be ludicrous to call this a \"Christian Nation.\" Wandering and Wondering", 
        "intTime": 20090504, 
        "postID": 3, 
        "quote": "", 
        "reply": "Yeh, he said it while addressing a bunch of Arab leaders in the Middle East, and he is right - Though the American People may be 70% Christian and declining, the Country's academic institutions and governmental agencies/departments are consistently run, and all their agendas are set by members of the upper class 25% who mostly boast no religious affiliation of any kind. Since they are the ones that set the tone, push the agendas and pass the laws which consistently move this country past secularism to a near-antagonistic stance towards our Judeo-Christian heritage, it would be ludicrous to call this a \"Christian Nation.\" Wandering and Wondering", 
        "threadID": "5291911282_7570094222001", 
        "time": "2009-05-04 20:41:00", 
        "title": "I Have A Question--Important", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Yeh, he said it while addressing a bunch of Arab leaders in the Middle East, and he is right - Though the American People may be 70% Christian and declining, the Country's academic institutions and governmental agencies/departments are consistently run, and all their agendas are set by members of the upper class 25% who mostly boast no religious affiliation of any kind. Since they are the ones that set the tone, push the agendas and pass the laws which consistently move this country past secularism to a near-antagonistic stance towards our Judeo-Christian heritage, it would be ludicrous to call this a \"Christian Nation.\" I feel the same way, you just say it better. Is this legal? I don't know,but its fun isn't?!", 
        "intTime": 20090504, 
        "postID": 4, 
        "quote": "Originally posted by greywolfghost: Yeh, he said it while addressing a bunch of Arab leaders in the Middle East, and he is right - Though the American People may be 70% Christian and declining, the Country's academic institutions and governmental agencies/departments are consistently run, and all their agendas are set by members of the upper class 25% who mostly boast no religious affiliation of any kind. Since they are the ones that set the tone, push the agendas and pass the laws which consistently move this country past secularism to a near-antagonistic stance towards our Judeo-Christian heritage, it would be ludicrous to call this a \"Christian Nation.\"", 
        "reply": " I feel the same way, you just say it better. Is this legal? I don't know,but its fun isn't?!", 
        "threadID": "5291911282_7570094222001", 
        "time": "2009-05-04 21:24:00", 
        "title": "I Have A Question--Important", 
        "userID": "DSTremf"
    }
]