[
    {
        "content": "I read this and found it to be interesting..unfortunately, most of us who live in this real world dont want to take risks and jepardize our families therefore we bow down to government who sets the rules so we dont have chaos in our land...I was always taught esp in my church to obey the laws of the land.. we have to have some form of rules which were originally based on the 10 ommandments but...like it says in this article..government made the constitution which had a different intent at that time....so its controled by the government we have now and can be changed by the government like we now see happening..with interpretation.. but the writers and signers of the constitution put in the 10 ammendments...to make sure that people knew that they did have inalienable rights irregardless of the constitution which can be fooled with or changed...by government...our other rights do not come from the gov. we already had them from the Almighty...so read and leave comments abt what you think...one part is a challenge..but like Martin luther if you want to make your mark..I say do it in a peaceful manner...persistance and kindness speak louder ..reach the heart...READ BELOW..YOU JUDGE AND LEAVE YOUR COMMENT..its not new just a different way of saying things and we do have freedom of speech...Oh and one more thing...who is the government...I think it use to be ..'we the people\"...now we hire someone to govern us..probly have chaos without it.. \"\"Because Americans Have Been Conditioned to Live Our Lives Under the True Essence of Slavery\"\"\" March 11, 2009 by DrD George Nelson USAF, retired All of this fretting, whining, buying licenses and permits, asking for permission and pleading with government is the fault of none other than we the people, but along the way, we’ve had a lot of help in that respect from Lawyers, the GOA, the NRA, AARP, ETC., and yes, our bought and paid for congressional politicians. If we had lived our lives as free sovereigns as the framers had idealistically hoped, there would be little need for all the organizations that are in the business of fighting on our behalf by hacking at the branches rather than striking the root. Ben Franklin was doubtful that the founder’s experiment with self government would function successfully for very long, and as it turns out, he was right. We now “voluntarily” pay more than half of our working wages in taxes for services that we often do not want, nor did we request. We pay for licenses to get married, and we are taxed for our food, our clothing, and our shelter. We fight the bureaucracy for the natural right to home-school our children, and eventually our children are taxed for the coffin and flowers purchased to bury their parents, and it goes on and on. Regardless of what anyone tries to make of the few opening words of the 2nd amendment, the constitution clearly and most emphatically says—- The right of the people to keep and bear arms shall not be infringed. There is nothing in that simple clause that needs any interpretation by lawyers in black robes. To keep arms simply means to own and store any and all tools of personal defense, which may be at hand. According to the supreme law of our Constitutional Republic, we may possess those tools, put them in our closets, in our glove box or in our pockets— Stash them in our purses, or hold them in our hands. To bear arms is to conceal or openly carry them and walk around anywhere we wish. There are no restrictions in the Bill of Rights on who may keep and bear arms. One only needs to be, a people. The right to keep and bear arms is a fundamental, God given, natural right, which was also written into the Preamble to the constitution. It is an all inclusive reference to the natural, God given rights of life, liberty and pursuit of happiness. Those fundamental, natural rights and freedoms include, and project a heavy burden of personal responsibility to cause no harm to another person’s life or property, or to interfere with another’s fundamental rights except in self defense or in defense of the Republic. The second amendment was included in the Bill of Rights in order to emphasize what was clearly understood at the time to be a fundamental, natural right to protect one’s life and liberties, and especially from the abuses of a tyrannical, out of control government which the founders knew was sure to come. If or when the people decide the constitution needs amending, the rules for making such changes are spelled out in Article five. Any so-called Law, Act, Ordinance or Statute, which is determined to be contrary to the provisions of the Constitution are null and void, retroactive to the time it was signed into law, and that includes an abundance of so-called Gun Control Laws. Only a Constitutional Amendment can change the clear intent of the supreme law of the land. An act of the legislature repugnant to the Constitution is void — Marbury v. Madison, Feb 1803. Time and space do not permit listing all the laws, acts and statutes, which are contrary to the Constitution, but in the interest of brevity and example, the ones which have had the most devastating effect on the prosperity of our Constitutional Republic are the Federal Reserve Act and the Legal Tender Act. The reason these were passed as Acts is because the schemers knew darn well they could never wrest control of the Republic’s money by way of a Constitutional amendment. Therefore, the Federal Reserve Act and the Legal Tender Act were null and void retroactive to 1913 because each Act is obviously repugnant to the Constitution. Applying to any agent of for a license to pursue any activity which is already constitutionally lawful, and a natural right is to suggest that the government agent is sovereign over you. The activities and actions of the NRA, GOA, AARP, your congressional member, and even us, (we the people) have long ago validated and perpetuated the false assumption that Governments at every level are sovereign over the people. The Founder’s clear intentions were to leave the people in charge of our own lives and that of our government—and in the ranking of sovereignty we the people are subject only to God—-The federal government is dead last. We’ve made a mess of things in the past 222 years of our Republic’s independent history, and we don’t have much time left to correct our mistakes. All of us must start now by accepting the responsibility that comes with sovereignty and freedom. We must cease the nonsense of asking our public servants for their permission to do anything which we the people have not had an active hand in approving. Until development of the Internet, we the people were totally dependent upon the controlled print, radio, and television media for all information critical to our interests and cultural values. The most damage was done to our lives and prosperity around the year 1913 when getting amendments, Laws and Acts through Congress were a breeze. In 1913, not many homes in rural America had electricity or even a battery operated radio. But today, the worm has turned because the Internet is rapidly replacing the so-called, mainstream media. Newspapers are rapidly going bankrupt and television is on the ropes. Of course, the media blame the troublesome Internet for their loss of subscribers rather than their own deficient and twisted reporting. The Internet is fast, it’s convenient, and basically it’s free, but the biggest advantage the Net has, by far is that it is, up to now, uncontrollable. The websites which attempt to twist or censor freedom of speech or offend one’s personal values are quickley abandoned by their readers who jump to other websites, which they consider more appealing and trustworthy— No bankruptcy filings or bailouts required, and the enemies of personal freedom are forever doomed to eventual failure. Because of the Internet, World citizens are communicating with one another today as never before in the history of Planet Earth—— consequently; Liars, thieves, propagandists, cheaters, tyrants and scammers are being exposed everyday, and patriotic bounty hunters of many nations are hot on their tails. Let us remain focused and continue to communicate with others around the World, because we are all in this leaking boat together. With what remains of the Constitutional Republic of these united states, let us begin to live our lives as the sovereigns we are supposed to be, not as subjects. This same redirection applies to people who happen to be employed as public servants, but who have also fallen into the misguided quagmire of obediently pleading to governments for licensed permission to engage in the natural right to earn a living, or to own a domesticated family pet, or to eat apricot kernels, to sell or drink raw milk or to keep and bear arms. We will never break free of this madness until we stop meekly asking government for permission to do a darned thing. Dr. Martin Luther King did not engage in what the media termed, civil disobedience. He simply stopped asking for permission. When we learn this valuable lesson and develop some personal backbone, then and only then will sovereign people become empowered to set rules they wish to follow in order to insure an orderly and prosperous society. Only then will we secure the blessings of liberty for ourselves and our posterity. — The Constitution for the united States would have never been ratified if the Framers had not halted the ratification process long enough to include the first ten amendments, which we know as the Bill of Rights. Each and everyone of those ten amendments are based on the natural, God given, fundamental rights that sets us apart as Americans. By far, the most important of those ten amendments is the one that is often been called, The Forgotten Amendment, and that is the one, all encompassing, Ninth Amendment. To be historically precise it reads simply; The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people. In the language of today the Framers may well have written the Ninth Amendment this way: The unalienable rights, which are listed herein are not all inclusive, and in no way does this enumeration place a limit on any and all all other reserved rights that further supports the People’s natural entitlements to life, liberty and the pursuit of happiness and property. We the people have no Constitutional rights. We have only unalienable, God given, rights, and that’s all we will ever need. Everyone has the natural right to be a card carrying atheist, but when it comes to claiming these rights in one’s personal defense it may be prudent to pause and give thanks to the Almighty Giver. No matter how you see it spelled—inalienable or unalienable, it simply means permanent, irrespective of what may someday happen to the Constitution. Civil Rights are the creation of government, and what the government gives, the government can take away, but unalienable rights are a totally different matter. Everything I do from day to day is to live by the golden rule while in the pursuit of life, liberty, liberty and happiness. Governments have absolutely no power, authority or jurisdiction in the matter. “People who fight may lose. People who don’t fight have already lost.” Bertolt Brecht This message has been edited. Last edited by: mouse51, Sun 15 March 2009 07:20 PM", 
        "intTime": 20090313, 
        "postID": 1, 
        "quote": "", 
        "reply": "I read this and found it to be interesting..unfortunately, most of us who live in this real world dont want to take risks and jepardize our families therefore we bow down to government who sets the rules so we dont have chaos in our land...I was always taught esp in my church to obey the laws of the land.. we have to have some form of rules which were originally based on the 10 ommandments but...like it says in this article..government made the constitution which had a different intent at that time....so its controled by the government we have now and can be changed by the government like we now see happening..with interpretation.. but the writers and signers of the constitution put in the 10 ammendments...to make sure that people knew that they did have inalienable rights irregardless of the constitution which can be fooled with or changed...by government...our other rights do not come from the gov. we already had them from the Almighty...so read and leave comments abt what you think...one part is a challenge..but like Martin luther if you want to make your mark..I say do it in a peaceful manner...persistance and kindness speak louder ..reach the heart...READ BELOW..YOU JUDGE AND LEAVE YOUR COMMENT..its not new just a different way of saying things and we do have freedom of speech...Oh and one more thing...who is the government...I think it use to be ..'we the people\"...now we hire someone to govern us..probly have chaos without it.. \"\"Because Americans Have Been Conditioned to Live Our Lives Under the True Essence of Slavery\"\"\" March 11, 2009 by DrD George Nelson USAF, retired All of this fretting, whining, buying licenses and permits, asking for permission and pleading with government is the fault of none other than we the people, but along the way, we’ve had a lot of help in that respect from Lawyers, the GOA, the NRA, AARP, ETC., and yes, our bought and paid for congressional politicians. If we had lived our lives as free sovereigns as the framers had idealistically hoped, there would be little need for all the organizations that are in the business of fighting on our behalf by hacking at the branches rather than striking the root. Ben Franklin was doubtful that the founder’s experiment with self government would function successfully for very long, and as it turns out, he was right. We now “voluntarily” pay more than half of our working wages in taxes for services that we often do not want, nor did we request. We pay for licenses to get married, and we are taxed for our food, our clothing, and our shelter. We fight the bureaucracy for the natural right to home-school our children, and eventually our children are taxed for the coffin and flowers purchased to bury their parents, and it goes on and on. Regardless of what anyone tries to make of the few opening words of the 2nd amendment, the constitution clearly and most emphatically says—- The right of the people to keep and bear arms shall not be infringed. There is nothing in that simple clause that needs any interpretation by lawyers in black robes. To keep arms simply means to own and store any and all tools of personal defense, which may be at hand. According to the supreme law of our Constitutional Republic, we may possess those tools, put them in our closets, in our glove box or in our pockets— Stash them in our purses, or hold them in our hands. To bear arms is to conceal or openly carry them and walk around anywhere we wish. There are no restrictions in the Bill of Rights on who may keep and bear arms. One only needs to be, a people. The right to keep and bear arms is a fundamental, God given, natural right, which was also written into the Preamble to the constitution. It is an all inclusive reference to the natural, God given rights of life, liberty and pursuit of happiness. Those fundamental, natural rights and freedoms include, and project a heavy burden of personal responsibility to cause no harm to another person’s life or property, or to interfere with another’s fundamental rights except in self defense or in defense of the Republic. The second amendment was included in the Bill of Rights in order to emphasize what was clearly understood at the time to be a fundamental, natural right to protect one’s life and liberties, and especially from the abuses of a tyrannical, out of control government which the founders knew was sure to come. If or when the people decide the constitution needs amending, the rules for making such changes are spelled out in Article five. Any so-called Law, Act, Ordinance or Statute, which is determined to be contrary to the provisions of the Constitution are null and void, retroactive to the time it was signed into law, and that includes an abundance of so-called Gun Control Laws. Only a Constitutional Amendment can change the clear intent of the supreme law of the land. An act of the legislature repugnant to the Constitution is void — Marbury v. Madison, Feb 1803. Time and space do not permit listing all the laws, acts and statutes, which are contrary to the Constitution, but in the interest of brevity and example, the ones which have had the most devastating effect on the prosperity of our Constitutional Republic are the Federal Reserve Act and the Legal Tender Act. The reason these were passed as Acts is because the schemers knew darn well they could never wrest control of the Republic’s money by way of a Constitutional amendment. Therefore, the Federal Reserve Act and the Legal Tender Act were null and void retroactive to 1913 because each Act is obviously repugnant to the Constitution. Applying to any agent of for a license to pursue any activity which is already constitutionally lawful, and a natural right is to suggest that the government agent is sovereign over you. The activities and actions of the NRA, GOA, AARP, your congressional member, and even us, (we the people) have long ago validated and perpetuated the false assumption that Governments at every level are sovereign over the people. The Founder’s clear intentions were to leave the people in charge of our own lives and that of our government—and in the ranking of sovereignty we the people are subject only to God—-The federal government is dead last. We’ve made a mess of things in the past 222 years of our Republic’s independent history, and we don’t have much time left to correct our mistakes. All of us must start now by accepting the responsibility that comes with sovereignty and freedom. We must cease the nonsense of asking our public servants for their permission to do anything which we the people have not had an active hand in approving. Until development of the Internet, we the people were totally dependent upon the controlled print, radio, and television media for all information critical to our interests and cultural values. The most damage was done to our lives and prosperity around the year 1913 when getting amendments, Laws and Acts through Congress were a breeze. In 1913, not many homes in rural America had electricity or even a battery operated radio. But today, the worm has turned because the Internet is rapidly replacing the so-called, mainstream media. Newspapers are rapidly going bankrupt and television is on the ropes. Of course, the media blame the troublesome Internet for their loss of subscribers rather than their own deficient and twisted reporting. The Internet is fast, it’s convenient, and basically it’s free, but the biggest advantage the Net has, by far is that it is, up to now, uncontrollable. The websites which attempt to twist or censor freedom of speech or offend one’s personal values are quickley abandoned by their readers who jump to other websites, which they consider more appealing and trustworthy— No bankruptcy filings or bailouts required, and the enemies of personal freedom are forever doomed to eventual failure. Because of the Internet, World citizens are communicating with one another today as never before in the history of Planet Earth—— consequently; Liars, thieves, propagandists, cheaters, tyrants and scammers are being exposed everyday, and patriotic bounty hunters of many nations are hot on their tails. Let us remain focused and continue to communicate with others around the World, because we are all in this leaking boat together. With what remains of the Constitutional Republic of these united states, let us begin to live our lives as the sovereigns we are supposed to be, not as subjects. This same redirection applies to people who happen to be employed as public servants, but who have also fallen into the misguided quagmire of obediently pleading to governments for licensed permission to engage in the natural right to earn a living, or to own a domesticated family pet, or to eat apricot kernels, to sell or drink raw milk or to keep and bear arms. We will never break free of this madness until we stop meekly asking government for permission to do a darned thing. Dr. Martin Luther King did not engage in what the media termed, civil disobedience. He simply stopped asking for permission. When we learn this valuable lesson and develop some personal backbone, then and only then will sovereign people become empowered to set rules they wish to follow in order to insure an orderly and prosperous society. Only then will we secure the blessings of liberty for ourselves and our posterity. — The Constitution for the united States would have never been ratified if the Framers had not halted the ratification process long enough to include the first ten amendments, which we know as the Bill of Rights. Each and everyone of those ten amendments are based on the natural, God given, fundamental rights that sets us apart as Americans. By far, the most important of those ten amendments is the one that is often been called, The Forgotten Amendment, and that is the one, all encompassing, Ninth Amendment. To be historically precise it reads simply; The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people. In the language of today the Framers may well have written the Ninth Amendment this way: The unalienable rights, which are listed herein are not all inclusive, and in no way does this enumeration place a limit on any and all all other reserved rights that further supports the People’s natural entitlements to life, liberty and the pursuit of happiness and property. We the people have no Constitutional rights. We have only unalienable, God given, rights, and that’s all we will ever need. Everyone has the natural right to be a card carrying atheist, but when it comes to claiming these rights in one’s personal defense it may be prudent to pause and give thanks to the Almighty Giver. No matter how you see it spelled—inalienable or unalienable, it simply means permanent, irrespective of what may someday happen to the Constitution. Civil Rights are the creation of government, and what the government gives, the government can take away, but unalienable rights are a totally different matter. Everything I do from day to day is to live by the golden rule while in the pursuit of life, liberty, liberty and happiness. Governments have absolutely no power, authority or jurisdiction in the matter. “People who fight may lose. People who don’t fight have already lost.” Bertolt Brecht This message has been edited. Last edited by: mouse51, Sun 15 March 2009 07:20 PM", 
        "threadID": "5291911282_4190018712001", 
        "time": "2009-03-13 23:25:00", 
        "title": "the constitution and inalienable rights....", 
        "userID": "mouse51"
    }, 
    {
        "content": "Some have more rights than others! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090314, 
        "postID": 2, 
        "quote": "", 
        "reply": "Some have more rights than others! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4190018712001", 
        "time": "2009-03-14 09:15:00", 
        "title": "the constitution and inalienable rights....", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: An act of the legislature repugnant to the Constitution is void — Marbury v. Madison, Feb 1803. So which way do you want it? The above court case itself is the most repugnant decision the Supreme Court ever made - not because of the \"Midnight Appointments\" of Federal Judges by Pres. John Adams that it tried to address, but that it constituted the most blatant grab of Power that had ever happened in this land since the Revolutionary War. How? The Constitution, though it set up and somewhat defined both Congress and a Federal Court system, it didn't clearly define the separation of Power between the two. It said that Congress could create Laws and control Budgets ($), and it said the President could Sign, Pocket, Table, or Sign such Bills, but it made no mention of who would stand in judgment over any of the process beyond that. Chief Justice of the Supreme Court John Marshall recognized this loop-hole. By saying that it was \"UnConstitutional\" for the suit of MArbury vs MAdison to even be brought against the Government, he created a new word, and grabbed a massive amount of Power to the Supreme Court, an unelected body which doesn't have to answer in any way to the American People - in fact, creating an Oligarchy of 5 then 7 now 9 Kings that sit in Supreme Judgement over this Land with absolutely NO Check or Balance, except the occasional retirement or death of a Judge. But the character of the Court is totally out of control of the People. Instead, it is subject to the capricious nature of the President and Senate sitting at the time - out of reach of the House of Representatives, who are closer to the People, or the People Themselves - - Whether a LAw is UnConstitutional should be debated by our Representatives, not left to unelected Judges. We must put our trust in 9 people who have no sense of the broad needs of this wide country, rather than the Representatives that come from all parts of it. Yet their Final Judgments actually create Laws that we must ALL follow, or be jailed... If you were to create a geometric diagram to represent our Government as it was shaped in 1789 by the Constitution and Bill of Rights, it would be a Diamond: Congress (Representing the People) would be at the top \"12 O'clock\" position, the Presidency and the Supreme would be at the \"3 and 9 O'clock\" positions with their Powers of Veto and Federal Appeals, and the People would be at the \"6 O'clock\" position, with their Voting/Electing and 2nd Amendment Rights to change/control and if necessary, rebell against ALL of the above. These are the TRUE Checks and Balances first put in place by the Constitution. But if you were to create a geometric diagram today, it would be a Triangle, with the Supreme Court at the top, and the Presidency and Congress on the bottom corners, and the People nowhere to be found, relegated to the sad position of Wards of the Government, to be bought and sold, and told what to do by ALL of the above...with the Supreme Court having Dictatorial Final Say as to what rules we must all follow - upon pain of arrest and imprison, loss of property, and worse - - That is NOT how a Republic should work - - Wandering and Wondering", 
        "intTime": 20090314, 
        "postID": 3, 
        "quote": "An act of the legislature repugnant to the Constitution is void — Marbury v. Madison, Feb 1803.", 
        "reply": " So which way do you want it? The above court case itself is the most repugnant decision the Supreme Court ever made - not because of the \"Midnight Appointments\" of Federal Judges by Pres. John Adams that it tried to address, but that it constituted the most blatant grab of Power that had ever happened in this land since the Revolutionary War. How? The Constitution, though it set up and somewhat defined both Congress and a Federal Court system, it didn't clearly define the separation of Power between the two. It said that Congress could create Laws and control Budgets ($), and it said the President could Sign, Pocket, Table, or Sign such Bills, but it made no mention of who would stand in judgment over any of the process beyond that. Chief Justice of the Supreme Court John Marshall recognized this loop-hole. By saying that it was \"UnConstitutional\" for the suit of MArbury vs MAdison to even be brought against the Government, he created a new word, and grabbed a massive amount of Power to the Supreme Court, an unelected body which doesn't have to answer in any way to the American People - in fact, creating an Oligarchy of 5 then 7 now 9 Kings that sit in Supreme Judgement over this Land with absolutely NO Check or Balance, except the occasional retirement or death of a Judge. But the character of the Court is totally out of control of the People. Instead, it is subject to the capricious nature of the President and Senate sitting at the time - out of reach of the House of Representatives, who are closer to the People, or the People Themselves - - Whether a LAw is UnConstitutional should be debated by our Representatives, not left to unelected Judges. We must put our trust in 9 people who have no sense of the broad needs of this wide country, rather than the Representatives that come from all parts of it. Yet their Final Judgments actually create Laws that we must ALL follow, or be jailed... If you were to create a geometric diagram to represent our Government as it was shaped in 1789 by the Constitution and Bill of Rights, it would be a Diamond: Congress (Representing the People) would be at the top \"12 O'clock\" position, the Presidency and the Supreme would be at the \"3 and 9 O'clock\" positions with their Powers of Veto and Federal Appeals, and the People would be at the \"6 O'clock\" position, with their Voting/Electing and 2nd Amendment Rights to change/control and if necessary, rebell against ALL of the above. These are the TRUE Checks and Balances first put in place by the Constitution. But if you were to create a geometric diagram today, it would be a Triangle, with the Supreme Court at the top, and the Presidency and Congress on the bottom corners, and the People nowhere to be found, relegated to the sad position of Wards of the Government, to be bought and sold, and told what to do by ALL of the above...with the Supreme Court having Dictatorial Final Say as to what rules we must all follow - upon pain of arrest and imprison, loss of property, and worse - - That is NOT how a Republic should work - - Wandering and Wondering", 
        "threadID": "5291911282_4190018712001", 
        "time": "2009-03-14 10:19:00", 
        "title": "the constitution and inalienable rights....", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "sorry that this is so long..I went in and took a bit out..hope its understandable..yes esp the rich have more rights..they have paid their way out of crimes..there are many examples..I dont have problems with someone being rich..but they should suffer the same things when they break the law as we do..but for some reason more pitty is given them and less punishment..In this country I do believe that we the people should have all our rights granted by God and our constitution and..people who are here illegaly should be deported not given the same things we are given..its not fair..we pay into a system so we can do or have certain things..legal aliens or refugees can have rights but according to the reason they are here..and it should not encroach on our rights ..unfortuntately..i think the speaker here is talking about gov taking those rights away from us..messing with the constitution or taking away from it becuase their form of gov or party doesnt like one or two of our rights listed in it..that is the reason these rights wer elisted and first...and it was said and very important that we have inalienable rights..God given rights ..which we in this country believe in...", 
        "intTime": 20090315, 
        "postID": 4, 
        "quote": "", 
        "reply": "sorry that this is so long..I went in and took a bit out..hope its understandable..yes esp the rich have more rights..they have paid their way out of crimes..there are many examples..I dont have problems with someone being rich..but they should suffer the same things when they break the law as we do..but for some reason more pitty is given them and less punishment..In this country I do believe that we the people should have all our rights granted by God and our constitution and..people who are here illegaly should be deported not given the same things we are given..its not fair..we pay into a system so we can do or have certain things..legal aliens or refugees can have rights but according to the reason they are here..and it should not encroach on our rights ..unfortuntately..i think the speaker here is talking about gov taking those rights away from us..messing with the constitution or taking away from it becuase their form of gov or party doesnt like one or two of our rights listed in it..that is the reason these rights wer elisted and first...and it was said and very important that we have inalienable rights..God given rights ..which we in this country believe in...", 
        "threadID": "5291911282_4190018712001", 
        "time": "2009-03-15 19:26:00", 
        "title": "the constitution and inalienable rights....", 
        "userID": "mouse51"
    }
]