[
    {
        "content": "The other day i took Cambodian DLPT and get 3/3. And i'll be taking the interview part. Is it possible to have a career in linguist in Cambodia language? If so, what is your suggestion. Clear record, 1.5 years in USMC. Also got 2/+1 on Mandarin. I appreciate your commend. And Ooh-Rah.", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "", 
        "reply": "The other day i took Cambodian DLPT and get 3/3. And i'll be taking the interview part. Is it possible to have a career in linguist in Cambodia language? If so, what is your suggestion. Clear record, 1.5 years in USMC. Also got 2/+1 on Mandarin. I appreciate your commend. And Ooh-Rah.", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-04 20:05:00", 
        "title": "Cambodian DLPT", 
        "userID": "17936304"
    }, 
    {
        "content": "Hi Ted, Welcome to mil.com Re. \"Ooh-Rah\", I thought that was Army. Marines is \"Semper Fi\" Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090404, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hi Ted, Welcome to mil.com Re. \"Ooh-Rah\", I thought that was Army. Marines is \"Semper Fi\" Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-04 20:11:00", 
        "title": "Cambodian DLPT", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Let me advise you on linguistics, When I took the language attitude test in 1954, I score so impressed the powers that be, they pulled me off of the KD range to retake the test. After they scored that, they decided to let me keep the first score. Was 7 out 37 and they gave six points for turning in the test. They spent an hour with me, with some basic English question, they couldn’t speak any language, But in 1990 they gave a recall notice because my records said I was fluent in farce (spell) I told them I wasn’t and they told me I still had to report to DA NLT 0900 Monday. So I went to DA, The G7 some major general met us in started stating out what our responsibility would be then he had individual meeting with him. When I showed him my original DD214, he said you really don’t speak farce do you? I told him general I don’t speak English very well. So the army gave me three day pay, travel, lodging and meals. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "", 
        "reply": "Let me advise you on linguistics, When I took the language attitude test in 1954, I score so impressed the powers that be, they pulled me off of the KD range to retake the test. After they scored that, they decided to let me keep the first score. Was 7 out 37 and they gave six points for turning in the test. They spent an hour with me, with some basic English question, they couldn’t speak any language, But in 1990 they gave a recall notice because my records said I was fluent in farce (spell) I told them I wasn’t and they told me I still had to report to DA NLT 0900 Monday. So I went to DA, The G7 some major general met us in started stating out what our responsibility would be then he had individual meeting with him. When I showed him my original DD214, he said you really don’t speak farce do you? I told him general I don’t speak English very well. So the army gave me three day pay, travel, lodging and meals. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-04 20:32:00", 
        "title": "Cambodian DLPT", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by OldArmyLove: Let me advise you on linguistics, When I took the language attitude test in 1954, I score so impressed the powers that be, they pulled me off of the KD range to retake the test. After they scored that, they decided to let me keep the first score. Was 7 out 37 and they gave six points for turning in the test. They spent an hour with me, with some basic English question, they couldn’t speak any language, But in 1990 they gave a recall notice because my records said I was fluent in farce (spell) I told them I wasn’t and they told me I still had to report to DA NLT 0900 Monday. So I went to DA, The G7 some major general met us in started stating out what our responsibility would be then he had individual meeting with him. When I showed him my original DD214, he said you really don’t speak farce do you? I told him general I don’t speak English very well. So the army gave me three day pay, travel, lodging and meals. I was going to say something to the poster, but I won't. Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "Originally posted by OldArmyLove: Let me advise you on linguistics, When I took the language attitude test in 1954, I score so impressed the powers that be, they pulled me off of the KD range to retake the test. After they scored that, they decided to let me keep the first score. Was 7 out 37 and they gave six points for turning in the test. They spent an hour with me, with some basic English question, they couldn’t speak any language, But in 1990 they gave a recall notice because my records said I was fluent in farce (spell) I told them I wasn’t and they told me I still had to report to DA NLT 0900 Monday. So I went to DA, The G7 some major general met us in started stating out what our responsibility would be then he had individual meeting with him. When I showed him my original DD214, he said you really don’t speak farce do you? I told him general I don’t speak English very well. So the army gave me three day pay, travel, lodging and meals.", 
        "reply": " I was going to say something to the poster, but I won't. Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-04 20:41:00", 
        "title": "Cambodian DLPT", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "quote: mikeyR8 I was going to say something to the poster, but I won't. Roll Eyes \"LEAD ME, FOLLOW ME, OR GET OUT OF MY WAY\" If you use big words, he wouldn't understand what you are saying and at his age he'll forget it in 10 minutes anyway,\" My mother taught me how to read reading and how to write writing, but she could not teach me how write reading or how to read writing. What could you expect cross bread ½ Pima Indian right off the reservation and a ½ Dutch farmer straight from the old country. But, at 4’0” and 90lbs, she was the kindest, most generous, most loving, self sacrificing and wisest person who ever lived. OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090405, 
        "postID": 5, 
        "quote": "mikeyR8 I was going to say something to the poster, but I won't. Roll Eyes \"LEAD ME, FOLLOW ME, OR GET OUT OF MY WAY\"", 
        "reply": " If you use big words, he wouldn't understand what you are saying and at his age he'll forget it in 10 minutes anyway,\" My mother taught me how to read reading and how to write writing, but she could not teach me how write reading or how to read writing. What could you expect cross bread ½ Pima Indian right off the reservation and a ½ Dutch farmer straight from the old country. But, at 4’0” and 90lbs, she was the kindest, most generous, most loving, self sacrificing and wisest person who ever lived. OAL God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-05 05:46:00", 
        "title": "Cambodian DLPT", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Originally posted by 17936304: The other day i took Cambodian DLPT and get 3/3. And i'll be taking the interview part. Is it possible to have a career in linguist in Cambodia language? If so, what is your suggestion. Clear record, 1.5 years in USMC. Also got 2/+1 on Mandarin. I appreciate your commend. And Ooh-Rah. Why Cambodian? We got a war on the horizon with them?? I hope not. Chinese, Arabic, Korean, Russian, Spanish, Portuguese (Brazil) - now those might have some meaning behind them - - Pick something worthwhile - - Wandering and Wondering", 
        "intTime": 20090405, 
        "postID": 6, 
        "quote": "Originally posted by 17936304: The other day i took Cambodian DLPT and get 3/3. And i'll be taking the interview part. Is it possible to have a career in linguist in Cambodia language? If so, what is your suggestion. Clear record, 1.5 years in USMC. Also got 2/+1 on Mandarin. I appreciate your commend. And Ooh-Rah.", 
        "reply": " Why Cambodian? We got a war on the horizon with them?? I hope not. Chinese, Arabic, Korean, Russian, Spanish, Portuguese (Brazil) - now those might have some meaning behind them - - Pick something worthwhile - - Wandering and Wondering", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-05 08:57:00", 
        "title": "Cambodian DLPT", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "A 3/3 is really good, lots of folks don't score that high in their native language. Which is arguably a prob with the test and not the language speaker. I don't know if there are any Cambodian slots. If I were you, I'd go for Chinese at DLI. It's on the beach in California, if you're into that sort of thing, though the water is rather cold most of the year. Also, many Chinese speakers get sent to Hawaii, though not all do. You'll do well in Chinese since you have some background in it, but pay attention! Lots of heritage speakers sent to DLI find the first three or four months a repeat of what they already know, so they quit paying attention and end up failing out at the year mark, once the coursework goes past their prior knowledge. You could even retrain into Arabic, but I don't know how high your DLAB score is. That's not such a big deal as long as you're dealing with language you already know, or related ones. For instance, it's pretty easy for an English speaker to learn French or German, but not Arabic or Korean.", 
        "intTime": 20090405, 
        "postID": 7, 
        "quote": "", 
        "reply": "A 3/3 is really good, lots of folks don't score that high in their native language. Which is arguably a prob with the test and not the language speaker. I don't know if there are any Cambodian slots. If I were you, I'd go for Chinese at DLI. It's on the beach in California, if you're into that sort of thing, though the water is rather cold most of the year. Also, many Chinese speakers get sent to Hawaii, though not all do. You'll do well in Chinese since you have some background in it, but pay attention! Lots of heritage speakers sent to DLI find the first three or four months a repeat of what they already know, so they quit paying attention and end up failing out at the year mark, once the coursework goes past their prior knowledge. You could even retrain into Arabic, but I don't know how high your DLAB score is. That's not such a big deal as long as you're dealing with language you already know, or related ones. For instance, it's pretty easy for an English speaker to learn French or German, but not Arabic or Korean.", 
        "threadID": "5291911282_1160068912001", 
        "time": "2009-04-05 12:49:00", 
        "title": "Cambodian DLPT", 
        "userID": "Ruanne"
    }
]