[
    {
        "content": "Greetings, These are very politically troubling times we are in. Our freedoms as Americans are on the brink of being lost. If you still value the American way of life and honor your oath to defend the Constitution against all enemies foreign and domestic then please check out this link ******** If the Commander in Chief has his way then there will come a day when you may be required to violate the 2nd Amendment and confiscate weapons from U.S. citizens. Your oath is to the Constitution first and the President second. The president took and oath of office to \"preserve, protect and defend the Constitution of the United States.\" He has violated this oath already. Please go to ******** Hot links are not authorized - you've been around here long enough to know that. Please don't let it happen again This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:24 PM", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "", 
        "reply": "Greetings, These are very politically troubling times we are in. Our freedoms as Americans are on the brink of being lost. If you still value the American way of life and honor your oath to defend the Constitution against all enemies foreign and domestic then please check out this link ******** If the Commander in Chief has his way then there will come a day when you may be required to violate the 2nd Amendment and confiscate weapons from U.S. citizens. Your oath is to the Constitution first and the President second. The president took and oath of office to \"preserve, protect and defend the Constitution of the United States.\" He has violated this oath already. Please go to ******** Hot links are not authorized - you've been around here long enough to know that. Please don't let it happen again This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:24 PM", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 13:14:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "I heard this kind of talk after the 2006 elections seemed to put us on the path to withdrawal from Iraq. Some folks were talking about standing by Congress over and above the President, because the President had never secured a constitutional Congressional Declaration of War, or something. I don't remember the logic exactly. But it's not just the Right among our ranks that brings it up on occasion. Suffice it to say that it would be a very very serious situation before soldiers would ever have to make the choice between the President and the Constitution. Outside of those exceedingly unlikely scenarios, you are talking sedition and mutiny, which is rather dangerous ground for a military member to tread. Remember your oath, indeed.", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "I heard this kind of talk after the 2006 elections seemed to put us on the path to withdrawal from Iraq. Some folks were talking about standing by Congress over and above the President, because the President had never secured a constitutional Congressional Declaration of War, or something. I don't remember the logic exactly. But it's not just the Right among our ranks that brings it up on occasion. Suffice it to say that it would be a very very serious situation before soldiers would ever have to make the choice between the President and the Constitution. Outside of those exceedingly unlikely scenarios, you are talking sedition and mutiny, which is rather dangerous ground for a military member to tread. Remember your oath, indeed.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 16:15:00", 
        "title": "Remember Your Oath", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Orders from the Commander in Chief that nullify the Constitution are sedition and treason.", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "", 
        "reply": "Orders from the Commander in Chief that nullify the Constitution are sedition and treason.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 16:37:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "Ooops. Sorry about the link. I have not posted on here in a couple of years. Just to clarify, when you take that oath it has no expiration date. I took the oath 30 years ago and served only one hitch. I still take that oath seriously. Many of our Constitutional freedoms are being challenged as I write this. 1st', 2nd, 4th, 5th, 9th, 10th Amendments, just to name a few, are nearly being nullified by the actions of this Commander in Chief. This abandonment of our Constitution can not be fully achieved if enough servicemembers honor their oath.", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "", 
        "reply": "Ooops. Sorry about the link. I have not posted on here in a couple of years. Just to clarify, when you take that oath it has no expiration date. I took the oath 30 years ago and served only one hitch. I still take that oath seriously. Many of our Constitutional freedoms are being challenged as I write this. 1st', 2nd, 4th, 5th, 9th, 10th Amendments, just to name a few, are nearly being nullified by the actions of this Commander in Chief. This abandonment of our Constitution can not be fully achieved if enough servicemembers honor their oath.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 16:48:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "Welcome back. Understand - I didn't check the date of your previous posts. The TOS has been updated several time in the past few years as have rules for each of the different forums. I would recommend you reread the TOS and the rules for each forum prior to posting on that forum. It will keep you from getting snake bit. Enjoy! OAL quote: Ooops. Sorry about the link. I have not posted on here in a couple of years. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "Ooops. Sorry about the link. I have not posted on here in a couple of years.", 
        "reply": "Welcome back. Understand - I didn't check the date of your previous posts. The TOS has been updated several time in the past few years as have rules for each of the different forums. I would recommend you reread the TOS and the rules for each forum prior to posting on that forum. It will keep you from getting snake bit. Enjoy! OAL  God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 17:54:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Military.com Military.com Forums Hop To Forum Categories Hot Topics & Current Events Hop To Forums General Discussion Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want?? Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "Military.com Military.com Forums Hop To Forum Categories Hot Topics & Current Events Hop To Forums General Discussion", 
        "reply": " Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want?? Wandering and Wondering", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 18:03:00", 
        "title": "Remember Your Oath", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want?? GWG, I took it out, I'll put it back: http://www.oath-keepers.blogspot.com/ It is a good place and the OP had not been here since the hot link policy came in - he didn't know. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want??", 
        "reply": " GWG, I took it out, I'll put it back: http://www.oath-keepers.blogspot.com/ It is a good place and the OP had not been here since the hot link policy came in - he didn't know. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 18:18:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Good man!! Fairly interesting sight - - Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "", 
        "reply": "Good man!! Fairly interesting sight - - Wandering and Wondering", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 18:23:00", 
        "title": "Remember Your Oath", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "It is interesting. It's good that people realize the dangers inherent in some of President Bush's policies, such as warrantless searches and detaining citizens as \"enemy combatants.\" As the site's authors rightly point out, our rights can erode on both the left and the right. This is not a Democrat-Republican thing. Be that as it may, \"states of emergency\" are regularly declared in natural disasters. And a martial-law style lockdown would become a necessity in a quarantine for a deadly pandemic. A Democrat being elected President hasn't caused the Right to Bear Arms to be abrogated yet. Obama's not the first one. So don't panic, just yet, people. Folks posting on this website do still need to be careful if they are still in the military. We don't have the same freedom of speech as your average citizen, that's part and parcel of UCMJ. A few of my friends had their blogs shut down by the command in the past couple of years. You are free to believe what you want, and act according to your conscience, but be careful what you say in public, and what you post online, say the right things, even if you aren't tracked down as a user of this site. UCMJ applies whether or not anyone is watching. You aren't likely to be tracked on this site, but I'd not post identifying information, regardless, on the off chance the military decides it's crossed the line.", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "", 
        "reply": "It is interesting. It's good that people realize the dangers inherent in some of President Bush's policies, such as warrantless searches and detaining citizens as \"enemy combatants.\" As the site's authors rightly point out, our rights can erode on both the left and the right. This is not a Democrat-Republican thing. Be that as it may, \"states of emergency\" are regularly declared in natural disasters. And a martial-law style lockdown would become a necessity in a quarantine for a deadly pandemic. A Democrat being elected President hasn't caused the Right to Bear Arms to be abrogated yet. Obama's not the first one. So don't panic, just yet, people. Folks posting on this website do still need to be careful if they are still in the military. We don't have the same freedom of speech as your average citizen, that's part and parcel of UCMJ. A few of my friends had their blogs shut down by the command in the past couple of years. You are free to believe what you want, and act according to your conscience, but be careful what you say in public, and what you post online, say the right things, even if you aren't tracked down as a user of this site. UCMJ applies whether or not anyone is watching. You aren't likely to be tracked on this site, but I'd not post identifying information, regardless, on the off chance the military decides it's crossed the line.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 19:12:00", 
        "title": "Remember Your Oath", 
        "userID": "Ruanne"
    }, 
    {
        "content": "I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ No exception, no expiration. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "", 
        "reply": "I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ No exception, no expiration. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 20:41:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "47 years ago.........an not forgoten. Can't wait to join. Great site,but stop the blowin sand in the eyes", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "", 
        "reply": "47 years ago.........an not forgoten. Can't wait to join. Great site,but stop the blowin sand in the eyes", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 23:19:00", 
        "title": "Remember Your Oath", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "quote: Originally posted by OldArmyLove: I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ took mine June 21 1962 and still keeping today as as long as i have a breath left No exception, no expiration.", 
        "intTime": 20090528, 
        "postID": 12, 
        "quote": "Originally posted by OldArmyLove: I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ took mine June 21 1962 and still keeping today as as long as i have a breath left No exception, no expiration.", 
        "reply": "", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 04:25:00", 
        "title": "Remember Your Oath", 
        "userID": "ss_287"
    }, 
    {
        "content": "Took the Army oath 12/83, took another 03/87 (LEO) Take them both pretty seriously.", 
        "intTime": 20090528, 
        "postID": 13, 
        "quote": "", 
        "reply": "Took the Army oath 12/83, took another 03/87 (LEO) Take them both pretty seriously.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 04:42:00", 
        "title": "Remember Your Oath", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "And how come we don't have a salute icon or a flag icon?", 
        "intTime": 20090528, 
        "postID": 14, 
        "quote": "", 
        "reply": "And how come we don't have a salute icon or a flag icon?", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 06:17:00", 
        "title": "Remember Your Oath", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Check this out - About the Oath Oath of Enlistment Join the ArmyFind Out How You Can Serve Get Free Info Here. No Obligationwww.Military.com Federal law requires everyone who enlists or re-enlists in the Armed Forces of the United States to take the enlistment oath. The oath of enlistment into the United States Armed Forces is administered by any commissioned officer to any person enlisting or re-enlisting for a term of service into any branch of the military. The officer asks the person, or persons, to raise their right hand and repeat the oath after him. The oath is traditionally performed in front of the United States Flag and other flags, such as the state flag, military branch flag, and unit guidon may be present. In the Armed Forces EXCEPT the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the orders of the officers appointed over me, according to regulations and the Uniform Code of Military Justice. So help me God. In the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States and the State of (STATE NAME) against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the Governor of (STATE NAME) and the orders of the officers appointed over me, according to law and regulations. So help me God. Guide Note: There has been some controversy about whether the phrase \"So help me God\" is mandatory. I have seen officers allow enlistees to omit these words, if they choose, according to their religious preference and beliefs. While federal law does not appear to make any part of the oath optional (see Title 10, Section 502 of the United States Code), military regulations often do. For example, the Army enlistment regulation (see Army Regulation 601-210, paragraph 6-18) makes the portion \"So help me God\" optional. History of the Oath of Enlistment During the Revolutionary War, the Continental Congress established different oaths for the enlisted men of the Continental Army. The first oath, voted on 14 June 1775 as part of the act creating the Continental Army, read: I _____ have, this day, voluntarily enlisted myself, as a soldier, in the American continental army, for one year, unless sooner discharged: And I do bind myself to conform, in all instances, to such rules and regulations, as are, or shall be, established for the government of the said Army. The original wording was effectively replaced by Section 3, Article 1, of the Articles of War approved by Congress on 20 September 1776, which specified that the oath of enlistment read: I _____ swear (or affirm as the case may be) to be trued to the United States of America, and to serve them honestly and faithfully against all their enemies opposers whatsoever; and to observe and obey the orders of the Continental Congress, and the orders of the Generals and officers set over me by them. The first oath under the Constitution was approved by Act of Congress 29 September 1789 (Sec. 3, Ch. 25, 1st Congress). It applied to all commissioned officers, noncommissioned officers and privates in the service of the United States. It came in two parts, the first of which read: \"I, A.B., do solemnly swear or affirm (as the case may be) that I will support the constitution of the United States.\" The second part read: \"I, A.B., do solemnly swear or affirm (as the case may be) to bear true allegiance to the United States of America, and to serve them honestly and faithfully, against all their enemies or opposers whatsoever, and to observe and obey the orders of the President of the United States of America, and the orders of the officers appointed over me.\" The next section of that chapter specified that \"the said troops shall be governed by the rules and articles of war, which have been established by the United States in Congress assembled, or by such rules and articles of war as may hereafter by law be established.\" The 1789 enlistment oath was changed in 1960 by amendment to Title 10, with the amendment (and current wording) becoming effective in 1962. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090528, 
        "postID": 15, 
        "quote": "", 
        "reply": "Check this out - About the Oath Oath of Enlistment Join the ArmyFind Out How You Can Serve Get Free Info Here. No Obligationwww.Military.com Federal law requires everyone who enlists or re-enlists in the Armed Forces of the United States to take the enlistment oath. The oath of enlistment into the United States Armed Forces is administered by any commissioned officer to any person enlisting or re-enlisting for a term of service into any branch of the military. The officer asks the person, or persons, to raise their right hand and repeat the oath after him. The oath is traditionally performed in front of the United States Flag and other flags, such as the state flag, military branch flag, and unit guidon may be present. In the Armed Forces EXCEPT the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the orders of the officers appointed over me, according to regulations and the Uniform Code of Military Justice. So help me God. In the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States and the State of (STATE NAME) against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the Governor of (STATE NAME) and the orders of the officers appointed over me, according to law and regulations. So help me God. Guide Note: There has been some controversy about whether the phrase \"So help me God\" is mandatory. I have seen officers allow enlistees to omit these words, if they choose, according to their religious preference and beliefs. While federal law does not appear to make any part of the oath optional (see Title 10, Section 502 of the United States Code), military regulations often do. For example, the Army enlistment regulation (see Army Regulation 601-210, paragraph 6-18) makes the portion \"So help me God\" optional. History of the Oath of Enlistment During the Revolutionary War, the Continental Congress established different oaths for the enlisted men of the Continental Army. The first oath, voted on 14 June 1775 as part of the act creating the Continental Army, read: I _____ have, this day, voluntarily enlisted myself, as a soldier, in the American continental army, for one year, unless sooner discharged: And I do bind myself to conform, in all instances, to such rules and regulations, as are, or shall be, established for the government of the said Army. The original wording was effectively replaced by Section 3, Article 1, of the Articles of War approved by Congress on 20 September 1776, which specified that the oath of enlistment read: I _____ swear (or affirm as the case may be) to be trued to the United States of America, and to serve them honestly and faithfully against all their enemies opposers whatsoever; and to observe and obey the orders of the Continental Congress, and the orders of the Generals and officers set over me by them. The first oath under the Constitution was approved by Act of Congress 29 September 1789 (Sec. 3, Ch. 25, 1st Congress). It applied to all commissioned officers, noncommissioned officers and privates in the service of the United States. It came in two parts, the first of which read: \"I, A.B., do solemnly swear or affirm (as the case may be) that I will support the constitution of the United States.\" The second part read: \"I, A.B., do solemnly swear or affirm (as the case may be) to bear true allegiance to the United States of America, and to serve them honestly and faithfully, against all their enemies or opposers whatsoever, and to observe and obey the orders of the President of the United States of America, and the orders of the officers appointed over me.\" The next section of that chapter specified that \"the said troops shall be governed by the rules and articles of war, which have been established by the United States in Congress assembled, or by such rules and articles of war as may hereafter by law be established.\" The 1789 enlistment oath was changed in 1960 by amendment to Title 10, with the amendment (and current wording) becoming effective in 1962. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 06:57:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Thanks for putting the link back in there Old Army Love. I do not take a political party stand on this issue. In my opinion, Bush abused executive powers and Obama has demonstrated by his policies that he will exploit that power as far as he can. There have been instances throughout our history where presidents have gone too far. We have never had a president with a clear socialist agenda before. And history has taught us that socialism leads to despotism. We have already been confronted with 2nd Amendment violation. New Orleans Police and LA National Guard confiscated weapons from people in their homes. This scenarios is precisely why we have 2nd Amendment rights. After those weapons were taken from law abiding citizens then only criminals had weapons. When this situation arises again and those in authority want to confiscate weapons are you going to obey that order?", 
        "intTime": 20090528, 
        "postID": 16, 
        "quote": "", 
        "reply": "Thanks for putting the link back in there Old Army Love. I do not take a political party stand on this issue. In my opinion, Bush abused executive powers and Obama has demonstrated by his policies that he will exploit that power as far as he can. There have been instances throughout our history where presidents have gone too far. We have never had a president with a clear socialist agenda before. And history has taught us that socialism leads to despotism. We have already been confronted with 2nd Amendment violation. New Orleans Police and LA National Guard confiscated weapons from people in their homes. This scenarios is precisely why we have 2nd Amendment rights. After those weapons were taken from law abiding citizens then only criminals had weapons. When this situation arises again and those in authority want to confiscate weapons are you going to obey that order?", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 07:26:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "menges, I believe that is covered under the first amendment. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090528, 
        "postID": 17, 
        "quote": "", 
        "reply": "menges, I believe that is covered under the first amendment. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 07:43:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "First Amendment is freedom of speech, 2nd Amendment is right to bear arms.", 
        "intTime": 20090528, 
        "postID": 18, 
        "quote": "", 
        "reply": "First Amendment is freedom of speech, 2nd Amendment is right to bear arms.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 08:12:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: And how come we don't have a salute icon or a flag icon?", 
        "intTime": 20090528, 
        "postID": 19, 
        "quote": "Originally posted by charlie_echo: And how come we don't have a salute icon or a flag icon?", 
        "reply": "", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 18:28:00", 
        "title": "Remember Your Oath", 
        "userID": "ss_287"
    }, 
    {
        "content": "That's beautiful!", 
        "intTime": 20090528, 
        "postID": 20, 
        "quote": "", 
        "reply": "That's beautiful!", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 19:06:00", 
        "title": "Remember Your Oath", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Greetings, These are very politically troubling times we are in. Our freedoms as Americans are on the brink of being lost. If you still value the American way of life and honor your oath to defend the Constitution against all enemies foreign and domestic then please check out this link ******** If the Commander in Chief has his way then there will come a day when you may be required to violate the 2nd Amendment and confiscate weapons from U.S. citizens. Your oath is to the Constitution first and the President second. The president took and oath of office to \"preserve, protect and defend the Constitution of the United States.\" He has violated this oath already. Please go to ******** Hot links are not authorized - you've been around here long enough to know that. Please don't let it happen again This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:24 PM", 
        "intTime": 20090527, 
        "postID": 21, 
        "quote": "", 
        "reply": "Greetings, These are very politically troubling times we are in. Our freedoms as Americans are on the brink of being lost. If you still value the American way of life and honor your oath to defend the Constitution against all enemies foreign and domestic then please check out this link ******** If the Commander in Chief has his way then there will come a day when you may be required to violate the 2nd Amendment and confiscate weapons from U.S. citizens. Your oath is to the Constitution first and the President second. The president took and oath of office to \"preserve, protect and defend the Constitution of the United States.\" He has violated this oath already. Please go to ******** Hot links are not authorized - you've been around here long enough to know that. Please don't let it happen again This message has been edited. Last edited by: OldArmyLove, Wed 27 May 2009 01:24 PM", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 13:14:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "I heard this kind of talk after the 2006 elections seemed to put us on the path to withdrawal from Iraq. Some folks were talking about standing by Congress over and above the President, because the President had never secured a constitutional Congressional Declaration of War, or something. I don't remember the logic exactly. But it's not just the Right among our ranks that brings it up on occasion. Suffice it to say that it would be a very very serious situation before soldiers would ever have to make the choice between the President and the Constitution. Outside of those exceedingly unlikely scenarios, you are talking sedition and mutiny, which is rather dangerous ground for a military member to tread. Remember your oath, indeed.", 
        "intTime": 20090527, 
        "postID": 22, 
        "quote": "", 
        "reply": "I heard this kind of talk after the 2006 elections seemed to put us on the path to withdrawal from Iraq. Some folks were talking about standing by Congress over and above the President, because the President had never secured a constitutional Congressional Declaration of War, or something. I don't remember the logic exactly. But it's not just the Right among our ranks that brings it up on occasion. Suffice it to say that it would be a very very serious situation before soldiers would ever have to make the choice between the President and the Constitution. Outside of those exceedingly unlikely scenarios, you are talking sedition and mutiny, which is rather dangerous ground for a military member to tread. Remember your oath, indeed.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 16:15:00", 
        "title": "Remember Your Oath", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Orders from the Commander in Chief that nullify the Constitution are sedition and treason.", 
        "intTime": 20090527, 
        "postID": 23, 
        "quote": "", 
        "reply": "Orders from the Commander in Chief that nullify the Constitution are sedition and treason.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 16:37:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "Ooops. Sorry about the link. I have not posted on here in a couple of years. Just to clarify, when you take that oath it has no expiration date. I took the oath 30 years ago and served only one hitch. I still take that oath seriously. Many of our Constitutional freedoms are being challenged as I write this. 1st', 2nd, 4th, 5th, 9th, 10th Amendments, just to name a few, are nearly being nullified by the actions of this Commander in Chief. This abandonment of our Constitution can not be fully achieved if enough servicemembers honor their oath.", 
        "intTime": 20090527, 
        "postID": 24, 
        "quote": "", 
        "reply": "Ooops. Sorry about the link. I have not posted on here in a couple of years. Just to clarify, when you take that oath it has no expiration date. I took the oath 30 years ago and served only one hitch. I still take that oath seriously. Many of our Constitutional freedoms are being challenged as I write this. 1st', 2nd, 4th, 5th, 9th, 10th Amendments, just to name a few, are nearly being nullified by the actions of this Commander in Chief. This abandonment of our Constitution can not be fully achieved if enough servicemembers honor their oath.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 16:48:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "Welcome back. Understand - I didn't check the date of your previous posts. The TOS has been updated several time in the past few years as have rules for each of the different forums. I would recommend you reread the TOS and the rules for each forum prior to posting on that forum. It will keep you from getting snake bit. Enjoy! OAL quote: Ooops. Sorry about the link. I have not posted on here in a couple of years. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090527, 
        "postID": 25, 
        "quote": "Ooops. Sorry about the link. I have not posted on here in a couple of years.", 
        "reply": "Welcome back. Understand - I didn't check the date of your previous posts. The TOS has been updated several time in the past few years as have rules for each of the different forums. I would recommend you reread the TOS and the rules for each forum prior to posting on that forum. It will keep you from getting snake bit. Enjoy! OAL  God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 17:54:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "quote: Military.com Military.com Forums Hop To Forum Categories Hot Topics & Current Events Hop To Forums General Discussion Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want?? Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 26, 
        "quote": "Military.com Military.com Forums Hop To Forum Categories Hot Topics & Current Events Hop To Forums General Discussion", 
        "reply": " Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want?? Wandering and Wondering", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 18:03:00", 
        "title": "Remember Your Oath", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want?? GWG, I took it out, I'll put it back: http://www.oath-keepers.blogspot.com/ It is a good place and the OP had not been here since the hot link policy came in - he didn't know. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090527, 
        "postID": 27, 
        "quote": "Could somebody just put in a cold link so that we could at least hunt down and read the thing if we want??", 
        "reply": " GWG, I took it out, I'll put it back: http://www.oath-keepers.blogspot.com/ It is a good place and the OP had not been here since the hot link policy came in - he didn't know. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 18:18:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Good man!! Fairly interesting sight - - Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 28, 
        "quote": "", 
        "reply": "Good man!! Fairly interesting sight - - Wandering and Wondering", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 18:23:00", 
        "title": "Remember Your Oath", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "It is interesting. It's good that people realize the dangers inherent in some of President Bush's policies, such as warrantless searches and detaining citizens as \"enemy combatants.\" As the site's authors rightly point out, our rights can erode on both the left and the right. This is not a Democrat-Republican thing. Be that as it may, \"states of emergency\" are regularly declared in natural disasters. And a martial-law style lockdown would become a necessity in a quarantine for a deadly pandemic. A Democrat being elected President hasn't caused the Right to Bear Arms to be abrogated yet. Obama's not the first one. So don't panic, just yet, people. Folks posting on this website do still need to be careful if they are still in the military. We don't have the same freedom of speech as your average citizen, that's part and parcel of UCMJ. A few of my friends had their blogs shut down by the command in the past couple of years. You are free to believe what you want, and act according to your conscience, but be careful what you say in public, and what you post online, say the right things, even if you aren't tracked down as a user of this site. UCMJ applies whether or not anyone is watching. You aren't likely to be tracked on this site, but I'd not post identifying information, regardless, on the off chance the military decides it's crossed the line.", 
        "intTime": 20090527, 
        "postID": 29, 
        "quote": "", 
        "reply": "It is interesting. It's good that people realize the dangers inherent in some of President Bush's policies, such as warrantless searches and detaining citizens as \"enemy combatants.\" As the site's authors rightly point out, our rights can erode on both the left and the right. This is not a Democrat-Republican thing. Be that as it may, \"states of emergency\" are regularly declared in natural disasters. And a martial-law style lockdown would become a necessity in a quarantine for a deadly pandemic. A Democrat being elected President hasn't caused the Right to Bear Arms to be abrogated yet. Obama's not the first one. So don't panic, just yet, people. Folks posting on this website do still need to be careful if they are still in the military. We don't have the same freedom of speech as your average citizen, that's part and parcel of UCMJ. A few of my friends had their blogs shut down by the command in the past couple of years. You are free to believe what you want, and act according to your conscience, but be careful what you say in public, and what you post online, say the right things, even if you aren't tracked down as a user of this site. UCMJ applies whether or not anyone is watching. You aren't likely to be tracked on this site, but I'd not post identifying information, regardless, on the off chance the military decides it's crossed the line.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 19:12:00", 
        "title": "Remember Your Oath", 
        "userID": "Ruanne"
    }, 
    {
        "content": "I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ No exception, no expiration. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090527, 
        "postID": 30, 
        "quote": "", 
        "reply": "I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ No exception, no expiration. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 20:41:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "47 years ago.........an not forgoten. Can't wait to join. Great site,but stop the blowin sand in the eyes", 
        "intTime": 20090527, 
        "postID": 31, 
        "quote": "", 
        "reply": "47 years ago.........an not forgoten. Can't wait to join. Great site,but stop the blowin sand in the eyes", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-27 23:19:00", 
        "title": "Remember Your Oath", 
        "userID": "YankeeeSgt"
    }, 
    {
        "content": "quote: Originally posted by OldArmyLove: I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ took mine June 21 1962 and still keeping today as as long as i have a breath left No exception, no expiration.", 
        "intTime": 20090528, 
        "postID": 32, 
        "quote": "Originally posted by OldArmyLove: I not only remember it I have a copy of my oath at my appointment to W1, just shy of 41 years ago: ------------------------------------------------ took mine June 21 1962 and still keeping today as as long as i have a breath left No exception, no expiration.", 
        "reply": "", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 04:25:00", 
        "title": "Remember Your Oath", 
        "userID": "ss_287"
    }, 
    {
        "content": "Took the Army oath 12/83, took another 03/87 (LEO) Take them both pretty seriously.", 
        "intTime": 20090528, 
        "postID": 33, 
        "quote": "", 
        "reply": "Took the Army oath 12/83, took another 03/87 (LEO) Take them both pretty seriously.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 04:42:00", 
        "title": "Remember Your Oath", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "And how come we don't have a salute icon or a flag icon?", 
        "intTime": 20090528, 
        "postID": 34, 
        "quote": "", 
        "reply": "And how come we don't have a salute icon or a flag icon?", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 06:17:00", 
        "title": "Remember Your Oath", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Check this out - About the Oath Oath of Enlistment Join the ArmyFind Out How You Can Serve Get Free Info Here. No Obligationwww.Military.com Federal law requires everyone who enlists or re-enlists in the Armed Forces of the United States to take the enlistment oath. The oath of enlistment into the United States Armed Forces is administered by any commissioned officer to any person enlisting or re-enlisting for a term of service into any branch of the military. The officer asks the person, or persons, to raise their right hand and repeat the oath after him. The oath is traditionally performed in front of the United States Flag and other flags, such as the state flag, military branch flag, and unit guidon may be present. In the Armed Forces EXCEPT the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the orders of the officers appointed over me, according to regulations and the Uniform Code of Military Justice. So help me God. In the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States and the State of (STATE NAME) against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the Governor of (STATE NAME) and the orders of the officers appointed over me, according to law and regulations. So help me God. Guide Note: There has been some controversy about whether the phrase \"So help me God\" is mandatory. I have seen officers allow enlistees to omit these words, if they choose, according to their religious preference and beliefs. While federal law does not appear to make any part of the oath optional (see Title 10, Section 502 of the United States Code), military regulations often do. For example, the Army enlistment regulation (see Army Regulation 601-210, paragraph 6-18) makes the portion \"So help me God\" optional. History of the Oath of Enlistment During the Revolutionary War, the Continental Congress established different oaths for the enlisted men of the Continental Army. The first oath, voted on 14 June 1775 as part of the act creating the Continental Army, read: I _____ have, this day, voluntarily enlisted myself, as a soldier, in the American continental army, for one year, unless sooner discharged: And I do bind myself to conform, in all instances, to such rules and regulations, as are, or shall be, established for the government of the said Army. The original wording was effectively replaced by Section 3, Article 1, of the Articles of War approved by Congress on 20 September 1776, which specified that the oath of enlistment read: I _____ swear (or affirm as the case may be) to be trued to the United States of America, and to serve them honestly and faithfully against all their enemies opposers whatsoever; and to observe and obey the orders of the Continental Congress, and the orders of the Generals and officers set over me by them. The first oath under the Constitution was approved by Act of Congress 29 September 1789 (Sec. 3, Ch. 25, 1st Congress). It applied to all commissioned officers, noncommissioned officers and privates in the service of the United States. It came in two parts, the first of which read: \"I, A.B., do solemnly swear or affirm (as the case may be) that I will support the constitution of the United States.\" The second part read: \"I, A.B., do solemnly swear or affirm (as the case may be) to bear true allegiance to the United States of America, and to serve them honestly and faithfully, against all their enemies or opposers whatsoever, and to observe and obey the orders of the President of the United States of America, and the orders of the officers appointed over me.\" The next section of that chapter specified that \"the said troops shall be governed by the rules and articles of war, which have been established by the United States in Congress assembled, or by such rules and articles of war as may hereafter by law be established.\" The 1789 enlistment oath was changed in 1960 by amendment to Title 10, with the amendment (and current wording) becoming effective in 1962. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090528, 
        "postID": 35, 
        "quote": "", 
        "reply": "Check this out - About the Oath Oath of Enlistment Join the ArmyFind Out How You Can Serve Get Free Info Here. No Obligationwww.Military.com Federal law requires everyone who enlists or re-enlists in the Armed Forces of the United States to take the enlistment oath. The oath of enlistment into the United States Armed Forces is administered by any commissioned officer to any person enlisting or re-enlisting for a term of service into any branch of the military. The officer asks the person, or persons, to raise their right hand and repeat the oath after him. The oath is traditionally performed in front of the United States Flag and other flags, such as the state flag, military branch flag, and unit guidon may be present. In the Armed Forces EXCEPT the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the orders of the officers appointed over me, according to regulations and the Uniform Code of Military Justice. So help me God. In the National Guard (Army or Air) I, (NAME), do solemnly swear (or affirm) that I will support and defend the Constitution of the United States and the State of (STATE NAME) against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; and that I will obey the orders of the President of the United States and the Governor of (STATE NAME) and the orders of the officers appointed over me, according to law and regulations. So help me God. Guide Note: There has been some controversy about whether the phrase \"So help me God\" is mandatory. I have seen officers allow enlistees to omit these words, if they choose, according to their religious preference and beliefs. While federal law does not appear to make any part of the oath optional (see Title 10, Section 502 of the United States Code), military regulations often do. For example, the Army enlistment regulation (see Army Regulation 601-210, paragraph 6-18) makes the portion \"So help me God\" optional. History of the Oath of Enlistment During the Revolutionary War, the Continental Congress established different oaths for the enlisted men of the Continental Army. The first oath, voted on 14 June 1775 as part of the act creating the Continental Army, read: I _____ have, this day, voluntarily enlisted myself, as a soldier, in the American continental army, for one year, unless sooner discharged: And I do bind myself to conform, in all instances, to such rules and regulations, as are, or shall be, established for the government of the said Army. The original wording was effectively replaced by Section 3, Article 1, of the Articles of War approved by Congress on 20 September 1776, which specified that the oath of enlistment read: I _____ swear (or affirm as the case may be) to be trued to the United States of America, and to serve them honestly and faithfully against all their enemies opposers whatsoever; and to observe and obey the orders of the Continental Congress, and the orders of the Generals and officers set over me by them. The first oath under the Constitution was approved by Act of Congress 29 September 1789 (Sec. 3, Ch. 25, 1st Congress). It applied to all commissioned officers, noncommissioned officers and privates in the service of the United States. It came in two parts, the first of which read: \"I, A.B., do solemnly swear or affirm (as the case may be) that I will support the constitution of the United States.\" The second part read: \"I, A.B., do solemnly swear or affirm (as the case may be) to bear true allegiance to the United States of America, and to serve them honestly and faithfully, against all their enemies or opposers whatsoever, and to observe and obey the orders of the President of the United States of America, and the orders of the officers appointed over me.\" The next section of that chapter specified that \"the said troops shall be governed by the rules and articles of war, which have been established by the United States in Congress assembled, or by such rules and articles of war as may hereafter by law be established.\" The 1789 enlistment oath was changed in 1960 by amendment to Title 10, with the amendment (and current wording) becoming effective in 1962. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 06:57:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "Thanks for putting the link back in there Old Army Love. I do not take a political party stand on this issue. In my opinion, Bush abused executive powers and Obama has demonstrated by his policies that he will exploit that power as far as he can. There have been instances throughout our history where presidents have gone too far. We have never had a president with a clear socialist agenda before. And history has taught us that socialism leads to despotism. We have already been confronted with 2nd Amendment violation. New Orleans Police and LA National Guard confiscated weapons from people in their homes. This scenarios is precisely why we have 2nd Amendment rights. After those weapons were taken from law abiding citizens then only criminals had weapons. When this situation arises again and those in authority want to confiscate weapons are you going to obey that order?", 
        "intTime": 20090528, 
        "postID": 36, 
        "quote": "", 
        "reply": "Thanks for putting the link back in there Old Army Love. I do not take a political party stand on this issue. In my opinion, Bush abused executive powers and Obama has demonstrated by his policies that he will exploit that power as far as he can. There have been instances throughout our history where presidents have gone too far. We have never had a president with a clear socialist agenda before. And history has taught us that socialism leads to despotism. We have already been confronted with 2nd Amendment violation. New Orleans Police and LA National Guard confiscated weapons from people in their homes. This scenarios is precisely why we have 2nd Amendment rights. After those weapons were taken from law abiding citizens then only criminals had weapons. When this situation arises again and those in authority want to confiscate weapons are you going to obey that order?", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 07:26:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "menges, I believe that is covered under the first amendment. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "intTime": 20090528, 
        "postID": 37, 
        "quote": "", 
        "reply": "menges, I believe that is covered under the first amendment. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 07:43:00", 
        "title": "Remember Your Oath", 
        "userID": "OldArmyLove"
    }, 
    {
        "content": "First Amendment is freedom of speech, 2nd Amendment is right to bear arms.", 
        "intTime": 20090528, 
        "postID": 38, 
        "quote": "", 
        "reply": "First Amendment is freedom of speech, 2nd Amendment is right to bear arms.", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 08:12:00", 
        "title": "Remember Your Oath", 
        "userID": "menges"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: And how come we don't have a salute icon or a flag icon?", 
        "intTime": 20090528, 
        "postID": 39, 
        "quote": "Originally posted by charlie_echo: And how come we don't have a salute icon or a flag icon?", 
        "reply": "", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 18:28:00", 
        "title": "Remember Your Oath", 
        "userID": "ss_287"
    }, 
    {
        "content": "That's beautiful!", 
        "intTime": 20090528, 
        "postID": 40, 
        "quote": "", 
        "reply": "That's beautiful!", 
        "threadID": "5291911282_3540024422001", 
        "time": "2009-05-28 19:06:00", 
        "title": "Remember Your Oath", 
        "userID": "charlie_echo"
    }
]