[
    {
        "content": "This is a true story and the author, Rick Mathes, is a well-known leader in prison ministry. The man who walks with God always gets to his destination. If you have a pulse you have a purpose. The Muslim religion is the fastest growing religion per capita in the United States, especially in the minority races!!! Last month I attended my annual training session that's required for maintaining my state prison security clearance. During the training session there was a presentation by three speakers representing the Roman Catholic, Protestant and Muslim faiths, who explained each of their beliefs. I was particularly interested in what the Islamic Imam had to say. The Imam gave a great presentation of the basics of Islam, complete with a video. After the presentations, time was provided for questions and answers. When it was my turn, I directed my question to the Imam and asked: 'Please, correct me if I'm wrong, but I understand that most Imams and clerics of Islam have declared a holy jihad [Holy war] against the infidels of the world and, that by killing an infidel, (which is a command to all Muslims) they are assured of a place in heaven. If that's the case, can you give me the definition of an infidel?' There was no disagreement with my statements and,without hesitation, he replied, 'Non-believers!' I responded, 'So, let me make sure I have this straight. All followers of Allah have been commanded to kill everyone who is not of your faith so they can have a place in heaven. Is that correct?' The expression on his face changed from one of authority and command to that of a little boy who had just been caught with his hand in the cookie jar.' He sheepishly replied, 'Yes.' I then stated, 'Well, sir, I have a real problem trying to imagine Pope John Paul commanding all Catholics to kill those of your faith or Dr. Stanley ordering all Protestants to do the same in order to guarantee them a place in heaven!' The Imam was speechless! I continued, 'I also have problem with being your friend when you and your brother clerics are telling your followers to kill me! Let me ask you a question: Would you rather have your Allah, who tells you to kill me in order for you to go to heaven, or my Jesus who tells me to love you because I am going to heaven and He wants you to be there with me?' You could have heard a pin drop as the Imam hung his head in shame. Needless to say, the organizers and/or promoters of the Diversification' training seminar were not happy with Rick's way of dealing with the Islamic Imam , and exposing the truth about the Muslims' beliefs. In twenty years there will be enough Muslim voters in the U.S. to elect the President! I think everyone in the U.S. and Canada should be required to read this, but with the ACLU, there is no way this will be widely publicized,unless each of us send it on! This is your chance to make a difference... To Late ????? SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 1, 
        "quote": "", 
        "reply": "This is a true story and the author, Rick Mathes, is a well-known leader in prison ministry. The man who walks with God always gets to his destination. If you have a pulse you have a purpose. The Muslim religion is the fastest growing religion per capita in the United States, especially in the minority races!!! Last month I attended my annual training session that's required for maintaining my state prison security clearance. During the training session there was a presentation by three speakers representing the Roman Catholic, Protestant and Muslim faiths, who explained each of their beliefs. I was particularly interested in what the Islamic Imam had to say. The Imam gave a great presentation of the basics of Islam, complete with a video. After the presentations, time was provided for questions and answers. When it was my turn, I directed my question to the Imam and asked: 'Please, correct me if I'm wrong, but I understand that most Imams and clerics of Islam have declared a holy jihad [Holy war] against the infidels of the world and, that by killing an infidel, (which is a command to all Muslims) they are assured of a place in heaven. If that's the case, can you give me the definition of an infidel?' There was no disagreement with my statements and,without hesitation, he replied, 'Non-believers!' I responded, 'So, let me make sure I have this straight. All followers of Allah have been commanded to kill everyone who is not of your faith so they can have a place in heaven. Is that correct?' The expression on his face changed from one of authority and command to that of a little boy who had just been caught with his hand in the cookie jar.' He sheepishly replied, 'Yes.' I then stated, 'Well, sir, I have a real problem trying to imagine Pope John Paul commanding all Catholics to kill those of your faith or Dr. Stanley ordering all Protestants to do the same in order to guarantee them a place in heaven!' The Imam was speechless! I continued, 'I also have problem with being your friend when you and your brother clerics are telling your followers to kill me! Let me ask you a question: Would you rather have your Allah, who tells you to kill me in order for you to go to heaven, or my Jesus who tells me to love you because I am going to heaven and He wants you to be there with me?' You could have heard a pin drop as the Imam hung his head in shame. Needless to say, the organizers and/or promoters of the Diversification' training seminar were not happy with Rick's way of dealing with the Islamic Imam , and exposing the truth about the Muslims' beliefs. In twenty years there will be enough Muslim voters in the U.S. to elect the President! I think everyone in the U.S. and Canada should be required to read this, but with the ACLU, there is no way this will be widely publicized,unless each of us send it on! This is your chance to make a difference... To Late ????? SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-08 18:04:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "EOCRon"
    }, 
    {
        "content": "Thank you Ron for saying what needed to be said! I recommend a book by John MacArthur, the title is, \"Terrorism, Jihad, and the Bible\" It's only 120 pages, but it opens your eye's, you will know the lies perpetrated by the so called peace loving people! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "", 
        "reply": "Thank you Ron for saying what needed to be said! I recommend a book by John MacArthur, the title is, \"Terrorism, Jihad, and the Bible\" It's only 120 pages, but it opens your eye's, you will know the lies perpetrated by the so called peace loving people! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-08 20:54:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "Bergy46"
    }, 
    {
        "content": "http://www.snopes.com/politics/religion/allah.asp Snopes calls BS on this one! quote: Reporter Greg Kearney, writing for the Lee News Service, traced the story to a correctional facility in Fulton, Missouri, and came away with a decidedly different version of events from Missouri state officials. According to Tim Kniest, Public Information Officer for the Missouri Department of Corrections, the event described was a training program for prison volunteers, for which ministers from several faiths were invited to give presentations in order to acquaint prison volunteers with the varied religious beliefs of the inmate population. The man who gave the presentation about Islam was not a Muslim minister; he was an inmate pressed into service to present a short film on Islam and answer some questions when the prison's Volunteer Coordinator was \"unable to find an Imam to speak. \"Moreover, reported Mr. Kniest, the prison's Volunteer Coordinator said that \"The inmate did a good job,\" adding, \"He was asked a few questions that were beyond his ability to answer. But he was not asked anything like that question [in the editorial]\": “...the Volunteer Coordinator at the prison said that no such exchange as the editorial reported ever took place. \"He certainly did not 'Hang his head in shame',\" according to Kniest. In fact, the inmate was thanked by the assembly before being escorted back to his quarters. Furthermore, the coordinator does not recall any questions dealing with jihad [Holy war] against the infidels of the world as reported in the editorial. In the editorial the inmate is presented as an Imam, or Islamic minister, which he clearly was not.” Regardless of whatever may have transpired at the prison training session referred to above, the larger point the writer is attempting to make in this piece is a grossly inaccurate one. Islam is not a monolithic religion in which unanimity of belief and action is coordinated from a central authority; with as well over a billion adherents in countries all over the world who belong to any one of a number of different sects with varying beliefs, traditions, and interpretations of scripture. (As well, some religious groups identify themselves as Islamic but are not recognized as such by the vast majority of Muslims.) No one Muslim (especially one who wasn't even a cleric) could speak to what all of Islam believes, anymore than a single member of a Methodist congregation could speak for every denomination and follower of Christianity. It sounds as if this Rick Mathes isn't one to let reality stand in the way of a good story, especially if it also allows him to work his personal bias into it! A Minister lacking integrity; imagine that! This message has been edited. Last edited by: KJ1110, Mon 09 March 2009 07:12 AM It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "Reporter Greg Kearney, writing for the Lee News Service, traced the story to a correctional facility in Fulton, Missouri, and came away with a decidedly different version of events from Missouri state officials. According to Tim Kniest, Public Information Officer for the Missouri Department of Corrections, the event described was a training program for prison volunteers, for which ministers from several faiths were invited to give presentations in order to acquaint prison volunteers with the varied religious beliefs of the inmate population. The man who gave the presentation about Islam was not a Muslim minister; he was an inmate pressed into service to present a short film on Islam and answer some questions when the prison's Volunteer Coordinator was \"unable to find an Imam to speak. \"Moreover, reported Mr. Kniest, the prison's Volunteer Coordinator said that \"The inmate did a good job,\" adding, \"He was asked a few questions that were beyond his ability to answer. But he was not asked anything like that question [in the editorial]\": “...the Volunteer Coordinator at the prison said that no such exchange as the editorial reported ever took place. \"He certainly did not 'Hang his head in shame',\" according to Kniest. In fact, the inmate was thanked by the assembly before being escorted back to his quarters. Furthermore, the coordinator does not recall any questions dealing with jihad [Holy war] against the infidels of the world as reported in the editorial. In the editorial the inmate is presented as an Imam, or Islamic minister, which he clearly was not.” Regardless of whatever may have transpired at the prison training session referred to above, the larger point the writer is attempting to make in this piece is a grossly inaccurate one. Islam is not a monolithic religion in which unanimity of belief and action is coordinated from a central authority; with as well over a billion adherents in countries all over the world who belong to any one of a number of different sects with varying beliefs, traditions, and interpretations of scripture. (As well, some religious groups identify themselves as Islamic but are not recognized as such by the vast majority of Muslims.) No one Muslim (especially one who wasn't even a cleric) could speak to what all of Islam believes, anymore than a single member of a Methodist congregation could speak for every denomination and follower of Christianity.", 
        "reply": "http://www.snopes.com/politics/religion/allah.asp Snopes calls BS on this one!  It sounds as if this Rick Mathes isn't one to let reality stand in the way of a good story, especially if it also allows him to work his personal bias into it! A Minister lacking integrity; imagine that! This message has been edited. Last edited by: KJ1110, Mon 09 March 2009 07:12 AM It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 06:34:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "KJ1110"
    }, 
    {
        "content": "KJ, Here's the thing though. The story may be a total fake but the thing is, as I see it, is that the message is true. It's true and it's scary to say the least. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "", 
        "reply": "KJ, Here's the thing though. The story may be a total fake but the thing is, as I see it, is that the message is true. It's true and it's scary to say the least. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 07:21:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "Vicdude"
    }, 
    {
        "content": "There is no other religion that teaches hate and death to those who wont follow their religion. Their false god is just that, a false god. The false god, allah is a figment of a sick mind! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "", 
        "reply": "There is no other religion that teaches hate and death to those who wont follow their religion. Their false god is just that, a false god. The false god, allah is a figment of a sick mind! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 08:38:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: KJ, Here's the thing though. The story may be a total fake but the thing is, as I see it, is that the message is true. It's true and it's scary to say the least. While it's certainly true of some member's of that religion, it is not true of all adherants of it anymore than all Christians are beer-swilling, snake-handling, buck-toothed, backwoods, tub-thumping, abortion-clinic bombing, haters of all things not white! Sweeping generalizations are always idiotic, and will inevitably come back and bite you in the butt! Usually, the members of any given group of people do stupid, evil, immoral things as a result of a lack of education combined with a charismatic leader manipulating their lack of sophistication to suit his own ends and not that of the Religion through their own personal twisting of the dogma. This so called Minister of the Gospel is not much better than these Imams in that he's equally willing to misrepresent reality in order to get individuals to fall in line with his particular brand of \"group-think!\" I have no use for liers of any stripe! The ends NEVER justify the means! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "Originally posted by Vicdude: KJ, Here's the thing though. The story may be a total fake but the thing is, as I see it, is that the message is true. It's true and it's scary to say the least.", 
        "reply": " While it's certainly true of some member's of that religion, it is not true of all adherants of it anymore than all Christians are beer-swilling, snake-handling, buck-toothed, backwoods, tub-thumping, abortion-clinic bombing, haters of all things not white! Sweeping generalizations are always idiotic, and will inevitably come back and bite you in the butt! Usually, the members of any given group of people do stupid, evil, immoral things as a result of a lack of education combined with a charismatic leader manipulating their lack of sophistication to suit his own ends and not that of the Religion through their own personal twisting of the dogma. This so called Minister of the Gospel is not much better than these Imams in that he's equally willing to misrepresent reality in order to get individuals to fall in line with his particular brand of \"group-think!\" I have no use for liers of any stripe! The ends NEVER justify the means! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 10:32:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: There is no other religion that teaches hate and death to those who wont follow their religion. Their false god is just that, a false god. The false god, allah is a figment of a sick mind! Bruce! Please! I have a higher opinion of you than that (and not just because of our shared surname). False God, indeed! Whether or not you choose to acknowledge it, the God of Islam (Allah) is based on the same deity as is ALL Abrahamic dogma. What you think of as the \"One True God,\" follower's of other dogma call a \"False God!\" Your acceptance of your particular interpretation has no more nor no less credence than anyone else's except to you and like-minded people! Beliefs are just another form of opinion, and you already know the rest of that cliched axiom! Leaving aside for the moment that I personally think all God-botherer's are some degree of nutz, I'm perfectly content to leave them to their own devices so long as they leave me to mine, but when you spout such disingenuous nonsense, you leave me shaking my head in profound sadness! This message has been edited. Last edited by: KJ1110, Mon 09 March 2009 11:05 AM It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090309, 
        "postID": 7, 
        "quote": "Originally posted by Bergy46: There is no other religion that teaches hate and death to those who wont follow their religion. Their false god is just that, a false god. The false god, allah is a figment of a sick mind!", 
        "reply": " Bruce! Please! I have a higher opinion of you than that (and not just because of our shared surname). False God, indeed! Whether or not you choose to acknowledge it, the God of Islam (Allah) is based on the same deity as is ALL Abrahamic dogma. What you think of as the \"One True God,\" follower's of other dogma call a \"False God!\" Your acceptance of your particular interpretation has no more nor no less credence than anyone else's except to you and like-minded people! Beliefs are just another form of opinion, and you already know the rest of that cliched axiom! Leaving aside for the moment that I personally think all God-botherer's are some degree of nutz, I'm perfectly content to leave them to their own devices so long as they leave me to mine, but when you spout such disingenuous nonsense, you leave me shaking my head in profound sadness! This message has been edited. Last edited by: KJ1110, Mon 09 March 2009 11:05 AM It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 10:45:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Yeah this had the reek of a chain email-lie. Thanks for debunking it and saving me the time. I love how these things are always posted as absolute fact, and are then quickly proved to be false; at which point the OP and gang always say, \"well the message is still true.\"", 
        "intTime": 20090309, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yeah this had the reek of a chain email-lie. Thanks for debunking it and saving me the time. I love how these things are always posted as absolute fact, and are then quickly proved to be false; at which point the OP and gang always say, \"well the message is still true.\"", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 11:34:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Yeah this had the reek of a chain email-lie. Thanks for debunking it and saving me the time. I love how these things are always posted as absolute fact, and are then quickly proved to be false; at which point the OP and gang always say, \"well the message is still true.\" My personal rule-of-thumb on such chain emails is that, by dint of it being a chain email, it's very likely BS, and if it's cute, it's almost certainly BS! If no attribution is given in the retelling, don't waste synapse-time on the BS other than to debunk it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090309, 
        "postID": 9, 
        "quote": "Originally posted by foxred03: Yeah this had the reek of a chain email-lie. Thanks for debunking it and saving me the time. I love how these things are always posted as absolute fact, and are then quickly proved to be false; at which point the OP and gang always say, \"well the message is still true.\"", 
        "reply": " My personal rule-of-thumb on such chain emails is that, by dint of it being a chain email, it's very likely BS, and if it's cute, it's almost certainly BS! If no attribution is given in the retelling, don't waste synapse-time on the BS other than to debunk it! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_5830092712001", 
        "time": "2009-03-09 13:21:00", 
        "title": "Author, Rick Mathes,Tells a Story", 
        "userID": "KJ1110"
    }
]