[
    {
        "content": "tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-15 23:25:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "SUEOH46"
    }, 
    {
        "content": "Uh, WTF? We speak English here, and - aside from RONCO - we don't shout by typing in all caps. Why do I think, one-and-done?", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "", 
        "reply": "Uh, WTF? We speak English here, and - aside from RONCO - we don't shout by typing in all caps. Why do I think, one-and-done?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-15 23:29:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "I don't know Cider why you would think that?", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "I don't know Cider why you would think that?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 03:46:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf Stop yelling. My wife is still sleeping.", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "reply": " Stop yelling. My wife is still sleeping.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 04:03:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Duster6"
    }, 
    {
        "content": "It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "", 
        "reply": "It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 05:21:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that?", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "", 
        "reply": "Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 05:53:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "OldChief5"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: That's nice, but if you have to teach someone how to type. They just need to turn off their computer and go get them some knowledge.", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "Originally posted by KJ1110:", 
        "reply": " That's nice, but if you have to teach someone how to type. They just need to turn off their computer and go get them some knowledge.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 05:58:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by OldChief5: Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that? I've run into that exact situation also. I have a pretty bad hand injury, I am 60% through vA for it. Still had to take a typing test, even though, loss of dexterity in my left hand is well documented. Some of those laws are bs. There just to say, were taking care of our own.", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by OldChief5: Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that?", 
        "reply": " I've run into that exact situation also. I have a pretty bad hand injury, I am 60% through vA for it. Still had to take a typing test, even though, loss of dexterity in my left hand is well documented. Some of those laws are bs. There just to say, were taking care of our own.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:01:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "azmax64"
    }, 
    {
        "content": "Young Lady, we do not shout here. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "", 
        "reply": "Young Lady, we do not shout here. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:11:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: SUEOH46 New Member I just had a really ugly experience! I clicked on her profile to have at least some clue (despite the terrible page) as too who she is, and MY page keeps popping up!! Whatsup with that!! Is my page and personal information being compromised?? This is really screwed up!! As for the games people play - they probably want somebody \"in house\" and are going to engineer the hiring that way every time -- Wandering and Wondering", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "SUEOH46 New Member", 
        "reply": " I just had a really ugly experience! I clicked on her profile to have at least some clue (despite the terrible page) as too who she is, and MY page keeps popping up!! Whatsup with that!! Is my page and personal information being compromised?? This is really screwed up!! As for the games people play - they probably want somebody \"in house\" and are going to engineer the hiring that way every time -- Wandering and Wondering", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:27:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I don't know the exact percentage of vets were I work, but it does seem to be pretty large. There were 9 people that started the same day as I did and 6 more 2 weeks later, all vets but 1. I did have an interesting experience when I retired in 2000. I applied for a pay tech job with the Coast Guard. It would be a step down from the job I retired from. This would be great I thought; a lock. I would be filling a position of someone I used to supervise. When I submitted my resume I was told that my Coast Guard experience didn't qualify me for the job. My current job (temp receiving clerk at a warehouse) did. For 18 of my 22 years, I was worked in pay and personnel but that didn't count.", 
        "intTime": 20090416, 
        "postID": 11, 
        "quote": "", 
        "reply": "I don't know the exact percentage of vets were I work, but it does seem to be pretty large. There were 9 people that started the same day as I did and 6 more 2 weeks later, all vets but 1. I did have an interesting experience when I retired in 2000. I applied for a pay tech job with the Coast Guard. It would be a step down from the job I retired from. This would be great I thought; a lock. I would be filling a position of someone I used to supervise. When I submitted my resume I was told that my Coast Guard experience didn't qualify me for the job. My current job (temp receiving clerk at a warehouse) did. For 18 of my 22 years, I was worked in pay and personnel but that didn't count.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:30:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "PSimon572"
    }, 
    {
        "content": "It seems she is upset! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090416, 
        "postID": 12, 
        "quote": "", 
        "reply": "It seems she is upset! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:33:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf If writing skills were required, I think it's pretty obvious why you didn't get the job. Don", 
        "intTime": 20090416, 
        "postID": 13, 
        "quote": "Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "reply": " If writing skills were required, I think it's pretty obvious why you didn't get the job. Don", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:33:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "intTime": 20090416, 
        "postID": 14, 
        "quote": "", 
        "reply": "I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 07:25:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "VDoP"
    }, 
    {
        "content": "This has been the case since the Vietnam era even then the military help screw vets with their SPN (spin codes) added covertly by the units that RELACDU them. In my state the Vets of Vietnam's labor board records were kept in the same file as paroled criminals and you were treated as such. The Administration fears us, which is good lest the gov. should get too oppressive. One good thing about this \"we know what floggin' side the Gov. is on.\"", 
        "intTime": 20090416, 
        "postID": 15, 
        "quote": "", 
        "reply": "This has been the case since the Vietnam era even then the military help screw vets with their SPN (spin codes) added covertly by the units that RELACDU them. In my state the Vets of Vietnam's labor board records were kept in the same file as paroled criminals and you were treated as such. The Administration fears us, which is good lest the gov. should get too oppressive. One good thing about this \"we know what floggin' side the Gov. is on.\"", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 07:41:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "galloglas"
    }, 
    {
        "content": "Perhaps it's more of who ya know and who ya blow It's easy to pick Vets that voted for Obama for his Iraq visit and exclude the ones who did not and it's easy to find vets that do a Murtha/JFkerry and give them the jobs and exclude the ones who did not. I have hundreds of friends who served and could not even get in the line to get the jobs. ----------------------------- quote: Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "reply": "Perhaps it's more of who ya know and who ya blow It's easy to pick Vets that voted for Obama for his Iraq visit and exclude the ones who did not and it's easy to find vets that do a Murtha/JFkerry and give them the jobs and exclude the ones who did not. I have hundreds of friends who served and could not even get in the line to get the jobs. ----------------------------- ", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 07:46:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "galloglas"
    }, 
    {
        "content": "This has been going on for a long time now, What's yer beef? I've lost a few jobs to civilians who were not as qualified. So there fixing the job requiremnets and qualifications so they can have the \"other\" guy doing it eh? He11 I saw this same thing in the Military, what's the diff? This kind of stuff happens all over because people just aren't honest. It's all a facade to keep you in line. Everybody else can go nutz and lie their azz off yet you have to toe the line. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "", 
        "reply": "This has been going on for a long time now, What's yer beef? I've lost a few jobs to civilians who were not as qualified. So there fixing the job requiremnets and qualifications so they can have the \"other\" guy doing it eh? He11 I saw this same thing in the Military, what's the diff? This kind of stuff happens all over because people just aren't honest. It's all a facade to keep you in line. Everybody else can go nutz and lie their azz off yet you have to toe the line. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 08:08:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination. I know many, me being one of them. Just about everyone I knew working for US Customs, Air and Marine Interdiction Division was a Military Veteran. But like you said, your military skills have a lot to do with the jobs required skills that you are applying for. IE: I ran boats for the USCG, therefore I was hired by Customs to run their patrol boats. Others I knew were Army, Marine, etc pilots, therefore they got the pilot positions with US Customs. Don", 
        "intTime": 20090416, 
        "postID": 18, 
        "quote": "Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "reply": " I know many, me being one of them. Just about everyone I knew working for US Customs, Air and Marine Interdiction Division was a Military Veteran. But like you said, your military skills have a lot to do with the jobs required skills that you are applying for. IE: I ran boats for the USCG, therefore I was hired by Customs to run their patrol boats. Others I knew were Army, Marine, etc pilots, therefore they got the pilot positions with US Customs. Don", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 08:12:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf If writing skills were required, I think it's pretty obvious why you didn't get the job. Don My thoughts exactly. I just can't quite stop laughing at the original post...spelling, grammer, relational skills, etc. - all MIA. WHAT A MARON!! These are my opinions. Yours may differ.", 
        "intTime": 20090416, 
        "postID": 19, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf If writing skills were required, I think it's pretty obvious why you didn't get the job. Don", 
        "reply": " My thoughts exactly. I just can't quite stop laughing at the original post...spelling, grammer, relational skills, etc. - all MIA. WHAT A MARON!! These are my opinions. Yours may differ.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 10:41:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "4403771"
    }, 
    {
        "content": "What did I say, Dawg - one and done! No word from the OP ...", 
        "intTime": 20090416, 
        "postID": 20, 
        "quote": "", 
        "reply": "What did I say, Dawg - one and done! No word from the OP ...", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 11:05:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "intTime": 20090415, 
        "postID": 21, 
        "quote": "", 
        "reply": "tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-15 23:25:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "SUEOH46"
    }, 
    {
        "content": "Uh, WTF? We speak English here, and - aside from RONCO - we don't shout by typing in all caps. Why do I think, one-and-done?", 
        "intTime": 20090415, 
        "postID": 22, 
        "quote": "", 
        "reply": "Uh, WTF? We speak English here, and - aside from RONCO - we don't shout by typing in all caps. Why do I think, one-and-done?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-15 23:29:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "I don't know Cider why you would think that?", 
        "intTime": 20090416, 
        "postID": 23, 
        "quote": "", 
        "reply": "I don't know Cider why you would think that?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 03:46:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf Stop yelling. My wife is still sleeping.", 
        "intTime": 20090416, 
        "postID": 24, 
        "quote": "Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "reply": " Stop yelling. My wife is still sleeping.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 04:03:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Duster6"
    }, 
    {
        "content": "It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090416, 
        "postID": 25, 
        "quote": "", 
        "reply": "It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 05:21:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "KJ1110"
    }, 
    {
        "content": "Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that?", 
        "intTime": 20090416, 
        "postID": 26, 
        "quote": "", 
        "reply": "Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 05:53:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "OldChief5"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: That's nice, but if you have to teach someone how to type. They just need to turn off their computer and go get them some knowledge.", 
        "intTime": 20090416, 
        "postID": 27, 
        "quote": "Originally posted by KJ1110:", 
        "reply": " That's nice, but if you have to teach someone how to type. They just need to turn off their computer and go get them some knowledge.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 05:58:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "azmax64"
    }, 
    {
        "content": "quote: Originally posted by OldChief5: Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that? I've run into that exact situation also. I have a pretty bad hand injury, I am 60% through vA for it. Still had to take a typing test, even though, loss of dexterity in my left hand is well documented. Some of those laws are bs. There just to say, were taking care of our own.", 
        "intTime": 20090416, 
        "postID": 28, 
        "quote": "Originally posted by OldChief5: Here's my story: I applied for a job with a fed Agency...HR at such Agency said I was qualified with a 110 incl vet preference. Over 100 applicants, only 2 (incl me) selected by HR to go to the \"hiring\" person...hiring person said I was \"inexperienced\" (only 40 years on the job!) Tried to go ADR...they refused...filed EEO complaint...no help from anyone...found out that the \"other\" person sent by HR \"withdrew\", which left me last man standing of 100 ap-plicants...still not hired...learned that a second, slightly modified job request went out shortly after the other person \"withdrew\"... the withdrawee got that job...it's been 2 years, the same, original vacancy still exists...Agency claims i am not expereinced enough and they have been unable to fill the job for the past 2 years... ...hmmmm, what's up with that?", 
        "reply": " I've run into that exact situation also. I have a pretty bad hand injury, I am 60% through vA for it. Still had to take a typing test, even though, loss of dexterity in my left hand is well documented. Some of those laws are bs. There just to say, were taking care of our own.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:01:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "azmax64"
    }, 
    {
        "content": "Young Lady, we do not shout here. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090416, 
        "postID": 29, 
        "quote": "", 
        "reply": "Young Lady, we do not shout here. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:11:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: SUEOH46 New Member I just had a really ugly experience! I clicked on her profile to have at least some clue (despite the terrible page) as too who she is, and MY page keeps popping up!! Whatsup with that!! Is my page and personal information being compromised?? This is really screwed up!! As for the games people play - they probably want somebody \"in house\" and are going to engineer the hiring that way every time -- Wandering and Wondering", 
        "intTime": 20090416, 
        "postID": 30, 
        "quote": "SUEOH46 New Member", 
        "reply": " I just had a really ugly experience! I clicked on her profile to have at least some clue (despite the terrible page) as too who she is, and MY page keeps popping up!! Whatsup with that!! Is my page and personal information being compromised?? This is really screwed up!! As for the games people play - they probably want somebody \"in house\" and are going to engineer the hiring that way every time -- Wandering and Wondering", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:27:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I don't know the exact percentage of vets were I work, but it does seem to be pretty large. There were 9 people that started the same day as I did and 6 more 2 weeks later, all vets but 1. I did have an interesting experience when I retired in 2000. I applied for a pay tech job with the Coast Guard. It would be a step down from the job I retired from. This would be great I thought; a lock. I would be filling a position of someone I used to supervise. When I submitted my resume I was told that my Coast Guard experience didn't qualify me for the job. My current job (temp receiving clerk at a warehouse) did. For 18 of my 22 years, I was worked in pay and personnel but that didn't count.", 
        "intTime": 20090416, 
        "postID": 31, 
        "quote": "", 
        "reply": "I don't know the exact percentage of vets were I work, but it does seem to be pretty large. There were 9 people that started the same day as I did and 6 more 2 weeks later, all vets but 1. I did have an interesting experience when I retired in 2000. I applied for a pay tech job with the Coast Guard. It would be a step down from the job I retired from. This would be great I thought; a lock. I would be filling a position of someone I used to supervise. When I submitted my resume I was told that my Coast Guard experience didn't qualify me for the job. My current job (temp receiving clerk at a warehouse) did. For 18 of my 22 years, I was worked in pay and personnel but that didn't count.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:30:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "PSimon572"
    }, 
    {
        "content": "It seems she is upset! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090416, 
        "postID": 32, 
        "quote": "", 
        "reply": "It seems she is upset! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:33:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf If writing skills were required, I think it's pretty obvious why you didn't get the job. Don", 
        "intTime": 20090416, 
        "postID": 33, 
        "quote": "Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf", 
        "reply": " If writing skills were required, I think it's pretty obvious why you didn't get the job. Don", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 06:33:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "intTime": 20090416, 
        "postID": 34, 
        "quote": "", 
        "reply": "I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 07:25:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "VDoP"
    }, 
    {
        "content": "This has been the case since the Vietnam era even then the military help screw vets with their SPN (spin codes) added covertly by the units that RELACDU them. In my state the Vets of Vietnam's labor board records were kept in the same file as paroled criminals and you were treated as such. The Administration fears us, which is good lest the gov. should get too oppressive. One good thing about this \"we know what floggin' side the Gov. is on.\"", 
        "intTime": 20090416, 
        "postID": 35, 
        "quote": "", 
        "reply": "This has been the case since the Vietnam era even then the military help screw vets with their SPN (spin codes) added covertly by the units that RELACDU them. In my state the Vets of Vietnam's labor board records were kept in the same file as paroled criminals and you were treated as such. The Administration fears us, which is good lest the gov. should get too oppressive. One good thing about this \"we know what floggin' side the Gov. is on.\"", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 07:41:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "galloglas"
    }, 
    {
        "content": "Perhaps it's more of who ya know and who ya blow It's easy to pick Vets that voted for Obama for his Iraq visit and exclude the ones who did not and it's easy to find vets that do a Murtha/JFkerry and give them the jobs and exclude the ones who did not. I have hundreds of friends who served and could not even get in the line to get the jobs. ----------------------------- quote: Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "reply": "Perhaps it's more of who ya know and who ya blow It's easy to pick Vets that voted for Obama for his Iraq visit and exclude the ones who did not and it's easy to find vets that do a Murtha/JFkerry and give them the jobs and exclude the ones who did not. I have hundreds of friends who served and could not even get in the line to get the jobs. ----------------------------- ", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 07:46:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "galloglas"
    }, 
    {
        "content": "This has been going on for a long time now, What's yer beef? I've lost a few jobs to civilians who were not as qualified. So there fixing the job requiremnets and qualifications so they can have the \"other\" guy doing it eh? He11 I saw this same thing in the Military, what's the diff? This kind of stuff happens all over because people just aren't honest. It's all a facade to keep you in line. Everybody else can go nutz and lie their azz off yet you have to toe the line. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090416, 
        "postID": 37, 
        "quote": "", 
        "reply": "This has been going on for a long time now, What's yer beef? I've lost a few jobs to civilians who were not as qualified. So there fixing the job requiremnets and qualifications so they can have the \"other\" guy doing it eh? He11 I saw this same thing in the Military, what's the diff? This kind of stuff happens all over because people just aren't honest. It's all a facade to keep you in line. Everybody else can go nutz and lie their azz off yet you have to toe the line. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 08:08:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination. I know many, me being one of them. Just about everyone I knew working for US Customs, Air and Marine Interdiction Division was a Military Veteran. But like you said, your military skills have a lot to do with the jobs required skills that you are applying for. IE: I ran boats for the USCG, therefore I was hired by Customs to run their patrol boats. Others I knew were Army, Marine, etc pilots, therefore they got the pilot positions with US Customs. Don", 
        "intTime": 20090416, 
        "postID": 38, 
        "quote": "Originally posted by VDoP: I have 10 friends of mine who are all veterans that all have been hired for federal government jobs. I think it may have something to do with qualifications/resume in relation to position being applied for than discrimination.", 
        "reply": " I know many, me being one of them. Just about everyone I knew working for US Customs, Air and Marine Interdiction Division was a Military Veteran. But like you said, your military skills have a lot to do with the jobs required skills that you are applying for. IE: I ran boats for the USCG, therefore I was hired by Customs to run their patrol boats. Others I knew were Army, Marine, etc pilots, therefore they got the pilot positions with US Customs. Don", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 08:12:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf If writing skills were required, I think it's pretty obvious why you didn't get the job. Don My thoughts exactly. I just can't quite stop laughing at the original post...spelling, grammer, relational skills, etc. - all MIA. WHAT A MARON!! These are my opinions. Yours may differ.", 
        "intTime": 20090416, 
        "postID": 39, 
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by SUEOH46: tHE FEDERAL GOVERNMENT AND HIRING VETS IS A JOKE, THERE IS SO MANY ARTICLES SLAMMING SOME AGENCY THEN SLAMMINT THE WHOLE GOVERNMENT. THEY DON'T WANT TO HIRE VETS BECAUSE WE KNOW HOW THING ARE SUPPOSED TO COST AND ARE MANAGE THEY WANT THE CIVIAL OFF THE STREET THAT DOSN'Y KNOW ANYTHING SO WHEN THERE CONTACTING BOSS SAYS HUNEY JUST SIGN IT YES THOSE BOLTS COST 40 DOLLARS A PIECE. THEY DON'T WANT US BECAUSE WE DON'T PLAY GAMES. JUST GO TO YOU VA OR ANY GOVERNMENT OFFICE ASK HOW MANY ARE VETS, YOU MIGHT GET ONE, IN THE VA THE DAV JUST SLAMMED THEM IN THE 2009 MARCH MAGAIZINE ISSUE 30 PERCENT VETS AND 8 PERCENT ARE DISABLED VETS ARE HIRES WITH ALL THE VETERAN AMINISTRATION, WHAT A SLAPP IN THE FACE AND THEY WONDER WHY THERE IS SO MANY SUICIDES, YOU HAVE PEOPLE THERE THAT DO NOT KNOW WHAT SERVING IS. nO I DON'T WANT A DOCTOR JOB JUST A SIMPLE GS6 MEDICAL SUPPORT ASSITANT, I KEEP GETTING THE HIRED SOME OTHE CIVILIAN, MY BUDDY AND PAL. GO TO A VA HOSPITA ASK DDID YOU SERVE MANY WILL TELL YOU KNOW, THEN ASK THEM HOW DID YOU GE THE JOB, OH I KNEW SOMEONE WITHIN. THERE IS FRAUD GALOR AND THE OPM, AND THERE USAJOBS THERE IS AMANUAL THAT TELL THESE CIVIY HR PUDKNOCKERS HOW TO POST TO HIRE, THE OPM BIBLE TO THE HRING AUTHORITYS, HEY VETS LOOK AT PAGE 176 START REQUESTING TO SEE WHAT WERE SUPPOSED TO ASK BY THE FOIA LOOK AT THIS BOOK. YOU CAN'T GET IT MAKE A COMPLAINT TO THE DOL/VETS DEPARTMENT OF LABOR VETS DEPARTMENT AND DON'T LET THEM GIVE YOU GAB ABOUT RESUMES, AND JOB FAIRS CRUD, TELL THEM TO INVESTIGATE OR PASS TO THE MSPB BOARD. VETS SO NOT GIVE UP EVEN START WRITING YOU SENATORS, THEY NEED TO CHANGE THE LAWS AND FORCE AND POLICE ALL AGENCIES. http://www.opm.gov/deu/Handbook_2007/DEO_Handbook.pdf If writing skills were required, I think it's pretty obvious why you didn't get the job. Don", 
        "reply": " My thoughts exactly. I just can't quite stop laughing at the original post...spelling, grammer, relational skills, etc. - all MIA. WHAT A MARON!! These are my opinions. Yours may differ.", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 10:41:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "4403771"
    }, 
    {
        "content": "What did I say, Dawg - one and done! No word from the OP ...", 
        "intTime": 20090416, 
        "postID": 40, 
        "quote": "", 
        "reply": "What did I say, Dawg - one and done! No word from the OP ...", 
        "threadID": "5291911282_5930088022001", 
        "time": "2009-04-16 11:05:00", 
        "title": "THE FEDERAL GOVERNMENT IS NOT HIRING VETS AND VETERAN PREF IS A JOKE.", 
        "userID": "Cider33_Alpha"
    }
]