[
    {
        "content": "I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day?", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day?", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 02:33:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Duster6"
    }, 
    {
        "content": "Pelosi is busy spreading love and understanding in China \"http://www.google.com/hostednews/ap/article/ALeqM5hLcZ2jQ4mu4rd7XlB3hetiVn1qbAD98DKRFO1\"", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "Pelosi is busy spreading love and understanding in China \"http://www.google.com/hostednews/ap/article/ALeqM5hLcZ2jQ4mu4rd7XlB3hetiVn1qbAD98DKRFO1\"", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 02:54:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Obama laid a wreath, and then went and played golf... \"The World's Finest\"", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "", 
        "reply": "Obama laid a wreath, and then went and played golf... \"The World's Finest\"", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 04:42:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? Wandering and Wondering", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day?", 
        "reply": " Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? Wandering and Wondering", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 05:59:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I hope I live long enough to someday see everyone from President down to the lowest Congressman, be a Veteran.", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "", 
        "reply": "I hope I live long enough to someday see everyone from President down to the lowest Congressman, be a Veteran.", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 06:24:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Duster6"
    }, 
    {
        "content": "More likely you'll see the day when none of them are - - Wandering and Wondering", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "", 
        "reply": "More likely you'll see the day when none of them are - - Wandering and Wondering", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 06:29:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Duster, it would be good if that happened! GWG, I hope that never happens! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "", 
        "reply": "Duster, it would be good if that happened! GWG, I hope that never happens! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 07:12:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition.", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "Originally posted by greywolfghost: quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans???", 
        "reply": " I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition.", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 07:27:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: quote: Originally posted by greywolfghost: quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition. Your 100% correct.", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "Originally posted by Misanthrope2: quote: Originally posted by greywolfghost: quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition.", 
        "reply": " Your 100% correct.", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 10:53:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. WRONG! Those that signed that blank check, whether willingly or unwillingly were paying a debt that is owed to our Country and to those who served before to ensure our way of life (not to mention those who paid that ultimate price) quote: It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Again, you are off because all Americans and the rest of the World too owes you and every person that serves in the Military a debt of gratitude and the respect that should be given to someone who didn't shirk their responsibility to their Country and fellow citizens.[/quote] quote: Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition. [/quote] I think you should reserve your judgement on Vets or Soldiers (no matter how they look) until you know their story. Thank you for your service and providing me and my family the security and safety that we live with because of your service!", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to.", 
        "reply": " WRONG! Those that signed that blank check, whether willingly or unwillingly were paying a debt that is owed to our Country and to those who served before to ensure our way of life (not to mention those who paid that ultimate price) quote: It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Again, you are off because all Americans and the rest of the World too owes you and every person that serves in the Military a debt of gratitude and the respect that should be given to someone who didn't shirk their responsibility to their Country and fellow citizens.[/quote] quote: Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition. [/quote] I think you should reserve your judgement on Vets or Soldiers (no matter how they look) until you know their story. Thank you for your service and providing me and my family the security and safety that we live with because of your service!", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 13:45:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: quote: Originally posted by greywolfghost: quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition. The normal caveat, and it really has nothing to do with the topic, unless you are talking about your direct knowledge of Federal Political Officials, the thrust of this thread. If the average person on the street don't want to serve, fine - They can go count their beans or torque their nuts or scrub their toilets or litigate their suits or peddle their stock, and it doesn't mean one rat'z azz to me - - But Federal Politicians who are in position to Wage War and kill off the Cream of America's Finest by sending Them into Harm's Way should have shown guts enough to take the Ultimate Risk themselves. Anyone running for High Political Office without having done so is a coward simply looking for the Power to manipulate the lives of others as a shield between him/her and Harm. If you wish to Vote for a person who has spent his or her whole life hiding here in America behind privilege, wealth and power that has been protected for them at the cost of the Blood and Sweat of people with more guts, that's your choice... But I always try to spot a candidate with a little more spine - - Even Socrates served as a General once - - Wandering and Wondering", 
        "intTime": 20090526, 
        "postID": 11, 
        "quote": "Originally posted by Misanthrope2: quote: Originally posted by greywolfghost: quote: Originally posted by Duster6: I wonder if or how Nancy Perlosi, Harry Reid, Barney Frank, or Dick Cheney honored our Veterans this Memorial Day? Well, ya got four people here who never spent a day in Uniform, and have never sweated a drop on the dangerous frontiers of this planet at any time in their lives to protect a buddy, the Flag, or this Country - so how would any of them have a REAL clue about Honoring Veterans??? I served 20 years in the Army but have 3 brothers who never served. The fact that they never served doesn't make them any less patriotic than myself or anyone who served. They don't look any different, act any different or love their country any less than anyone who has served. They were not forced to serve and chose not to. It's that simple. I never asked for nor expected any sort of preferential treatment because I served in the military. That was my choice because I loved the military lifestyle. No one owes me anything because I was a soldier and I don't expect anyone to pay homage to me. Sometimes I am disgusted when I see ex-hippy soldiers parading in all sorts of modified and partial uniforms with long greasy hair, demanding respect and dinegrating those who never served. In my 20 years I knew many \"soldiers\" who were unworthy of the uniform, bums and drug addicts, cruel and sadistic, and outright ignorant people who didn't belong in the military. Conversely, I met some of the best Americans in the military who served loyally and faithfully, but who never demanded that those who never served pay them some sort of special recognition.", 
        "reply": " The normal caveat, and it really has nothing to do with the topic, unless you are talking about your direct knowledge of Federal Political Officials, the thrust of this thread. If the average person on the street don't want to serve, fine - They can go count their beans or torque their nuts or scrub their toilets or litigate their suits or peddle their stock, and it doesn't mean one rat'z azz to me - - But Federal Politicians who are in position to Wage War and kill off the Cream of America's Finest by sending Them into Harm's Way should have shown guts enough to take the Ultimate Risk themselves. Anyone running for High Political Office without having done so is a coward simply looking for the Power to manipulate the lives of others as a shield between him/her and Harm. If you wish to Vote for a person who has spent his or her whole life hiding here in America behind privilege, wealth and power that has been protected for them at the cost of the Blood and Sweat of people with more guts, that's your choice... But I always try to spot a candidate with a little more spine - - Even Socrates served as a General once - - Wandering and Wondering", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-26 14:33:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "But Federal Politicians who are in position to Wage War and kill off the Cream of America's Finest by sending Them into Harm's Way should have shown guts enough to take the Ultimate Risk themselves. Anyone running for High Political Office without having done so is a coward simply looking for the Power to manipulate the lives of others as a shield between him/her and Harm. If you wish to Vote for a person who has spent his or her whole life hiding here in America behind privilege, wealth and power that has been protected for them at the cost of the Blood and Sweat of people with more guts, that's your choice... But I always try to spot a candidate with a little more spine - - Even Socrates served as a General once - -[/QUOTE] I agree 100%. It's interesting that neo-con and neo-lib chicken hawks have no qualms about sending American troops in harms way, but would never think of doing the same themselves or would never send their own children in harms way. I also respect (if that's a proper term) a politician who has served in the military. Unfortunately, they number in the extreme minority.", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "", 
        "reply": "But Federal Politicians who are in position to Wage War and kill off the Cream of America's Finest by sending Them into Harm's Way should have shown guts enough to take the Ultimate Risk themselves. Anyone running for High Political Office without having done so is a coward simply looking for the Power to manipulate the lives of others as a shield between him/her and Harm. If you wish to Vote for a person who has spent his or her whole life hiding here in America behind privilege, wealth and power that has been protected for them at the cost of the Blood and Sweat of people with more guts, that's your choice... But I always try to spot a candidate with a little more spine - - Even Socrates served as a General once - -[/QUOTE] I agree 100%. It's interesting that neo-con and neo-lib chicken hawks have no qualms about sending American troops in harms way, but would never think of doing the same themselves or would never send their own children in harms way. I also respect (if that's a proper term) a politician who has served in the military. Unfortunately, they number in the extreme minority.", 
        "threadID": "5291911282_4620082422001", 
        "time": "2009-05-27 09:34:00", 
        "title": "I wonder if certain Politicians honored our Veterans?", 
        "userID": "Misanthrope2"
    }
]