[
    {
        "content": "my husband is in tech school for the air force, and i'm 39 weeks pregnant. I'm getting induced on friday and was told to contact the red cross to have him sent home. this is the whole reason i'm getting induced, because i wanted him to be able to be there the whole time. when i called red cross they told me that they aren't the one's to get him home since i'm not having any complications. they told me to have the dr send the papers to my husbands command. my dr's office was closed by the time i got the fax number and will call and ask them to send it. my husband talked to people in his command about it and they said that he wont be going home. my question is why wont they send him home? i thought having a baby was a thing to get him home.", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "", 
        "reply": "my husband is in tech school for the air force, and i'm 39 weeks pregnant. I'm getting induced on friday and was told to contact the red cross to have him sent home. this is the whole reason i'm getting induced, because i wanted him to be able to be there the whole time. when i called red cross they told me that they aren't the one's to get him home since i'm not having any complications. they told me to have the dr send the papers to my husbands command. my dr's office was closed by the time i got the fax number and will call and ask them to send it. my husband talked to people in his command about it and they said that he wont be going home. my question is why wont they send him home? i thought having a baby was a thing to get him home.", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 19:06:00", 
        "title": "red cross?", 
        "userID": "tconnatser"
    }, 
    {
        "content": "NOPE!", 
        "intTime": 20090504, 
        "postID": 2, 
        "quote": "", 
        "reply": "NOPE!", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 19:12:00", 
        "title": "red cross?", 
        "userID": "F.N.G."
    }, 
    {
        "content": "quote: my question is why wont they send him home? I don't know for sure, but a good guess would be, so his training is not interupted. Tech School is highly specialized and any interuption can cause serious issues regarding classroon cohesion and impede future manpower requirements. Maybe someone else has advice that would be more helpful. Congrats to you and your husband on the upcoming birth of your child.", 
        "intTime": 20090504, 
        "postID": 3, 
        "quote": "my question is why wont they send him home?", 
        "reply": " I don't know for sure, but a good guess would be, so his training is not interupted. Tech School is highly specialized and any interuption can cause serious issues regarding classroon cohesion and impede future manpower requirements. Maybe someone else has advice that would be more helpful. Congrats to you and your husband on the upcoming birth of your child.", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 19:16:00", 
        "title": "red cross?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by tconnatser: my husband is in tech school for the air force, and i'm 39 weeks pregnant. I'm getting induced on friday and was told to contact the red cross to have him sent home. this is the whole reason i'm getting induced, because i wanted him to be able to be there the whole time. when i called red cross they told me that they aren't the one's to get him home since i'm not having any complications. they told me to have the dr send the papers to my husbands command. my dr's office was closed by the time i got the fax number and will call and ask them to send it. my husband talked to people in his command about it and they said that he wont be going home. my question is why wont they send him home? i thought having a baby was a thing to get him home. This may sound harsh, but military wives give birth all the time without their Soldier. Wasn't this discussed before he went to school? Red Cross is for emergencies only. ETA-My bad, Airfoce, meat to say Airman. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090504, 
        "postID": 4, 
        "quote": "Originally posted by tconnatser: my husband is in tech school for the air force, and i'm 39 weeks pregnant. I'm getting induced on friday and was told to contact the red cross to have him sent home. this is the whole reason i'm getting induced, because i wanted him to be able to be there the whole time. when i called red cross they told me that they aren't the one's to get him home since i'm not having any complications. they told me to have the dr send the papers to my husbands command. my dr's office was closed by the time i got the fax number and will call and ask them to send it. my husband talked to people in his command about it and they said that he wont be going home. my question is why wont they send him home? i thought having a baby was a thing to get him home.", 
        "reply": " This may sound harsh, but military wives give birth all the time without their Soldier. Wasn't this discussed before he went to school? Red Cross is for emergencies only. ETA-My bad, Airfoce, meat to say Airman. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 19:29:00", 
        "title": "red cross?", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "tconnaster, I'm sorry to hear of your situation. Perhaps, you could ask your doctor to fax, the Tech school where your husband is. Tell him not to use snail mail. Your Dr. may be able to convince the powers that be to allow your husband to come home for a short time. Remember, your hub will probably have to make that time up. Having him home for the birth will be worth it. Good luck! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090504, 
        "postID": 5, 
        "quote": "", 
        "reply": "tconnaster, I'm sorry to hear of your situation. Perhaps, you could ask your doctor to fax, the Tech school where your husband is. Tell him not to use snail mail. Your Dr. may be able to convince the powers that be to allow your husband to come home for a short time. Remember, your hub will probably have to make that time up. Having him home for the birth will be worth it. Good luck! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 19:52:00", 
        "title": "red cross?", 
        "userID": "Bergy46"
    }, 
    {
        "content": "In the Air Force, you get screwed up in training, they don't recycle you, they wash you out. It's that simple. There are so many people trying to get slots, and so many slots are being reduced that the competition is murder. You bring him home on anything short or a major emergency, he may not have a place to go back to... there won't be any room in the next class. That thing will be booked clear full, as will the next - - You may just have to have mom and dad do the hand-holding on this one - - Wandering and Wondering", 
        "intTime": 20090504, 
        "postID": 6, 
        "quote": "", 
        "reply": "In the Air Force, you get screwed up in training, they don't recycle you, they wash you out. It's that simple. There are so many people trying to get slots, and so many slots are being reduced that the competition is murder. You bring him home on anything short or a major emergency, he may not have a place to go back to... there won't be any room in the next class. That thing will be booked clear full, as will the next - - You may just have to have mom and dad do the hand-holding on this one - - Wandering and Wondering", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 20:11:00", 
        "title": "red cross?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: In the Air Force, you get screwed up in training, they don't recycle you, they wash you out. It's that simple. There are so many people trying to get slots, and so many slots are being reduced that the competition is murder. You bring him home on anything short or a major emergency, he may not have a place to go back to... there won't be any room in the next class. That thing will be booked clear full, as will the next - - You may just have to have mom and dad do the hand-holding on this one - - The problem is age and commitment. If we let every Trainee in any branch go home for this knd of thing and interupt the cycle of training We would lose scheduled Airmen. It's more than just the School, it's the request to fill and satisfy those requirements. Back in my days, the Military didn't issue you a wife. Let him stay in school. His records will reflect that action and may cause other problems with his career Got money for everything but \"VETERANS\" Same old story!", 
        "intTime": 20090504, 
        "postID": 7, 
        "quote": "Originally posted by greywolfghost: In the Air Force, you get screwed up in training, they don't recycle you, they wash you out. It's that simple. There are so many people trying to get slots, and so many slots are being reduced that the competition is murder. You bring him home on anything short or a major emergency, he may not have a place to go back to... there won't be any room in the next class. That thing will be booked clear full, as will the next - - You may just have to have mom and dad do the hand-holding on this one - -", 
        "reply": " The problem is age and commitment. If we let every Trainee in any branch go home for this knd of thing and interupt the cycle of training We would lose scheduled Airmen. It's more than just the School, it's the request to fill and satisfy those requirements. Back in my days, the Military didn't issue you a wife. Let him stay in school. His records will reflect that action and may cause other problems with his career Got money for everything but \"VETERANS\" Same old story!", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 21:54:00", 
        "title": "red cross?", 
        "userID": "mikeyR8"
    }, 
    {
        "content": "Either you didn't plan this through, or else he did! FYI, I didn't see either of my oldest born.", 
        "intTime": 20090504, 
        "postID": 8, 
        "quote": "", 
        "reply": "Either you didn't plan this through, or else he did! FYI, I didn't see either of my oldest born.", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-04 23:53:00", 
        "title": "red cross?", 
        "userID": "azmax64"
    }, 
    {
        "content": "There is no complications and your spouse is in the middle of training, unless it is an option and allowed by the CO to miss class on Friday and fly back Sunday it will not happen. The military will also NOT pay for him to come home so it would out of your own pocket. The CO can refuse because it isn't possible and this can mean a delay in his training. Children are born whether or not the father is there. And actually up until about 30 years ago if that, most fathers weren't allowed to be there, they pacing outside in the hall or were at work, or a bar or who know where. The doctor can fax the information but no guarantees. It will not be the first thing he misses for the child being in the military. He can miss the first words, first steps, first Christmas, first day in Kindergarten, first soccer day, and the list continues. It sucks but it is part of military life.", 
        "intTime": 20090505, 
        "postID": 9, 
        "quote": "", 
        "reply": "There is no complications and your spouse is in the middle of training, unless it is an option and allowed by the CO to miss class on Friday and fly back Sunday it will not happen. The military will also NOT pay for him to come home so it would out of your own pocket. The CO can refuse because it isn't possible and this can mean a delay in his training. Children are born whether or not the father is there. And actually up until about 30 years ago if that, most fathers weren't allowed to be there, they pacing outside in the hall or were at work, or a bar or who know where. The doctor can fax the information but no guarantees. It will not be the first thing he misses for the child being in the military. He can miss the first words, first steps, first Christmas, first day in Kindergarten, first soccer day, and the list continues. It sucks but it is part of military life.", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 04:56:00", 
        "title": "red cross?", 
        "userID": "Navywifeinparadise"
    }, 
    {
        "content": "The Red Cross is there to get your soldier/airman/whatever home during an emergency (i.e. his or your father or mother die, bad car accident and you and the kids are in the hospital, etc) unless there are serious complications with your pregnancy, they won't send him home and even if there were, the baby would be born and everything over before he got there any way. Let him stay in training. When he finishes that, he may have a little more le-way to get some time off. And Navywife is totally right, he'll wind up missing more than seems fair... but you both made the decision to have a child while he was in the military. You should definitely get accustomed to your needs/wants/desires coming second to the Military... after all, when he signed the line, you became the Mistress", 
        "intTime": 20090505, 
        "postID": 10, 
        "quote": "", 
        "reply": "The Red Cross is there to get your soldier/airman/whatever home during an emergency (i.e. his or your father or mother die, bad car accident and you and the kids are in the hospital, etc) unless there are serious complications with your pregnancy, they won't send him home and even if there were, the baby would be born and everything over before he got there any way. Let him stay in training. When he finishes that, he may have a little more le-way to get some time off. And Navywife is totally right, he'll wind up missing more than seems fair... but you both made the decision to have a child while he was in the military. You should definitely get accustomed to your needs/wants/desires coming second to the Military... after all, when he signed the line, you became the Mistress", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 07:47:00", 
        "title": "red cross?", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "Looks to me like the original poster has RTBd, but I'll throw in one example I know of personally about how the Air Force handles interruptions in training: When I was at one of several Weapons Controller Schools I attended, there was this young 2nd Lt. who was doing an acceptable job. One day, one of the instructors comes in looking for the \"Grey-headed 1st Lt...\" (me) with the opportunity of a life time: One of the F-4s going up for intercepts that day had a bad targeting radar, so the WIZO was staying on the ground. That meant a chance for someone to ride in the back seat! I thought about it, but over 40, I didn't need a thrill ride, so I passed. This young 2nd Lt. jumped on the opportunity!! Well, I was controlling the F-4s, snapping them all over the sky, and the young man got really air sick. In fact, he got so bad that he couldn't drive back to the billets, so I took him - and every time I stopped or made a turn, he had to get out and throw up - -!! Well, he tried to come back to training the next day, but when he looked at that green strobe going around the scope, he would get dizzy and have to run for it... He eventually missed 3 days of training in a row, and could not pass the End of Phase Test for that week of training - - They gave him a Re-Take the next day, which he also failed - and they washed him out and sent him home!! Just like that!! Gone...! Pretty typical of all the Courses and Schools I've done in the Air Force - no recycle and no sympathy - - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 11, 
        "quote": "", 
        "reply": "Looks to me like the original poster has RTBd, but I'll throw in one example I know of personally about how the Air Force handles interruptions in training: When I was at one of several Weapons Controller Schools I attended, there was this young 2nd Lt. who was doing an acceptable job. One day, one of the instructors comes in looking for the \"Grey-headed 1st Lt...\" (me) with the opportunity of a life time: One of the F-4s going up for intercepts that day had a bad targeting radar, so the WIZO was staying on the ground. That meant a chance for someone to ride in the back seat! I thought about it, but over 40, I didn't need a thrill ride, so I passed. This young 2nd Lt. jumped on the opportunity!! Well, I was controlling the F-4s, snapping them all over the sky, and the young man got really air sick. In fact, he got so bad that he couldn't drive back to the billets, so I took him - and every time I stopped or made a turn, he had to get out and throw up - -!! Well, he tried to come back to training the next day, but when he looked at that green strobe going around the scope, he would get dizzy and have to run for it... He eventually missed 3 days of training in a row, and could not pass the End of Phase Test for that week of training - - They gave him a Re-Take the next day, which he also failed - and they washed him out and sent him home!! Just like that!! Gone...! Pretty typical of all the Courses and Schools I've done in the Air Force - no recycle and no sympathy - - - Wandering and Wondering", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 13:12:00", 
        "title": "red cross?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I got tapped to be the first Army guy to go to the KennelMaster/ K-9 Superviser school at Lackland. My wife was 6 months along when began the training. Long story short, wife gave birth while I was still at lackland. I can see me now telling the General that I think I'll go home for a few days. Cut your husband some slack and let him better himself.", 
        "intTime": 20090505, 
        "postID": 12, 
        "quote": "", 
        "reply": "I got tapped to be the first Army guy to go to the KennelMaster/ K-9 Superviser school at Lackland. My wife was 6 months along when began the training. Long story short, wife gave birth while I was still at lackland. I can see me now telling the General that I think I'll go home for a few days. Cut your husband some slack and let him better himself.", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 13:22:00", 
        "title": "red cross?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Pretty typical of all the Courses and Schools I've done in the Air Force - no recycle and no sympathy - - - GWG, Good advice for sure. It was that way in 1977 and I'm sure it hasn't changed.", 
        "intTime": 20090505, 
        "postID": 13, 
        "quote": "Pretty typical of all the Courses and Schools I've done in the Air Force - no recycle and no sympathy - - -", 
        "reply": " GWG, Good advice for sure. It was that way in 1977 and I'm sure it hasn't changed.", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 13:23:00", 
        "title": "red cross?", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by tconnatser: my husband is in tech school for the air force, and i'm 39 weeks pregnant. I'm getting induced on friday and was told to contact the red cross to have him sent home. this is the whole reason i'm getting induced, because i wanted him to be able to be there the whole time. when i called red cross they told me that they aren't the one's to get him home since i'm not having any complications. they told me to have the dr send the papers to my husbands command. my dr's office was closed by the time i got the fax number and will call and ask them to send it. my husband talked to people in his command about it and they said that he wont be going home. my question is why wont they send him home? i thought having a baby was a thing to get him home. My dear, your husband did his part 39 weeks ago. Right now he's about as useful to you as breasts on a bull. Perhaps I'll draw some fire over my opinion but I believe he's involved in something a lot more important then witnessing a birth. He's training to defend his country. What can possibly be more important than that? Get over it and have someone shoot a video of the birth. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "Originally posted by tconnatser: my husband is in tech school for the air force, and i'm 39 weeks pregnant. I'm getting induced on friday and was told to contact the red cross to have him sent home. this is the whole reason i'm getting induced, because i wanted him to be able to be there the whole time. when i called red cross they told me that they aren't the one's to get him home since i'm not having any complications. they told me to have the dr send the papers to my husbands command. my dr's office was closed by the time i got the fax number and will call and ask them to send it. my husband talked to people in his command about it and they said that he wont be going home. my question is why wont they send him home? i thought having a baby was a thing to get him home.", 
        "reply": " My dear, your husband did his part 39 weeks ago. Right now he's about as useful to you as breasts on a bull. Perhaps I'll draw some fire over my opinion but I believe he's involved in something a lot more important then witnessing a birth. He's training to defend his country. What can possibly be more important than that? Get over it and have someone shoot a video of the birth. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 14:58:00", 
        "title": "red cross?", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: I believe he's involved in something a lot more important then witnessing a birth. He's training to defend his country. What can possibly be more important than that? +1", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "I believe he's involved in something a lot more important then witnessing a birth. He's training to defend his country. What can possibly be more important than that?", 
        "reply": " +1", 
        "threadID": "5291911282_1320005222001", 
        "time": "2009-05-05 15:18:00", 
        "title": "red cross?", 
        "userID": "VeteranDad78"
    }
]