[
    {
        "content": "Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here.", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-06 12:35:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "Rhondajae"
    }, 
    {
        "content": "I'm not sure about the DoD but have you checked with your local FRG?", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "I'm not sure about the DoD but have you checked with your local FRG?", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-06 12:39:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "armywifefigueroa"
    }, 
    {
        "content": "quote: Originally posted by Rhondajae: Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here. Sorry to hear about your problems. The answer is no they don't. They provide marriage counseling and the like, but once you make the decision to divorce, you are on your own. They will move you on their dime, but that's about it. You need to get all the proper paperwork in order to start child support, assuming you will have full custody. You have 2 bach degrees, I'm certain you could find 'something' even if it's a small paycut. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "Originally posted by Rhondajae: Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here.", 
        "reply": " Sorry to hear about your problems. The answer is no they don't. They provide marriage counseling and the like, but once you make the decision to divorce, you are on your own. They will move you on their dime, but that's about it. You need to get all the proper paperwork in order to start child support, assuming you will have full custody. You have 2 bach degrees, I'm certain you could find 'something' even if it's a small paycut. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-06 12:42:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "boughtwaprice"
    }, 
    {
        "content": "Base operations list will have a dependants liason officer, start there. If you are a legal resident of the state you are living in go to the Health and Human Services people and they can steer you in the right direction. Family welfare will also be a place to look and children's services as well. I have some fair experience counselling people about these matters and in other areas as well. Go to my profile click on the friends thing and you can e-mail if you wish it's a blind service and you can't find me and I can't find you!! So you needn't be nervous about dealing with a stranger or nut bag! Rev. Bruce........Tawodi", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "", 
        "reply": "Base operations list will have a dependants liason officer, start there. If you are a legal resident of the state you are living in go to the Health and Human Services people and they can steer you in the right direction. Family welfare will also be a place to look and children's services as well. I have some fair experience counselling people about these matters and in other areas as well. Go to my profile click on the friends thing and you can e-mail if you wish it's a blind service and you can't find me and I can't find you!! So you needn't be nervous about dealing with a stranger or nut bag! Rev. Bruce........Tawodi", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-06 12:42:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "tawodi"
    }, 
    {
        "content": "Don't forget the base Chaplain! If you can't find what you're looking for, he knows where to point you. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "", 
        "reply": "Don't forget the base Chaplain! If you can't find what you're looking for, he knows where to point you. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-06 12:54:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by Rhondajae: Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here. I'm sorry that your marriage is ending in divorce. As far as child support goes, just make sure that the proper paper is filled out your ex will have to pay what divorce judge as determined. If the state your getting divorced in awards alimony, he'll have to pay that also. The military takes a very dim view of servicemembers who fail to take care of their financial obligations.", 
        "intTime": 20090507, 
        "postID": 6, 
        "quote": "Originally posted by Rhondajae: Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here.", 
        "reply": " I'm sorry that your marriage is ending in divorce. As far as child support goes, just make sure that the proper paper is filled out your ex will have to pay what divorce judge as determined. If the state your getting divorced in awards alimony, he'll have to pay that also. The military takes a very dim view of servicemembers who fail to take care of their financial obligations.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-07 13:06:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "rangerdoug"
    }, 
    {
        "content": "Sorry to hear the bad news. Been down Divorce Road three times myself. Try this section; Military Life, Spouses and Community Military Marriage and Military Relationships http://forums.military.com/eve/forums/a/frm/f/6450019001001 Good luck, Don", 
        "intTime": 20090507, 
        "postID": 7, 
        "quote": "", 
        "reply": "Sorry to hear the bad news. Been down Divorce Road three times myself. Try this section; Military Life, Spouses and Community Military Marriage and Military Relationships http://forums.military.com/eve/forums/a/frm/f/6450019001001 Good luck, Don", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-07 16:41:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "If there has been abuse/anger towards you by your military husband, and he is in the Army, go to Army Family Advocacy Programs. They can expedite it for you.", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "", 
        "reply": "If there has been abuse/anger towards you by your military husband, and he is in the Army, go to Army Family Advocacy Programs. They can expedite it for you.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-07 16:47:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Two college degrees and you can't find a job? Or won't look for a job? You may have to settle for less than you want; flipping burgers or working at Wal-Mart. Sell your car and take the bus. Go to court and ask for child support. do you want out of your marriage or just want someone else to support you?", 
        "intTime": 20090508, 
        "postID": 9, 
        "quote": "I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son.", 
        "reply": " Two college degrees and you can't find a job? Or won't look for a job? You may have to settle for less than you want; flipping burgers or working at Wal-Mart. Sell your car and take the bus. Go to court and ask for child support. do you want out of your marriage or just want someone else to support you?", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-08 01:48:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "For someone who is soooo well educated, you sure have adopted an (I can't) attitude. Have you ever thought about being self employed? You have 2 degree's, put them to good use. This message has been edited. Last edited by: azmax64, Fri 08 May 2009 02:35 AM", 
        "intTime": 20090508, 
        "postID": 10, 
        "quote": "", 
        "reply": "For someone who is soooo well educated, you sure have adopted an (I can't) attitude. Have you ever thought about being self employed? You have 2 degree's, put them to good use. This message has been edited. Last edited by: azmax64, Fri 08 May 2009 02:35 AM", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-08 02:11:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "azmax64"
    }, 
    {
        "content": "Get a lawyer, your husband has dug in his heels. A competent lawyer can get you what you have a right to! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090508, 
        "postID": 11, 
        "quote": "", 
        "reply": "Get a lawyer, your husband has dug in his heels. A competent lawyer can get you what you have a right to! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-08 06:09:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Military One Source is the place to start. There is free counseling, information, etc.. and it is confidential. Be prepared that if you do get a divorce that the military will not move you back home, unless the AD member agrees to use his final HOR move which doesnt happen often. So it can be up to you to do so. Save your money, get rid of stuff, etc....put money in your bank account and it goes from there, so that way you are slightly protected.", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "", 
        "reply": "Military One Source is the place to start. There is free counseling, information, etc.. and it is confidential. Be prepared that if you do get a divorce that the military will not move you back home, unless the AD member agrees to use his final HOR move which doesnt happen often. So it can be up to you to do so. Save your money, get rid of stuff, etc....put money in your bank account and it goes from there, so that way you are slightly protected.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-08 08:02:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "Navywifeinparadise"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Two college degrees and you can't find a job? Or won't look for a job? You may have to settle for less than you want; flipping burgers or working at Wal-Mart. Sell your car and take the bus. Go to court and ask for child support. do you want out of your marriage or just want someone else to support you? Dear Scooter_Mech Just so you know, when I married my soon to be ex husband, I was the bread winner. I understand where you are coming from in regards to your question. I, too, know alot of young girls who married enlisted men in hopes of being \"saved\" from their current circumstances. I, jowever, am not one of them. Now, I dont know where you are from, but I am stationed in southern CA. If you've been following the news at all, then you would know that the recession has hit particularly hard in CA and especially in my profession. No, I am not looking for someone to support me and I feel that it is absolutely shameful that some people think that a well educated person cant (or is not allowed to) fall on hard times. Shame on you. Also, if you know anything about the economy in Southern CA, then you would know that the cost of living is extremely high, so no, a job at Wal-Mart is not IMMEDIATELY sufficient enough to support a family. All I am looking for is help to get me to a location that is not as costly as place that I currently reside (because of a husband that I HAVE SUPPORTED) and to a place (my home) where a job at Wal-Mart could very well pay rent.", 
        "intTime": 20090511, 
        "postID": 13, 
        "quote": "Originally posted by scooter_mech: quote: I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Two college degrees and you can't find a job? Or won't look for a job? You may have to settle for less than you want; flipping burgers or working at Wal-Mart. Sell your car and take the bus. Go to court and ask for child support. do you want out of your marriage or just want someone else to support you?", 
        "reply": " Dear Scooter_Mech Just so you know, when I married my soon to be ex husband, I was the bread winner. I understand where you are coming from in regards to your question. I, too, know alot of young girls who married enlisted men in hopes of being \"saved\" from their current circumstances. I, jowever, am not one of them. Now, I dont know where you are from, but I am stationed in southern CA. If you've been following the news at all, then you would know that the recession has hit particularly hard in CA and especially in my profession. No, I am not looking for someone to support me and I feel that it is absolutely shameful that some people think that a well educated person cant (or is not allowed to) fall on hard times. Shame on you. Also, if you know anything about the economy in Southern CA, then you would know that the cost of living is extremely high, so no, a job at Wal-Mart is not IMMEDIATELY sufficient enough to support a family. All I am looking for is help to get me to a location that is not as costly as place that I currently reside (because of a husband that I HAVE SUPPORTED) and to a place (my home) where a job at Wal-Mart could very well pay rent.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-11 21:26:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "Rhondajae"
    }, 
    {
        "content": "quote: Originally posted by Rhondajae: quote: Originally posted by scooter_mech: quote: I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Two college degrees and you can't find a job? Or won't look for a job? You may have to settle for less than you want; flipping burgers or working at Wal-Mart. Sell your car and take the bus. Go to court and ask for child support. do you want out of your marriage or just want someone else to support you? Dear Scooter_Mech Just so you know, when I married my soon to be ex husband, I was the bread winner. I understand where you are coming from in regards to your question. I, too, know alot of young girls who married enlisted men in hopes of being \"saved\" from their current circumstances. I, jowever, am not one of them. Now, I dont know where you are from, but I am stationed in southern CA. If you've been following the news at all, then you would know that the recession has hit particularly hard in CA and especially in my profession. No, I am not looking for someone to support me and I feel that it is absolutely shameful that some people think that a well educated person cant (or is not allowed to) fall on hard times. Shame on you. Also, if you know anything about the economy in Southern CA, then you would know that the cost of living is extremely high, so no, a job at Wal-Mart is not IMMEDIATELY sufficient enough to support a family. All I am looking for is help to get me to a location that is not as costly as place that I currently reside (because of a husband that I HAVE SUPPORTED) and to a place (my home) where a job at Wal-Mart could very well pay rent. Have you spoken to the base chaplain, hun? They usually have lots of networking, both within and outside of the military. He or she may have options or ideas for you that you haven't considered, and may even be able to hook you up with someone that can help you with your employment and relocation needs. I'm sorry you're going through this... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090512, 
        "postID": 14, 
        "quote": "Originally posted by Rhondajae: quote: Originally posted by scooter_mech: quote: I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Two college degrees and you can't find a job? Or won't look for a job? You may have to settle for less than you want; flipping burgers or working at Wal-Mart. Sell your car and take the bus. Go to court and ask for child support. do you want out of your marriage or just want someone else to support you? Dear Scooter_Mech Just so you know, when I married my soon to be ex husband, I was the bread winner. I understand where you are coming from in regards to your question. I, too, know alot of young girls who married enlisted men in hopes of being \"saved\" from their current circumstances. I, jowever, am not one of them. Now, I dont know where you are from, but I am stationed in southern CA. If you've been following the news at all, then you would know that the recession has hit particularly hard in CA and especially in my profession. No, I am not looking for someone to support me and I feel that it is absolutely shameful that some people think that a well educated person cant (or is not allowed to) fall on hard times. Shame on you. Also, if you know anything about the economy in Southern CA, then you would know that the cost of living is extremely high, so no, a job at Wal-Mart is not IMMEDIATELY sufficient enough to support a family. All I am looking for is help to get me to a location that is not as costly as place that I currently reside (because of a husband that I HAVE SUPPORTED) and to a place (my home) where a job at Wal-Mart could very well pay rent.", 
        "reply": " Have you spoken to the base chaplain, hun? They usually have lots of networking, both within and outside of the military. He or she may have options or ideas for you that you haven't considered, and may even be able to hook you up with someone that can help you with your employment and relocation needs. I'm sorry you're going through this... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-12 06:19:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "Divorce is bad enough, if you can't get a qualified advocate...the spouses lawyer will chew you up. However, there are lawyers who specialze being an advocate for husbands and there are those who specialize in being an advocate for wives! Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090512, 
        "postID": 15, 
        "quote": "", 
        "reply": "Divorce is bad enough, if you can't get a qualified advocate...the spouses lawyer will chew you up. However, there are lawyers who specialze being an advocate for husbands and there are those who specialize in being an advocate for wives! Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-12 08:13:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by Rhondajae: Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here. Rhondajae, You have no friends? Were you working before and then laid off? Have you tried civil service? Have you thought about enlisting? What will happen to the six-year-old? Divorces are so hard on the children. Is there no way you will reconsider? Perhaps a separation while going to marriage counseling could be the answer... \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090512, 
        "postID": 16, 
        "quote": "Originally posted by Rhondajae: Hello. I am a military spouse that has been married for 8 years. I have been wanting a divorce for 3 out of those 8 years. I dont really have any family that I can depend on, and my husband has made sure that I dont have any friends (any that I can go to for that type of support. My fiends are his co-workers). My question is: Does the DOD have any programs designed to assist separating military spouses? I am an educated woman (2 bachelor degrees), however now that the country in in a recession, it is almost next to impossible to get a job so that I can provide support for my 6 year old son. Any help would be greatly appreciated. Signed, Get me out of here.", 
        "reply": " Rhondajae, You have no friends? Were you working before and then laid off? Have you tried civil service? Have you thought about enlisting? What will happen to the six-year-old? Divorces are so hard on the children. Is there no way you will reconsider? Perhaps a separation while going to marriage counseling could be the answer... \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "5291911282_6580046222001", 
        "time": "2009-05-12 16:21:00", 
        "title": "Divorce Suuport System Needed BADLY", 
        "userID": "aggie_swife"
    }
]