[
    {
        "content": "Name the one thing that President Obama tried to do to our Veterans that President Bush would never have tried to do.", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "Name the one thing that President Obama tried to do to our Veterans that President Bush would never have tried to do.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 15:49:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Keep their kids from having to fight in Iraq during 3 or 4 mandatory tours on pain of imprisonment if they refuse to go? I'm not really sure where you're trying to go with this - - You might want to vent a little and clarify in the process - - Wandering and Wondering", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "Keep their kids from having to fight in Iraq during 3 or 4 mandatory tours on pain of imprisonment if they refuse to go? I'm not really sure where you're trying to go with this - - You might want to vent a little and clarify in the process - - Wandering and Wondering", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 15:52:00", 
        "title": "Only college graduates answer please.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:07:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "reply": " Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:17:00", 
        "title": "Only college graduates answer please.", 
        "userID": "jaluck"
    }, 
    {
        "content": "I don't see how he's going to dodge the bullet on that one. The damage is already done As the old adage goes: \"Open mouth, insert foot\" Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "I don't see how he's going to dodge the bullet on that one. The damage is already done As the old adage goes: \"Open mouth, insert foot\" Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:19:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Well, I'd hate to see that for those who have no other option. I have a certain amount of Medical Insurance from my civilian retirement, so I'm going to do the best I can not to burden the Federal System. That way, maybe the money can go for somebody not so fortunate. All my uncles used the VA pretty extensively in their later years. They were all WW II Vets. But Dad never did. He stayed with Blue Cross/Blue Shield, which he earned retiring as a Welder from United States Steel. He didn't want to be on the Federal nickle unless he had no other option, yet he had been on Saipan and Iwo Jima. So he'd certainly earned VA help. He just wanted to be independent from all that, and that's the way I hope to do - but I'd hate to see anyone lose what they've earned by getting shot at while in the GI Uniform - - Wandering and Wondering", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "", 
        "reply": "Well, I'd hate to see that for those who have no other option. I have a certain amount of Medical Insurance from my civilian retirement, so I'm going to do the best I can not to burden the Federal System. That way, maybe the money can go for somebody not so fortunate. All my uncles used the VA pretty extensively in their later years. They were all WW II Vets. But Dad never did. He stayed with Blue Cross/Blue Shield, which he earned retiring as a Welder from United States Steel. He didn't want to be on the Federal nickle unless he had no other option, yet he had been on Saipan and Iwo Jima. So he'd certainly earned VA help. He just wanted to be independent from all that, and that's the way I hope to do - but I'd hate to see anyone lose what they've earned by getting shot at while in the GI Uniform - - Wandering and Wondering", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:21:00", 
        "title": "Only college graduates answer please.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I go to the VA and I already am a paying customer. They charge my insurance Shockey", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "", 
        "reply": "I go to the VA and I already am a paying customer. They charge my insurance Shockey", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:26:00", 
        "title": "Only college graduates answer please.", 
        "userID": "shockey"
    }, 
    {
        "content": "You jumped to the answer to quick Duster. In fact among the VA health care issue there are several things about Obama that are beginning to float to the surface. I go the VA but they charge my insurance as well.", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "", 
        "reply": "You jumped to the answer to quick Duster. In fact among the VA health care issue there are several things about Obama that are beginning to float to the surface. I go the VA but they charge my insurance as well.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 19:08:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. I use the VA regularly. I can't stand the insurance health programs I've been with. Seems they are always nickel and dimeing you all the way. The VA's health care is as good or better than some of the high cost programs I've been with. I've had the various Govt. Employee Fed, State and local govt. health insurance plans and I still prefer the VA's system. They are slow but then I think the money they should be spending on more help gets blown on some freekin statue or office furniture. The way to keep them on their toes is to let them know that you expect them to help you as soon as they can and show some respect. I always start every conversation with a VA employee with, \"Hows your day going\"? If it's not flowing for them I just try to make a positive comment, sometimes that's difficult especially when I'm in pain but hey. Unfortunately every visit to the VA Hospital usually ends with a visit to the pharmacy and that can get me steamed sometimes. I don't think they coordinate with the doctors very well. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 9, 
        "quote": "Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "reply": " I use the VA regularly. I can't stand the insurance health programs I've been with. Seems they are always nickel and dimeing you all the way. The VA's health care is as good or better than some of the high cost programs I've been with. I've had the various Govt. Employee Fed, State and local govt. health insurance plans and I still prefer the VA's system. They are slow but then I think the money they should be spending on more help gets blown on some freekin statue or office furniture. The way to keep them on their toes is to let them know that you expect them to help you as soon as they can and show some respect. I always start every conversation with a VA employee with, \"Hows your day going\"? If it's not flowing for them I just try to make a positive comment, sometimes that's difficult especially when I'm in pain but hey. Unfortunately every visit to the VA Hospital usually ends with a visit to the pharmacy and that can get me steamed sometimes. I don't think they coordinate with the doctors very well. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 00:21:00", 
        "title": "Only college graduates answer please.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "intTime": 20090319, 
        "postID": 10, 
        "quote": "Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex", 
        "reply": " I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 02:11:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra? Duster6, I dunno. Don't think I've ever seen one. ...Alex", 
        "intTime": 20090319, 
        "postID": 11, 
        "quote": "Originally posted by Duster6: I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "reply": " Duster6, I dunno. Don't think I've ever seen one. ...Alex", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 06:31:00", 
        "title": "Only college graduates answer please.", 
        "userID": "jaluck"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra? I want one that says, \"Still waiting for change\". Or maybe \"Hold on to your seats I hear change is coming, someday\". How about, \"I thought he was talkin about real change, not pocket change\". Or \"If he puts his hand in his pocket and moves it around, you can hear the change\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: quote: Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "reply": " I want one that says, \"Still waiting for change\". Or maybe \"Hold on to your seats I hear change is coming, someday\". How about, \"I thought he was talkin about real change, not pocket change\". Or \"If he puts his hand in his pocket and moves it around, you can hear the change\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 10:24:00", 
        "title": "Only college graduates answer please.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives...", 
        "intTime": 20090319, 
        "postID": 13, 
        "quote": "", 
        "reply": "change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives...", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 10:34:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Elesso"
    }, 
    {
        "content": "It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - - Wandering and Wondering", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "", 
        "reply": "It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - - Wandering and Wondering", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 11:02:00", 
        "title": "Only college graduates answer please.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Elesso: change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives... If the change is good I'll embrace it. If the change is bad I will fight it with all my energy. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "Originally posted by Elesso: change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives...", 
        "reply": " If the change is good I'll embrace it. If the change is bad I will fight it with all my energy. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 11:06:00", 
        "title": "Only college graduates answer please.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - - now THAT is an idea i can fall in line with.... using legal means, and getting voted into office is the AMERICAN way.. great idea GWG!!", 
        "intTime": 20090319, 
        "postID": 16, 
        "quote": "Originally posted by greywolfghost: It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - -", 
        "reply": " now THAT is an idea i can fall in line with.... using legal means, and getting voted into office is the AMERICAN way.. great idea GWG!!", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 11:10:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Elesso"
    }, 
    {
        "content": "Technically, I'm not a college graduate, but I only have seven credits left until graduation, so hopefully you'll let me slide in on this one. -President Obama considered making wounded veterans use personal health insurance to help pay for the cost of VA care. For the wounded veterans who are no longer productive members of society, according to Speaker of the House Pelosi, this is a good plan; we don't need people leeching off of the government. -President Obama wants to release the innocent people who were unfairly detained at Gitmo, and has considered letting them go to the U.S. As a baby-killing Iraq veteran, should I fear reprisals for the war crimes that I have commited? -President Obama wants to lessen troop commitment in Iraq, yet he won't pull them out either. I know that President Obama has always been against the war in Iraq (since he was in his mother's womb, in fact), so I can only assume that, as President, he has come upon classified information which has made him alter his course. Normally, I would chalk this up to politicians acting politiciany, but President Obama came into Washington in order to change things, I hope. -President Obama makes me feel that the time that I had spent in Iraq (fortunately, I wasn't wounded, or else I'd be a drain on government funds) was worthwhile. -Vice-President Biden hit the nail on the head when he targeted the U.S. soldiers, who do not pay taxes while deployed, as being the unpatriotic leeches that they are.", 
        "intTime": 20090319, 
        "postID": 17, 
        "quote": "", 
        "reply": "Technically, I'm not a college graduate, but I only have seven credits left until graduation, so hopefully you'll let me slide in on this one. -President Obama considered making wounded veterans use personal health insurance to help pay for the cost of VA care. For the wounded veterans who are no longer productive members of society, according to Speaker of the House Pelosi, this is a good plan; we don't need people leeching off of the government. -President Obama wants to release the innocent people who were unfairly detained at Gitmo, and has considered letting them go to the U.S. As a baby-killing Iraq veteran, should I fear reprisals for the war crimes that I have commited? -President Obama wants to lessen troop commitment in Iraq, yet he won't pull them out either. I know that President Obama has always been against the war in Iraq (since he was in his mother's womb, in fact), so I can only assume that, as President, he has come upon classified information which has made him alter his course. Normally, I would chalk this up to politicians acting politiciany, but President Obama came into Washington in order to change things, I hope. -President Obama makes me feel that the time that I had spent in Iraq (fortunately, I wasn't wounded, or else I'd be a drain on government funds) was worthwhile. -Vice-President Biden hit the nail on the head when he targeted the U.S. soldiers, who do not pay taxes while deployed, as being the unpatriotic leeches that they are.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 12:20:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question.", 
        "intTime": 20090319, 
        "postID": 18, 
        "quote": "", 
        "reply": "Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 15:05:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Plattsfire1"
    }, 
    {
        "content": "quote: Originally posted by Plattsfire1: Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question. A lot of the kids today are ****tards.", 
        "intTime": 20090319, 
        "postID": 19, 
        "quote": "Originally posted by Plattsfire1: Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question.", 
        "reply": " A lot of the kids today are ****tards.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 15:17:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Name the one thing that President Obama tried to do to our Veterans that President Bush would never have tried to do.", 
        "intTime": 20090318, 
        "postID": 20, 
        "quote": "", 
        "reply": "Name the one thing that President Obama tried to do to our Veterans that President Bush would never have tried to do.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 15:49:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Keep their kids from having to fight in Iraq during 3 or 4 mandatory tours on pain of imprisonment if they refuse to go? I'm not really sure where you're trying to go with this - - You might want to vent a little and clarify in the process - - Wandering and Wondering", 
        "intTime": 20090318, 
        "postID": 21, 
        "quote": "", 
        "reply": "Keep their kids from having to fight in Iraq during 3 or 4 mandatory tours on pain of imprisonment if they refuse to go? I'm not really sure where you're trying to go with this - - You might want to vent a little and clarify in the process - - Wandering and Wondering", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 15:52:00", 
        "title": "Only college graduates answer please.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "intTime": 20090318, 
        "postID": 22, 
        "quote": "", 
        "reply": "OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:07:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "reply": " Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:17:00", 
        "title": "Only college graduates answer please.", 
        "userID": "jaluck"
    }, 
    {
        "content": "I don't see how he's going to dodge the bullet on that one. The damage is already done As the old adage goes: \"Open mouth, insert foot\" Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090318, 
        "postID": 24, 
        "quote": "", 
        "reply": "I don't see how he's going to dodge the bullet on that one. The damage is already done As the old adage goes: \"Open mouth, insert foot\" Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:19:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "Well, I'd hate to see that for those who have no other option. I have a certain amount of Medical Insurance from my civilian retirement, so I'm going to do the best I can not to burden the Federal System. That way, maybe the money can go for somebody not so fortunate. All my uncles used the VA pretty extensively in their later years. They were all WW II Vets. But Dad never did. He stayed with Blue Cross/Blue Shield, which he earned retiring as a Welder from United States Steel. He didn't want to be on the Federal nickle unless he had no other option, yet he had been on Saipan and Iwo Jima. So he'd certainly earned VA help. He just wanted to be independent from all that, and that's the way I hope to do - but I'd hate to see anyone lose what they've earned by getting shot at while in the GI Uniform - - Wandering and Wondering", 
        "intTime": 20090318, 
        "postID": 25, 
        "quote": "", 
        "reply": "Well, I'd hate to see that for those who have no other option. I have a certain amount of Medical Insurance from my civilian retirement, so I'm going to do the best I can not to burden the Federal System. That way, maybe the money can go for somebody not so fortunate. All my uncles used the VA pretty extensively in their later years. They were all WW II Vets. But Dad never did. He stayed with Blue Cross/Blue Shield, which he earned retiring as a Welder from United States Steel. He didn't want to be on the Federal nickle unless he had no other option, yet he had been on Saipan and Iwo Jima. So he'd certainly earned VA help. He just wanted to be independent from all that, and that's the way I hope to do - but I'd hate to see anyone lose what they've earned by getting shot at while in the GI Uniform - - Wandering and Wondering", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:21:00", 
        "title": "Only college graduates answer please.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I go to the VA and I already am a paying customer. They charge my insurance Shockey", 
        "intTime": 20090318, 
        "postID": 26, 
        "quote": "", 
        "reply": "I go to the VA and I already am a paying customer. They charge my insurance Shockey", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 16:26:00", 
        "title": "Only college graduates answer please.", 
        "userID": "shockey"
    }, 
    {
        "content": "You jumped to the answer to quick Duster. In fact among the VA health care issue there are several things about Obama that are beginning to float to the surface. I go the VA but they charge my insurance as well.", 
        "intTime": 20090318, 
        "postID": 27, 
        "quote": "", 
        "reply": "You jumped to the answer to quick Duster. In fact among the VA health care issue there are several things about Obama that are beginning to float to the surface. I go the VA but they charge my insurance as well.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-18 19:08:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Wolfhound_1968"
    }, 
    {
        "content": "quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. I use the VA regularly. I can't stand the insurance health programs I've been with. Seems they are always nickel and dimeing you all the way. The VA's health care is as good or better than some of the high cost programs I've been with. I've had the various Govt. Employee Fed, State and local govt. health insurance plans and I still prefer the VA's system. They are slow but then I think the money they should be spending on more help gets blown on some freekin statue or office furniture. The way to keep them on their toes is to let them know that you expect them to help you as soon as they can and show some respect. I always start every conversation with a VA employee with, \"Hows your day going\"? If it's not flowing for them I just try to make a positive comment, sometimes that's difficult especially when I'm in pain but hey. Unfortunately every visit to the VA Hospital usually ends with a visit to the pharmacy and that can get me steamed sometimes. I don't think they coordinate with the doctors very well. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 28, 
        "quote": "Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers.", 
        "reply": " I use the VA regularly. I can't stand the insurance health programs I've been with. Seems they are always nickel and dimeing you all the way. The VA's health care is as good or better than some of the high cost programs I've been with. I've had the various Govt. Employee Fed, State and local govt. health insurance plans and I still prefer the VA's system. They are slow but then I think the money they should be spending on more help gets blown on some freekin statue or office furniture. The way to keep them on their toes is to let them know that you expect them to help you as soon as they can and show some respect. I always start every conversation with a VA employee with, \"Hows your day going\"? If it's not flowing for them I just try to make a positive comment, sometimes that's difficult especially when I'm in pain but hey. Unfortunately every visit to the VA Hospital usually ends with a visit to the pharmacy and that can get me steamed sometimes. I don't think they coordinate with the doctors very well. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 00:21:00", 
        "title": "Only college graduates answer please.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "intTime": 20090319, 
        "postID": 29, 
        "quote": "Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex", 
        "reply": " I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 02:11:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra? Duster6, I dunno. Don't think I've ever seen one. ...Alex", 
        "intTime": 20090319, 
        "postID": 30, 
        "quote": "Originally posted by Duster6: I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "reply": " Duster6, I dunno. Don't think I've ever seen one. ...Alex", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 06:31:00", 
        "title": "Only college graduates answer please.", 
        "userID": "jaluck"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra? I want one that says, \"Still waiting for change\". Or maybe \"Hold on to your seats I hear change is coming, someday\". How about, \"I thought he was talkin about real change, not pocket change\". Or \"If he puts his hand in his pocket and moves it around, you can hear the change\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 31, 
        "quote": "Originally posted by Duster6: quote: Originally posted by jaluck: quote: Originally posted by Duster6: OK its been on the news for weeks now and other posts talk about it. Obama tried to make service connected Veterans pay for they health care instead of the VA paying for it. How low can you go? This week he dropped the subject as it might lower his popularity poll numbers. Duster6, So why are you bringing it up here and now? Is something wrong about the other threads? ...Alex I don't know Alex. Sometimes I say and do the stupidest things. By the way, you seem like a smart person let me ask you a question. Where can I get one of those Obama bumper stickers that say,\" How do you like the new change America? for my Tundra?", 
        "reply": " I want one that says, \"Still waiting for change\". Or maybe \"Hold on to your seats I hear change is coming, someday\". How about, \"I thought he was talkin about real change, not pocket change\". Or \"If he puts his hand in his pocket and moves it around, you can hear the change\". Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 10:24:00", 
        "title": "Only college graduates answer please.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives...", 
        "intTime": 20090319, 
        "postID": 32, 
        "quote": "", 
        "reply": "change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives...", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 10:34:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Elesso"
    }, 
    {
        "content": "It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - - Wandering and Wondering", 
        "intTime": 20090319, 
        "postID": 33, 
        "quote": "", 
        "reply": "It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - - Wandering and Wondering", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 11:02:00", 
        "title": "Only college graduates answer please.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Elesso: change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives... If the change is good I'll embrace it. If the change is bad I will fight it with all my energy. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090319, 
        "postID": 34, 
        "quote": "Originally posted by Elesso: change is scary, especially when change afects us. but why fear change? like death, it is unavoidable. why is there a hesitance here to accept change and ADAPT to it? humanity has dealt with change since we have been on this earth adam and eve dealt wi the first ever eviction but they adapted. Joseph, Moses, Colombus, hitler, clinton, Bush... everyone dealt with change, for good of for bad.. and it only makes us stronger. stop fearing change, and embrace it. make it part of your lives...", 
        "reply": " If the change is good I'll embrace it. If the change is bad I will fight it with all my energy. Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 11:06:00", 
        "title": "Only college graduates answer please.", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - - now THAT is an idea i can fall in line with.... using legal means, and getting voted into office is the AMERICAN way.. great idea GWG!!", 
        "intTime": 20090319, 
        "postID": 35, 
        "quote": "Originally posted by greywolfghost: It does kinda chap me that Obamma is continually harping on benefits and freebies for the intercity poor folk and all at everybody else's expense, then turning the tables on veterans who have kept this country free so that both parties, which ever one is in power at the time, can loot it. Maybe it's time for a \"Progressive Workers and Veteran's Party\" - Democrat and Republican Elitists need not apply - -", 
        "reply": " now THAT is an idea i can fall in line with.... using legal means, and getting voted into office is the AMERICAN way.. great idea GWG!!", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 11:10:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Elesso"
    }, 
    {
        "content": "Technically, I'm not a college graduate, but I only have seven credits left until graduation, so hopefully you'll let me slide in on this one. -President Obama considered making wounded veterans use personal health insurance to help pay for the cost of VA care. For the wounded veterans who are no longer productive members of society, according to Speaker of the House Pelosi, this is a good plan; we don't need people leeching off of the government. -President Obama wants to release the innocent people who were unfairly detained at Gitmo, and has considered letting them go to the U.S. As a baby-killing Iraq veteran, should I fear reprisals for the war crimes that I have commited? -President Obama wants to lessen troop commitment in Iraq, yet he won't pull them out either. I know that President Obama has always been against the war in Iraq (since he was in his mother's womb, in fact), so I can only assume that, as President, he has come upon classified information which has made him alter his course. Normally, I would chalk this up to politicians acting politiciany, but President Obama came into Washington in order to change things, I hope. -President Obama makes me feel that the time that I had spent in Iraq (fortunately, I wasn't wounded, or else I'd be a drain on government funds) was worthwhile. -Vice-President Biden hit the nail on the head when he targeted the U.S. soldiers, who do not pay taxes while deployed, as being the unpatriotic leeches that they are.", 
        "intTime": 20090319, 
        "postID": 36, 
        "quote": "", 
        "reply": "Technically, I'm not a college graduate, but I only have seven credits left until graduation, so hopefully you'll let me slide in on this one. -President Obama considered making wounded veterans use personal health insurance to help pay for the cost of VA care. For the wounded veterans who are no longer productive members of society, according to Speaker of the House Pelosi, this is a good plan; we don't need people leeching off of the government. -President Obama wants to release the innocent people who were unfairly detained at Gitmo, and has considered letting them go to the U.S. As a baby-killing Iraq veteran, should I fear reprisals for the war crimes that I have commited? -President Obama wants to lessen troop commitment in Iraq, yet he won't pull them out either. I know that President Obama has always been against the war in Iraq (since he was in his mother's womb, in fact), so I can only assume that, as President, he has come upon classified information which has made him alter his course. Normally, I would chalk this up to politicians acting politiciany, but President Obama came into Washington in order to change things, I hope. -President Obama makes me feel that the time that I had spent in Iraq (fortunately, I wasn't wounded, or else I'd be a drain on government funds) was worthwhile. -Vice-President Biden hit the nail on the head when he targeted the U.S. soldiers, who do not pay taxes while deployed, as being the unpatriotic leeches that they are.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 12:20:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question.", 
        "intTime": 20090319, 
        "postID": 37, 
        "quote": "", 
        "reply": "Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 15:05:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Plattsfire1"
    }, 
    {
        "content": "quote: Originally posted by Plattsfire1: Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question. A lot of the kids today are ****tards.", 
        "intTime": 20090319, 
        "postID": 38, 
        "quote": "Originally posted by Plattsfire1: Exactly what does any of this have to do with being a college graduate? Of course you are begging someone to ask that question.", 
        "reply": " A lot of the kids today are ****tards.", 
        "threadID": "5291911282_9940042812001", 
        "time": "2009-03-19 15:17:00", 
        "title": "Only college graduates answer please.", 
        "userID": "Philhelm"
    }
]