[
    {
        "content": "I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most.", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "", 
        "reply": "I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 09:19:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "Also what about all the palistien and Hamaas refugees he has authotized 20.3 million to bring them here and house them. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "Also what about all the palistien and Hamaas refugees he has authotized 20.3 million to bring them here and house them. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 10:05:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by tanarg: I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most. Uh, I don't suppose by chance you might have something of substance proving those people are a threat do you? \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "Originally posted by tanarg: I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most.", 
        "reply": " Uh, I don't suppose by chance you might have something of substance proving those people are a threat do you? \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 10:37:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "", 
        "reply": "Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 12:15:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "nrinstitute.org/mustread.php nrinstitute.org/mustread.php By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamo detainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from the United States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, /S/ Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section NO HOT LINKS ALLOWED UNLESS THEY ARE GOV.ORG , OR MIL.COM LINKS This message has been edited. Last edited by: <NEMESIS1960>, Fri 01 May 2009 12:31 PM", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "", 
        "reply": "nrinstitute.org/mustread.php nrinstitute.org/mustread.php By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamo detainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from the United States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, /S/ Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section NO HOT LINKS ALLOWED UNLESS THEY ARE GOV.ORG , OR MIL.COM LINKS This message has been edited. Last edited by: <NEMESIS1960>, Fri 01 May 2009 12:31 PM", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 12:21:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation.", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "Andrew C. McCarthy", 
        "reply": " tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 13:31:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation. Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person?", 
        "intTime": 20090501, 
        "postID": 7, 
        "quote": "Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation.", 
        "reply": " Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 14:44:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "quote: Originally posted by tanarg: quote: Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation. Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person? Well..because you could be. Remember this part of my post \"Since you have no profile info other tanarg\" ? Now...do you see where I thought it might be you? So what terrifies you so much about Chinese Uighurs?", 
        "intTime": 20090501, 
        "postID": 8, 
        "quote": "Originally posted by tanarg: quote: Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation. Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person?", 
        "reply": " Well..because you could be. Remember this part of my post \"Since you have no profile info other tanarg\" ? Now...do you see where I thought it might be you? So what terrifies you so much about Chinese Uighurs?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 17:06:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "It's Obama who terrifies me.", 
        "intTime": 20090501, 
        "postID": 9, 
        "quote": "", 
        "reply": "It's Obama who terrifies me.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 17:49:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "quote: Releasing Chinese Uighurs into the U.S. Explain all - What the Hell is a Uighur, besides a word that's really hard to pronounce - -??? Wandering and Wondering", 
        "intTime": 20090501, 
        "postID": 10, 
        "quote": "Releasing Chinese Uighurs into the U.S.", 
        "reply": " Explain all - What the Hell is a Uighur, besides a word that's really hard to pronounce - -??? Wandering and Wondering", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 20:57:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries.", 
        "intTime": 20090501, 
        "postID": 11, 
        "quote": "", 
        "reply": "They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 22:23:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tanarg: Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules. Oh shoot man, you're absolutely right. When I opened the quote window the blank space I pasted into was at the bottom of my screen. Please accept my apology. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090502, 
        "postID": 12, 
        "quote": "Originally posted by tanarg: Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules.", 
        "reply": " Oh shoot man, you're absolutely right. When I opened the quote window the blank space I pasted into was at the bottom of my screen. Please accept my apology. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 05:21:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by tawodi: They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries. So where do you or anyone else think these poor bassturds be sent, along with any of the others at GITMO. One way or another, they are humans - Maybe send them all the Israel or Gaza? The problem with all this mess is no one thought about what was to be done with these people long term... Should have never been moved out of country where captured - Wandering and Wondering", 
        "intTime": 20090502, 
        "postID": 13, 
        "quote": "Originally posted by tawodi: They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries.", 
        "reply": " So where do you or anyone else think these poor bassturds be sent, along with any of the others at GITMO. One way or another, they are humans - Maybe send them all the Israel or Gaza? The problem with all this mess is no one thought about what was to be done with these people long term... Should have never been moved out of country where captured - Wandering and Wondering", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 06:40:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "To return them to their country is usually not possible as they would be killed outright. There it's out in the open now. So you and I are once again in agreement. We made a huge mistake in taking them from the theater of ops in the attempt to keep them \"extraconstitutional\" prisoners. As it turns out most of the returnees are again fighting us again...gee I wonder why? My first instinct then was that it was a mistake to have \"captured' them in the first place. But then again, I'm a cut to the chase, kinda guy in these circumstances! T", 
        "intTime": 20090502, 
        "postID": 14, 
        "quote": "", 
        "reply": "To return them to their country is usually not possible as they would be killed outright. There it's out in the open now. So you and I are once again in agreement. We made a huge mistake in taking them from the theater of ops in the attempt to keep them \"extraconstitutional\" prisoners. As it turns out most of the returnees are again fighting us again...gee I wonder why? My first instinct then was that it was a mistake to have \"captured' them in the first place. But then again, I'm a cut to the chase, kinda guy in these circumstances! T", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 07:57:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "if we can't repatriate them, and they can't stay here, what other suggestions are there? keeping them locked up for eternety? slit their throats? freeze them in carbonite? ship them off to a prison moon off uranus?", 
        "intTime": 20090502, 
        "postID": 15, 
        "quote": "", 
        "reply": "if we can't repatriate them, and they can't stay here, what other suggestions are there? keeping them locked up for eternety? slit their throats? freeze them in carbonite? ship them off to a prison moon off uranus?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:11:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Elesso"
    }, 
    {
        "content": "Do we have a prison moon?? Just askin'", 
        "intTime": 20090502, 
        "postID": 16, 
        "quote": "", 
        "reply": "Do we have a prison moon?? Just askin'", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:19:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "Release them to their countries, not the U.S. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090502, 
        "postID": 17, 
        "quote": "", 
        "reply": "Release them to their countries, not the U.S. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:29:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Do we have a prison moon?? Just askin' yup!! it sits in the sea of tranquility... that is where we are keeping osama.... don't tell anyone", 
        "intTime": 20090502, 
        "postID": 18, 
        "quote": "Originally posted by tawodi: Do we have a prison moon?? Just askin'", 
        "reply": " yup!! it sits in the sea of tranquility... that is where we are keeping osama.... don't tell anyone", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:29:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Elesso"
    }, 
    {
        "content": "O.K. I won't...SHHHHH!!", 
        "intTime": 20090502, 
        "postID": 19, 
        "quote": "", 
        "reply": "O.K. I won't...SHHHHH!!", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:30:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Release them to their countries, not the U.S. Isn't that where they would recruit more like themselves and come screaming back ith knives in their teeth?? Time for nukes??? Wandering and Wondering", 
        "intTime": 20090502, 
        "postID": 20, 
        "quote": "Originally posted by Bergy46: Release them to their countries, not the U.S.", 
        "reply": " Isn't that where they would recruit more like themselves and come screaming back ith knives in their teeth?? Time for nukes??? Wandering and Wondering", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:33:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most.", 
        "intTime": 20090501, 
        "postID": 21, 
        "quote": "", 
        "reply": "I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 09:19:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "Also what about all the palistien and Hamaas refugees he has authotized 20.3 million to bring them here and house them. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090501, 
        "postID": 22, 
        "quote": "", 
        "reply": "Also what about all the palistien and Hamaas refugees he has authotized 20.3 million to bring them here and house them. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 10:05:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by tanarg: I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most. Uh, I don't suppose by chance you might have something of substance proving those people are a threat do you? \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090501, 
        "postID": 23, 
        "quote": "Originally posted by tanarg: I've written the following to my congressional representatives -- what do you all think of this issue? Dear < My Senators and my Representative>: I am exceedingly distressed by feelings of terror because of Obama's threat to release Chinese Uighurs into the U.S., against the advice of professionals who advised him not to do so. I am calling upon you to do something to protect the American people. Obama is not doing his job of protecting us -- and that is his PRIMARY responsibility. He is, in fact, personally terrorizing me by his threats of releasing dangerous prisoners in our midst. \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" Something is seriously wrong here. Please do something to stop Obama from destroying our country. I am very afraid. Please -- use your influence to make the president more responsible and caring for the citizens of this country. It is wrong to do what he threatens to do. Thank you for considering my concerns. I am very worried. I am terrified that my country is in the hands of man who really hates it. I am scared. And it is Obama who scares me most.", 
        "reply": " Uh, I don't suppose by chance you might have something of substance proving those people are a threat do you? \"http://www.washingtonpost.com/wp-dyn/content/article/2005/08/23/AR2005082301362.html\" How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 10:37:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules.", 
        "intTime": 20090501, 
        "postID": 24, 
        "quote": "", 
        "reply": "Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 12:15:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "nrinstitute.org/mustread.php nrinstitute.org/mustread.php By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamo detainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from the United States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, /S/ Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section NO HOT LINKS ALLOWED UNLESS THEY ARE GOV.ORG , OR MIL.COM LINKS This message has been edited. Last edited by: <NEMESIS1960>, Fri 01 May 2009 12:31 PM", 
        "intTime": 20090501, 
        "postID": 25, 
        "quote": "", 
        "reply": "nrinstitute.org/mustread.php nrinstitute.org/mustread.php By email (to the Counterterrorism Division) and by regular mail: The Honorable Eric H. Holder, Jr. Attorney General of the United States United States Department of Justice 950 Pennsylvania Avenue, NW Washington, D.C. 20530-0001 Dear Attorney General Holder: This letter is respectfully submitted to inform you that I must decline the invitation to participate in the May 4 roundtable meeting the President’s Task Force on Detention Policy is convening with current and former prosecutors involved in international terrorism cases. An invitation was extended to me by trial lawyers from the Counterterrorism Section, who are members of the Task Force, which you are leading. The invitation email (of April 14) indicates that the meeting is part of an ongoing effort to identify lawful policies on the detention and disposition of alien enemy combatants—or what the Department now calls “individuals captured or apprehended in connection with armed conflicts and counterterrorism operations.” I admire the lawyers of the Counterterrorism Division, and I do not question their good faith. Nevertheless, it is quite clear—most recently, from your provocative remarks on Wednesday in Germany—that the Obama administration has already settled on a policy of releasing trained jihadists (including releasing some of them into the United States). Whatever the good intentions of the organizers, the meeting will obviously be used by the administration to claim that its policy was arrived at in consultation with current and former government officials experienced in terrorism cases and national security issues. I deeply disagree with this policy, which I believe is a violation of federal law and a betrayal of the president’s first obligation to protect the American people. Under the circumstances, I think the better course is to register my dissent, rather than be used as a prop. Moreover, in light of public statements by both you and the President, it is dismayingly clear that, under your leadership, the Justice Department takes the position that a lawyer who in good faith offers legal advice to government policy makers—like the government lawyers who offered good faith advice on interrogation policy—may be subject to investigation and prosecution for the content of that advice, in addition to empty but professionally damaging accusations of ethical misconduct. Given that stance, any prudent lawyer would have to hesitate before offering advice to the government. Beyond that, as elucidated in my writing (including my proposal for a new national security court, which I understand the Task Force has perused), I believe alien enemy combatants should be detained at Guantanamo Bay (or a facility like it) until the conclusion of hostilities. This national defense measure is deeply rooted in the venerable laws of war and was reaffirmed by the Supreme Court in the 2004 Hamdi case. Yet, as recently as Wednesday, you asserted that, in your considered judgment, such notions violate America’s “commitment to the rule of law.” Indeed, you elaborated, “Nothing symbolizes our [adminstration’s] new course more than our decision to close the prison at Guantanamo Bay…. President Obama believes, and I strongly agree, that Guantanamo has come to represent a time and an approach that we want to put behind us: a disregard for our centuries-long respect for the rule of law[.]” (Emphasis added.) Given your policy of conducting ruinous criminal and ethics investigations of lawyers over the advice they offer the government, and your specific position that the wartime detention I would endorse is tantamount to a violation of law, it makes little sense for me to attend the Task Force meeting. After all, my choice would be to remain silent or risk jeopardizing myself. For what it may be worth, I will say this much. For eight years, we have had a robust debate in the United States about how to handle alien terrorists captured during a defensive war authorized by Congress after nearly 3000 of our fellow Americans were annihilated. Essentially, there have been two camps. One calls for prosecution in the civilian criminal justice system, the strategy used throughout the 1990s. The other calls for a military justice approach of combatant detention and war-crimes prosecutions by military commission. Because each theory has its downsides, many commentators, myself included, have proposed a third way: a hybrid system, designed for the realities of modern international terrorism—a new system that would address the needs to protect our classified defense secrets and to assure Americans, as well as our allies, that we are detaining the right people. There are differences in these various proposals. But their proponents, and adherents to both the military and civilian justice approaches, have all agreed on at least one thing: Foreign terrorists trained to execute mass-murder attacks cannot simply be released while the war ensues and Americans are still being targeted. We have already released too many jihadists who, as night follows day, have resumed plotting to kill Americans. Indeed, according to recent reports, a released Guantanamo detainee is now leading Taliban combat operations in Afghanistan, where President Obama has just sent additional American forces. The Obama campaign smeared Guantanamo Bay as a human rights blight. Consistent with that hyperbolic rhetoric, the President began his administration by promising to close the detention camp within a year. The President did this even though he and you (a) agree Gitmo is a top-flight prison facility, (b) acknowledge that our nation is still at war, and (c) concede that many Gitmo detainees are extremely dangerous terrorists who cannot be tried under civilian court rules. Patently, the commitment to close Guantanamo Bay within a year was made without a plan for what to do with these detainees who cannot be tried. Consequently, the Detention Policy Task Force is not an effort to arrive at the best policy. It is an effort to justify a bad policy that has already been adopted: to wit, the Obama administration policy to release trained terrorists outright if that’s what it takes to close Gitmo by January. Obviously, I am powerless to stop the administration from releasing top al Qaeda operatives who planned mass-murder attacks against American cities—like Binyam Mohammed (the accomplice of “Dirty Bomber” Jose Padilla) whom the administration recently transferred to Britain, where he is now at liberty and living on public assistance. I am similarly powerless to stop the administration from admitting into the United States such alien jihadists as the 17 remaining Uighur detainees. According to National Intelligence Director Dennis Blair, the Uighurs will apparently live freely, on American taxpayer assistance, despite the facts that they are affiliated with a terrorist organization and have received terrorist paramilitary training. Under federal immigration law (the 2005 REAL ID Act), those facts render them excludable from the United States. The Uighurs’ impending release is thus a remarkable development given the Obama administration’s propensity to deride its predecessor’s purported insensitivity to the rule of law. I am, in addition, powerless to stop the President, as he takes these reckless steps, from touting his Detention Policy Task Force as a demonstration of his national security seriousness. But I can decline to participate in the charade. Finally, let me repeat that I respect and admire the dedication of Justice Department lawyers, whom I have tirelessly defended since I retired in 2003 as a chief assistant U.S. attorney in the Southern District of New York. It was a unique honor to serve for nearly twenty years as a federal prosecutor, under administrations of both parties. It was as proud a day as I have ever had when the trial team I led was awarded the Attorney General’s Exceptional Service Award in 1996, after we secured the convictions of Sheikh Omar Abdel Rahman and his underlings for waging a terrorist war against the United States. I particularly appreciated receiving the award from Attorney General Reno—as I recounted in Willful Blindness, my book about the case, without her steadfastness against opposition from short-sighted government officials who wanted to release him, the “blind sheikh” would never have been indicted, much less convicted and so deservedly sentenced to life-imprisonment. In any event, I’ve always believed defending our nation is a duty of citizenship, not ideology. Thus, my conservative political views aside, I’ve made myself available to liberal and conservative groups, to Democrats and Republicans, who’ve thought tapping my experience would be beneficial. It pains me to decline your invitation, but the attendant circumstances leave no other option. Very truly yours, /S/ Andrew C. McCarthy cc: Sylvia T. Kaser and John DePue National Security Division, Counterterrorism Section NO HOT LINKS ALLOWED UNLESS THEY ARE GOV.ORG , OR MIL.COM LINKS This message has been edited. Last edited by: <NEMESIS1960>, Fri 01 May 2009 12:31 PM", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 12:21:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation.", 
        "intTime": 20090501, 
        "postID": 26, 
        "quote": "Andrew C. McCarthy", 
        "reply": " tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 13:31:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "quote: Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation. Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person?", 
        "intTime": 20090501, 
        "postID": 27, 
        "quote": "Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation.", 
        "reply": " Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 14:44:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "quote: Originally posted by tanarg: quote: Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation. Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person? Well..because you could be. Remember this part of my post \"Since you have no profile info other tanarg\" ? Now...do you see where I thought it might be you? So what terrifies you so much about Chinese Uighurs?", 
        "intTime": 20090501, 
        "postID": 28, 
        "quote": "Originally posted by tanarg: quote: Originally posted by VeteranDad78: quote: Andrew C. McCarthy tanarg, Are you Andrew C. McCarthy, former Assistant United States Attorney for the Southern District of New York? Since you have no profile info other tanarg, I'd appreciate a confirmation. Why would you think I am he? In my initial post I posted a letter from me to my congressional representatives. Do we sound like the same person?", 
        "reply": " Well..because you could be. Remember this part of my post \"Since you have no profile info other tanarg\" ? Now...do you see where I thought it might be you? So what terrifies you so much about Chinese Uighurs?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 17:06:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "VeteranDad78"
    }, 
    {
        "content": "It's Obama who terrifies me.", 
        "intTime": 20090501, 
        "postID": 29, 
        "quote": "", 
        "reply": "It's Obama who terrifies me.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 17:49:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tanarg"
    }, 
    {
        "content": "quote: Releasing Chinese Uighurs into the U.S. Explain all - What the Hell is a Uighur, besides a word that's really hard to pronounce - -??? Wandering and Wondering", 
        "intTime": 20090501, 
        "postID": 30, 
        "quote": "Releasing Chinese Uighurs into the U.S.", 
        "reply": " Explain all - What the Hell is a Uighur, besides a word that's really hard to pronounce - -??? Wandering and Wondering", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 20:57:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries.", 
        "intTime": 20090501, 
        "postID": 31, 
        "quote": "", 
        "reply": "They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries.", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-01 22:23:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by tanarg: Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules. Oh shoot man, you're absolutely right. When I opened the quote window the blank space I pasted into was at the bottom of my screen. Please accept my apology. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090502, 
        "postID": 32, 
        "quote": "Originally posted by tanarg: Vicdude: You shouldn't be pasting things into my quote and making it appear they were part of my original post. That's considered dishonest. The recommendations he has received were against releasing them in the U.S. I do not buy that they are not dangerous. But kindly do not alter people's posts. I am sure that is a violation of the forum's rules.", 
        "reply": " Oh shoot man, you're absolutely right. When I opened the quote window the blank space I pasted into was at the bottom of my screen. Please accept my apology. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 05:21:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by tawodi: They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries. So where do you or anyone else think these poor bassturds be sent, along with any of the others at GITMO. One way or another, they are humans - Maybe send them all the Israel or Gaza? The problem with all this mess is no one thought about what was to be done with these people long term... Should have never been moved out of country where captured - Wandering and Wondering", 
        "intTime": 20090502, 
        "postID": 33, 
        "quote": "Originally posted by tawodi: They are a tribe from the vast reaches of Mongolia and western China that they (the Chinese government) recruit to suppress Christians and certain other groups in China and Tibet. Also they have been utilized by Al Qaeda as operatives in those areas as well, and then transported and retrained by Bin Laden himself to continue terrorist operations elsewhere in the world, at his behest and command. The way to pronounce the word is U i (short i sound ) ghers. U i ghers. This information from \"Voice of the Martyrs\" at \"persecution.com\" A group that we, of The People of Abraham co-respond with. Tawodi.....Rev. Bruce Tree of The Mustard Seed Ministries.", 
        "reply": " So where do you or anyone else think these poor bassturds be sent, along with any of the others at GITMO. One way or another, they are humans - Maybe send them all the Israel or Gaza? The problem with all this mess is no one thought about what was to be done with these people long term... Should have never been moved out of country where captured - Wandering and Wondering", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 06:40:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "To return them to their country is usually not possible as they would be killed outright. There it's out in the open now. So you and I are once again in agreement. We made a huge mistake in taking them from the theater of ops in the attempt to keep them \"extraconstitutional\" prisoners. As it turns out most of the returnees are again fighting us again...gee I wonder why? My first instinct then was that it was a mistake to have \"captured' them in the first place. But then again, I'm a cut to the chase, kinda guy in these circumstances! T", 
        "intTime": 20090502, 
        "postID": 34, 
        "quote": "", 
        "reply": "To return them to their country is usually not possible as they would be killed outright. There it's out in the open now. So you and I are once again in agreement. We made a huge mistake in taking them from the theater of ops in the attempt to keep them \"extraconstitutional\" prisoners. As it turns out most of the returnees are again fighting us again...gee I wonder why? My first instinct then was that it was a mistake to have \"captured' them in the first place. But then again, I'm a cut to the chase, kinda guy in these circumstances! T", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 07:57:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "if we can't repatriate them, and they can't stay here, what other suggestions are there? keeping them locked up for eternety? slit their throats? freeze them in carbonite? ship them off to a prison moon off uranus?", 
        "intTime": 20090502, 
        "postID": 35, 
        "quote": "", 
        "reply": "if we can't repatriate them, and they can't stay here, what other suggestions are there? keeping them locked up for eternety? slit their throats? freeze them in carbonite? ship them off to a prison moon off uranus?", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:11:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Elesso"
    }, 
    {
        "content": "Do we have a prison moon?? Just askin'", 
        "intTime": 20090502, 
        "postID": 36, 
        "quote": "", 
        "reply": "Do we have a prison moon?? Just askin'", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:19:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "Release them to their countries, not the U.S. Keep smiling, everyone will wonder what you've been up to!", 
        "intTime": 20090502, 
        "postID": 37, 
        "quote": "", 
        "reply": "Release them to their countries, not the U.S. Keep smiling, everyone will wonder what you've been up to!", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:29:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Bergy46"
    }, 
    {
        "content": "quote: Originally posted by tawodi: Do we have a prison moon?? Just askin' yup!! it sits in the sea of tranquility... that is where we are keeping osama.... don't tell anyone", 
        "intTime": 20090502, 
        "postID": 38, 
        "quote": "Originally posted by tawodi: Do we have a prison moon?? Just askin'", 
        "reply": " yup!! it sits in the sea of tranquility... that is where we are keeping osama.... don't tell anyone", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:29:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "Elesso"
    }, 
    {
        "content": "O.K. I won't...SHHHHH!!", 
        "intTime": 20090502, 
        "postID": 39, 
        "quote": "", 
        "reply": "O.K. I won't...SHHHHH!!", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:30:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "tawodi"
    }, 
    {
        "content": "quote: Originally posted by Bergy46: Release them to their countries, not the U.S. Isn't that where they would recruit more like themselves and come screaming back ith knives in their teeth?? Time for nukes??? Wandering and Wondering", 
        "intTime": 20090502, 
        "postID": 40, 
        "quote": "Originally posted by Bergy46: Release them to their countries, not the U.S.", 
        "reply": " Isn't that where they would recruit more like themselves and come screaming back ith knives in their teeth?? Time for nukes??? Wandering and Wondering", 
        "threadID": "5291911282_8670042222001", 
        "time": "2009-05-02 08:33:00", 
        "title": "Releasing Chinese Uighurs into the U.S.", 
        "userID": "greywolfghost"
    }
]