[
    {
        "content": "BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-20 20:16:00", 
        "title": "Gun registration", 
        "userID": "Mgunns"
    }, 
    {
        "content": "quote: Originally posted by Mgunns: BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi Your post is a diatribe. Not a diatribe in favor of the Second Amendment, but against Mr. Obama. This is an unconstitutional law being suggested by \"some\" members of Congress. I doubt it it will pass. But right now in New York (and for the last thirty years) all gun owners are \"supposed\" to register their firearms with the government. No license required - However, in New York, if you want a hunting license you MUST take and pass a firearms safety course. I approve. Far too many jerks blow away anything that moves. I do NOT approve of the registration law. More importantly, I do not approve of the idea that you have to get a license (no matter how easy to get). Owning guns is a RIGHT not a privledge. License those who drive, not those who own guns. Finally, Mr. Obama apologised for his stuped remark even before the program aired. Now, which of your various diatribes is this thread about? I'd like to keep it simple... Dave", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "Originally posted by Mgunns: BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi", 
        "reply": " Your post is a diatribe. Not a diatribe in favor of the Second Amendment, but against Mr. Obama. This is an unconstitutional law being suggested by \"some\" members of Congress. I doubt it it will pass. But right now in New York (and for the last thirty years) all gun owners are \"supposed\" to register their firearms with the government. No license required - However, in New York, if you want a hunting license you MUST take and pass a firearms safety course. I approve. Far too many jerks blow away anything that moves. I do NOT approve of the registration law. More importantly, I do not approve of the idea that you have to get a license (no matter how easy to get). Owning guns is a RIGHT not a privledge. License those who drive, not those who own guns. Finally, Mr. Obama apologised for his stuped remark even before the program aired. Now, which of your various diatribes is this thread about? I'd like to keep it simple... Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-21 08:37:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "", 
        "reply": "hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-21 10:57:00", 
        "title": "Gun registration", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail? The Sullivan Law is aimed only at handguns (not that I'm defending the Sullivan Law). It's been around since the turn of the Century, when a corrupt politician named Sullivan ( ) wanted to create a monopoly on owning handguns. He wanted his supporters to own them... Roughly twenty years ago, New York City passed a law requiring registration of rifles - Not a licensing law, you are simply required to \"register\" your guns. An abuse of the Second Amendment. Dave", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "reply": " The Sullivan Law is aimed only at handguns (not that I'm defending the Sullivan Law). It's been around since the turn of the Century, when a corrupt politician named Sullivan ( ) wanted to create a monopoly on owning handguns. He wanted his supporters to own them... Roughly twenty years ago, New York City passed a law requiring registration of rifles - Not a licensing law, you are simply required to \"register\" your guns. An abuse of the Second Amendment. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-21 12:55:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "People who want the government to take care of them and protect them are the ones who don't possess the honor or dignity of a free citizen. Their fear based arguments against gun ownership are pathetic attempts to level the playing field and make it impossible for freedom to exist in the birthplace of society based on personal freedom and individual rights as outlined in our Constitution and Bill of Rights", 
        "intTime": 20090329, 
        "postID": 5, 
        "quote": "", 
        "reply": "People who want the government to take care of them and protect them are the ones who don't possess the honor or dignity of a free citizen. Their fear based arguments against gun ownership are pathetic attempts to level the playing field and make it impossible for freedom to exist in the birthplace of society based on personal freedom and individual rights as outlined in our Constitution and Bill of Rights", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-29 20:13:00", 
        "title": "Gun registration", 
        "userID": "lcplcross"
    }, 
    {
        "content": "The first step to confiscation is registration.", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "", 
        "reply": "The first step to confiscation is registration.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-04 18:08:00", 
        "title": "Gun registration", 
        "userID": "Ranger48820"
    }, 
    {
        "content": "Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too.", 
        "intTime": 20090405, 
        "postID": 7, 
        "quote": "", 
        "reply": "Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-05 13:41:00", 
        "title": "Gun registration", 
        "userID": "CG_GunnersM8"
    }, 
    {
        "content": "Nope, won't - - Wandering and Wondering", 
        "intTime": 20090405, 
        "postID": 8, 
        "quote": "", 
        "reply": "Nope, won't - - Wandering and Wondering", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-05 19:01:00", 
        "title": "Gun registration", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail? Yes, you are correct, and by golly there have been NO gun crimes since. Well maybe one or two. See how well that works?", 
        "intTime": 20090406, 
        "postID": 9, 
        "quote": "Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "reply": " Yes, you are correct, and by golly there have been NO gun crimes since. Well maybe one or two. See how well that works?", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-06 12:39:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Ranger48820: The first step to confiscation is registration. Nooo, the 1st step is to confiscate the politicians.", 
        "intTime": 20090406, 
        "postID": 10, 
        "quote": "Originally posted by Ranger48820: The first step to confiscation is registration.", 
        "reply": " Nooo, the 1st step is to confiscate the politicians.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-06 12:41:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing.", 
        "intTime": 20090406, 
        "postID": 11, 
        "quote": "Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too.", 
        "reply": " Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-06 12:46:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing. Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Dave", 
        "intTime": 20090407, 
        "postID": 12, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing.", 
        "reply": " Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 11:39:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing. Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave", 
        "intTime": 20090407, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing. Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave", 
        "reply": "", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 12:09:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave I made my post, not because I disagree with you about the Second Amendment, but rather that this is a strictly \"Liberal\" problem. There are plenty of Conservatives who support gun control, and plenty of leftists who do not. (I will concede that in this moment of time, a higher percentage of \"liberals,\" then conervatives, oppose the Second Amendment.) But for example, in the recent DC decision, while the Bush administration, on the one hand hailed the results, had actually sent in their lawyers to support the DC gun ban. And much of the scholarship that is taking place now, is being done by Liberals and Leftists who once opposed the Second Amendment but now support it. \"http://www.nytimes.com/2007/05/06/us/06firearms.html?_r=1&hp&oref=slogin\" But no, I was quite serious in my question. People get what they deserve, and if anti-gun proponents can amend the Constitution to get rid of rights, that is THEIR RIGHT! What they are NOT allowed to do is to pass simple laws by a majority vote, and overturn the Constitution by such votes. Dave", 
        "intTime": 20090407, 
        "postID": 14, 
        "quote": "Originally posted by Raunchy: Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave", 
        "reply": " I made my post, not because I disagree with you about the Second Amendment, but rather that this is a strictly \"Liberal\" problem. There are plenty of Conservatives who support gun control, and plenty of leftists who do not. (I will concede that in this moment of time, a higher percentage of \"liberals,\" then conervatives, oppose the Second Amendment.) But for example, in the recent DC decision, while the Bush administration, on the one hand hailed the results, had actually sent in their lawyers to support the DC gun ban. And much of the scholarship that is taking place now, is being done by Liberals and Leftists who once opposed the Second Amendment but now support it. \"http://www.nytimes.com/2007/05/06/us/06firearms.html?_r=1&hp&oref=slogin\" But no, I was quite serious in my question. People get what they deserve, and if anti-gun proponents can amend the Constitution to get rid of rights, that is THEIR RIGHT! What they are NOT allowed to do is to pass simple laws by a majority vote, and overturn the Constitution by such votes. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 14:33:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "God, I am glad I live in Florida. We can get permits to carry guns, I have a permit and I do carry, and we have the right to protect ourselves with deadly force if need be. The 2nd amendment to the constitution allows me to do that and I will not allow Obama to take that right from me.", 
        "intTime": 20090407, 
        "postID": 15, 
        "quote": "", 
        "reply": "God, I am glad I live in Florida. We can get permits to carry guns, I have a permit and I do carry, and we have the right to protect ourselves with deadly force if need be. The 2nd amendment to the constitution allows me to do that and I will not allow Obama to take that right from me.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 16:36:00", 
        "title": "Gun registration", 
        "userID": "9475297"
    }, 
    {
        "content": "i agree with that. there is no better way to enslave a people than to disarm them first.", 
        "intTime": 20090416, 
        "postID": 16, 
        "quote": "", 
        "reply": "i agree with that. there is no better way to enslave a people than to disarm them first.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-16 17:57:00", 
        "title": "Gun registration", 
        "userID": "21208003"
    }, 
    {
        "content": "quote: Originally posted by 21208003: i agree with that. there is no better way to enslave a people than to disarm them first. What is \"that,\" that you agree with? That an armed people are a free people, or we have no right to Amend the Constitution? If you use force to prevent the people from exercising their will, then YOU are enslaving them. Dave", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "Originally posted by 21208003: i agree with that. there is no better way to enslave a people than to disarm them first.", 
        "reply": " What is \"that,\" that you agree with? That an armed people are a free people, or we have no right to Amend the Constitution? If you use force to prevent the people from exercising their will, then YOU are enslaving them. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-17 05:48:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi", 
        "intTime": 20090320, 
        "postID": 21, 
        "quote": "", 
        "reply": "BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-20 20:16:00", 
        "title": "Gun registration", 
        "userID": "Mgunns"
    }, 
    {
        "content": "quote: Originally posted by Mgunns: BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi Your post is a diatribe. Not a diatribe in favor of the Second Amendment, but against Mr. Obama. This is an unconstitutional law being suggested by \"some\" members of Congress. I doubt it it will pass. But right now in New York (and for the last thirty years) all gun owners are \"supposed\" to register their firearms with the government. No license required - However, in New York, if you want a hunting license you MUST take and pass a firearms safety course. I approve. Far too many jerks blow away anything that moves. I do NOT approve of the registration law. More importantly, I do not approve of the idea that you have to get a license (no matter how easy to get). Owning guns is a RIGHT not a privledge. License those who drive, not those who own guns. Finally, Mr. Obama apologised for his stuped remark even before the program aired. Now, which of your various diatribes is this thread about? I'd like to keep it simple... Dave", 
        "intTime": 20090321, 
        "postID": 22, 
        "quote": "Originally posted by Mgunns: BO and his happy warriors are trying to get just about everyone in the US registered if they own a gun. The Bill is HR45 interesting name. You need to read this POS and then disagree with me! This was brought in at the very begining, read the number # 45, before numnuts gave away all our money to the bankers etc: and also after his funny remarks about the special Olympics. If I used the \"N\" word I would be drawn and quartered, if you know what that means. No amount of apolgizing(s) would help, Huh. But he gets away with it because he is new(BS) he old enough to know better. Shame on him and those that follow and stick up for him. A jack ass on comedians show!!! Semper Fi", 
        "reply": " Your post is a diatribe. Not a diatribe in favor of the Second Amendment, but against Mr. Obama. This is an unconstitutional law being suggested by \"some\" members of Congress. I doubt it it will pass. But right now in New York (and for the last thirty years) all gun owners are \"supposed\" to register their firearms with the government. No license required - However, in New York, if you want a hunting license you MUST take and pass a firearms safety course. I approve. Far too many jerks blow away anything that moves. I do NOT approve of the registration law. More importantly, I do not approve of the idea that you have to get a license (no matter how easy to get). Owning guns is a RIGHT not a privledge. License those who drive, not those who own guns. Finally, Mr. Obama apologised for his stuped remark even before the program aired. Now, which of your various diatribes is this thread about? I'd like to keep it simple... Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-21 08:37:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "intTime": 20090321, 
        "postID": 23, 
        "quote": "", 
        "reply": "hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-21 10:57:00", 
        "title": "Gun registration", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail? The Sullivan Law is aimed only at handguns (not that I'm defending the Sullivan Law). It's been around since the turn of the Century, when a corrupt politician named Sullivan ( ) wanted to create a monopoly on owning handguns. He wanted his supporters to own them... Roughly twenty years ago, New York City passed a law requiring registration of rifles - Not a licensing law, you are simply required to \"register\" your guns. An abuse of the Second Amendment. Dave", 
        "intTime": 20090321, 
        "postID": 24, 
        "quote": "Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "reply": " The Sullivan Law is aimed only at handguns (not that I'm defending the Sullivan Law). It's been around since the turn of the Century, when a corrupt politician named Sullivan ( ) wanted to create a monopoly on owning handguns. He wanted his supporters to own them... Roughly twenty years ago, New York City passed a law requiring registration of rifles - Not a licensing law, you are simply required to \"register\" your guns. An abuse of the Second Amendment. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-21 12:55:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "People who want the government to take care of them and protect them are the ones who don't possess the honor or dignity of a free citizen. Their fear based arguments against gun ownership are pathetic attempts to level the playing field and make it impossible for freedom to exist in the birthplace of society based on personal freedom and individual rights as outlined in our Constitution and Bill of Rights", 
        "intTime": 20090329, 
        "postID": 25, 
        "quote": "", 
        "reply": "People who want the government to take care of them and protect them are the ones who don't possess the honor or dignity of a free citizen. Their fear based arguments against gun ownership are pathetic attempts to level the playing field and make it impossible for freedom to exist in the birthplace of society based on personal freedom and individual rights as outlined in our Constitution and Bill of Rights", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-03-29 20:13:00", 
        "title": "Gun registration", 
        "userID": "lcplcross"
    }, 
    {
        "content": "The first step to confiscation is registration.", 
        "intTime": 20090404, 
        "postID": 26, 
        "quote": "", 
        "reply": "The first step to confiscation is registration.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-04 18:08:00", 
        "title": "Gun registration", 
        "userID": "Ranger48820"
    }, 
    {
        "content": "Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too.", 
        "intTime": 20090405, 
        "postID": 27, 
        "quote": "", 
        "reply": "Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-05 13:41:00", 
        "title": "Gun registration", 
        "userID": "CG_GunnersM8"
    }, 
    {
        "content": "Nope, won't - - Wandering and Wondering", 
        "intTime": 20090405, 
        "postID": 28, 
        "quote": "", 
        "reply": "Nope, won't - - Wandering and Wondering", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-05 19:01:00", 
        "title": "Gun registration", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail? Yes, you are correct, and by golly there have been NO gun crimes since. Well maybe one or two. See how well that works?", 
        "intTime": 20090406, 
        "postID": 29, 
        "quote": "Originally posted by Elesso: hey, Dave... hasn't New York City had the Sullivan law since the 1920's? a law tha t requres all weapons to be registered as in anyone possessing an unlicansed gun goes to jail?", 
        "reply": " Yes, you are correct, and by golly there have been NO gun crimes since. Well maybe one or two. See how well that works?", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-06 12:39:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Ranger48820: The first step to confiscation is registration. Nooo, the 1st step is to confiscate the politicians.", 
        "intTime": 20090406, 
        "postID": 30, 
        "quote": "Originally posted by Ranger48820: The first step to confiscation is registration.", 
        "reply": " Nooo, the 1st step is to confiscate the politicians.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-06 12:41:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing.", 
        "intTime": 20090406, 
        "postID": 31, 
        "quote": "Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too.", 
        "reply": " Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-06 12:46:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing. Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Dave", 
        "intTime": 20090407, 
        "postID": 32, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing.", 
        "reply": " Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 11:39:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing. Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave", 
        "intTime": 20090407, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Raunchy: quote: Originally posted by CG_GunnersM8: Dozens of these bills are introduced to congress each year, and the only reason they never pass is because law abiding gun owners make it apparent that we are against them, I have already emailed SEN. Gregg and voiced my opposition, I hope all of you tell your own congressmen how you feel too. Then why do these frickin morons keep introducing them? I'll tell you why, because the left never, never gives up. Just like the Russians with their five year plans, when they don't work they just extend the time limit. It's a never ending fight against these socialist that \"somebody\" keeps electing. Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave", 
        "reply": "", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 12:09:00", 
        "title": "Gun registration", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave I made my post, not because I disagree with you about the Second Amendment, but rather that this is a strictly \"Liberal\" problem. There are plenty of Conservatives who support gun control, and plenty of leftists who do not. (I will concede that in this moment of time, a higher percentage of \"liberals,\" then conervatives, oppose the Second Amendment.) But for example, in the recent DC decision, while the Bush administration, on the one hand hailed the results, had actually sent in their lawyers to support the DC gun ban. And much of the scholarship that is taking place now, is being done by Liberals and Leftists who once opposed the Second Amendment but now support it. \"http://www.nytimes.com/2007/05/06/us/06firearms.html?_r=1&hp&oref=slogin\" But no, I was quite serious in my question. People get what they deserve, and if anti-gun proponents can amend the Constitution to get rid of rights, that is THEIR RIGHT! What they are NOT allowed to do is to pass simple laws by a majority vote, and overturn the Constitution by such votes. Dave", 
        "intTime": 20090407, 
        "postID": 34, 
        "quote": "Originally posted by Raunchy: Are you suggesting that as a Freedom loving American we should ban the right of people to oppose owning guns? If the right to own a gun is taken away, there will soon be no free freedom loving people. Only people cowering behind locked doors afraid of the night.As Abe Lincoln said \"The constitution is no suicide pact\". \"The right of the individual to own guns is the greatest fraud perpetrated on the American People.\" Warren Burger, Conservative Chief Justice of the Supreme Court. Thankfully this idiot is no longer around. Too often the courts have their own axes to grind, so they read the law as they think it should be. Burger was one of them. Dave", 
        "reply": " I made my post, not because I disagree with you about the Second Amendment, but rather that this is a strictly \"Liberal\" problem. There are plenty of Conservatives who support gun control, and plenty of leftists who do not. (I will concede that in this moment of time, a higher percentage of \"liberals,\" then conervatives, oppose the Second Amendment.) But for example, in the recent DC decision, while the Bush administration, on the one hand hailed the results, had actually sent in their lawyers to support the DC gun ban. And much of the scholarship that is taking place now, is being done by Liberals and Leftists who once opposed the Second Amendment but now support it. \"http://www.nytimes.com/2007/05/06/us/06firearms.html?_r=1&hp&oref=slogin\" But no, I was quite serious in my question. People get what they deserve, and if anti-gun proponents can amend the Constitution to get rid of rights, that is THEIR RIGHT! What they are NOT allowed to do is to pass simple laws by a majority vote, and overturn the Constitution by such votes. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 14:33:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }, 
    {
        "content": "God, I am glad I live in Florida. We can get permits to carry guns, I have a permit and I do carry, and we have the right to protect ourselves with deadly force if need be. The 2nd amendment to the constitution allows me to do that and I will not allow Obama to take that right from me.", 
        "intTime": 20090407, 
        "postID": 35, 
        "quote": "", 
        "reply": "God, I am glad I live in Florida. We can get permits to carry guns, I have a permit and I do carry, and we have the right to protect ourselves with deadly force if need be. The 2nd amendment to the constitution allows me to do that and I will not allow Obama to take that right from me.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-07 16:36:00", 
        "title": "Gun registration", 
        "userID": "9475297"
    }, 
    {
        "content": "i agree with that. there is no better way to enslave a people than to disarm them first.", 
        "intTime": 20090416, 
        "postID": 36, 
        "quote": "", 
        "reply": "i agree with that. there is no better way to enslave a people than to disarm them first.", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-16 17:57:00", 
        "title": "Gun registration", 
        "userID": "21208003"
    }, 
    {
        "content": "quote: Originally posted by 21208003: i agree with that. there is no better way to enslave a people than to disarm them first. What is \"that,\" that you agree with? That an armed people are a free people, or we have no right to Amend the Constitution? If you use force to prevent the people from exercising their will, then YOU are enslaving them. Dave", 
        "intTime": 20090417, 
        "postID": 37, 
        "quote": "Originally posted by 21208003: i agree with that. there is no better way to enslave a people than to disarm them first.", 
        "reply": " What is \"that,\" that you agree with? That an armed people are a free people, or we have no right to Amend the Constitution? If you use force to prevent the people from exercising their will, then YOU are enslaving them. Dave", 
        "threadID": "5531905206_7070064812001", 
        "time": "2009-04-17 05:48:00", 
        "title": "Gun registration", 
        "userID": "Grachus"
    }
]