[
    {
        "content": "Okay shipmates. Sound off! I need some help with this one. I served eight years active duty in the Navy. After I got out the Navy, I married. This husband of mine has five kids and pay child support. Within the last two years, he fell behind and his ex wife took him to court and had a lein for child support placed on his credit report. I am thinking about going back into the military as a commissioned officer--I am not paying no one's child support...does the military make you pay your husband's child support debt?", 
        "intTime": 20090328, 
        "postID": 1, 
        "quote": "", 
        "reply": "Okay shipmates. Sound off! I need some help with this one. I served eight years active duty in the Navy. After I got out the Navy, I married. This husband of mine has five kids and pay child support. Within the last two years, he fell behind and his ex wife took him to court and had a lein for child support placed on his credit report. I am thinking about going back into the military as a commissioned officer--I am not paying no one's child support...does the military make you pay your husband's child support debt?", 
        "threadID": "5531905206_9690091912001", 
        "time": "2009-03-28 15:01:00", 
        "title": "Marriage question", 
        "userID": "katinausn"
    }, 
    {
        "content": "Good question. Bump. I'd like to see specific orders/laws, too if anyone can provide some.", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good question. Bump. I'd like to see specific orders/laws, too if anyone can provide some.", 
        "threadID": "5531905206_9690091912001", 
        "time": "2009-03-30 01:13:00", 
        "title": "Marriage question", 
        "userID": "cutterx2202"
    }, 
    {
        "content": "Not certain, but looking. I know that the military can make you pay your own child support, and as you are married, not engadged/dating I think that the same rules apply. Will let you kno if I can find out for certain.", 
        "intTime": 20090405, 
        "postID": 3, 
        "quote": "", 
        "reply": "Not certain, but looking. I know that the military can make you pay your own child support, and as you are married, not engadged/dating I think that the same rules apply. Will let you kno if I can find out for certain.", 
        "threadID": "5531905206_9690091912001", 
        "time": "2009-04-05 13:44:00", 
        "title": "Marriage question", 
        "userID": "CG_GunnersM8"
    }, 
    {
        "content": "The first thing you should find out is if these kids will be considered YOUR dependents. Dependency can be defined for purposes of joining the service, and also for BAH. The definitions may be different for each case. I would ask in the recruiter forum. If they are your dependents for purposes of joining the service, the Navy might not even let you in. According to this Navy Legal Service Office website (scroll down near the bottom under \"Military Support Regulations\"): quote: The Navy, Air Force and Coast Guard do not have the authority to order their service members to pay support, including child support. The policies established by the Navy, Air Force and Coast Guard serve as guidelines for counseling service members. If the service member fails to respond positively to counseling and initiate support it can have a negative effect on his or her career. Failure to provide support can result in a loss of Basic Allowance for Housing (BAH) for junior enlisted service members and the loss of the difference between BAH with dependents and BAH without dependents for senior enlisted and officers. Where the failure to provide support rises to the level that it brings discredit to the military service the service member may be punished. None of these actions results in the family member receiving support. There are also links on that website to each individual Service's specific regulations.", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "The Navy, Air Force and Coast Guard do not have the authority to order their service members to pay support, including child support. The policies established by the Navy, Air Force and Coast Guard serve as guidelines for counseling service members. If the service member fails to respond positively to counseling and initiate support it can have a negative effect on his or her career. Failure to provide support can result in a loss of Basic Allowance for Housing (BAH) for junior enlisted service members and the loss of the difference between BAH with dependents and BAH without dependents for senior enlisted and officers. Where the failure to provide support rises to the level that it brings discredit to the military service the service member may be punished. None of these actions results in the family member receiving support.", 
        "reply": "The first thing you should find out is if these kids will be considered YOUR dependents. Dependency can be defined for purposes of joining the service, and also for BAH. The definitions may be different for each case. I would ask in the recruiter forum. If they are your dependents for purposes of joining the service, the Navy might not even let you in. According to this Navy Legal Service Office website (scroll down near the bottom under \"Military Support Regulations\"):  There are also links on that website to each individual Service's specific regulations.", 
        "threadID": "5531905206_9690091912001", 
        "time": "2009-04-06 11:53:00", 
        "title": "Marriage question", 
        "userID": "92guru"
    }, 
    {
        "content": "I will ask wiggle into the Recruiter forum and ask there...I am just as confussed as I want to be. My hubby's child support issues are hideous not to mention that retarded ex wives!! Most states when purchasing homes, cars, etc. Consider his child support debt as my debt--debt/ratio factor. That drives me crazy...so, I may have to join as a DIVORCED woman becauase it is against my religion to pay someone else child support...I just hope he didn't marry me to do so--eeeek. Thanks shipmate", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "", 
        "reply": "I will ask wiggle into the Recruiter forum and ask there...I am just as confussed as I want to be. My hubby's child support issues are hideous not to mention that retarded ex wives!! Most states when purchasing homes, cars, etc. Consider his child support debt as my debt--debt/ratio factor. That drives me crazy...so, I may have to join as a DIVORCED woman becauase it is against my religion to pay someone else child support...I just hope he didn't marry me to do so--eeeek. Thanks shipmate", 
        "threadID": "5531905206_9690091912001", 
        "time": "2009-04-06 12:28:00", 
        "title": "Marriage question", 
        "userID": "katinausn"
    }
]