[
    {
        "content": "Part and parcel of hardline socialism is ECONOMIC isolationism (Kim Il Sung's juche or self-sufficiency), why is it that Cuba wants to trade ala NAFTA against which the Communist Party of USA has been opposed. How else can you argue with very irrational people. This message has been edited. Last edited by: kipfer, Wed 22 April 2009 03:46 AM", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "", 
        "reply": "Part and parcel of hardline socialism is ECONOMIC isolationism (Kim Il Sung's juche or self-sufficiency), why is it that Cuba wants to trade ala NAFTA against which the Communist Party of USA has been opposed. How else can you argue with very irrational people. This message has been edited. Last edited by: kipfer, Wed 22 April 2009 03:46 AM", 
        "threadID": "5531905206_4450056802001", 
        "time": "2009-04-21 12:35:00", 
        "title": "Recognize and Trade with Cuba!", 
        "userID": "kipfer"
    }, 
    {
        "content": "I didn't see any debate here on why NOT to recognize Cuba. Not my favorite country nor dictator, but it would seem reasonable to normalize relations with Cuba at this point.", 
        "intTime": 20090428, 
        "postID": 18, 
        "quote": "", 
        "reply": "I didn't see any debate here on why NOT to recognize Cuba. Not my favorite country nor dictator, but it would seem reasonable to normalize relations with Cuba at this point.", 
        "threadID": "5531905206_4450056802001", 
        "time": "2009-04-28 17:31:00", 
        "title": "Recognize and Trade with Cuba!", 
        "userID": "ropedope"
    }, 
    {
        "content": "quote: Originally posted by ropedope: I didn't see any debate here on why NOT to recognize Cuba. Not my favorite country nor dictator, but it would seem reasonable to normalize relations with Cuba at this point. The two brothers find each other antagonizing. One values communist principles. The other is giving hints that he wants to repent and open up the economy. Fidel wants to save his brother's skin from agitated members of the Communist Party of Cuba who fear 'loss of jobs'. Junior officers from both camps are restless. I agree with you but we have to protect Raul in case Fidel passes away. They're going to butcher him for the 'anomalies' that his brother did especially to a general whose only fault was saying \"you look sexy in that outfit,Fidel'. Protect Raul at all costs. He is a good asset for US and he's willing to repent unless some 'suicidal' communist hardline military officer attempts for a coup. Fidel is still alive. I wonder why three members of the Cuban parliament are emboldened to taunt the two brothers. Alarcon is one. I forgot the name of the other two. Much more if Fidel passes awayy.I am worried for Raul. So as not to antagonize the persons concerned and prove good faith, I suggest to the IT administrator to provide a geographical block on this lest I be accused of wrongful intentions which is not the case.... This message has been edited. Last edited by: kipfer, Wed 29 April 2009 08:43 AM", 
        "intTime": 20090429, 
        "postID": 19, 
        "quote": "Originally posted by ropedope: I didn't see any debate here on why NOT to recognize Cuba. Not my favorite country nor dictator, but it would seem reasonable to normalize relations with Cuba at this point.", 
        "reply": " The two brothers find each other antagonizing. One values communist principles. The other is giving hints that he wants to repent and open up the economy. Fidel wants to save his brother's skin from agitated members of the Communist Party of Cuba who fear 'loss of jobs'. Junior officers from both camps are restless. I agree with you but we have to protect Raul in case Fidel passes away. They're going to butcher him for the 'anomalies' that his brother did especially to a general whose only fault was saying \"you look sexy in that outfit,Fidel'. Protect Raul at all costs. He is a good asset for US and he's willing to repent unless some 'suicidal' communist hardline military officer attempts for a coup. Fidel is still alive. I wonder why three members of the Cuban parliament are emboldened to taunt the two brothers. Alarcon is one. I forgot the name of the other two. Much more if Fidel passes awayy.I am worried for Raul. So as not to antagonize the persons concerned and prove good faith, I suggest to the IT administrator to provide a geographical block on this lest I be accused of wrongful intentions which is not the case.... This message has been edited. Last edited by: kipfer, Wed 29 April 2009 08:43 AM", 
        "threadID": "5531905206_4450056802001", 
        "time": "2009-04-29 04:27:00", 
        "title": "Recognize and Trade with Cuba!", 
        "userID": "kipfer"
    }
]