[
    {
        "content": "Your Second Amendment Rights And Your Right to Privacy is in Danger to a Felon who Introduced a Bill that Not only Restrict's Your right to Own a Fire Arm But Also Invades Your Privacy, Please Don't Ignore this Message, Call Your Senatore, Call Your Representative Tell Them to Vote NO on House Resoulution 45. And Please Forward This to All You Know, Tell Everyone You Know. This Bill Will Make Law Abiding Citizens into Criminals. The Blair Holt's Firearm Licensing and Record of Sale Act (H.R. 45) is a bill pending in the 111th United States Congress. The bill was introduced on January 6, 2009 by Representative Bobby Rush of Illinois. In 1969, Bobby Rush, co-founder of the Illinois Black Panther Party, served six months in prison for felony possession of firearms. The main objective of the bill is to provide for stricter Gun Control. A person would be prohibited by law from possessing a firearm unless approved by a state-run system or having been issued a license that would have to be renewed every five years within thirty days of the expiration date. The Attorney General would set up a tracking system of all sales with dealers having to be licensed. Production figures of each licensed manufacturer would be made public. If passed, the bill would require all current handgun and semi-automatic firearms owners to become certified by the Attorney General within two years or risk losing their private property and/or be considered a \"criminal\" for possesion of a firearm without a license. H.R.45 Blair Holt's Firearm Licensing and Record of Sale Act of 2009 (Introduced in House) -------------------------------------------------------------------------------- January 6, 2009 Mr. RUSH introduced the following bill; which was referred to the Committee on the Judiciary -------------------------------------------------------------------------------- A BILL To provide for the implementation of a system of licensing for purchasers of certain firearms and for a record of sale system for those firearms, and for other purposes. Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, SECTION 1. SHORT TITLE; TABLE OF CONTENTS. (a) Short Title- This Act may be cited as `Blair Holt's Firearm Licensing and Record of Sale Act of 2009'. (b) Table of Contents- The table of contents for this Act is as follows: Sec. 1. Short title; table of contents. Sec. 2. Findings and purposes. Sec. 3. Definitions. TITLE I--LICENSING Sec. 101. Licensing requirement. Sec. 102. Application requirements. Sec. 103. Issuance of license. Sec. 104. Renewal of license. Sec. 105. Revocation of license. TITLE II--RECORD OF SALE OR TRANSFER Sec. 201. Sale or transfer requirements for qualifying firearms. Sec. 202. Firearm records. TITLE III--ADDITIONAL PROHIBITIONS Sec. 301. Universal background check requirement. Sec. 302. Failure to maintain or permit inspection of records. Sec. 303. Failure to report loss or theft of firearm. Sec. 304. Failure to provide notice of change of address. Sec. 305. Child access prevention. TITLE IV--ENFORCEMENT Sec. 401. Criminal penalties. Sec. 402. Regulations. Sec. 403. Inspections. Sec. 404. Orders. Sec. 405. Injunctive enforcement. TITLE V--FIREARM INJURY INFORMATION AND RESEARCH Sec. 501. Duties of the Attorney General. TITLE VI--EFFECT ON STATE LAW Sec. 601. Effect on State law. Sec. 602. Certification of State firearm licensing systems and State firearm record of sale systems. TITLE VII--RELATIONSHIP TO OTHER LAW Sec. 701. Subordination to Arms Export Control Act. TITLE VIII--INAPPLICABILITY Sec. 801. Inapplicability to governmental authorities. TITLE IX--EFFECTIVE DATE Sec. 901. Effective date of amendments. SEC. 2. FINDINGS AND PURPOSES. (a) Findings- Congress finds that-- (1) the manufacture, distribution, and importation of firearms is inherently commercial in nature; (2) firearms regularly move in interstate commerce; (3) to the extent that firearms trafficking is intrastate in nature, it arises out of and is substantially connected with a commercial transaction, which, when viewed in the aggregate, substantially affects interstate commerce; (4) because the intrastate and interstate trafficking of firearms are so commingled, full regulation of interstate commerce requires the incidental regulation of intrastate commerce; (5) gun violence in the United States is associated with the majority of homicides, over half the suicides, and two-thirds of non-fatal violent injuries; and (6) on the afternoon of May 10, 2007, Blair Holt, a junior at Julian High School in Chicago, was killed on a public bus riding home from school when he used his body to shield a girl who was in the line of fire after a young man boarded the bus and started shooting. (b) Sense of the Congress- It is the sense of the Congress that-- (1) firearms trafficking is prevalent and widespread in and among the States, and it is usually impossible to distinguish between intrastate trafficking and interstate trafficking; and (2) it is in the national interest and within the role of the Federal Government to ensure that the regulation of firearms is uniform among the States, that law enforcement can quickly and effectively trace firearms used in crime, and that firearms owners know how to use and safely store their firearms. (c) Purposes- The purposes of this Act and the amendments made by this Act are-- (1) to protect the public against the unreasonable risk of injury and death associated with the unrecorded sale or transfer of qualifying firearms to criminals and youth; (2) to ensure that owners of qualifying firearms are knowledgeable in the safe use, handling, and storage of those firearms; (3) to restrict the availability of qualifying firearms to criminals, youth, and other persons prohibited by Federal law from receiving firearms; and (4) to facilitate the tracing of qualifying firearms used in crime by Federal and State law enforcement agencies. SEC. 3. DEFINITIONS. (a) In General- In this Act: (1) FIREARM; LICENSED DEALER; LICENSED MANUFACTURER; STATE- The terms `firearm', `licensed dealer', `licensed manufacturer', and `State' have the meanings given those terms in section 921(a) of title 18, United States Code. (2) QUALIFYING FIREARM- The term `qualifying firearm' has the meaning given the term in section 921(a) of title 18, United States Code, as amended by subsection (b) of this section. (b) Amendment to Title 18, United States Code- Section 921(a) of title 18, United States Code, is amended by adding at the end the following: `(36) The term `qualifying firearm'-- `(A) means-- `(i) any handgun; or `(ii) any semiautomatic firearm that can accept any detachable ammunition feeding device; and `(B) does not include any antique.'. TITLE I--LICENSING SEC. 101. LICENSING REQUIREMENT. Section 922 of title 18, United States Code, is amended by adding at the end the following: `(aa) Firearm Licensing Requirement- `(1) IN GENERAL- It shall be unlawful for any person other than a licensed importer, licensed manufacturer, licensed dealer, or licensed collector to possess a qualifying firearm on or after the applicable date, unless that person has been issued a firearm license-- `(A) under title I of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, which license has not been invalidated or revoked under that title; or `(B) pursuant to a State firearm licensing and record of sale system certified under section 602 of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, which license has not been invalidated or revoked under State law. `(2) APPLICABLE DATE- In this subsection, the term `applicable date' means-- `(A) with respect to a qualifying firearm that is acquired by the person before the date of the enactment of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, 2 years after such date of enactment; and `(B) with respect to a qualifying firearm that is acquired by the person on or after the date of the enactment of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, 1 year after such date of enactment.'. SEC. 102. APPLICATION REQUIREMENTS. (a) In General- In order to be issued a firearm license under this title, an individual shall submit to the Attorney General (in accordance with the regulations promulgated under subsection (b)) an application, which shall include-- (1) a current, passport-sized photograph of the applicant that provides a clear, accurate likeness of the applicant; (2) the name, address, and date and place of birth of the applicant; (3) any other name that the applicant has ever used or by which the applicant has ever been known; (4) a clear thumb print of the applicant, which shall be made when, and in the presence of the entity to whom, the application is submitted; (5) with respect to each category of person prohibited by Federal law, or by the law of the State of residence of the applicant, from obtaining a firearm, a statement that the individual is not a person prohibited from obtaining a firearm; (6) a certification by the applicant that the applicant will keep any firearm owned by the applicant safely stored and out of the possession of persons who have not attained 18 years of age; (7) a certificate attesting to the completion at the time of application of a written firearms examination, which shall test the knowledge and ability of the applicant regarding-- (A) the safe storage of firearms, particularly in the vicinity of persons who have not attained 18 years of age; (B) the safe handling of firearms; (C) the use of firearms in the home and the risks associated with such use; (D) the legal responsibilities of firearms owners, including Federal, State, and local laws relating to requirements for the possession and storage of firearms, and relating to reporting requirements with respect to firearms; and (E) any other subjects, as the Attorney General determines to be appropriate; (8) an authorization by the applicant to release to the Attorney General or an authorized representative of the Attorney General any mental health records pertaining to the applicant; (9) the date on which the application was submitted; and (10) the signature of the applicant. (b) Regulations Governing Submission- The Attorney General shall promulgate regulations specifying procedures for the submission of applications to the Attorney General under this section, which regulations shall-- (1) provide for submission of the application through a licensed dealer or an office or agency of the Federal Government designated by the Attorney General; (2) require the applicant to provide a valid identification document (as defined in section 1028(d)(2) of title 18, United States Code) of the applicant, containing a photograph of the applicant, to the licensed dealer or to the office or agency of the Federal Government, as applicable, at the time of submission of the application to that dealer, office, or agency; and (3) require that a completed application be forwarded to the Attorney General not later than 48 hours after the application is submitted to the licensed dealer or office or agency of the Federal Government, as applicable. (c) Fees- (1) IN GENERAL- The Attorney General shall charge and collect from each applicant for a license under this title a fee in an amount determined in accordance with paragraph (2). (2) FEE AMOUNT- The amount of the fee collected under this subsection shall be not less than the amount determined by the Attorney General to be necessary to ensure that the total amount of all fees collected under this subsection during a fiscal year is sufficient to cover the costs of carrying out this title during that fiscal year, except that such amount shall not exceed $25. SEC. 103. ISSUANCE OF LICENSE. (a) In General- The Attorney General shall issue a firearm license to an applicant who has submitted an application that meets the requirements of section 102 of this Act, if the Attorney General ascertains that the individual is not prohibited by subsection (g) or (n) of section 922 of title 18, United States Code, from receiving a firearm. (b) Effect of Issuance to Prohibited Person- A firearm license issued under this section shall be null and void if issued to a person who is prohibited by subsection (g) or (n) of section 922 of title 18, United States Code, from receiving a firearm. (c) Form of License- A firearm license issued under this section shall be in the form of a tamper-resistant card, and shall include-- (1) the photograph of the licensed individual submitted with the application; (2) the address of the licensed individual; (3) the date of birth of the licensed individual; (4) a license number, unique to each licensed individual; (5) the expiration date of the license, which shall be the date that is 5 years after the initial anniversary of the date of birth of the licensed individual following the date on which the license is issued (or in the case of a license renewal, following the date on which the license is renewed under section 104); (6) the signature of the licensed individual provided on the application, or a facsimile of the application; and (7) centered at the top of the license, capitalized, and in boldface type, the following: `FIREARM LICENSE--NOT VALID FOR ANY OTHER PURPOSE'. SEC. 104. RENEWAL OF LICENSE. (a) Application for Renewal- (1) IN GENERAL- In order to renew a firearm license issued under this title, not later than 30 days before the expiration date of the license, the licensed individual shall submit to the Attorney General (in accordance with the regulations promulgated under paragraph (3)), in a form approved by the Attorney General, an application for renewal of the license. (2) CONTENTS- An application submitted under paragraph (1) shall include-- (A) a current, passport-sized photograph of the applicant that provides a clear, accurate likeness of the applicant; (B) current proof of identity of the licensed individual; and (C) the address of the licensed individual. (3) REGULATIONS GOVERNING SUBMISSION- The Attorney General shall promulgate regulations specifying procedures for the submission of applications under this subsection. (b) Issuance of Renewed License- Upon approval of an application submitted under subsection (a) of this section, the Attorney General shall issue a renewed license, which shall meet the requirements of section 103(c), except that the license shall include the current photograph and address of the licensed individual, as provided in the application submitted under this section, and the expiration date of the renewed license, as provided in section 103(c)(5). SEC. 105. REVOCATION OF LICENSE. (a) In General- If an individual to whom a license has been issued under this title subsequently becomes a person who is prohibited by subsection (g) or (n) of section 922 of title 18, United States Code, from receiving a firearm-- (1) the license is revoked; and (2) the individual shall promptly return the license to the Attorney General. (b) Administrative Action- Upon receipt by the Attorney General of notice that an individual to whom a license has been issued under this title has become a person described in subsection (a), the Attorney General shall ensure that the individual promptly returns the license to the Attorney General. TITLE II--RECORD OF SALE OR TRANSFER SEC. 201. SALE OR TRANSFER REQUIREMENTS FOR QUALIFYING FIREARMS. Section 922 of title 18, United States Code, as amended by section 101 of this Act, is amended by adding at the end the following: `(bb) Unauthorized Sale or Transfer of a Qualifying Firearm- It shall be unlawful for any person to sell, deliver, or otherwise transfer a qualifying firearm to, or for, any person who is not a licensed importer, licensed manufacturer, licensed dealer, or licensed collector, or to receive a qualifying firearm from a person who is not a licensed importer, licensed manufacturer, licensed dealer, or licensed collector, unless, at the time and place of the transfer or receipt-- `(1) the transferee presents to a licensed dealer a valid firearm license issued to the transferee-- `(A) under title I of Blair Holt's Firearm Licensing and Record of Sale Act of 2009; or `(B) pursuant to a State firearm licensing and record of sale system certified under section 602 of Blair Holt's Firearm Licensing and Record of Sale Act of 2009 established by the State in which the transfer or receipt occurs; `(2) the licensed dealer contacts the Attorney General or the head of the State agency that administers the certified system described in paragraph (1)(B), as applicable, and receives notice that the transferee has been issued a firearm license described in paragraph (1) and that the license remains valid; and `(3) the licensed dealer records on a document (which, in the case of a sale, shall be the sales receipt) a tracking authorization number provided by the Attorney General or the head of the State agency, as applicable, as evidence that the licensed dealer has verified the validity of the license.'. SEC. 202. FIREARM RECORDS. (a) Submission of Sale or Transfer Reports- Not later than 14 days after the date on which the transfer of qualifying firearm is processed by a licensed dealer under section 922(bb) of title 18, United States Code (as added by section 201 of this Act), the licensed dealer shall submit to the Attorney General (or, in the case of a licensed dealer located in a State that has a State firearm licensing and record of sale system certified under section 602 of this Act, to the head of the State agency that administers that system) a report of that transfer, which shall include information relating to-- (1) the manufacturer of the firearm; (2) the model name or number of the firearm; (3) the serial number of the firearm; (4) the date on which the firearm was received by the transferee; (5) the number of a valid firearm license issued to the transferee under title I of this Act; and (6) the name and address of the individual who transferred the firearm to the transferee. (b) Federal Record of Sale System- Not later than 9 months after the date of the enactment of this Act, the Attorney General shall establish and maintain a Federal record of sale system, which shall include the information included in each report submitted to the Attorney General under subsection (a). (c) Elimination of Prohibition on Establishment of System of Registration- Section 926(a) of title 18, United States Code, is amended by striking the second sentence. TITLE III--ADDITIONAL PROHIBITIONS SEC. 301. UNIVERSAL BACKGROUND CHECK REQUIREMENT. Section 922 of title 18, United States Code, as amended by sections 101 and 201 of this Act, is amended by adding at the end the following: `(cc) Universal Background Check Requirement- `(1) REQUIREMENT- Except as provided in paragraph (2), it shall be unlawful for any person other than a licensed importer, licensed manufacturer, licensed dealer, or licensed collector to sell, deliver, or otherwise transfer a firearm to any person other than such a licensee, unless the transfer is processed through a licensed dealer in accordance with subsection (t). `(2) EXCEPTION- Paragraph (1) shall not apply to the infrequent transfer of a firearm by gift, bequest, intestate succession or other means by an individual to a parent, child, grandparent, or grandchild of the individual, or to any loan of a firearm for any lawful purpose for not more than 30 days between persons who are personally known to each other.'. Thanks, Jason", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "Your Second Amendment Rights And Your Right to Privacy is in Danger to a Felon who Introduced a Bill that Not only Restrict's Your right to Own a Fire Arm But Also Invades Your Privacy, Please Don't Ignore this Message, Call Your Senatore, Call Your Representative Tell Them to Vote NO on House Resoulution 45. And Please Forward This to All You Know, Tell Everyone You Know. This Bill Will Make Law Abiding Citizens into Criminals. The Blair Holt's Firearm Licensing and Record of Sale Act (H.R. 45) is a bill pending in the 111th United States Congress. The bill was introduced on January 6, 2009 by Representative Bobby Rush of Illinois. In 1969, Bobby Rush, co-founder of the Illinois Black Panther Party, served six months in prison for felony possession of firearms. The main objective of the bill is to provide for stricter Gun Control. A person would be prohibited by law from possessing a firearm unless approved by a state-run system or having been issued a license that would have to be renewed every five years within thirty days of the expiration date. The Attorney General would set up a tracking system of all sales with dealers having to be licensed. Production figures of each licensed manufacturer would be made public. If passed, the bill would require all current handgun and semi-automatic firearms owners to become certified by the Attorney General within two years or risk losing their private property and/or be considered a \"criminal\" for possesion of a firearm without a license. H.R.45 Blair Holt's Firearm Licensing and Record of Sale Act of 2009 (Introduced in House) -------------------------------------------------------------------------------- January 6, 2009 Mr. RUSH introduced the following bill; which was referred to the Committee on the Judiciary -------------------------------------------------------------------------------- A BILL To provide for the implementation of a system of licensing for purchasers of certain firearms and for a record of sale system for those firearms, and for other purposes. Be it enacted by the Senate and House of Representatives of the United States of America in Congress assembled, SECTION 1. SHORT TITLE; TABLE OF CONTENTS. (a) Short Title- This Act may be cited as `Blair Holt's Firearm Licensing and Record of Sale Act of 2009'. (b) Table of Contents- The table of contents for this Act is as follows: Sec. 1. Short title; table of contents. Sec. 2. Findings and purposes. Sec. 3. Definitions. TITLE I--LICENSING Sec. 101. Licensing requirement. Sec. 102. Application requirements. Sec. 103. Issuance of license. Sec. 104. Renewal of license. Sec. 105. Revocation of license. TITLE II--RECORD OF SALE OR TRANSFER Sec. 201. Sale or transfer requirements for qualifying firearms. Sec. 202. Firearm records. TITLE III--ADDITIONAL PROHIBITIONS Sec. 301. Universal background check requirement. Sec. 302. Failure to maintain or permit inspection of records. Sec. 303. Failure to report loss or theft of firearm. Sec. 304. Failure to provide notice of change of address. Sec. 305. Child access prevention. TITLE IV--ENFORCEMENT Sec. 401. Criminal penalties. Sec. 402. Regulations. Sec. 403. Inspections. Sec. 404. Orders. Sec. 405. Injunctive enforcement. TITLE V--FIREARM INJURY INFORMATION AND RESEARCH Sec. 501. Duties of the Attorney General. TITLE VI--EFFECT ON STATE LAW Sec. 601. Effect on State law. Sec. 602. Certification of State firearm licensing systems and State firearm record of sale systems. TITLE VII--RELATIONSHIP TO OTHER LAW Sec. 701. Subordination to Arms Export Control Act. TITLE VIII--INAPPLICABILITY Sec. 801. Inapplicability to governmental authorities. TITLE IX--EFFECTIVE DATE Sec. 901. Effective date of amendments. SEC. 2. FINDINGS AND PURPOSES. (a) Findings- Congress finds that-- (1) the manufacture, distribution, and importation of firearms is inherently commercial in nature; (2) firearms regularly move in interstate commerce; (3) to the extent that firearms trafficking is intrastate in nature, it arises out of and is substantially connected with a commercial transaction, which, when viewed in the aggregate, substantially affects interstate commerce; (4) because the intrastate and interstate trafficking of firearms are so commingled, full regulation of interstate commerce requires the incidental regulation of intrastate commerce; (5) gun violence in the United States is associated with the majority of homicides, over half the suicides, and two-thirds of non-fatal violent injuries; and (6) on the afternoon of May 10, 2007, Blair Holt, a junior at Julian High School in Chicago, was killed on a public bus riding home from school when he used his body to shield a girl who was in the line of fire after a young man boarded the bus and started shooting. (b) Sense of the Congress- It is the sense of the Congress that-- (1) firearms trafficking is prevalent and widespread in and among the States, and it is usually impossible to distinguish between intrastate trafficking and interstate trafficking; and (2) it is in the national interest and within the role of the Federal Government to ensure that the regulation of firearms is uniform among the States, that law enforcement can quickly and effectively trace firearms used in crime, and that firearms owners know how to use and safely store their firearms. (c) Purposes- The purposes of this Act and the amendments made by this Act are-- (1) to protect the public against the unreasonable risk of injury and death associated with the unrecorded sale or transfer of qualifying firearms to criminals and youth; (2) to ensure that owners of qualifying firearms are knowledgeable in the safe use, handling, and storage of those firearms; (3) to restrict the availability of qualifying firearms to criminals, youth, and other persons prohibited by Federal law from receiving firearms; and (4) to facilitate the tracing of qualifying firearms used in crime by Federal and State law enforcement agencies. SEC. 3. DEFINITIONS. (a) In General- In this Act: (1) FIREARM; LICENSED DEALER; LICENSED MANUFACTURER; STATE- The terms `firearm', `licensed dealer', `licensed manufacturer', and `State' have the meanings given those terms in section 921(a) of title 18, United States Code. (2) QUALIFYING FIREARM- The term `qualifying firearm' has the meaning given the term in section 921(a) of title 18, United States Code, as amended by subsection (b) of this section. (b) Amendment to Title 18, United States Code- Section 921(a) of title 18, United States Code, is amended by adding at the end the following: `(36) The term `qualifying firearm'-- `(A) means-- `(i) any handgun; or `(ii) any semiautomatic firearm that can accept any detachable ammunition feeding device; and `(B) does not include any antique.'. TITLE I--LICENSING SEC. 101. LICENSING REQUIREMENT. Section 922 of title 18, United States Code, is amended by adding at the end the following: `(aa) Firearm Licensing Requirement- `(1) IN GENERAL- It shall be unlawful for any person other than a licensed importer, licensed manufacturer, licensed dealer, or licensed collector to possess a qualifying firearm on or after the applicable date, unless that person has been issued a firearm license-- `(A) under title I of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, which license has not been invalidated or revoked under that title; or `(B) pursuant to a State firearm licensing and record of sale system certified under section 602 of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, which license has not been invalidated or revoked under State law. `(2) APPLICABLE DATE- In this subsection, the term `applicable date' means-- `(A) with respect to a qualifying firearm that is acquired by the person before the date of the enactment of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, 2 years after such date of enactment; and `(B) with respect to a qualifying firearm that is acquired by the person on or after the date of the enactment of Blair Holt's Firearm Licensing and Record of Sale Act of 2009, 1 year after such date of enactment.'. SEC. 102. APPLICATION REQUIREMENTS. (a) In General- In order to be issued a firearm license under this title, an individual shall submit to the Attorney General (in accordance with the regulations promulgated under subsection (b)) an application, which shall include-- (1) a current, passport-sized photograph of the applicant that provides a clear, accurate likeness of the applicant; (2) the name, address, and date and place of birth of the applicant; (3) any other name that the applicant has ever used or by which the applicant has ever been known; (4) a clear thumb print of the applicant, which shall be made when, and in the presence of the entity to whom, the application is submitted; (5) with respect to each category of person prohibited by Federal law, or by the law of the State of residence of the applicant, from obtaining a firearm, a statement that the individual is not a person prohibited from obtaining a firearm; (6) a certification by the applicant that the applicant will keep any firearm owned by the applicant safely stored and out of the possession of persons who have not attained 18 years of age; (7) a certificate attesting to the completion at the time of application of a written firearms examination, which shall test the knowledge and ability of the applicant regarding-- (A) the safe storage of firearms, particularly in the vicinity of persons who have not attained 18 years of age; (B) the safe handling of firearms; (C) the use of firearms in the home and the risks associated with such use; (D) the legal responsibilities of firearms owners, including Federal, State, and local laws relating to requirements for the possession and storage of firearms, and relating to reporting requirements with respect to firearms; and (E) any other subjects, as the Attorney General determines to be appropriate; (8) an authorization by the applicant to release to the Attorney General or an authorized representative of the Attorney General any mental health records pertaining to the applicant; (9) the date on which the application was submitted; and (10) the signature of the applicant. (b) Regulations Governing Submission- The Attorney General shall promulgate regulations specifying procedures for the submission of applications to the Attorney General under this section, which regulations shall-- (1) provide for submission of the application through a licensed dealer or an office or agency of the Federal Government designated by the Attorney General; (2) require the applicant to provide a valid identification document (as defined in section 1028(d)(2) of title 18, United States Code) of the applicant, containing a photograph of the applicant, to the licensed dealer or to the office or agency of the Federal Government, as applicable, at the time of submission of the application to that dealer, office, or agency; and (3) require that a completed application be forwarded to the Attorney General not later than 48 hours after the application is submitted to the licensed dealer or office or agency of the Federal Government, as applicable. (c) Fees- (1) IN GENERAL- The Attorney General shall charge and collect from each applicant for a license under this title a fee in an amount determined in accordance with paragraph (2). (2) FEE AMOUNT- The amount of the fee collected under this subsection shall be not less than the amount determined by the Attorney General to be necessary to ensure that the total amount of all fees collected under this subsection during a fiscal year is sufficient to cover the costs of carrying out this title during that fiscal year, except that such amount shall not exceed $25. SEC. 103. ISSUANCE OF LICENSE. (a) In General- The Attorney General shall issue a firearm license to an applicant who has submitted an application that meets the requirements of section 102 of this Act, if the Attorney General ascertains that the individual is not prohibited by subsection (g) or (n) of section 922 of title 18, United States Code, from receiving a firearm. (b) Effect of Issuance to Prohibited Person- A firearm license issued under this section shall be null and void if issued to a person who is prohibited by subsection (g) or (n) of section 922 of title 18, United States Code, from receiving a firearm. (c) Form of License- A firearm license issued under this section shall be in the form of a tamper-resistant card, and shall include-- (1) the photograph of the licensed individual submitted with the application; (2) the address of the licensed individual; (3) the date of birth of the licensed individual; (4) a license number, unique to each licensed individual; (5) the expiration date of the license, which shall be the date that is 5 years after the initial anniversary of the date of birth of the licensed individual following the date on which the license is issued (or in the case of a license renewal, following the date on which the license is renewed under section 104); (6) the signature of the licensed individual provided on the application, or a facsimile of the application; and (7) centered at the top of the license, capitalized, and in boldface type, the following: `FIREARM LICENSE--NOT VALID FOR ANY OTHER PURPOSE'. SEC. 104. RENEWAL OF LICENSE. (a) Application for Renewal- (1) IN GENERAL- In order to renew a firearm license issued under this title, not later than 30 days before the expiration date of the license, the licensed individual shall submit to the Attorney General (in accordance with the regulations promulgated under paragraph (3)), in a form approved by the Attorney General, an application for renewal of the license. (2) CONTENTS- An application submitted under paragraph (1) shall include-- (A) a current, passport-sized photograph of the applicant that provides a clear, accurate likeness of the applicant; (B) current proof of identity of the licensed individual; and (C) the address of the licensed individual. (3) REGULATIONS GOVERNING SUBMISSION- The Attorney General shall promulgate regulations specifying procedures for the submission of applications under this subsection. (b) Issuance of Renewed License- Upon approval of an application submitted under subsection (a) of this section, the Attorney General shall issue a renewed license, which shall meet the requirements of section 103(c), except that the license shall include the current photograph and address of the licensed individual, as provided in the application submitted under this section, and the expiration date of the renewed license, as provided in section 103(c)(5). SEC. 105. REVOCATION OF LICENSE. (a) In General- If an individual to whom a license has been issued under this title subsequently becomes a person who is prohibited by subsection (g) or (n) of section 922 of title 18, United States Code, from receiving a firearm-- (1) the license is revoked; and (2) the individual shall promptly return the license to the Attorney General. (b) Administrative Action- Upon receipt by the Attorney General of notice that an individual to whom a license has been issued under this title has become a person described in subsection (a), the Attorney General shall ensure that the individual promptly returns the license to the Attorney General. TITLE II--RECORD OF SALE OR TRANSFER SEC. 201. SALE OR TRANSFER REQUIREMENTS FOR QUALIFYING FIREARMS. Section 922 of title 18, United States Code, as amended by section 101 of this Act, is amended by adding at the end the following: `(bb) Unauthorized Sale or Transfer of a Qualifying Firearm- It shall be unlawful for any person to sell, deliver, or otherwise transfer a qualifying firearm to, or for, any person who is not a licensed importer, licensed manufacturer, licensed dealer, or licensed collector, or to receive a qualifying firearm from a person who is not a licensed importer, licensed manufacturer, licensed dealer, or licensed collector, unless, at the time and place of the transfer or receipt-- `(1) the transferee presents to a licensed dealer a valid firearm license issued to the transferee-- `(A) under title I of Blair Holt's Firearm Licensing and Record of Sale Act of 2009; or `(B) pursuant to a State firearm licensing and record of sale system certified under section 602 of Blair Holt's Firearm Licensing and Record of Sale Act of 2009 established by the State in which the transfer or receipt occurs; `(2) the licensed dealer contacts the Attorney General or the head of the State agency that administers the certified system described in paragraph (1)(B), as applicable, and receives notice that the transferee has been issued a firearm license described in paragraph (1) and that the license remains valid; and `(3) the licensed dealer records on a document (which, in the case of a sale, shall be the sales receipt) a tracking authorization number provided by the Attorney General or the head of the State agency, as applicable, as evidence that the licensed dealer has verified the validity of the license.'. SEC. 202. FIREARM RECORDS. (a) Submission of Sale or Transfer Reports- Not later than 14 days after the date on which the transfer of qualifying firearm is processed by a licensed dealer under section 922(bb) of title 18, United States Code (as added by section 201 of this Act), the licensed dealer shall submit to the Attorney General (or, in the case of a licensed dealer located in a State that has a State firearm licensing and record of sale system certified under section 602 of this Act, to the head of the State agency that administers that system) a report of that transfer, which shall include information relating to-- (1) the manufacturer of the firearm; (2) the model name or number of the firearm; (3) the serial number of the firearm; (4) the date on which the firearm was received by the transferee; (5) the number of a valid firearm license issued to the transferee under title I of this Act; and (6) the name and address of the individual who transferred the firearm to the transferee. (b) Federal Record of Sale System- Not later than 9 months after the date of the enactment of this Act, the Attorney General shall establish and maintain a Federal record of sale system, which shall include the information included in each report submitted to the Attorney General under subsection (a). (c) Elimination of Prohibition on Establishment of System of Registration- Section 926(a) of title 18, United States Code, is amended by striking the second sentence. TITLE III--ADDITIONAL PROHIBITIONS SEC. 301. UNIVERSAL BACKGROUND CHECK REQUIREMENT. Section 922 of title 18, United States Code, as amended by sections 101 and 201 of this Act, is amended by adding at the end the following: `(cc) Universal Background Check Requirement- `(1) REQUIREMENT- Except as provided in paragraph (2), it shall be unlawful for any person other than a licensed importer, licensed manufacturer, licensed dealer, or licensed collector to sell, deliver, or otherwise transfer a firearm to any person other than such a licensee, unless the transfer is processed through a licensed dealer in accordance with subsection (t). `(2) EXCEPTION- Paragraph (1) shall not apply to the infrequent transfer of a firearm by gift, bequest, intestate succession or other means by an individual to a parent, child, grandparent, or grandchild of the individual, or to any loan of a firearm for any lawful purpose for not more than 30 days between persons who are personally known to each other.'. Thanks, Jason", 
        "threadID": "5531905206_1730045712001", 
        "time": "2009-03-11 09:11:00", 
        "title": "Please Read, Kinda Long, But Worth Your Time", 
        "userID": "11538325"
    }, 
    {
        "content": "quote: Originally posted by 11538325: Your Second Amendment Rights And Your Right to Privacy is in Danger to a Felon who Introduced a Bill that Not only Restrict's Your right to Own a Fire Arm But Also Invades Your Privacy, (snip) Thanks, Jason This patently UnConstitutional Bill is going no where. It violates a heck of a lot more than the Second Amendment. The bill is so dead in the water, that a search of the NRA site produced no hits. Any nutjob that is a member of Congress can introduce whatever they want. The problem is not with \"this\" bill, but the so called \"moderate\" ban on \"assault\" rifles. Dave", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "Originally posted by 11538325: Your Second Amendment Rights And Your Right to Privacy is in Danger to a Felon who Introduced a Bill that Not only Restrict's Your right to Own a Fire Arm But Also Invades Your Privacy, (snip) Thanks, Jason", 
        "reply": " This patently UnConstitutional Bill is going no where. It violates a heck of a lot more than the Second Amendment. The bill is so dead in the water, that a search of the NRA site produced no hits. Any nutjob that is a member of Congress can introduce whatever they want. The problem is not with \"this\" bill, but the so called \"moderate\" ban on \"assault\" rifles. Dave", 
        "threadID": "5531905206_1730045712001", 
        "time": "2009-03-11 10:37:00", 
        "title": "Please Read, Kinda Long, But Worth Your Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "You Never Know with the Ultra-Liberal Wackos that we Have in Congress", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "You Never Know with the Ultra-Liberal Wackos that we Have in Congress", 
        "threadID": "5531905206_1730045712001", 
        "time": "2009-03-11 11:23:00", 
        "title": "Please Read, Kinda Long, But Worth Your Time", 
        "userID": "11538325"
    }, 
    {
        "content": "quote: Originally posted by 11538325: You Never Know with the Ultra-Liberal Wackos that we Have in Congress My favorite Senator, the \"Ultra-Liberal,\" Russ Feingold opposes the assualt rifle ban. Dave", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by 11538325: You Never Know with the Ultra-Liberal Wackos that we Have in Congress", 
        "reply": " My favorite Senator, the \"Ultra-Liberal,\" Russ Feingold opposes the assualt rifle ban. Dave", 
        "threadID": "5531905206_1730045712001", 
        "time": "2009-03-11 11:51:00", 
        "title": "Please Read, Kinda Long, But Worth Your Time", 
        "userID": "Grachus"
    }
]