[
    {
        "content": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "intTime": 20090429, 
        "postID": 2, 
        "quote": "", 
        "reply": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:08:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. You should be urging Hannity to take Olbermann's offer then. Walt", 
        "intTime": 20090429, 
        "postID": 3, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " You should be urging Hannity to take Olbermann's offer then. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "intTime": 20090429, 
        "postID": 4, 
        "quote": "", 
        "reply": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "intTime": 20090429, 
        "postID": 5, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "intTime": 20090429, 
        "postID": 6, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090429, 
        "postID": 7, 
        "quote": "", 
        "reply": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "intTime": 20090429, 
        "postID": 8, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:20:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "intTime": 20090429, 
        "postID": 9, 
        "quote": "", 
        "reply": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:59:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced. Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "intTime": 20090429, 
        "postID": 10, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "reply": " Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "intTime": 20090429, 
        "postID": 11, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear.", 
        "reply": " That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:10:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "intTime": 20090429, 
        "postID": 12, 
        "quote": "", 
        "reply": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "intTime": 20090429, 
        "postID": 13, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "reply": " If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:17:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "intTime": 20090429, 
        "postID": 14, 
        "quote": "", 
        "reply": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show. lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "intTime": 20090429, 
        "postID": 15, 
        "quote": "Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "reply": " lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:34:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "intTime": 20090429, 
        "postID": 16, 
        "quote": "", 
        "reply": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:41:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "intTime": 20090429, 
        "postID": 17, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "reply": " What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:43:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\" In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "intTime": 20090429, 
        "postID": 18, 
        "quote": "Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "reply": " In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:44:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "intTime": 20090429, 
        "postID": 19, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "reply": " Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:45:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Olberdonkey is all flatulence!", 
        "intTime": 20090429, 
        "postID": 20, 
        "quote": "", 
        "reply": "Olberdonkey is all flatulence!", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 08:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "EAG154"
    }, 
    {
        "content": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "intTime": 20090429, 
        "postID": 21, 
        "quote": "", 
        "reply": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "intTime": 20090429, 
        "postID": 22, 
        "quote": "", 
        "reply": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:08:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. You should be urging Hannity to take Olbermann's offer then. Walt", 
        "intTime": 20090429, 
        "postID": 23, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " You should be urging Hannity to take Olbermann's offer then. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "intTime": 20090429, 
        "postID": 24, 
        "quote": "", 
        "reply": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "intTime": 20090429, 
        "postID": 25, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "intTime": 20090429, 
        "postID": 26, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090429, 
        "postID": 27, 
        "quote": "", 
        "reply": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "intTime": 20090429, 
        "postID": 28, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:20:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "intTime": 20090429, 
        "postID": 29, 
        "quote": "", 
        "reply": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:59:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced. Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "intTime": 20090429, 
        "postID": 30, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "reply": " Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "intTime": 20090429, 
        "postID": 31, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear.", 
        "reply": " That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:10:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "intTime": 20090429, 
        "postID": 32, 
        "quote": "", 
        "reply": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "intTime": 20090429, 
        "postID": 33, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "reply": " If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:17:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "intTime": 20090429, 
        "postID": 34, 
        "quote": "", 
        "reply": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show. lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "intTime": 20090429, 
        "postID": 35, 
        "quote": "Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "reply": " lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:34:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "intTime": 20090429, 
        "postID": 36, 
        "quote": "", 
        "reply": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:41:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "intTime": 20090429, 
        "postID": 37, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "reply": " What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:43:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\" In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "intTime": 20090429, 
        "postID": 38, 
        "quote": "Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "reply": " In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:44:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "intTime": 20090429, 
        "postID": 39, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "reply": " Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:45:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Olberdonkey is all flatulence!", 
        "intTime": 20090429, 
        "postID": 40, 
        "quote": "", 
        "reply": "Olberdonkey is all flatulence!", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 08:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "EAG154"
    }, 
    {
        "content": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "intTime": 20090429, 
        "postID": 41, 
        "quote": "", 
        "reply": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "intTime": 20090429, 
        "postID": 42, 
        "quote": "", 
        "reply": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:08:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. You should be urging Hannity to take Olbermann's offer then. Walt", 
        "intTime": 20090429, 
        "postID": 43, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " You should be urging Hannity to take Olbermann's offer then. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "intTime": 20090429, 
        "postID": 44, 
        "quote": "", 
        "reply": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "intTime": 20090429, 
        "postID": 45, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "intTime": 20090429, 
        "postID": 46, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090429, 
        "postID": 47, 
        "quote": "", 
        "reply": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "intTime": 20090429, 
        "postID": 48, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:20:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "intTime": 20090429, 
        "postID": 49, 
        "quote": "", 
        "reply": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:59:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced. Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "intTime": 20090429, 
        "postID": 50, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "reply": " Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "intTime": 20090429, 
        "postID": 51, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear.", 
        "reply": " That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:10:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "intTime": 20090429, 
        "postID": 52, 
        "quote": "", 
        "reply": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "intTime": 20090429, 
        "postID": 53, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "reply": " If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:17:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "intTime": 20090429, 
        "postID": 54, 
        "quote": "", 
        "reply": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show. lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "intTime": 20090429, 
        "postID": 55, 
        "quote": "Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "reply": " lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:34:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "intTime": 20090429, 
        "postID": 56, 
        "quote": "", 
        "reply": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:41:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "intTime": 20090429, 
        "postID": 57, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "reply": " What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:43:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\" In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "intTime": 20090429, 
        "postID": 58, 
        "quote": "Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "reply": " In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:44:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "intTime": 20090429, 
        "postID": 59, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "reply": " Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:45:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Olberdonkey is all flatulence!", 
        "intTime": 20090429, 
        "postID": 60, 
        "quote": "", 
        "reply": "Olberdonkey is all flatulence!", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 08:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "EAG154"
    }, 
    {
        "content": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "intTime": 20090429, 
        "postID": 61, 
        "quote": "", 
        "reply": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "intTime": 20090429, 
        "postID": 62, 
        "quote": "", 
        "reply": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:08:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. You should be urging Hannity to take Olbermann's offer then. Walt", 
        "intTime": 20090429, 
        "postID": 63, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " You should be urging Hannity to take Olbermann's offer then. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "intTime": 20090429, 
        "postID": 64, 
        "quote": "", 
        "reply": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "intTime": 20090429, 
        "postID": 65, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "intTime": 20090429, 
        "postID": 66, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090429, 
        "postID": 67, 
        "quote": "", 
        "reply": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "intTime": 20090429, 
        "postID": 68, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:20:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "intTime": 20090429, 
        "postID": 69, 
        "quote": "", 
        "reply": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:59:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced. Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "intTime": 20090429, 
        "postID": 70, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "reply": " Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "intTime": 20090429, 
        "postID": 71, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear.", 
        "reply": " That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:10:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "intTime": 20090429, 
        "postID": 72, 
        "quote": "", 
        "reply": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "intTime": 20090429, 
        "postID": 73, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "reply": " If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:17:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "intTime": 20090429, 
        "postID": 74, 
        "quote": "", 
        "reply": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show. lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "intTime": 20090429, 
        "postID": 75, 
        "quote": "Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "reply": " lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:34:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "intTime": 20090429, 
        "postID": 76, 
        "quote": "", 
        "reply": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:41:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "intTime": 20090429, 
        "postID": 77, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "reply": " What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:43:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\" In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "intTime": 20090429, 
        "postID": 78, 
        "quote": "Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "reply": " In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:44:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "intTime": 20090429, 
        "postID": 79, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "reply": " Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:45:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Olberdonkey is all flatulence!", 
        "intTime": 20090429, 
        "postID": 80, 
        "quote": "", 
        "reply": "Olberdonkey is all flatulence!", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 08:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "EAG154"
    }, 
    {
        "content": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "intTime": 20090429, 
        "postID": 81, 
        "quote": "", 
        "reply": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "intTime": 20090429, 
        "postID": 82, 
        "quote": "", 
        "reply": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:08:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. You should be urging Hannity to take Olbermann's offer then. Walt", 
        "intTime": 20090429, 
        "postID": 83, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " You should be urging Hannity to take Olbermann's offer then. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "intTime": 20090429, 
        "postID": 84, 
        "quote": "", 
        "reply": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "intTime": 20090429, 
        "postID": 85, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "intTime": 20090429, 
        "postID": 86, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090429, 
        "postID": 87, 
        "quote": "", 
        "reply": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "intTime": 20090429, 
        "postID": 88, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:20:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "intTime": 20090429, 
        "postID": 89, 
        "quote": "", 
        "reply": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:59:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced. Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "intTime": 20090429, 
        "postID": 90, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "reply": " Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "intTime": 20090429, 
        "postID": 91, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear.", 
        "reply": " That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:10:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "intTime": 20090429, 
        "postID": 92, 
        "quote": "", 
        "reply": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "intTime": 20090429, 
        "postID": 93, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "reply": " If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:17:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "intTime": 20090429, 
        "postID": 94, 
        "quote": "", 
        "reply": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show. lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "intTime": 20090429, 
        "postID": 95, 
        "quote": "Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "reply": " lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:34:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "intTime": 20090429, 
        "postID": 96, 
        "quote": "", 
        "reply": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:41:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "intTime": 20090429, 
        "postID": 97, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "reply": " What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:43:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\" In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "intTime": 20090429, 
        "postID": 98, 
        "quote": "Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "reply": " In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:44:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "intTime": 20090429, 
        "postID": 99, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "reply": " Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:45:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Olberdonkey is all flatulence!", 
        "intTime": 20090429, 
        "postID": 100, 
        "quote": "", 
        "reply": "Olberdonkey is all flatulence!", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 08:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "EAG154"
    }, 
    {
        "content": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "intTime": 20090429, 
        "postID": 101, 
        "quote": "", 
        "reply": "Friday, April 24, 2009 12:26 PM By: Dan C. Weil MSNBC news commentator Keith Olbermann is taking on his Fox News counterpart Sean Hannity over the issue of waterboarding – in a rather extreme way. He blasted Hannity’s views on the issue and said he would donate $1,000 to charity for every second that Hannity is waterboarded. Hannity, in an argument with actor Charles Grodin on Fox, defended waterboarding, calling it a means of “enhanced interrogation.” When Grodin asked Hannity if he would consent to be waterboarded himself, the Fox anchor replied, \"Sure. I'll do it for charity. I'll let you do it. I'll do it for the troops' families.\" That wasn’t enough for Olbermann. \"What a breakthrough it would be if, by having reality literally forced upon him, a buffoon like Hannity were to realize the deadly seriousness of this,\" Olbermann says. \"The searing truth: that the moment of torture automatically makes the presumed bad guy recipient the victim, and makes the torturer into the evildoer.\" As for the charity offer, Olbermann says, \"For every second you last, a thousand dollars - live or on tape, provided other networks' cameras are there.” But he doesn’t stop there. “Oh, and I'll double it when you admit you feared for your life, when you admit the horrible truth - waterboarding, the symbol of the last administration, is torture,\" Olbermann says. ----------- I have not heard that Hannity has accepted. I watched Olbermann on 4/28 and didn't see it mentioned. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 04:22:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "intTime": 20090429, 
        "postID": 102, 
        "quote": "", 
        "reply": "Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:08:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. You should be urging Hannity to take Olbermann's offer then. Walt", 
        "intTime": 20090429, 
        "postID": 103, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " You should be urging Hannity to take Olbermann's offer then. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "intTime": 20090429, 
        "postID": 104, 
        "quote": "", 
        "reply": "Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "intTime": 20090429, 
        "postID": 105, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Uh -- Olbermann is not the one that~s claiming waterboarding is not torture and that to prove it he would do if for charity. Hannity made the claim -- Olbermann has just basically told him to put up or shutup.To me that is fair -put up or shutup. --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause... Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "intTime": 20090429, 
        "postID": 106, 
        "quote": "Originally posted by catahoulagill: Money comes easier to Olbermann than most of us. I would like to see Olbermann agree to match Hannity minute for minute until one hollers uncle. If Olbermann believes the charity is a good cause...", 
        "reply": " Hannity is the one who stated he would be waterboarded, Olbermann simply called him out on it. I am not sure which is dumber, agreeing to be waterboarded or being punked by Olbermann.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:06:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090429, 
        "postID": 107, 
        "quote": "", 
        "reply": "Hannity is all mouth….that’s what he does! He’s an entertainer and he pampers to the crowd that wants to hear this garbage! As far as water-boarding goes, he would be balling his eyes out in a matter of milliseconds. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture. OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "intTime": 20090429, 
        "postID": 108, 
        "quote": "Originally posted by FlankerFlyer: Stupermann is clueless and a shill for the ultralib socialists. There are probably a few dozen of us on these forums that wold eagerly take this dumb a zz up on his offer. Id do it long enough to insure that this loser is broke afterwards, besides the humane society would love to have a few extra million even if it is money tainted by hate speech. The US does not torture and waterboarding is NOT torture.", 
        "reply": " OK, why not contact Olbermann's office and volunteer, or is this another meaningless neoconservative rant?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:20:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "intTime": 20090429, 
        "postID": 109, 
        "quote": "", 
        "reply": "It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 06:59:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced. Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "intTime": 20090429, 
        "postID": 110, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. If Keith is to get something out of this for a price, I would like to see Sean match his offer for Keith to do the same thing. Fair & Balanced.", 
        "reply": " Why would he? He's not the one that claims waterboarding isn't torture. He also wasn't stupid enough to volunteer to be boarded on TV, then back out.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:01:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "intTime": 20090429, 
        "postID": 111, 
        "quote": "Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear.", 
        "reply": " That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:10:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "intTime": 20090429, 
        "postID": 112, 
        "quote": "", 
        "reply": "Why would he? If he can state it is the symbol of the prior administration, what's the problem with a little more contribution than his own money. Wouldn't two be better than one to make such an important point about waterboarding?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "intTime": 20090429, 
        "postID": 113, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt", 
        "reply": " If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:17:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "intTime": 20090429, 
        "postID": 114, 
        "quote": "", 
        "reply": "Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:24:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show. lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "intTime": 20090429, 
        "postID": 115, 
        "quote": "Originally posted by AngryPuppy: Is it that Olbermann is jealous of Hannity's ratings? Putting the obvious aside, Olberman obviously condones water boarding when it suits his needs. Seems a little hypocritical, for someone whom claims to be so against it, to pay to see the show.", 
        "reply": " lets make this simple for you --if Olberman had stated that the middle east was 100% safe and there was no hatred for Americans there and he was willing to walk down the streets of bagdad, waving the American flag to prove same IF some one would donate to charity for every mile he walked would the person that took that bet up be obligated to walk alongside him waving a flag also? --Savage", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:34:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "intTime": 20090429, 
        "postID": 116, 
        "quote": "", 
        "reply": "Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:41:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "intTime": 20090429, 
        "postID": 117, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture.", 
        "reply": " What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:43:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\" In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "intTime": 20090429, 
        "postID": 118, 
        "quote": "Originally posted by WhiskeyPapa: Saw this: Olbermann, who hasn't missed any chance to criticize his ideological enemies at Fox, concedes TV competition plays a part in his offer. But he said it was sincere, because he believes Hannity has had a damaging role in the debate. \"If you expose people to reality, even with someone who is denying reality, that can have a powerful and important impact,\" he said.\"", 
        "reply": " In order to expose hannity to reality you'll need an engine hoist to pluck his head from his six.", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:44:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "intTime": 20090429, 
        "postID": 119, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: quote: Originally posted by WhiskeyPapa: quote: Originally posted by catahoulagill: It just seems that Olbermann is quite alright with waterboarding as long as it suits his own agenda. Sounds like Keith wants Sean waterboarded until Sean says the things he wants to hear. That would certainly prove the point -- waterboarding is torture. It is not really even an issue here if WB is torture or not. It is Shawn Hannity looking a fool, and he surely does. Walt If its not an issue, why are so many discussing it? Maybe to make it an issue to continue blaming the prior administration for all our troubles. I agree with waterboarding to save lives. Not comfortable and not torture. What it shows, and the reason I started this thread, is that FOX plays to people who won't/can't think for themselves. Hannity is a disgrace and yet he is one of of the most popular FOX shills. Walt", 
        "reply": " Talk about a specious argument - do you actually consider Olbermann rants to be fodder for intelligent discussion?", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 07:45:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Olberdonkey is all flatulence!", 
        "intTime": 20090429, 
        "postID": 120, 
        "quote": "", 
        "reply": "Olberdonkey is all flatulence!", 
        "threadID": "672198221_4780030222001", 
        "time": "2009-04-29 08:11:00", 
        "title": "Keith Olbermann Offers $1,000 a Second for Sean Hannity Waterboarding", 
        "userID": "EAG154"
    }
]