[
    {
        "content": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "“I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.”", 
        "reply": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\"  Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 14:56:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "reply": " Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:06:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: Do you honestly think Texas or an any state has that Option and could do anything about it? Regardless of that...Succession is a waste of time, effort and the wrong approach. People need to band together in all states and make a huge statement to all congress, the senate and the Whitehouse. That statement is The FairTax. It would work and it would place this nation at the very top of the economic super power. Not to mention it would show out government that \"we the people\" do have a voice. These secessionist movement people need to stop wasting time on a fantasy and place it in the FairTax movement. A much more realistic change than Succesion. Where is the devotionm to the US Flag in these people? Border line of being traitors and rebels in my view.", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union:", 
        "reply": " Do you honestly think Texas or an any state has that Option and could do anything about it? Regardless of that...Succession is a waste of time, effort and the wrong approach. People need to band together in all states and make a huge statement to all congress, the senate and the Whitehouse. That statement is The FairTax. It would work and it would place this nation at the very top of the economic super power. Not to mention it would show out government that \"we the people\" do have a voice. These secessionist movement people need to stop wasting time on a fantasy and place it in the FairTax movement. A much more realistic change than Succesion. Where is the devotionm to the US Flag in these people? Border line of being traitors and rebels in my view.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:07:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "", 
        "reply": "Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) \"Common sense isn't.\"", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:16:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Originally posted by Grachus: quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "reply": " COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:19:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) Yeah I can see that happening...they need to come back from la la land.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " Yeah I can see that happening...they need to come back from la la land.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:20:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I really don't think anyone should ever run for office again if they are from Texas.", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "I really don't think anyone should ever run for office again if they are from Texas.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:23:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "reply": " Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:51:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) True, but outdated. Texas did not just succeed from the Union, they went to War with the United States, which negated that portion of the original agreement. If Texas had simply pulled out of the Union without joining the other States in Their treason, they probably could have gotten away with it. Todays Texas Constitution no longer contains that provision. Dave", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " True, but outdated. Texas did not just succeed from the Union, they went to War with the United States, which negated that portion of the original agreement. If Texas had simply pulled out of the Union without joining the other States in Their treason, they probably could have gotten away with it. Todays Texas Constitution no longer contains that provision. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:01:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "reply": " Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:04:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "I like Chuck, but he needs a reality check along with all the people that suggest succession. I think he is even for the fairtax I believe. That is what he needs to concentrate on. The new Revolution is the FairTax.", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "", 
        "reply": "I like Chuck, but he needs a reality check along with all the people that suggest succession. I think he is even for the fairtax I believe. That is what he needs to concentrate on. The new Revolution is the FairTax.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:05:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave 69 yesterday, i think... he is up there...", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "reply": " 69 yesterday, i think... he is up there...", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:28:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) I could have voted for Huckabee simply on 1 issue fairtax. But nope reps had to stay the course and place up a politician that's been part of the system for decades and wants no real progress of change to place this country what it needs to be. Specially with all the BS going on with our current tax system and the billions wasted on it every year, which everyone politely overlooks as being \"ok\" cause that's how we do it. Yes we have to pay taxes, but the way we do it can be greatly improved.", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " I could have voted for Huckabee simply on 1 issue fairtax. But nope reps had to stay the course and place up a politician that's been part of the system for decades and wants no real progress of change to place this country what it needs to be. Specially with all the BS going on with our current tax system and the billions wasted on it every year, which everyone politely overlooks as being \"ok\" cause that's how we do it. Yes we have to pay taxes, but the way we do it can be greatly improved.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:37:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Damn those Republicans should have embraced \"Change\" and nominated a cabinet nearly entirely focused around the Clinton and Bush Administrations ;-) \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "", 
        "reply": "Damn those Republicans should have embraced \"Change\" and nominated a cabinet nearly entirely focused around the Clinton and Bush Administrations ;-) \"Common sense isn't.\"", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 19:14:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "reply": " Crap statement in my opinion", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 19:17:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "ACR26"
    }, 
    {
        "content": "Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "", 
        "reply": "Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 20:45:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) Chuck (and those foolish enough to follow him) have apparently forgotten how things turned out the last time a group of states decided to try and secede - they got their azzes handed to them, and lost a few cities due to them being burned to the ground by the victorious Union armies. If they were dumb enough to try it again, the beating they would get would be even more lopsided, and we'd spend years watching FLIR/night vision footage of them being hunted down like the Taliban just before a JDAM or Hellfire is dropped down on top of them. Not to mention that I doubt the Union would be anywhere near as kind to them a second time around come surrender time. Is getting your panties in a wad over an election that didn't go your way worth all that trouble and destruction?", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " Chuck (and those foolish enough to follow him) have apparently forgotten how things turned out the last time a group of states decided to try and secede - they got their azzes handed to them, and lost a few cities due to them being burned to the ground by the victorious Union armies. If they were dumb enough to try it again, the beating they would get would be even more lopsided, and we'd spend years watching FLIR/night vision footage of them being hunted down like the Taliban just before a JDAM or Hellfire is dropped down on top of them. Not to mention that I doubt the Union would be anywhere near as kind to them a second time around come surrender time. Is getting your panties in a wad over an election that didn't go your way worth all that trouble and destruction?", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 04:52:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Norris must be suffering the effects of too much blunt force trauma to the head. That is exactly what I was thinking. He is perpetually \"punch drunk\". Coo-coo for cocopuffs he is...", 
        "intTime": 20090312, 
        "postID": 18, 
        "quote": "Originally posted by mcgreer: Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "reply": " That is exactly what I was thinking. He is perpetually \"punch drunk\". Coo-coo for cocopuffs he is...", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 05:45:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Yeah, not all texans are quite as stupid as chuck norris seems to believe.", 
        "intTime": 20090312, 
        "postID": 19, 
        "quote": "", 
        "reply": "Yeah, not all texans are quite as stupid as chuck norris seems to believe.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PocketRockets"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion COMMENT: Hmmm ... must be a defender of extreme political positions and loopy-thinking would-be politicians.", 
        "intTime": 20090312, 
        "postID": 20, 
        "quote": "Originally posted by ACR26: quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion", 
        "reply": " COMMENT: Hmmm ... must be a defender of extreme political positions and loopy-thinking would-be politicians.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 14:42:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "intTime": 20090311, 
        "postID": 21, 
        "quote": "“I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.”", 
        "reply": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\"  Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 14:56:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "intTime": 20090311, 
        "postID": 22, 
        "quote": "Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "reply": " Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:06:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: Do you honestly think Texas or an any state has that Option and could do anything about it? Regardless of that...Succession is a waste of time, effort and the wrong approach. People need to band together in all states and make a huge statement to all congress, the senate and the Whitehouse. That statement is The FairTax. It would work and it would place this nation at the very top of the economic super power. Not to mention it would show out government that \"we the people\" do have a voice. These secessionist movement people need to stop wasting time on a fantasy and place it in the FairTax movement. A much more realistic change than Succesion. Where is the devotionm to the US Flag in these people? Border line of being traitors and rebels in my view.", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union:", 
        "reply": " Do you honestly think Texas or an any state has that Option and could do anything about it? Regardless of that...Succession is a waste of time, effort and the wrong approach. People need to band together in all states and make a huge statement to all congress, the senate and the Whitehouse. That statement is The FairTax. It would work and it would place this nation at the very top of the economic super power. Not to mention it would show out government that \"we the people\" do have a voice. These secessionist movement people need to stop wasting time on a fantasy and place it in the FairTax movement. A much more realistic change than Succesion. Where is the devotionm to the US Flag in these people? Border line of being traitors and rebels in my view.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:07:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "", 
        "reply": "Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) \"Common sense isn't.\"", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:16:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "intTime": 20090311, 
        "postID": 25, 
        "quote": "Originally posted by Grachus: quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "reply": " COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:19:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) Yeah I can see that happening...they need to come back from la la land.", 
        "intTime": 20090311, 
        "postID": 26, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " Yeah I can see that happening...they need to come back from la la land.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:20:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I really don't think anyone should ever run for office again if they are from Texas.", 
        "intTime": 20090311, 
        "postID": 27, 
        "quote": "", 
        "reply": "I really don't think anyone should ever run for office again if they are from Texas.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:23:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "intTime": 20090311, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "reply": " Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:51:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) True, but outdated. Texas did not just succeed from the Union, they went to War with the United States, which negated that portion of the original agreement. If Texas had simply pulled out of the Union without joining the other States in Their treason, they probably could have gotten away with it. Todays Texas Constitution no longer contains that provision. Dave", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " True, but outdated. Texas did not just succeed from the Union, they went to War with the United States, which negated that portion of the original agreement. If Texas had simply pulled out of the Union without joining the other States in Their treason, they probably could have gotten away with it. Todays Texas Constitution no longer contains that provision. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:01:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "reply": " Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:04:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "I like Chuck, but he needs a reality check along with all the people that suggest succession. I think he is even for the fairtax I believe. That is what he needs to concentrate on. The new Revolution is the FairTax.", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "", 
        "reply": "I like Chuck, but he needs a reality check along with all the people that suggest succession. I think he is even for the fairtax I believe. That is what he needs to concentrate on. The new Revolution is the FairTax.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:05:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave 69 yesterday, i think... he is up there...", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "reply": " 69 yesterday, i think... he is up there...", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:28:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) I could have voted for Huckabee simply on 1 issue fairtax. But nope reps had to stay the course and place up a politician that's been part of the system for decades and wants no real progress of change to place this country what it needs to be. Specially with all the BS going on with our current tax system and the billions wasted on it every year, which everyone politely overlooks as being \"ok\" cause that's how we do it. Yes we have to pay taxes, but the way we do it can be greatly improved.", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " I could have voted for Huckabee simply on 1 issue fairtax. But nope reps had to stay the course and place up a politician that's been part of the system for decades and wants no real progress of change to place this country what it needs to be. Specially with all the BS going on with our current tax system and the billions wasted on it every year, which everyone politely overlooks as being \"ok\" cause that's how we do it. Yes we have to pay taxes, but the way we do it can be greatly improved.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:37:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Damn those Republicans should have embraced \"Change\" and nominated a cabinet nearly entirely focused around the Clinton and Bush Administrations ;-) \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "", 
        "reply": "Damn those Republicans should have embraced \"Change\" and nominated a cabinet nearly entirely focused around the Clinton and Bush Administrations ;-) \"Common sense isn't.\"", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 19:14:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "reply": " Crap statement in my opinion", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 19:17:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "ACR26"
    }, 
    {
        "content": "Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "", 
        "reply": "Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 20:45:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) Chuck (and those foolish enough to follow him) have apparently forgotten how things turned out the last time a group of states decided to try and secede - they got their azzes handed to them, and lost a few cities due to them being burned to the ground by the victorious Union armies. If they were dumb enough to try it again, the beating they would get would be even more lopsided, and we'd spend years watching FLIR/night vision footage of them being hunted down like the Taliban just before a JDAM or Hellfire is dropped down on top of them. Not to mention that I doubt the Union would be anywhere near as kind to them a second time around come surrender time. Is getting your panties in a wad over an election that didn't go your way worth all that trouble and destruction?", 
        "intTime": 20090312, 
        "postID": 37, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " Chuck (and those foolish enough to follow him) have apparently forgotten how things turned out the last time a group of states decided to try and secede - they got their azzes handed to them, and lost a few cities due to them being burned to the ground by the victorious Union armies. If they were dumb enough to try it again, the beating they would get would be even more lopsided, and we'd spend years watching FLIR/night vision footage of them being hunted down like the Taliban just before a JDAM or Hellfire is dropped down on top of them. Not to mention that I doubt the Union would be anywhere near as kind to them a second time around come surrender time. Is getting your panties in a wad over an election that didn't go your way worth all that trouble and destruction?", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 04:52:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Norris must be suffering the effects of too much blunt force trauma to the head. That is exactly what I was thinking. He is perpetually \"punch drunk\". Coo-coo for cocopuffs he is...", 
        "intTime": 20090312, 
        "postID": 38, 
        "quote": "Originally posted by mcgreer: Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "reply": " That is exactly what I was thinking. He is perpetually \"punch drunk\". Coo-coo for cocopuffs he is...", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 05:45:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Yeah, not all texans are quite as stupid as chuck norris seems to believe.", 
        "intTime": 20090312, 
        "postID": 39, 
        "quote": "", 
        "reply": "Yeah, not all texans are quite as stupid as chuck norris seems to believe.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PocketRockets"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion COMMENT: Hmmm ... must be a defender of extreme political positions and loopy-thinking would-be politicians.", 
        "intTime": 20090312, 
        "postID": 40, 
        "quote": "Originally posted by ACR26: quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion", 
        "reply": " COMMENT: Hmmm ... must be a defender of extreme political positions and loopy-thinking would-be politicians.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 14:42:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "intTime": 20090311, 
        "postID": 41, 
        "quote": "“I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.”", 
        "reply": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\"  Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 14:56:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "intTime": 20090311, 
        "postID": 42, 
        "quote": "Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future", 
        "reply": " Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:06:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: Do you honestly think Texas or an any state has that Option and could do anything about it? Regardless of that...Succession is a waste of time, effort and the wrong approach. People need to band together in all states and make a huge statement to all congress, the senate and the Whitehouse. That statement is The FairTax. It would work and it would place this nation at the very top of the economic super power. Not to mention it would show out government that \"we the people\" do have a voice. These secessionist movement people need to stop wasting time on a fantasy and place it in the FairTax movement. A much more realistic change than Succesion. Where is the devotionm to the US Flag in these people? Border line of being traitors and rebels in my view.", 
        "intTime": 20090311, 
        "postID": 43, 
        "quote": "Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union:", 
        "reply": " Do you honestly think Texas or an any state has that Option and could do anything about it? Regardless of that...Succession is a waste of time, effort and the wrong approach. People need to band together in all states and make a huge statement to all congress, the senate and the Whitehouse. That statement is The FairTax. It would work and it would place this nation at the very top of the economic super power. Not to mention it would show out government that \"we the people\" do have a voice. These secessionist movement people need to stop wasting time on a fantasy and place it in the FairTax movement. A much more realistic change than Succesion. Where is the devotionm to the US Flag in these people? Border line of being traitors and rebels in my view.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:07:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 44, 
        "quote": "", 
        "reply": "Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) \"Common sense isn't.\"", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:16:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "intTime": 20090311, 
        "postID": 45, 
        "quote": "Originally posted by Grachus: quote: Originally posted by PhoenixDark: Actor Chuck Norris told WorldNetDaily that he would be interested in being President of Texas should the state secede from the union: \"http://politicalticker.blogs.cnn.com/2009/03/11/chuck-norris-for-president-%e2%80%a6-of-texas/\" \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=91103\" quote: “I may run for president of Texas,” Norris wrote Monday in a column posted at WorldNetDaily. “That need may be a reality sooner than we think. If not me, someone someday may again be running for president of the Lone Star state, if the state of the union continues to turn into the enemy of the state.” The actor claimed “thousands of cell groups will be united around the country in solidarity over the concerns for our nation” and said that if states decide to secede from the union, that Texas would lead the way. “Anyone who has been around Texas for any length of time knows exactly what we'd do if the going got rough in America,” Norris wrote. “Let there be no doubt about that.” Sounds like Chuck is aching to wear Gitmo Orange in the near future Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "reply": " COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:19:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) Yeah I can see that happening...they need to come back from la la land.", 
        "intTime": 20090311, 
        "postID": 46, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " Yeah I can see that happening...they need to come back from la la land.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:20:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I really don't think anyone should ever run for office again if they are from Texas.", 
        "intTime": 20090311, 
        "postID": 47, 
        "quote": "", 
        "reply": "I really don't think anyone should ever run for office again if they are from Texas.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:23:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "intTime": 20090311, 
        "postID": 48, 
        "quote": "Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave", 
        "reply": " Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 15:51:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "DCookeUSA1"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) True, but outdated. Texas did not just succeed from the Union, they went to War with the United States, which negated that portion of the original agreement. If Texas had simply pulled out of the Union without joining the other States in Their treason, they probably could have gotten away with it. Todays Texas Constitution no longer contains that provision. Dave", 
        "intTime": 20090311, 
        "postID": 49, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " True, but outdated. Texas did not just succeed from the Union, they went to War with the United States, which negated that portion of the original agreement. If Texas had simply pulled out of the Union without joining the other States in Their treason, they probably could have gotten away with it. Todays Texas Constitution no longer contains that provision. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:01:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "intTime": 20090311, 
        "postID": 50, 
        "quote": "Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that.", 
        "reply": " Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:04:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Grachus"
    }, 
    {
        "content": "I like Chuck, but he needs a reality check along with all the people that suggest succession. I think he is even for the fairtax I believe. That is what he needs to concentrate on. The new Revolution is the FairTax.", 
        "intTime": 20090311, 
        "postID": 51, 
        "quote": "", 
        "reply": "I like Chuck, but he needs a reality check along with all the people that suggest succession. I think he is even for the fairtax I believe. That is what he needs to concentrate on. The new Revolution is the FairTax.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:05:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave 69 yesterday, i think... he is up there...", 
        "intTime": 20090311, 
        "postID": 52, 
        "quote": "Originally posted by Grachus: quote: Originally posted by DCookeUSA1: quote: Originally posted by Grachus: Good to hear that he's exposed himself as the nut-job that he is. Dave Did you just call Chuck Norris a nut-job? I don't think Chuck Norris would appreciate that. Heh, he, I think he's even older than I am... But no doubt he could kick my butt, all he has to do is get here and get through the dog. Dave", 
        "reply": " 69 yesterday, i think... he is up there...", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:28:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) I could have voted for Huckabee simply on 1 issue fairtax. But nope reps had to stay the course and place up a politician that's been part of the system for decades and wants no real progress of change to place this country what it needs to be. Specially with all the BS going on with our current tax system and the billions wasted on it every year, which everyone politely overlooks as being \"ok\" cause that's how we do it. Yes we have to pay taxes, but the way we do it can be greatly improved.", 
        "intTime": 20090311, 
        "postID": 53, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " I could have voted for Huckabee simply on 1 issue fairtax. But nope reps had to stay the course and place up a politician that's been part of the system for decades and wants no real progress of change to place this country what it needs to be. Specially with all the BS going on with our current tax system and the billions wasted on it every year, which everyone politely overlooks as being \"ok\" cause that's how we do it. Yes we have to pay taxes, but the way we do it can be greatly improved.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 16:37:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Damn those Republicans should have embraced \"Change\" and nominated a cabinet nearly entirely focused around the Clinton and Bush Administrations ;-) \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 54, 
        "quote": "", 
        "reply": "Damn those Republicans should have embraced \"Change\" and nominated a cabinet nearly entirely focused around the Clinton and Bush Administrations ;-) \"Common sense isn't.\"", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 19:14:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion", 
        "intTime": 20090311, 
        "postID": 55, 
        "quote": "COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison.", 
        "reply": " Crap statement in my opinion", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 19:17:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "ACR26"
    }, 
    {
        "content": "Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "intTime": 20090311, 
        "postID": 56, 
        "quote": "", 
        "reply": "Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-11 20:45:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-) Chuck (and those foolish enough to follow him) have apparently forgotten how things turned out the last time a group of states decided to try and secede - they got their azzes handed to them, and lost a few cities due to them being burned to the ground by the victorious Union armies. If they were dumb enough to try it again, the beating they would get would be even more lopsided, and we'd spend years watching FLIR/night vision footage of them being hunted down like the Taliban just before a JDAM or Hellfire is dropped down on top of them. Not to mention that I doubt the Union would be anywhere near as kind to them a second time around come surrender time. Is getting your panties in a wad over an election that didn't go your way worth all that trouble and destruction?", 
        "intTime": 20090312, 
        "postID": 57, 
        "quote": "Originally posted by Gladewalker: Actually, Texas refused to join the Union without a secession clause... so they DO have the right to secede. And I don't think Chuck Norris is afraid of Gitmo... after all it'll be closed soon anyway ;-) I supported Huckabee/Norris last year. The \"Speak softly and carry a big kick\" ticket ;-)", 
        "reply": " Chuck (and those foolish enough to follow him) have apparently forgotten how things turned out the last time a group of states decided to try and secede - they got their azzes handed to them, and lost a few cities due to them being burned to the ground by the victorious Union armies. If they were dumb enough to try it again, the beating they would get would be even more lopsided, and we'd spend years watching FLIR/night vision footage of them being hunted down like the Taliban just before a JDAM or Hellfire is dropped down on top of them. Not to mention that I doubt the Union would be anywhere near as kind to them a second time around come surrender time. Is getting your panties in a wad over an election that didn't go your way worth all that trouble and destruction?", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 04:52:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Norris must be suffering the effects of too much blunt force trauma to the head. That is exactly what I was thinking. He is perpetually \"punch drunk\". Coo-coo for cocopuffs he is...", 
        "intTime": 20090312, 
        "postID": 58, 
        "quote": "Originally posted by mcgreer: Norris must be suffering the effects of too much blunt force trauma to the head.", 
        "reply": " That is exactly what I was thinking. He is perpetually \"punch drunk\". Coo-coo for cocopuffs he is...", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 05:45:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "Yeah, not all texans are quite as stupid as chuck norris seems to believe.", 
        "intTime": 20090312, 
        "postID": 59, 
        "quote": "", 
        "reply": "Yeah, not all texans are quite as stupid as chuck norris seems to believe.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 14:13:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "PocketRockets"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion COMMENT: Hmmm ... must be a defender of extreme political positions and loopy-thinking would-be politicians.", 
        "intTime": 20090312, 
        "postID": 60, 
        "quote": "Originally posted by ACR26: quote: COMMENT: Oh yeah, he makes me feel much more reassured. He makes Tim McVeigh look rational in comparison. Crap statement in my opinion", 
        "reply": " COMMENT: Hmmm ... must be a defender of extreme political positions and loopy-thinking would-be politicians.", 
        "threadID": "672198221_2150075712001", 
        "time": "2009-03-12 14:42:00", 
        "title": "Chuck Norris For President - of Texas", 
        "userID": "NOVAMarine"
    }
]