[
    {
        "content": "quote: When he visits Strasbourg, France, this week to participate in festivities marking NATO's 60th anniversary, President Obama should deliver a valedictory address, announcing his intention to withdraw the United States from the alliance. The U.S. has done its job. It's time for Europe to assume full responsibility for its own security, freeing the U.S. to attend to more urgent priorities. (....) Over time, the Soviet threat diminished and eventually disappeared. Since then, however, an alliance once regarded as the most successful in all of history has lost its way. When the end of the Cold War left Russia temporarily weakened, the United States and its allies wasted no time in exploiting that weakness. NATO pressed eastward, incorporating into its ranks nations that had previously formed part of the Soviet empire and of the Soviet Union itself. American policymakers urged the alliance to expand its reach, abandoning its defensive posture to become an instrument of intervention. According to the conventional wisdom of the 1990s, NATO needed to go \"out of area\" or it would surely go \"out of business.\" This program of enlarging both NATO's territorial expanse and its ambitions has now reached an impasse. Through its military punishment of Georgia last year, Russia has signaled it will not tolerate further encroachments into what the Kremlin sees as its legitimate sphere of influence. Meanwhile, through its ineffective performance in Afghanistan -- NATO's most ambitious \"out of area\" contingency -- the alliance has revealed the extent to which its capabilities and its cohesion have eroded. Present-day NATO is a shadow of what it once was. Calling it a successful alliance today is the equivalent of calling General Motors a successful car company -- it privileges nostalgia over self-awareness. As with GM, so too with NATO: Fixing past mistakes will require painful changes. Continuing along the existing trajectory is not an option. If the alliance pursues any further eastward expansion (incorporating Ukraine into its ranks, as some in Washington have advocated), it will implode. If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors. Salvation requires taking a different course. However counterintuitive, the best prospect for restoring NATO's sense of purpose and direction lies in having the U.S. announce its intention to exit the alliance. Salvaging NATO requires reorienting the alliance back to its founding purpose: the defense of Europe. This remains a worthy mission. Although Vladimir Putin's Russia hardly compares with Josef Stalin's Soviet Union, and although current Russian military capabilities pale in comparison with those of the old Red Army, the fact is that Europe today does face a security threat to its east. Having been subjected (in its own eyes at least) to two decades of Western humiliation, authoritarian Russia is by no means committed to the status quo. Given the opportunity, the Kremlin could well give in to the temptation to do mischief. NATO's priority must be to ensure that no such opportunity presents itself, which means demonstrating an unquestioned capacity for self-defense. The difference between 1949 and 2009 is that present-day Europe is more than capable of addressing today's threat, without American assistance or supervision. Collectively, the Europeans don't need U.S. troops or dollars, both of which are in short supply anyway and needed elsewhere. Yet as long as the United States sustains the pretense that Europe cannot manage its own affairs, the Europeans will endorse that proposition, letting Americans foot most of the bill. Only if Washington makes it clear that the era of free-riding has ended will Europe grow up. (....) +http://www.latimes.com/news/opinion/commentary/la-oe-bacevich2-2009apr02,0,7272382.story", 
        "intTime": 20090402, 
        "postID": 1, 
        "quote": "When he visits Strasbourg, France, this week to participate in festivities marking NATO's 60th anniversary, President Obama should deliver a valedictory address, announcing his intention to withdraw the United States from the alliance. The U.S. has done its job. It's time for Europe to assume full responsibility for its own security, freeing the U.S. to attend to more urgent priorities. (....) Over time, the Soviet threat diminished and eventually disappeared. Since then, however, an alliance once regarded as the most successful in all of history has lost its way. When the end of the Cold War left Russia temporarily weakened, the United States and its allies wasted no time in exploiting that weakness. NATO pressed eastward, incorporating into its ranks nations that had previously formed part of the Soviet empire and of the Soviet Union itself. American policymakers urged the alliance to expand its reach, abandoning its defensive posture to become an instrument of intervention. According to the conventional wisdom of the 1990s, NATO needed to go \"out of area\" or it would surely go \"out of business.\" This program of enlarging both NATO's territorial expanse and its ambitions has now reached an impasse. Through its military punishment of Georgia last year, Russia has signaled it will not tolerate further encroachments into what the Kremlin sees as its legitimate sphere of influence. Meanwhile, through its ineffective performance in Afghanistan -- NATO's most ambitious \"out of area\" contingency -- the alliance has revealed the extent to which its capabilities and its cohesion have eroded. Present-day NATO is a shadow of what it once was. Calling it a successful alliance today is the equivalent of calling General Motors a successful car company -- it privileges nostalgia over self-awareness. As with GM, so too with NATO: Fixing past mistakes will require painful changes. Continuing along the existing trajectory is not an option. If the alliance pursues any further eastward expansion (incorporating Ukraine into its ranks, as some in Washington have advocated), it will implode. If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors. Salvation requires taking a different course. However counterintuitive, the best prospect for restoring NATO's sense of purpose and direction lies in having the U.S. announce its intention to exit the alliance. Salvaging NATO requires reorienting the alliance back to its founding purpose: the defense of Europe. This remains a worthy mission. Although Vladimir Putin's Russia hardly compares with Josef Stalin's Soviet Union, and although current Russian military capabilities pale in comparison with those of the old Red Army, the fact is that Europe today does face a security threat to its east. Having been subjected (in its own eyes at least) to two decades of Western humiliation, authoritarian Russia is by no means committed to the status quo. Given the opportunity, the Kremlin could well give in to the temptation to do mischief. NATO's priority must be to ensure that no such opportunity presents itself, which means demonstrating an unquestioned capacity for self-defense. The difference between 1949 and 2009 is that present-day Europe is more than capable of addressing today's threat, without American assistance or supervision. Collectively, the Europeans don't need U.S. troops or dollars, both of which are in short supply anyway and needed elsewhere. Yet as long as the United States sustains the pretense that Europe cannot manage its own affairs, the Europeans will endorse that proposition, letting Americans foot most of the bill. Only if Washington makes it clear that the era of free-riding has ended will Europe grow up. (....)", 
        "reply": " +http://www.latimes.com/news/opinion/commentary/la-oe-bacevich2-2009apr02,0,7272382.story", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 05:54:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Knele"
    }, 
    {
        "content": "Perhaps the time for NATO has come and gone. Maybe we let the EU take care of itself. There is no longer 1+ million USSR troops within a couple of hundred miles of the inter-German border threatening, so what purpose is the Alliance serving today? However we should maintain our close ties with the UK.", 
        "intTime": 20090402, 
        "postID": 2, 
        "quote": "", 
        "reply": "Perhaps the time for NATO has come and gone. Maybe we let the EU take care of itself. There is no longer 1+ million USSR troops within a couple of hundred miles of the inter-German border threatening, so what purpose is the Alliance serving today? However we should maintain our close ties with the UK.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 08:49:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "sw614"
    }, 
    {
        "content": "Never have liked NATO nor the Geneva Convention. I believe that it has held the U.S. back. But agree that we should keep friendly ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 3, 
        "quote": "", 
        "reply": "Never have liked NATO nor the Geneva Convention. I believe that it has held the U.S. back. But agree that we should keep friendly ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:26:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Care to explain why you feel that way? I'm curious...", 
        "intTime": 20090402, 
        "postID": 4, 
        "quote": "", 
        "reply": "Care to explain why you feel that way? I'm curious...", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:31:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I was told when I was inlisted in the military that the U.S. did not signe the geneva convention, so Why do people complain that the U.S. is breaking the thing it was a contract that the U.S. did not signe how can we break it? Also in my opinion NATO just took over the job of the mobs of the 20s and 30s, 99.9 % are criminels. This is JMO probably nobody else agrees but OH Well D.J.", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "", 
        "reply": "I was told when I was inlisted in the military that the U.S. did not signe the geneva convention, so Why do people complain that the U.S. is breaking the thing it was a contract that the U.S. did not signe how can we break it? Also in my opinion NATO just took over the job of the mobs of the 20s and 30s, 99.9 % are criminels. This is JMO probably nobody else agrees but OH Well D.J.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:40:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "Originally posted by mcgreer: Care to explain why you feel that way? I'm curious...", 
        "reply": " It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:55:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties.", 
        "reply": " The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:19:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 8, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "reply": " Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:25:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. From the article: If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors.", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "reply": " From the article: If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:31:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO.", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds.", 
        "reply": " We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:33:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. I thought the 5.56 was adopted at US prodding, not the other way around.", 
        "intTime": 20090402, 
        "postID": 11, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds.", 
        "reply": " I thought the 5.56 was adopted at US prodding, not the other way around.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:35:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. The US was never forced into adopting the 5.56, quite the contrary. In fact the US had previously overruled other NATO countries in favor of the 7.62 mm as a standard NATO round. But sometime in the 70's it was agreed that the lower recoil and better effectiveness of the 5.56 was to prefer over the 7.62 round so the US agreed to a 5.56 standard. I doubt that NATO could do anything the US didnt agree to. As for the Geneva Convention, the US has indeed signed it and I'd think it's a great concern if stated otherwise in the US armed forces.", 
        "intTime": 20090402, 
        "postID": 12, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds.", 
        "reply": " The US was never forced into adopting the 5.56, quite the contrary. In fact the US had previously overruled other NATO countries in favor of the 7.62 mm as a standard NATO round. But sometime in the 70's it was agreed that the lower recoil and better effectiveness of the 5.56 was to prefer over the 7.62 round so the US agreed to a 5.56 standard. I doubt that NATO could do anything the US didnt agree to. As for the Geneva Convention, the US has indeed signed it and I'd think it's a great concern if stated otherwise in the US armed forces.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:37:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Hultberg"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 13, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO.", 
        "reply": " Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:38:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard!", 
        "intTime": 20090402, 
        "postID": 14, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties.", 
        "reply": " You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard!", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:39:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960.", 
        "intTime": 20090402, 
        "postID": 15, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead.", 
        "reply": " Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:41:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Fear of the Soviet Union is what kept NATO together and made the alliance effective. With the end of the Cold War, the lack of a compelling reason for NATO's continued existence, as well as its over-expansion eastward has severely diluted it's effectiveness and relevance. NATO is no longer the focused alliance it once was and has instead become some kind of smaller, military version of the UN, IMO.", 
        "intTime": 20090402, 
        "postID": 16, 
        "quote": "", 
        "reply": "Fear of the Soviet Union is what kept NATO together and made the alliance effective. With the end of the Cold War, the lack of a compelling reason for NATO's continued existence, as well as its over-expansion eastward has severely diluted it's effectiveness and relevance. NATO is no longer the focused alliance it once was and has instead become some kind of smaller, military version of the UN, IMO.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 12:26:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960. Probably right then, but I would rather have the 7.62 \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 17, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960.", 
        "reply": " Probably right then, but I would rather have the 7.62 \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 12:26:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard! No, I wasn't confused. You may just be reading what I posted the wrong way. What is your concern about? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 18, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard!", 
        "reply": " No, I wasn't confused. You may just be reading what I posted the wrong way. What is your concern about? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 12:27:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. a. If you're referring to Afghanistan - NATO isn't \"holding us back\" on anything. We have a mission there that is separate from the ISAF mission, which is a UN mandate to hold the ground for the Afghan government until they can do it for themselves. The US mission there is largely an offensive mission, while the ISAF mission is not. We have GIs performing both missions, with NATO and on their own. Now - what is NATO telling us we cannot do? They're in no position do do that, for openers, and what, with our limited numbers there, can we do \"faster\"? b. Unfortunate that a GI has no respect for his LOAC training, which is inspired by the Geneva Conventions. By the way, it was the United States which inspired the nations to employ the Conventions - and our Congress has ratified all of them, so that makes them US law. Considering the nature of the Geneva Conventions, do you think that maximum cruelty, unchecked violence, and possibly genocidal acts will help our cause? Why do you think America needs to behave that way? And what makes you think that a \"kill 'em all\" strategy will work for us? How does that help us strategically? The matter of small arms ammunition is, from a strategic standpoint, a relatively trivial one. What you haven't learned is this, and I've explained it before here: - NATO, like many alliances, operate on consensus. That is a very slow and tedious process, but when a decision is made that way, it is a very solid one. - Despite the consensus decision among the members of the Alliance, every nation has its own sovereign interests, and those will always trump an alliance by default. So, after consensus is reached among the NATO ambassadors, they now have to sell the idea to their respective governments. That results in more delay. - While all that's going on, someone has to keep things together. That's where we come in. We've earned that role and have not shirked it. Remember - we're the leaders, and what we've done is what leaders do. - The NATO Alliance does not stop any nation from doing whatever they please.", 
        "intTime": 20090402, 
        "postID": 19, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties.", 
        "reply": " a. If you're referring to Afghanistan - NATO isn't \"holding us back\" on anything. We have a mission there that is separate from the ISAF mission, which is a UN mandate to hold the ground for the Afghan government until they can do it for themselves. The US mission there is largely an offensive mission, while the ISAF mission is not. We have GIs performing both missions, with NATO and on their own. Now - what is NATO telling us we cannot do? They're in no position do do that, for openers, and what, with our limited numbers there, can we do \"faster\"? b. Unfortunate that a GI has no respect for his LOAC training, which is inspired by the Geneva Conventions. By the way, it was the United States which inspired the nations to employ the Conventions - and our Congress has ratified all of them, so that makes them US law. Considering the nature of the Geneva Conventions, do you think that maximum cruelty, unchecked violence, and possibly genocidal acts will help our cause? Why do you think America needs to behave that way? And what makes you think that a \"kill 'em all\" strategy will work for us? How does that help us strategically? The matter of small arms ammunition is, from a strategic standpoint, a relatively trivial one. What you haven't learned is this, and I've explained it before here: - NATO, like many alliances, operate on consensus. That is a very slow and tedious process, but when a decision is made that way, it is a very solid one. - Despite the consensus decision among the members of the Alliance, every nation has its own sovereign interests, and those will always trump an alliance by default. So, after consensus is reached among the NATO ambassadors, they now have to sell the idea to their respective governments. That results in more delay. - While all that's going on, someone has to keep things together. That's where we come in. We've earned that role and have not shirked it. Remember - we're the leaders, and what we've done is what leaders do. - The NATO Alliance does not stop any nation from doing whatever they please.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 18:37:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "let the EU start a war and when they ask for us to send troops just refuse. simple quick", 
        "intTime": 20090403, 
        "postID": 20, 
        "quote": "", 
        "reply": "let the EU start a war and when they ask for us to send troops just refuse. simple quick", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-03 00:19:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: When he visits Strasbourg, France, this week to participate in festivities marking NATO's 60th anniversary, President Obama should deliver a valedictory address, announcing his intention to withdraw the United States from the alliance. The U.S. has done its job. It's time for Europe to assume full responsibility for its own security, freeing the U.S. to attend to more urgent priorities. (....) Over time, the Soviet threat diminished and eventually disappeared. Since then, however, an alliance once regarded as the most successful in all of history has lost its way. When the end of the Cold War left Russia temporarily weakened, the United States and its allies wasted no time in exploiting that weakness. NATO pressed eastward, incorporating into its ranks nations that had previously formed part of the Soviet empire and of the Soviet Union itself. American policymakers urged the alliance to expand its reach, abandoning its defensive posture to become an instrument of intervention. According to the conventional wisdom of the 1990s, NATO needed to go \"out of area\" or it would surely go \"out of business.\" This program of enlarging both NATO's territorial expanse and its ambitions has now reached an impasse. Through its military punishment of Georgia last year, Russia has signaled it will not tolerate further encroachments into what the Kremlin sees as its legitimate sphere of influence. Meanwhile, through its ineffective performance in Afghanistan -- NATO's most ambitious \"out of area\" contingency -- the alliance has revealed the extent to which its capabilities and its cohesion have eroded. Present-day NATO is a shadow of what it once was. Calling it a successful alliance today is the equivalent of calling General Motors a successful car company -- it privileges nostalgia over self-awareness. As with GM, so too with NATO: Fixing past mistakes will require painful changes. Continuing along the existing trajectory is not an option. If the alliance pursues any further eastward expansion (incorporating Ukraine into its ranks, as some in Washington have advocated), it will implode. If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors. Salvation requires taking a different course. However counterintuitive, the best prospect for restoring NATO's sense of purpose and direction lies in having the U.S. announce its intention to exit the alliance. Salvaging NATO requires reorienting the alliance back to its founding purpose: the defense of Europe. This remains a worthy mission. Although Vladimir Putin's Russia hardly compares with Josef Stalin's Soviet Union, and although current Russian military capabilities pale in comparison with those of the old Red Army, the fact is that Europe today does face a security threat to its east. Having been subjected (in its own eyes at least) to two decades of Western humiliation, authoritarian Russia is by no means committed to the status quo. Given the opportunity, the Kremlin could well give in to the temptation to do mischief. NATO's priority must be to ensure that no such opportunity presents itself, which means demonstrating an unquestioned capacity for self-defense. The difference between 1949 and 2009 is that present-day Europe is more than capable of addressing today's threat, without American assistance or supervision. Collectively, the Europeans don't need U.S. troops or dollars, both of which are in short supply anyway and needed elsewhere. Yet as long as the United States sustains the pretense that Europe cannot manage its own affairs, the Europeans will endorse that proposition, letting Americans foot most of the bill. Only if Washington makes it clear that the era of free-riding has ended will Europe grow up. (....) +http://www.latimes.com/news/opinion/commentary/la-oe-bacevich2-2009apr02,0,7272382.story", 
        "intTime": 20090402, 
        "postID": 21, 
        "quote": "When he visits Strasbourg, France, this week to participate in festivities marking NATO's 60th anniversary, President Obama should deliver a valedictory address, announcing his intention to withdraw the United States from the alliance. The U.S. has done its job. It's time for Europe to assume full responsibility for its own security, freeing the U.S. to attend to more urgent priorities. (....) Over time, the Soviet threat diminished and eventually disappeared. Since then, however, an alliance once regarded as the most successful in all of history has lost its way. When the end of the Cold War left Russia temporarily weakened, the United States and its allies wasted no time in exploiting that weakness. NATO pressed eastward, incorporating into its ranks nations that had previously formed part of the Soviet empire and of the Soviet Union itself. American policymakers urged the alliance to expand its reach, abandoning its defensive posture to become an instrument of intervention. According to the conventional wisdom of the 1990s, NATO needed to go \"out of area\" or it would surely go \"out of business.\" This program of enlarging both NATO's territorial expanse and its ambitions has now reached an impasse. Through its military punishment of Georgia last year, Russia has signaled it will not tolerate further encroachments into what the Kremlin sees as its legitimate sphere of influence. Meanwhile, through its ineffective performance in Afghanistan -- NATO's most ambitious \"out of area\" contingency -- the alliance has revealed the extent to which its capabilities and its cohesion have eroded. Present-day NATO is a shadow of what it once was. Calling it a successful alliance today is the equivalent of calling General Motors a successful car company -- it privileges nostalgia over self-awareness. As with GM, so too with NATO: Fixing past mistakes will require painful changes. Continuing along the existing trajectory is not an option. If the alliance pursues any further eastward expansion (incorporating Ukraine into its ranks, as some in Washington have advocated), it will implode. If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors. Salvation requires taking a different course. However counterintuitive, the best prospect for restoring NATO's sense of purpose and direction lies in having the U.S. announce its intention to exit the alliance. Salvaging NATO requires reorienting the alliance back to its founding purpose: the defense of Europe. This remains a worthy mission. Although Vladimir Putin's Russia hardly compares with Josef Stalin's Soviet Union, and although current Russian military capabilities pale in comparison with those of the old Red Army, the fact is that Europe today does face a security threat to its east. Having been subjected (in its own eyes at least) to two decades of Western humiliation, authoritarian Russia is by no means committed to the status quo. Given the opportunity, the Kremlin could well give in to the temptation to do mischief. NATO's priority must be to ensure that no such opportunity presents itself, which means demonstrating an unquestioned capacity for self-defense. The difference between 1949 and 2009 is that present-day Europe is more than capable of addressing today's threat, without American assistance or supervision. Collectively, the Europeans don't need U.S. troops or dollars, both of which are in short supply anyway and needed elsewhere. Yet as long as the United States sustains the pretense that Europe cannot manage its own affairs, the Europeans will endorse that proposition, letting Americans foot most of the bill. Only if Washington makes it clear that the era of free-riding has ended will Europe grow up. (....)", 
        "reply": " +http://www.latimes.com/news/opinion/commentary/la-oe-bacevich2-2009apr02,0,7272382.story", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 05:54:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Knele"
    }, 
    {
        "content": "Perhaps the time for NATO has come and gone. Maybe we let the EU take care of itself. There is no longer 1+ million USSR troops within a couple of hundred miles of the inter-German border threatening, so what purpose is the Alliance serving today? However we should maintain our close ties with the UK.", 
        "intTime": 20090402, 
        "postID": 22, 
        "quote": "", 
        "reply": "Perhaps the time for NATO has come and gone. Maybe we let the EU take care of itself. There is no longer 1+ million USSR troops within a couple of hundred miles of the inter-German border threatening, so what purpose is the Alliance serving today? However we should maintain our close ties with the UK.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 08:49:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "sw614"
    }, 
    {
        "content": "Never have liked NATO nor the Geneva Convention. I believe that it has held the U.S. back. But agree that we should keep friendly ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 23, 
        "quote": "", 
        "reply": "Never have liked NATO nor the Geneva Convention. I believe that it has held the U.S. back. But agree that we should keep friendly ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:26:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Care to explain why you feel that way? I'm curious...", 
        "intTime": 20090402, 
        "postID": 24, 
        "quote": "", 
        "reply": "Care to explain why you feel that way? I'm curious...", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:31:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I was told when I was inlisted in the military that the U.S. did not signe the geneva convention, so Why do people complain that the U.S. is breaking the thing it was a contract that the U.S. did not signe how can we break it? Also in my opinion NATO just took over the job of the mobs of the 20s and 30s, 99.9 % are criminels. This is JMO probably nobody else agrees but OH Well D.J.", 
        "intTime": 20090402, 
        "postID": 25, 
        "quote": "", 
        "reply": "I was told when I was inlisted in the military that the U.S. did not signe the geneva convention, so Why do people complain that the U.S. is breaking the thing it was a contract that the U.S. did not signe how can we break it? Also in my opinion NATO just took over the job of the mobs of the 20s and 30s, 99.9 % are criminels. This is JMO probably nobody else agrees but OH Well D.J.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:40:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 26, 
        "quote": "Originally posted by mcgreer: Care to explain why you feel that way? I'm curious...", 
        "reply": " It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 10:55:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "intTime": 20090402, 
        "postID": 27, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties.", 
        "reply": " The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:19:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 28, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "reply": " Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:25:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. From the article: If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors.", 
        "intTime": 20090402, 
        "postID": 29, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50.", 
        "reply": " From the article: If it persists in attempting to pacify Afghanistan (vainly trying to prod the Germans and other reluctant allies into deploying more troops with fewer strings attached), it will only further expose its internal weakness. NATO won't survive by compounding its own recent errors.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:31:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO.", 
        "intTime": 20090402, 
        "postID": 30, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds.", 
        "reply": " We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:33:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. I thought the 5.56 was adopted at US prodding, not the other way around.", 
        "intTime": 20090402, 
        "postID": 31, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds.", 
        "reply": " I thought the 5.56 was adopted at US prodding, not the other way around.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:35:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds. The US was never forced into adopting the 5.56, quite the contrary. In fact the US had previously overruled other NATO countries in favor of the 7.62 mm as a standard NATO round. But sometime in the 70's it was agreed that the lower recoil and better effectiveness of the 5.56 was to prefer over the 7.62 round so the US agreed to a 5.56 standard. I doubt that NATO could do anything the US didnt agree to. As for the Geneva Convention, the US has indeed signed it and I'd think it's a great concern if stated otherwise in the US armed forces.", 
        "intTime": 20090402, 
        "postID": 32, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Your right the GC has nothing to do with 5.56, but NATO does. I would rather be using a 7.62 round than 5.56 rounds.", 
        "reply": " The US was never forced into adopting the 5.56, quite the contrary. In fact the US had previously overruled other NATO countries in favor of the 7.62 mm as a standard NATO round. But sometime in the 70's it was agreed that the lower recoil and better effectiveness of the 5.56 was to prefer over the 7.62 round so the US agreed to a 5.56 standard. I doubt that NATO could do anything the US didnt agree to. As for the Geneva Convention, the US has indeed signed it and I'd think it's a great concern if stated otherwise in the US armed forces.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:37:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Hultberg"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 33, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO.", 
        "reply": " Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:38:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard!", 
        "intTime": 20090402, 
        "postID": 34, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties.", 
        "reply": " You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard!", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:39:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960.", 
        "intTime": 20090402, 
        "postID": 35, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead.", 
        "reply": " Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 11:41:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Fear of the Soviet Union is what kept NATO together and made the alliance effective. With the end of the Cold War, the lack of a compelling reason for NATO's continued existence, as well as its over-expansion eastward has severely diluted it's effectiveness and relevance. NATO is no longer the focused alliance it once was and has instead become some kind of smaller, military version of the UN, IMO.", 
        "intTime": 20090402, 
        "postID": 36, 
        "quote": "", 
        "reply": "Fear of the Soviet Union is what kept NATO together and made the alliance effective. With the end of the Cold War, the lack of a compelling reason for NATO's continued existence, as well as its over-expansion eastward has severely diluted it's effectiveness and relevance. NATO is no longer the focused alliance it once was and has instead become some kind of smaller, military version of the UN, IMO.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 12:26:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960. Probably right then, but I would rather have the 7.62 \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 37, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by nspreitler: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. The article ignores the 800 pound gorilla in the room, Afghanistan. NATO forces from 24 countries have been in Afghanistan for years. Canada and the UK have each lost more troops per capita than the United States there. Our use of 5.56 has nothing to do with the Geneva convention. The 240s are in 7.62, the M2 uses .50. Then what is our use of 5.56 based off of. Cus i would love to be using 7.62 rounds. We use 5.56 because that is what DoD bought. Many NATO countries use 7.62 in their individual weapons. The USAF started buying 5.56 AR-15s in 1960, but it wsan't until th late 1970s that it became a standard round in NATO. Many NATO countries use 5.56 rounds also. Maybe we wanted it because it was more humane...either way I don't like the 5.56 and believe we should be using a 7.62 round instead. Many NATO countries do use 5.56, many do not. The US was the first to use 5.56 and then NATO adopted it, not the other way around. I could be wrong, but I can't find any use of 5.56 rounds prior to the Air Force buying AR-15s in 1960.", 
        "reply": " Probably right then, but I would rather have the 7.62 \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 12:26:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard! No, I wasn't confused. You may just be reading what I posted the wrong way. What is your concern about? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 38, 
        "quote": "Originally posted by Knele: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. You seem to be confused on the Geneva Convention! Without me simply regurgitating, here you go: +http://en.wikipedia.org/wiki/Geneva_Conventions Also, 5.56 was developed in the US and originally chambered in the M16 rifle. Before that 7.62 mm was NATO standard!", 
        "reply": " No, I wasn't confused. You may just be reading what I posted the wrong way. What is your concern about? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 12:27:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties. a. If you're referring to Afghanistan - NATO isn't \"holding us back\" on anything. We have a mission there that is separate from the ISAF mission, which is a UN mandate to hold the ground for the Afghan government until they can do it for themselves. The US mission there is largely an offensive mission, while the ISAF mission is not. We have GIs performing both missions, with NATO and on their own. Now - what is NATO telling us we cannot do? They're in no position do do that, for openers, and what, with our limited numbers there, can we do \"faster\"? b. Unfortunate that a GI has no respect for his LOAC training, which is inspired by the Geneva Conventions. By the way, it was the United States which inspired the nations to employ the Conventions - and our Congress has ratified all of them, so that makes them US law. Considering the nature of the Geneva Conventions, do you think that maximum cruelty, unchecked violence, and possibly genocidal acts will help our cause? Why do you think America needs to behave that way? And what makes you think that a \"kill 'em all\" strategy will work for us? How does that help us strategically? The matter of small arms ammunition is, from a strategic standpoint, a relatively trivial one. What you haven't learned is this, and I've explained it before here: - NATO, like many alliances, operate on consensus. That is a very slow and tedious process, but when a decision is made that way, it is a very solid one. - Despite the consensus decision among the members of the Alliance, every nation has its own sovereign interests, and those will always trump an alliance by default. So, after consensus is reached among the NATO ambassadors, they now have to sell the idea to their respective governments. That results in more delay. - While all that's going on, someone has to keep things together. That's where we come in. We've earned that role and have not shirked it. Remember - we're the leaders, and what we've done is what leaders do. - The NATO Alliance does not stop any nation from doing whatever they please.", 
        "intTime": 20090402, 
        "postID": 39, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: Care to explain why you feel that way? I'm curious... It was mainly created because of the USSR and that does not exist anymore. In my opinion we can do more tactically than if we are with NATO. I believe that the GC holds us back. Our enemies use 7.62 rounds yet we can't we have to use 5.56 rounds. We can get a lot more a lot faster without NATO holding us back. Besides what has NATO done? Everytime something comes up the U.S. is the first to do something and then others either follow or don't do anything at all. I say disband NATO, but keep the ties.", 
        "reply": " a. If you're referring to Afghanistan - NATO isn't \"holding us back\" on anything. We have a mission there that is separate from the ISAF mission, which is a UN mandate to hold the ground for the Afghan government until they can do it for themselves. The US mission there is largely an offensive mission, while the ISAF mission is not. We have GIs performing both missions, with NATO and on their own. Now - what is NATO telling us we cannot do? They're in no position do do that, for openers, and what, with our limited numbers there, can we do \"faster\"? b. Unfortunate that a GI has no respect for his LOAC training, which is inspired by the Geneva Conventions. By the way, it was the United States which inspired the nations to employ the Conventions - and our Congress has ratified all of them, so that makes them US law. Considering the nature of the Geneva Conventions, do you think that maximum cruelty, unchecked violence, and possibly genocidal acts will help our cause? Why do you think America needs to behave that way? And what makes you think that a \"kill 'em all\" strategy will work for us? How does that help us strategically? The matter of small arms ammunition is, from a strategic standpoint, a relatively trivial one. What you haven't learned is this, and I've explained it before here: - NATO, like many alliances, operate on consensus. That is a very slow and tedious process, but when a decision is made that way, it is a very solid one. - Despite the consensus decision among the members of the Alliance, every nation has its own sovereign interests, and those will always trump an alliance by default. So, after consensus is reached among the NATO ambassadors, they now have to sell the idea to their respective governments. That results in more delay. - While all that's going on, someone has to keep things together. That's where we come in. We've earned that role and have not shirked it. Remember - we're the leaders, and what we've done is what leaders do. - The NATO Alliance does not stop any nation from doing whatever they please.", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-02 18:37:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "let the EU start a war and when they ask for us to send troops just refuse. simple quick", 
        "intTime": 20090403, 
        "postID": 40, 
        "quote": "", 
        "reply": "let the EU start a war and when they ask for us to send troops just refuse. simple quick", 
        "threadID": "672198221_2640016912001", 
        "time": "2009-04-03 00:19:00", 
        "title": "How do we save NATO? We quit", 
        "userID": "world_king377"
    }
]