[
    {
        "content": "\"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "intTime": 20090524, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:04:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran?", 
        "intTime": 20090524, 
        "postID": 2, 
        "quote": "", 
        "reply": "51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran?", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:26:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Motive25"
    }, 
    {
        "content": "A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on.", 
        "intTime": 20090524, 
        "postID": 3, 
        "quote": "", 
        "reply": "A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:45:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true!", 
        "intTime": 20090524, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "reply": " CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true!", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:49:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090524, 
        "postID": 5, 
        "quote": "Originally posted by Agent991: A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 09:27:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Agent991: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true! It is inevitable no matter what people may think. Then what? Some may ask. We either kill them all and win a REAL war, or we need to learn how to pray to Mohammed. Israel will not allow itself to perish. I do think after a good ass whoopin and many have died, Iran will stop it's BS, but that's the only way.", 
        "intTime": 20090524, 
        "postID": 6, 
        "quote": "Originally posted by Agent991: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true!", 
        "reply": " It is inevitable no matter what people may think. Then what? Some may ask. We either kill them all and win a REAL war, or we need to learn how to pray to Mohammed. Israel will not allow itself to perish. I do think after a good ass whoopin and many have died, Iran will stop it's BS, but that's the only way.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 10:03:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "intTime": 20090524, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "reply": " You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 13:45:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us. And how many times must people like you be told that Iranian Presidents have absolutely zero power? It doesn't matter if Colin Powell gets elected President over there, the Ayatollah's call the shots, and they will not give up their pursuit of nuclear weapons... I for one am glad Israel is committed to the destruction of Irans nuclear ambitions, god speed and good luck...", 
        "intTime": 20090524, 
        "postID": 8, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "reply": " And how many times must people like you be told that Iranian Presidents have absolutely zero power? It doesn't matter if Colin Powell gets elected President over there, the Ayatollah's call the shots, and they will not give up their pursuit of nuclear weapons... I for one am glad Israel is committed to the destruction of Irans nuclear ambitions, god speed and good luck...", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 13:53:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Motive25: 51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran? How many fronts are we capabile of now that it is said N.Korea detonated another Nuke? How will we fund it? where will the troops come from without a draft, and where will we train them now that many facilities have been closed. Iran, Iraq, Afganistan, Pakistan, N.Korea, Where will this money come from?? How large will the defense budget have to be? At what point do we bring all the troops home, Admit were writing checks our azz cant cash and turn everything over to the UN where it should have been all along.", 
        "intTime": 20090524, 
        "postID": 9, 
        "quote": "Originally posted by Motive25: 51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran?", 
        "reply": " How many fronts are we capabile of now that it is said N.Korea detonated another Nuke? How will we fund it? where will the troops come from without a draft, and where will we train them now that many facilities have been closed. Iran, Iraq, Afganistan, Pakistan, N.Korea, Where will this money come from?? How large will the defense budget have to be? At what point do we bring all the troops home, Admit were writing checks our azz cant cash and turn everything over to the UN where it should have been all along.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 22:48:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "john2x"
    }, 
    {
        "content": "Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "intTime": 20090524, 
        "postID": 10, 
        "quote": "", 
        "reply": "Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 23:05:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\"", 
        "intTime": 20090524, 
        "postID": 11, 
        "quote": "Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "reply": " Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\"", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 23:48:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\" Agreed. The argument that Israel shouldn't try to prevent other nations from becoming nuclear is naive. The radicals of the islamic faith have openly stated their intention is to get their hands on nuclear weapons AND use them.", 
        "intTime": 20090524, 
        "postID": 12, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\"", 
        "reply": " Agreed. The argument that Israel shouldn't try to prevent other nations from becoming nuclear is naive. The radicals of the islamic faith have openly stated their intention is to get their hands on nuclear weapons AND use them.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 23:53:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "KoRnAdvocate"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "intTime": 20090525, 
        "postID": 13, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "reply": "", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 01:51:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "If anyone can tell me when Muslims didn't believe that their religion was the only true religion please stand up and be counted. How many out there believe that someday in your life time that there will be peace between Mulsims and Infidels please raise your hand. (I want everyone to see the real idiots on these boards).", 
        "intTime": 20090525, 
        "postID": 14, 
        "quote": "", 
        "reply": "If anyone can tell me when Muslims didn't believe that their religion was the only true religion please stand up and be counted. How many out there believe that someday in your life time that there will be peace between Mulsims and Infidels please raise your hand. (I want everyone to see the real idiots on these boards).", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 04:23:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Duster6"
    }, 
    {
        "content": "We believe what we do. NO I do not believe that all Muslims feel this way no more than I believe all Christians believe they are the only true religion. But there are plenty of far right wingers that do believe Christianity is the only true religion and it is quite logical for those to think that all Muslims believe the same for their faith. Thus the reason for many of wars in the past. Which is why we live in a nation where everyone has the right to worship whatever or whoever they want without retaliation or retribution.", 
        "intTime": 20090525, 
        "postID": 15, 
        "quote": "", 
        "reply": "We believe what we do. NO I do not believe that all Muslims feel this way no more than I believe all Christians believe they are the only true religion. But there are plenty of far right wingers that do believe Christianity is the only true religion and it is quite logical for those to think that all Muslims believe the same for their faith. Thus the reason for many of wars in the past. Which is why we live in a nation where everyone has the right to worship whatever or whoever they want without retaliation or retribution.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:00:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us. Maybe, but Iran is moving forward with a nuclear weapons program. Show me where the pro-westerner Iranians are not backing this and they are \"outraged\" at the current government for proceeding. The technology is there and they want the nukes. Now are you going to trust that these pro good guy Iranians are just going to cut off everything that has been advanced so far or if a new leader is elected he is just going to say ok lets stop this? If they were that horrified at the thought or the good guys were a majority and wanted to stop this, they would have taken that man out a long time ago. Israel has a finger on the trigger that I can assure you. They will/will not strike just because of our opinion on this form. They will do so if and when they think they have to. My opinion is the time is very close, they may or may not be waiting for the elections, but that is something they will decide upon for themselves and themselves alone, not from what any other country including the U.S. tells them. How could they possibly trust a U.S. call knowing how bad we screwed the pooch with Iraq? I sure in hell wouldn't no matter who was President because our government is too big and too out of touch with each other. The right arm still does not know what the left arm is doing and we are just as vulnerable today for another 911 as we were on 911.", 
        "intTime": 20090525, 
        "postID": 16, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "reply": " Maybe, but Iran is moving forward with a nuclear weapons program. Show me where the pro-westerner Iranians are not backing this and they are \"outraged\" at the current government for proceeding. The technology is there and they want the nukes. Now are you going to trust that these pro good guy Iranians are just going to cut off everything that has been advanced so far or if a new leader is elected he is just going to say ok lets stop this? If they were that horrified at the thought or the good guys were a majority and wanted to stop this, they would have taken that man out a long time ago. Israel has a finger on the trigger that I can assure you. They will/will not strike just because of our opinion on this form. They will do so if and when they think they have to. My opinion is the time is very close, they may or may not be waiting for the elections, but that is something they will decide upon for themselves and themselves alone, not from what any other country including the U.S. tells them. How could they possibly trust a U.S. call knowing how bad we screwed the pooch with Iraq? I sure in hell wouldn't no matter who was President because our government is too big and too out of touch with each other. The right arm still does not know what the left arm is doing and we are just as vulnerable today for another 911 as we were on 911.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:01:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. One will suffice. We are very tiny country.", 
        "intTime": 20090525, 
        "postID": 17, 
        "quote": "Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "reply": " One will suffice. We are very tiny country.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:07:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP Some sort of proof? Something?", 
        "intTime": 20090525, 
        "postID": 18, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "reply": " Some sort of proof? Something?", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:08:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090525, 
        "postID": 19, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 07:35:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "NSNN"
    }, 
    {
        "content": "This is gonna get bad. Between Iran and N Korea, there is gonna be a big war. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 20, 
        "quote": "", 
        "reply": "This is gonna get bad. Between Iran and N Korea, there is gonna be a big war. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 07:53:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "intTime": 20090524, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:04:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran?", 
        "intTime": 20090524, 
        "postID": 22, 
        "quote": "", 
        "reply": "51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran?", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:26:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Motive25"
    }, 
    {
        "content": "A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on.", 
        "intTime": 20090524, 
        "postID": 23, 
        "quote": "", 
        "reply": "A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:45:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true!", 
        "intTime": 20090524, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "reply": " CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true!", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 08:49:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090524, 
        "postID": 25, 
        "quote": "Originally posted by Agent991: A little nugget of poll data here \"But 74 percent of those questioned said they believe that new US President Barack Obama's efforts will not stop the Islamic republic from acquiring atomic weapons.\" Source.. BreitbartDOTcom. Yes, Motive the \"then what\" scenario is troubling. However, Israel is literally backed into a corner, For afterall, A-Jad vis a vis Iran firmly believes in the 12th Iman theory. Iran wants the demise of Isreal. Complete and total Descrution. And the USA is \"The Great Satan\". The Saber Rattling continues. On and on.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 09:27:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Agent991: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true! It is inevitable no matter what people may think. Then what? Some may ask. We either kill them all and win a REAL war, or we need to learn how to pray to Mohammed. Israel will not allow itself to perish. I do think after a good ass whoopin and many have died, Iran will stop it's BS, but that's the only way.", 
        "intTime": 20090524, 
        "postID": 26, 
        "quote": "Originally posted by Agent991: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. CJ! Nor do I. It seems inevitable. Our children will, as you say, have to deal with this. Sad but true!", 
        "reply": " It is inevitable no matter what people may think. Then what? Some may ask. We either kill them all and win a REAL war, or we need to learn how to pray to Mohammed. Israel will not allow itself to perish. I do think after a good ass whoopin and many have died, Iran will stop it's BS, but that's the only way.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 10:03:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "intTime": 20090524, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming.", 
        "reply": " You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 13:45:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us. And how many times must people like you be told that Iranian Presidents have absolutely zero power? It doesn't matter if Colin Powell gets elected President over there, the Ayatollah's call the shots, and they will not give up their pursuit of nuclear weapons... I for one am glad Israel is committed to the destruction of Irans nuclear ambitions, god speed and good luck...", 
        "intTime": 20090524, 
        "postID": 28, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "reply": " And how many times must people like you be told that Iranian Presidents have absolutely zero power? It doesn't matter if Colin Powell gets elected President over there, the Ayatollah's call the shots, and they will not give up their pursuit of nuclear weapons... I for one am glad Israel is committed to the destruction of Irans nuclear ambitions, god speed and good luck...", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 13:53:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Motive25: 51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran? How many fronts are we capabile of now that it is said N.Korea detonated another Nuke? How will we fund it? where will the troops come from without a draft, and where will we train them now that many facilities have been closed. Iran, Iraq, Afganistan, Pakistan, N.Korea, Where will this money come from?? How large will the defense budget have to be? At what point do we bring all the troops home, Admit were writing checks our azz cant cash and turn everything over to the UN where it should have been all along.", 
        "intTime": 20090524, 
        "postID": 29, 
        "quote": "Originally posted by Motive25: 51-49, with a +/- 4.5% margin of error, is not much hang a policy-making \"hat\" on. Second, the answer to the question \"then what?\" has not be articulated. Once a war is started with Iran, how will it be conducted and what is the exit strategy? Is Israel prepared for the fall out in & around it's own country? Also, is the US prepared for the implications of an attack on Iran?", 
        "reply": " How many fronts are we capabile of now that it is said N.Korea detonated another Nuke? How will we fund it? where will the troops come from without a draft, and where will we train them now that many facilities have been closed. Iran, Iraq, Afganistan, Pakistan, N.Korea, Where will this money come from?? How large will the defense budget have to be? At what point do we bring all the troops home, Admit were writing checks our azz cant cash and turn everything over to the UN where it should have been all along.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 22:48:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "john2x"
    }, 
    {
        "content": "Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "intTime": 20090524, 
        "postID": 30, 
        "quote": "", 
        "reply": "Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 23:05:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\"", 
        "intTime": 20090524, 
        "postID": 31, 
        "quote": "Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "reply": " Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\"", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 23:48:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\" Agreed. The argument that Israel shouldn't try to prevent other nations from becoming nuclear is naive. The radicals of the islamic faith have openly stated their intention is to get their hands on nuclear weapons AND use them.", 
        "intTime": 20090524, 
        "postID": 32, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. Israel has never had a racist mouth piece denying historical events such as the Holocaust. Israel is not controlled by religious fanatics. The comparision isn't even close. Just because a Police Officer has a weapon, doesnt mean the thug down the street can too just make things \"fair.\"", 
        "reply": " Agreed. The argument that Israel shouldn't try to prevent other nations from becoming nuclear is naive. The radicals of the islamic faith have openly stated their intention is to get their hands on nuclear weapons AND use them.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-24 23:53:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "KoRnAdvocate"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "intTime": 20090525, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "reply": "", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 01:51:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "If anyone can tell me when Muslims didn't believe that their religion was the only true religion please stand up and be counted. How many out there believe that someday in your life time that there will be peace between Mulsims and Infidels please raise your hand. (I want everyone to see the real idiots on these boards).", 
        "intTime": 20090525, 
        "postID": 34, 
        "quote": "", 
        "reply": "If anyone can tell me when Muslims didn't believe that their religion was the only true religion please stand up and be counted. How many out there believe that someday in your life time that there will be peace between Mulsims and Infidels please raise your hand. (I want everyone to see the real idiots on these boards).", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 04:23:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "Duster6"
    }, 
    {
        "content": "We believe what we do. NO I do not believe that all Muslims feel this way no more than I believe all Christians believe they are the only true religion. But there are plenty of far right wingers that do believe Christianity is the only true religion and it is quite logical for those to think that all Muslims believe the same for their faith. Thus the reason for many of wars in the past. Which is why we live in a nation where everyone has the right to worship whatever or whoever they want without retaliation or retribution.", 
        "intTime": 20090525, 
        "postID": 35, 
        "quote": "", 
        "reply": "We believe what we do. NO I do not believe that all Muslims feel this way no more than I believe all Christians believe they are the only true religion. But there are plenty of far right wingers that do believe Christianity is the only true religion and it is quite logical for those to think that all Muslims believe the same for their faith. Thus the reason for many of wars in the past. Which is why we live in a nation where everyone has the right to worship whatever or whoever they want without retaliation or retribution.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:00:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us. Maybe, but Iran is moving forward with a nuclear weapons program. Show me where the pro-westerner Iranians are not backing this and they are \"outraged\" at the current government for proceeding. The technology is there and they want the nukes. Now are you going to trust that these pro good guy Iranians are just going to cut off everything that has been advanced so far or if a new leader is elected he is just going to say ok lets stop this? If they were that horrified at the thought or the good guys were a majority and wanted to stop this, they would have taken that man out a long time ago. Israel has a finger on the trigger that I can assure you. They will/will not strike just because of our opinion on this form. They will do so if and when they think they have to. My opinion is the time is very close, they may or may not be waiting for the elections, but that is something they will decide upon for themselves and themselves alone, not from what any other country including the U.S. tells them. How could they possibly trust a U.S. call knowing how bad we screwed the pooch with Iraq? I sure in hell wouldn't no matter who was President because our government is too big and too out of touch with each other. The right arm still does not know what the left arm is doing and we are just as vulnerable today for another 911 as we were on 911.", 
        "intTime": 20090525, 
        "postID": 36, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: \"http://www.breitbart.com/article.php?id=CNG.278ae37b736a0478b7223156a3bcf18a.401&show_article=1\" add 1 to that. Lets get it over. I do not want my children to have to deal with what is coming. You do realize that Iran's Presidential elections are less than 3 weeks away - and that the reformist Mir Hossein Mousavi is predicted to win - provided nobody else does anything stupid (like Israel attacking Iran or increasing the threats to do so). Like it or not, Iran is changing to a more pro-Western outlook and the hardline Islamists are quickly losing power much as the Republicans did in 2008 - yet an attack on them will unify ALL of Iran against the West in general (and the US and Israel in particular) just like 9/11 unified us.", 
        "reply": " Maybe, but Iran is moving forward with a nuclear weapons program. Show me where the pro-westerner Iranians are not backing this and they are \"outraged\" at the current government for proceeding. The technology is there and they want the nukes. Now are you going to trust that these pro good guy Iranians are just going to cut off everything that has been advanced so far or if a new leader is elected he is just going to say ok lets stop this? If they were that horrified at the thought or the good guys were a majority and wanted to stop this, they would have taken that man out a long time ago. Israel has a finger on the trigger that I can assure you. They will/will not strike just because of our opinion on this form. They will do so if and when they think they have to. My opinion is the time is very close, they may or may not be waiting for the elections, but that is something they will decide upon for themselves and themselves alone, not from what any other country including the U.S. tells them. How could they possibly trust a U.S. call knowing how bad we screwed the pooch with Iraq? I sure in hell wouldn't no matter who was President because our government is too big and too out of touch with each other. The right arm still does not know what the left arm is doing and we are just as vulnerable today for another 911 as we were on 911.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:01:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. One will suffice. We are very tiny country.", 
        "intTime": 20090525, 
        "postID": 37, 
        "quote": "Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has.", 
        "reply": " One will suffice. We are very tiny country.", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:07:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP Some sort of proof? Something?", 
        "intTime": 20090525, 
        "postID": 38, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "reply": " Some sort of proof? Something?", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 06:08:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090525, 
        "postID": 39, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by nspreitler: Is Israel willing to give up its own stockpile of nuclear weapons and long range missiles? If not what right do they have to be upset if Tehran has them? I don't want to see a nuclear armed Iran, but what is Iran going to do with a handful of warheads versus the 100 or so Israel has. Israel has never called for the destruction of any state. The Israelis have actually carried it out. Israel has never had a racist mouth piece denying historical events such as the Holocaust. No, but they've done quite a bit to deny the massacres of Arab and Palestinian villages during thier war of independence, and more lately denying Shatila and Sabra - not to mention things like using WP on civilians during their spates with Lebanon and Gaza. Israel is not controlled by religious fanatics. BULLCRAP", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 07:35:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "NSNN"
    }, 
    {
        "content": "This is gonna get bad. Between Iran and N Korea, there is gonna be a big war. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 40, 
        "quote": "", 
        "reply": "This is gonna get bad. Between Iran and N Korea, there is gonna be a big war. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6210051422001", 
        "time": "2009-05-25 07:53:00", 
        "title": "Half of Israelis back immediate strike on Iran", 
        "userID": "L0A1"
    }
]