[
    {
        "content": "Seems like Kim's son may not be a frontrunner anymore to succeed him. Mind you I bet this will change a few times before and after Kim's death. quote: SEOUL (Reuters) - North Korean leader Kim Jong-il put to rest this week any doubt about whom he sees as his second in command when he elevated his brother-in-law Jang Song-taek to a powerful military post, analysts said on Friday. Kim, 67, was re-elected to his leadership post at parliament on Thursday but questions about his health, raised by a suspected stroke in August, remained. He cut a gaunt figure at the session and, his hair thinned and graying, walked with a limp onto stage. ++http://ca.news.yahoo.com/s/reuters/090410/world/international_us_korea_north_jang",
        "intTime": 20090410,
        "postID": 1,
        "quote": "SEOUL (Reuters) - North Korean leader Kim Jong-il put to rest this week any doubt about whom he sees as his second in command when he elevated his brother-in-law Jang Song-taek to a powerful military post, analysts said on Friday. Kim, 67, was re-elected to his leadership post at parliament on Thursday but questions about his health, raised by a suspected stroke in August, remained. He cut a gaunt figure at the session and, his hair thinned and graying, walked with a limp onto stage.",
        "reply": "Seems like Kim's son may not be a frontrunner anymore to succeed him. Mind you I bet this will change a few times before and after Kim's death.  ++http://ca.news.yahoo.com/s/reuters/090410/world/international_us_korea_north_jang",
        "threadID": "672198221_9050063022001",
        "time": "2009-04-10 09:02:00",
        "title": "Kim Jong Il reappears at North Korean assembly, removing all doubt he is alive",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "quote: Originally posted by Canuck_Centaur: Seems like Kim's son may not be a frontrunner anymore to succeed him. Mind you I bet this will change a few times before and after Kim's death. quote: SEOUL (Reuters) - North Korean leader Kim Jong-il put to rest this week any doubt about whom he sees as his second in command when he elevated his brother-in-law Jang Song-taek to a powerful military post, analysts said on Friday. Kim, 67, was re-elected to his leadership post at parliament on Thursday but questions about his health, raised by a suspected stroke in August, remained. He cut a gaunt figure at the session and, his hair thinned and graying, walked with a limp onto stage. ++http://ca.news.yahoo.com/s/reuters/090410/world/international_us_korea_north_jang Actually, it was a bottle of Glen Fiddich which addressed the \"assembly.\" I've had a hard time telling them apart for years. Enough Glen Fiddich, and even the dead can walk - So either way, they haven't made their case, err, argument... Dave",
        "intTime": 20090410,
        "postID": 2,
        "quote": "Originally posted by Canuck_Centaur: Seems like Kim's son may not be a frontrunner anymore to succeed him. Mind you I bet this will change a few times before and after Kim's death. quote: SEOUL (Reuters) - North Korean leader Kim Jong-il put to rest this week any doubt about whom he sees as his second in command when he elevated his brother-in-law Jang Song-taek to a powerful military post, analysts said on Friday. Kim, 67, was re-elected to his leadership post at parliament on Thursday but questions about his health, raised by a suspected stroke in August, remained. He cut a gaunt figure at the session and, his hair thinned and graying, walked with a limp onto stage. ++http://ca.news.yahoo.com/s/reuters/090410/world/international_us_korea_north_jang",
        "reply": " Actually, it was a bottle of Glen Fiddich which addressed the \"assembly.\" I've had a hard time telling them apart for years. Enough Glen Fiddich, and even the dead can walk - So either way, they haven't made their case, err, argument... Dave",
        "threadID": "672198221_9050063022001",
        "time": "2009-04-10 09:28:00",
        "title": "Kim Jong Il reappears at North Korean assembly, removing all doubt he is alive",
        "userID": "Grachus"
    },
    {
        "content": "its a look alike...",
        "intTime": 20090410,
        "postID": 3,
        "quote": "",
        "reply": "its a look alike...",
        "threadID": "672198221_9050063022001",
        "time": "2009-04-10 10:04:00",
        "title": "Kim Jong Il reappears at North Korean assembly, removing all doubt he is alive",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by outlaws93: its a look alike... Naah, it's the real Glen Fiddich. He was knocken down a case a day, and metamorphasised into a giant bottle of the stuff. I know my Scotch! Single Malt forever! Dave",
        "intTime": 20090410,
        "postID": 4,
        "quote": "Originally posted by outlaws93: its a look alike...",
        "reply": " Naah, it's the real Glen Fiddich. He was knocken down a case a day, and metamorphasised into a giant bottle of the stuff. I know my Scotch! Single Malt forever! Dave",
        "threadID": "672198221_9050063022001",
        "time": "2009-04-10 10:53:00",
        "title": "Kim Jong Il reappears at North Korean assembly, removing all doubt he is alive",
        "userID": "Grachus"
    },
    {
        "content": "Who doubted he was still alive? I didn't. We'll know when he's dead because all of the people in that country will be forced to mourn for two straight weeks for the loss of their; \"Dear Leader.\" Definitely not looking forward to that crap clogging up the mainstream news for two straight weeks. This message has been edited. Last edited by: mrmixitup, Fri 10 April 2009 12:07 PM",
        "intTime": 20090410,
        "postID": 5,
        "quote": "",
        "reply": "Who doubted he was still alive? I didn't. We'll know when he's dead because all of the people in that country will be forced to mourn for two straight weeks for the loss of their; \"Dear Leader.\" Definitely not looking forward to that crap clogging up the mainstream news for two straight weeks. This message has been edited. Last edited by: mrmixitup, Fri 10 April 2009 12:07 PM",
        "threadID": "672198221_9050063022001",
        "time": "2009-04-10 11:51:00",
        "title": "Kim Jong Il reappears at North Korean assembly, removing all doubt he is alive",
        "userID": "mrmixitup"
    }
]