[
    {
        "content": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "intTime": 20090504,
        "postID": 1,
        "quote": "",
        "reply": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:51:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "intTime": 20090504,
        "postID": 2,
        "quote": "",
        "reply": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Kegler300"
    },
    {
        "content": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "intTime": 20090504,
        "postID": 3,
        "quote": "",
        "reply": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:02:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "intTime": 20090504,
        "postID": 4,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:56:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "intTime": 20090504,
        "postID": 5,
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "reply": " The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:03:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 6,
        "quote": "",
        "reply": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "intTime": 20090504,
        "postID": 7,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:08:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "The tax man...",
        "intTime": 20090504,
        "postID": 8,
        "quote": "",
        "reply": "The tax man...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by EAG154: The tax man... A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "intTime": 20090504,
        "postID": 9,
        "quote": "Originally posted by EAG154: The tax man...",
        "reply": " A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "intTime": 20090504,
        "postID": 10,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "ArtMarsh"
    },
    {
        "content": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "intTime": 20090504,
        "postID": 11,
        "quote": "",
        "reply": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:52:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "intTime": 20090504,
        "postID": 12,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 21:59:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "john2x"
    },
    {
        "content": "quote: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? I suppose after AIG has a child and makes less than 30k a year.",
        "intTime": 20090504,
        "postID": 13,
        "quote": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too?",
        "reply": " I suppose after AIG has a child and makes less than 30k a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:45:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: I believe he's already had a whack at charitable deductions proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "intTime": 20090504,
        "postID": 14,
        "quote": "I believe he's already had a whack at charitable deductions",
        "reply": " proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:47:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course. ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "intTime": 20090505,
        "postID": 15,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "reply": " ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:33:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "intTime": 20090505,
        "postID": 16,
        "quote": "Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go.",
        "reply": " I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:37:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions? Had to be Kilnton or B. Hussain Obama",
        "intTime": 20090505,
        "postID": 17,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "reply": " Had to be Kilnton or B. Hussain Obama",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:38:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "intTime": 20090505,
        "postID": 18,
        "quote": "",
        "reply": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:20:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that? When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "intTime": 20090505,
        "postID": 19,
        "quote": "Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "reply": " When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "A_Savage"
    },
    {
        "content": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "intTime": 20090505,
        "postID": 20,
        "quote": "",
        "reply": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 05:12:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "GlassOnion"
    },
    {
        "content": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "intTime": 20090504,
        "postID": 21,
        "quote": "",
        "reply": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:51:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "intTime": 20090504,
        "postID": 22,
        "quote": "",
        "reply": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Kegler300"
    },
    {
        "content": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "intTime": 20090504,
        "postID": 23,
        "quote": "",
        "reply": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:02:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "intTime": 20090504,
        "postID": 24,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:56:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "intTime": 20090504,
        "postID": 25,
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "reply": " The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:03:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 26,
        "quote": "",
        "reply": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "intTime": 20090504,
        "postID": 27,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:08:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "The tax man...",
        "intTime": 20090504,
        "postID": 28,
        "quote": "",
        "reply": "The tax man...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by EAG154: The tax man... A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "intTime": 20090504,
        "postID": 29,
        "quote": "Originally posted by EAG154: The tax man...",
        "reply": " A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "intTime": 20090504,
        "postID": 30,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "ArtMarsh"
    },
    {
        "content": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "intTime": 20090504,
        "postID": 31,
        "quote": "",
        "reply": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:52:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "intTime": 20090504,
        "postID": 32,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 21:59:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "john2x"
    },
    {
        "content": "quote: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? I suppose after AIG has a child and makes less than 30k a year.",
        "intTime": 20090504,
        "postID": 33,
        "quote": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too?",
        "reply": " I suppose after AIG has a child and makes less than 30k a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:45:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: I believe he's already had a whack at charitable deductions proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "intTime": 20090504,
        "postID": 34,
        "quote": "I believe he's already had a whack at charitable deductions",
        "reply": " proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:47:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course. ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "intTime": 20090505,
        "postID": 35,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "reply": " ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:33:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "intTime": 20090505,
        "postID": 36,
        "quote": "Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go.",
        "reply": " I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:37:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions? Had to be Kilnton or B. Hussain Obama",
        "intTime": 20090505,
        "postID": 37,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "reply": " Had to be Kilnton or B. Hussain Obama",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:38:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "intTime": 20090505,
        "postID": 38,
        "quote": "",
        "reply": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:20:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that? When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "intTime": 20090505,
        "postID": 39,
        "quote": "Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "reply": " When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "A_Savage"
    },
    {
        "content": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "intTime": 20090505,
        "postID": 40,
        "quote": "",
        "reply": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 05:12:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "GlassOnion"
    },
    {
        "content": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "intTime": 20090504,
        "postID": 41,
        "quote": "",
        "reply": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:51:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "intTime": 20090504,
        "postID": 42,
        "quote": "",
        "reply": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Kegler300"
    },
    {
        "content": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "intTime": 20090504,
        "postID": 43,
        "quote": "",
        "reply": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:02:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "intTime": 20090504,
        "postID": 44,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:56:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "intTime": 20090504,
        "postID": 45,
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "reply": " The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:03:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 46,
        "quote": "",
        "reply": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "intTime": 20090504,
        "postID": 47,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:08:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "The tax man...",
        "intTime": 20090504,
        "postID": 48,
        "quote": "",
        "reply": "The tax man...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by EAG154: The tax man... A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "intTime": 20090504,
        "postID": 49,
        "quote": "Originally posted by EAG154: The tax man...",
        "reply": " A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "intTime": 20090504,
        "postID": 50,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "ArtMarsh"
    },
    {
        "content": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "intTime": 20090504,
        "postID": 51,
        "quote": "",
        "reply": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:52:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "intTime": 20090504,
        "postID": 52,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 21:59:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "john2x"
    },
    {
        "content": "quote: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? I suppose after AIG has a child and makes less than 30k a year.",
        "intTime": 20090504,
        "postID": 53,
        "quote": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too?",
        "reply": " I suppose after AIG has a child and makes less than 30k a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:45:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: I believe he's already had a whack at charitable deductions proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "intTime": 20090504,
        "postID": 54,
        "quote": "I believe he's already had a whack at charitable deductions",
        "reply": " proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:47:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course. ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "intTime": 20090505,
        "postID": 55,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "reply": " ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:33:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "intTime": 20090505,
        "postID": 56,
        "quote": "Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go.",
        "reply": " I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:37:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions? Had to be Kilnton or B. Hussain Obama",
        "intTime": 20090505,
        "postID": 57,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "reply": " Had to be Kilnton or B. Hussain Obama",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:38:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "intTime": 20090505,
        "postID": 58,
        "quote": "",
        "reply": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:20:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that? When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "intTime": 20090505,
        "postID": 59,
        "quote": "Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "reply": " When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "A_Savage"
    },
    {
        "content": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "intTime": 20090505,
        "postID": 60,
        "quote": "",
        "reply": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 05:12:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "GlassOnion"
    },
    {
        "content": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "intTime": 20090504,
        "postID": 61,
        "quote": "",
        "reply": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:51:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "intTime": 20090504,
        "postID": 62,
        "quote": "",
        "reply": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Kegler300"
    },
    {
        "content": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "intTime": 20090504,
        "postID": 63,
        "quote": "",
        "reply": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:02:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "intTime": 20090504,
        "postID": 64,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:56:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "intTime": 20090504,
        "postID": 65,
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "reply": " The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:03:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 66,
        "quote": "",
        "reply": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "intTime": 20090504,
        "postID": 67,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:08:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "The tax man...",
        "intTime": 20090504,
        "postID": 68,
        "quote": "",
        "reply": "The tax man...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by EAG154: The tax man... A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "intTime": 20090504,
        "postID": 69,
        "quote": "Originally posted by EAG154: The tax man...",
        "reply": " A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "intTime": 20090504,
        "postID": 70,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "ArtMarsh"
    },
    {
        "content": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "intTime": 20090504,
        "postID": 71,
        "quote": "",
        "reply": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:52:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "intTime": 20090504,
        "postID": 72,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 21:59:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "john2x"
    },
    {
        "content": "quote: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? I suppose after AIG has a child and makes less than 30k a year.",
        "intTime": 20090504,
        "postID": 73,
        "quote": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too?",
        "reply": " I suppose after AIG has a child and makes less than 30k a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:45:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: I believe he's already had a whack at charitable deductions proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "intTime": 20090504,
        "postID": 74,
        "quote": "I believe he's already had a whack at charitable deductions",
        "reply": " proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:47:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course. ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "intTime": 20090505,
        "postID": 75,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "reply": " ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:33:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "intTime": 20090505,
        "postID": 76,
        "quote": "Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go.",
        "reply": " I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:37:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions? Had to be Kilnton or B. Hussain Obama",
        "intTime": 20090505,
        "postID": 77,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "reply": " Had to be Kilnton or B. Hussain Obama",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:38:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "intTime": 20090505,
        "postID": 78,
        "quote": "",
        "reply": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:20:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that? When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "intTime": 20090505,
        "postID": 79,
        "quote": "Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "reply": " When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "A_Savage"
    },
    {
        "content": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "intTime": 20090505,
        "postID": 80,
        "quote": "",
        "reply": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 05:12:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "GlassOnion"
    },
    {
        "content": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "intTime": 20090504,
        "postID": 81,
        "quote": "",
        "reply": "\"http://news.bbc.co.uk/2/hi/business/8032747.stm\" It's not the fairtax which is what I want, but it is a step in the right direction under the current screwed up system. \"'Corporate loopholes' He wants to close tax provisions that allow firms to put off paying taxes on profits made overseas as long as those earnings are invested back into the overseas subsidiaries. \"The steps I am announcing today will help us deal with some of the more egregious examples of what is wrong with our tax code,\" he said at a joint announcement with Treasury Secretary Timothy Geithner. While \"most Americans meet their responsibilities\" with regard to tax, he said there were others shirking theirs. He now needs congressional approval for the changes, which some business leaders oppose, before they could come into effect in 2011. The president said his proposals would fix a tax code \"full of corporate loopholes \" which encourage US companies to send jobs overseas.\" This has been needed for a long time. For those of you that think this is an outrage consider this, go fairtax then you won't have to worry about business paying taxes period, and we won't have to worry about those business owners taking tax deductions \"in the name of the business\" as a way to skirt around paying their individual shares.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:51:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "intTime": 20090504,
        "postID": 82,
        "quote": "",
        "reply": "It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. \"The World's Finest\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 09:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Kegler300"
    },
    {
        "content": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "intTime": 20090504,
        "postID": 83,
        "quote": "",
        "reply": "Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:02:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "intTime": 20090504,
        "postID": 84,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 10:56:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "intTime": 20090504,
        "postID": 85,
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave",
        "reply": " The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:03:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "crackerjacks61"
    },
    {
        "content": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090504,
        "postID": 86,
        "quote": "",
        "reply": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "intTime": 20090504,
        "postID": 87,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " I believe he's already had a whack at charitable deductions, another would not be a surprise.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:08:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "The tax man...",
        "intTime": 20090504,
        "postID": 88,
        "quote": "",
        "reply": "The tax man...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 18:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by EAG154: The tax man... A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "intTime": 20090504,
        "postID": 89,
        "quote": "Originally posted by EAG154: The tax man...",
        "reply": " A little mood music: \"http://www.youtube.com/watch?v=Ct8HYm10tlI\"",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:06:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "adminnco1"
    },
    {
        "content": "quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "intTime": 20090504,
        "postID": 90,
        "quote": "Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc.",
        "reply": " Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:44:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "ArtMarsh"
    },
    {
        "content": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "intTime": 20090504,
        "postID": 91,
        "quote": "",
        "reply": "It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 19:52:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "intTime": 20090504,
        "postID": 92,
        "quote": "Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway.",
        "reply": " Thats not really true CrackerJack the tax laws apply to everyone you just need position yourself to have them available to you plus a good tax advisor and a business. Then with some creativity your in the same league as the big boys on a smaller scale. And the best part is its all perfectly legal. As I always said you need to spead money to make money. Saving a few bucks doing it yourself or H&R block isnt going to cut it. Its penny wise and pound foolish.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 21:59:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "john2x"
    },
    {
        "content": "quote: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? I suppose after AIG has a child and makes less than 30k a year.",
        "intTime": 20090504,
        "postID": 93,
        "quote": "\"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too?",
        "reply": " I suppose after AIG has a child and makes less than 30k a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:45:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: I believe he's already had a whack at charitable deductions proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "intTime": 20090504,
        "postID": 94,
        "quote": "I believe he's already had a whack at charitable deductions",
        "reply": " proposed as a drop from 33% to 28%. not exactly earth shattering.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-04 22:47:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course. ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "intTime": 20090505,
        "postID": 95,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Works for me. I have yet to date been able to take any of those so called deductions. Must mean, unless your amoung the top fortune 500 companies your sol anyway. You're going to learn something very interesting from the recent moves by the administration (Swiss Bank accounts, off shore bank accounts, loopholes, etc). I've been telling you that the wealthy who are in fact the sponsors of ALL the flat tax schemes, often use the argument that rich people use loopholes, therefore let's have a flat tax. You're going to find out that the same people who sponsor the flat taxes are going to be enraged at this loophole elimination schemes. Dave The difference between this scheme and the fairtax Dave? Jobs Jobs Jobs. If this works, maybe the FairTax won't be needed and I will stop pressing for it. We need our industrial base back in this country for many reasons, not just jobs of course.",
        "reply": " ...I have to admit...if he pulls this off I will vote him in forever....however those old fellas on the Hill will kill this... Already past the future",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:33:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go. I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "intTime": 20090505,
        "postID": 96,
        "quote": "Originally posted by L0A1: \"Tax Loppholes\" A child deduction is a loophole. Earn income credit is a loophole. So what is next, will he start getting rid of these things too? LOL, then he MUST prove these companies are not paying taxes to other countries, after all a person can not be taxed twice on the same income. I still think a Flat Tax is the way to go.",
        "reply": " I think there is a difference between a loophole that the government provides to the tax payer, and hiding your money overseas to avoid paying any tax.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:37:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions? Had to be Kilnton or B. Hussain Obama",
        "intTime": 20090505,
        "postID": 97,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by Kegler300: It's only a matter time before he closes tax loopholes used by everyday citizens like the mortgage interest deduction, charitable deductions, etc. Just out of curiosity... who closed the credit card and other interest paid federal deductions?",
        "reply": " Had to be Kilnton or B. Hussain Obama",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 03:38:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "xnavycg"
    },
    {
        "content": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "intTime": 20090505,
        "postID": 98,
        "quote": "",
        "reply": "800 new federal jobs for the IRS folks, 10 year time frame to catch these off shore tax cheats and millions of dollars spent on this. Yea, it is my guess that many of these CEO's, bank presidents, politicians will only need a few weeks to get their money and hide it somewhere else. But hey, we must do it simply because in the next 10 years our interest we will have to pay on the money we have borrowed from China and our friends who own the oil fields in the Middle East will be 1 Trillion bucks a year.",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:20:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that? When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "intTime": 20090505,
        "postID": 99,
        "quote": "Originally posted by Duster6: It is nice to know that Obama is going after the punks who take advantage of the loop holes in the tax system by the rich and famous but they only make up about 2% of the population. What about the 30 plus percent of Americans living in the US that don't pay taxes? How about going after them...Plus he said on tv today that this will be a slow process and will take about 10 years. Wow it only took us 10 years to put a man on the moon and yet we can't put an end to these cheating scumbags even though he is going to hire 800 more IRS agents to go after them??? Whats up with that?",
        "reply": " When you factor in the fact the top 1% of the population is holding 40% of the money and the top 15% has 70% of this nations wealth -- it can be a big chunk of change that folks are avoiding paying their fair share on. Please note this is from the year 2000 and its gone downhill since then. --Savage",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 04:58:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "A_Savage"
    },
    {
        "content": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "intTime": 20090505,
        "postID": 100,
        "quote": "",
        "reply": "The Irony of hypocrisy... as if those evil corporations wrote the legislation to create those loop holes... oh, but that doesn't count..? Remove the loopholes for all - create a flat-tax and allow ALL citizens to pay their own taxes. Why should businesses be forced to do the gov's job of collecting taxes. Instead of payroll deductions - let the people pay their own taxes. Why should corporations pay any taxes? Corporations don't use any benefits - a company does NOT get SSC checks, unemployment checks, or welfare..? Why not TAX the money that becomes \"income\" for the individuals - but NOT tax the companies so the money can go into creating more businesses - bigger businesses...? If the CEO's of these companies were paying the same 15% flat tax as me & you, why should the gov then tax those companies too? That means the owners of those companies are TAXED TWICE! Blaming corporations for using loopholes is akin to blaming someone for using coupons or discount stores... It's akink to blaming Toyota for the problems in Detroit... Corporations do not STEAL or abuse any laws - PEOPLE DO... Guns don't decide who they shoot - PEOPLE DO... Obama is simply following his soclialist liberation strategy - create the class warfare and cause the divisions - then continually blame the rich while simultaneously changing the definition of rich... It won't last too long - more & more companies will be pulling out. When people start spending 5-10 bucks for a 20oz single Pepsi - they'll start getting the message that socialism has NOT worked anywhere else - it is NOT going to work here... but then, maybe not...",
        "threadID": "672198221_9480054222001",
        "time": "2009-05-05 05:12:00",
        "title": "Obama crackdown on tax loopholes",
        "userID": "GlassOnion"
    }
]