[
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Recently in the news a woman who already has 6 children just delivered 8 more. She had some type of fertilely injection. Do you all think this is acceptable and if so why? From what I know on this news story is that she is a woman possessed with having children. But how can she afford 14 kids? IMO I think she is having them just to collect more welfare money and food stamps. The cost to tax payers is going to be in the millions of dollars. What about the doctors that approved this medical treatment? I hope this case opens some eyes in our government. If a woman wants to have 14 kids then have at it. Just don't expect me to pay for it. Some people do this all the time. Have kids just so they can get more money out of the tax payers. Very Sad. Gents, this is just another reason why we need to get off the freebie system and go to a flat sales tax \"www.fairtax.org\" It's not perfect, but it beats the heck out of what we got now. \"www.zaptheirs.com\" join us UNITE in our non-partisan effort! From what I have been told, the feds are looking into taking all the kids away from her. I assume they already have taken the latest eight away. Rather then support the bimbo and all her offsprings, I would think the welfare departmtne along with child welfare would be much better off finding quarters for all 14 of the children, hire a nurse on call, hire a few folks to care for the kids and send the bimbo to a work farm, along with the idiot that impregnated her, he/she needs their license removed along with what brains remianing in their itty bitty head............Ringo", 
        "intTime": 20090315, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Duster6: Recently in the news a woman who already has 6 children just delivered 8 more. She had some type of fertilely injection. Do you all think this is acceptable and if so why? From what I know on this news story is that she is a woman possessed with having children. But how can she afford 14 kids? IMO I think she is having them just to collect more welfare money and food stamps. The cost to tax payers is going to be in the millions of dollars. What about the doctors that approved this medical treatment? I hope this case opens some eyes in our government. If a woman wants to have 14 kids then have at it. Just don't expect me to pay for it. Some people do this all the time. Have kids just so they can get more money out of the tax payers. Very Sad. Gents, this is just another reason why we need to get off the freebie system and go to a flat sales tax \"www.fairtax.org\" It's not perfect, but it beats the heck out of what we got now. \"www.zaptheirs.com\" join us UNITE in our non-partisan effort!", 
        "reply": " From what I have been told, the feds are looking into taking all the kids away from her. I assume they already have taken the latest eight away. Rather then support the bimbo and all her offsprings, I would think the welfare departmtne along with child welfare would be much better off finding quarters for all 14 of the children, hire a nurse on call, hire a few folks to care for the kids and send the bimbo to a work farm, along with the idiot that impregnated her, he/she needs their license removed along with what brains remianing in their itty bitty head............Ringo", 
        "threadID": "672198221_1800099312001", 
        "time": "2009-03-15 00:13:00", 
        "title": "Eight is enough, or is it?", 
        "userID": "RingosRule"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Recently in the news a woman who already has 6 children just delivered 8 more. She had some type of fertilely injection. Do you all think this is acceptable and if so why? From what I know on this news story is that she is a woman possessed with having children. But how can she afford 14 kids? IMO I think she is having them just to collect more welfare money and food stamps. The cost to tax payers is going to be in the millions of dollars. What about the doctors that approved this medical treatment? I hope this case opens some eyes in our government. If a woman wants to have 14 kids then have at it. Just don't expect me to pay for it. Some people do this all the time. Have kids just so they can get more money out of the tax payers. Very Sad. Gents, this is just another reason why we need to get off the freebie system and go to a flat sales tax \"www.fairtax.org\" It's not perfect, but it beats the heck out of what we got now. \"www.zaptheirs.com\" join us UNITE in our non-partisan effort! Wow....this is scary. I'm actually agreeing with crackerjacks on something. I have been reading up on the Fair Tax, and the Flat Tax. I do believe this \"tax\" topic should be addressed elsewhere. But since I'm already talking about it, does anyone have any opinions on the 2 tax systems mentioned here? Both have merit, and I would consider either if worded properly.", 
        "intTime": 20090315, 
        "postID": 9, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Duster6: Recently in the news a woman who already has 6 children just delivered 8 more. She had some type of fertilely injection. Do you all think this is acceptable and if so why? From what I know on this news story is that she is a woman possessed with having children. But how can she afford 14 kids? IMO I think she is having them just to collect more welfare money and food stamps. The cost to tax payers is going to be in the millions of dollars. What about the doctors that approved this medical treatment? I hope this case opens some eyes in our government. If a woman wants to have 14 kids then have at it. Just don't expect me to pay for it. Some people do this all the time. Have kids just so they can get more money out of the tax payers. Very Sad. Gents, this is just another reason why we need to get off the freebie system and go to a flat sales tax \"www.fairtax.org\" It's not perfect, but it beats the heck out of what we got now. \"www.zaptheirs.com\" join us UNITE in our non-partisan effort!", 
        "reply": " Wow....this is scary. I'm actually agreeing with crackerjacks on something. I have been reading up on the Fair Tax, and the Flat Tax. I do believe this \"tax\" topic should be addressed elsewhere. But since I'm already talking about it, does anyone have any opinions on the 2 tax systems mentioned here? Both have merit, and I would consider either if worded properly.", 
        "threadID": "672198221_1800099312001", 
        "time": "2009-03-15 01:55:00", 
        "title": "Eight is enough, or is it?", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Recently in the news a woman who already has 6 children just delivered 8 more. She had some type of fertilely injection. Do you all think this is acceptable and if so why? From what I know on this news story is that she is a woman possessed with having children. But how can she afford 14 kids? IMO I think she is having them just to collect more welfare money and food stamps. The cost to tax payers is going to be in the millions of dollars. What about the doctors that approved this medical treatment? I hope this case opens some eyes in our government. If a woman wants to have 14 kids then have at it. Just don't expect me to pay for it. Some people do this all the time. Have kids just so they can get more money out of the tax payers. Very Sad. Gents, this is just another reason why we need to get off the freebie system and go to a flat sales tax \"www.fairtax.org\" It's not perfect, but it beats the heck out of what we got now. \"www.zaptheirs.com\" join us UNITE in our non-partisan effort! Wow....this is scary. I'm actually agreeing with crackerjacks on something. I have been reading up on the Fair Tax, and the Flat Tax. I do believe this \"tax\" topic should be addressed elsewhere. But since I'm already talking about it, does anyone have any opinions on the 2 tax systems mentioned here? Both have merit, and I would consider either if worded properly. My \"opinion\" of course - But all these fair tax, flat tax systems are, Although often well intentioned, just elaborate scams that will pass more of the tax burden from the wealthy to the Middle and Working Class. While at first glance Middle and Working class people \"seem\" to benefit, actually these schemes will result in less revenue, which means less monies from the Feds to the States. This in turn will result in more State and Local taxes, which are ALWAYS regressive and unfair. So for example my State (New York) s proposing new tolls which will cost a working person an additional $1200 a year (which is one hell of a HUGE TAX HIKE). Not to mention uping the sales tax a few percentage points. These fair tax, flat tax schemes are being proposed because the present Progressive tax is in fact full of loop holes - As if to say that any new tax scheme will not have loop holes? Killing the progressive tax system has been the dream of \"some\" silly Conservatives for quite a long time. These schemes always sound good. Everyone pays less, and somehow, there will be more monies... Dave Dave", 
        "intTime": 20090315, 
        "postID": 10, 
        "quote": "Originally posted by badmac933: quote: Originally posted by crackerjacks61: quote: Originally posted by Duster6: Recently in the news a woman who already has 6 children just delivered 8 more. She had some type of fertilely injection. Do you all think this is acceptable and if so why? From what I know on this news story is that she is a woman possessed with having children. But how can she afford 14 kids? IMO I think she is having them just to collect more welfare money and food stamps. The cost to tax payers is going to be in the millions of dollars. What about the doctors that approved this medical treatment? I hope this case opens some eyes in our government. If a woman wants to have 14 kids then have at it. Just don't expect me to pay for it. Some people do this all the time. Have kids just so they can get more money out of the tax payers. Very Sad. Gents, this is just another reason why we need to get off the freebie system and go to a flat sales tax \"www.fairtax.org\" It's not perfect, but it beats the heck out of what we got now. \"www.zaptheirs.com\" join us UNITE in our non-partisan effort! Wow....this is scary. I'm actually agreeing with crackerjacks on something. I have been reading up on the Fair Tax, and the Flat Tax. I do believe this \"tax\" topic should be addressed elsewhere. But since I'm already talking about it, does anyone have any opinions on the 2 tax systems mentioned here? Both have merit, and I would consider either if worded properly.", 
        "reply": " My \"opinion\" of course - But all these fair tax, flat tax systems are, Although often well intentioned, just elaborate scams that will pass more of the tax burden from the wealthy to the Middle and Working Class. While at first glance Middle and Working class people \"seem\" to benefit, actually these schemes will result in less revenue, which means less monies from the Feds to the States. This in turn will result in more State and Local taxes, which are ALWAYS regressive and unfair. So for example my State (New York) s proposing new tolls which will cost a working person an additional $1200 a year (which is one hell of a HUGE TAX HIKE). Not to mention uping the sales tax a few percentage points. These fair tax, flat tax schemes are being proposed because the present Progressive tax is in fact full of loop holes - As if to say that any new tax scheme will not have loop holes? Killing the progressive tax system has been the dream of \"some\" silly Conservatives for quite a long time. These schemes always sound good. Everyone pays less, and somehow, there will be more monies... Dave Dave", 
        "threadID": "672198221_1800099312001", 
        "time": "2009-03-15 09:30:00", 
        "title": "Eight is enough, or is it?", 
        "userID": "Grachus"
    }
]