[
    {
        "content": "I'm shocked; shocked I tell you that there was also an intelligence and analysis assessment done on the ‘threat’ from left-wing extremist by DHS/FBI back in January. So does that mean that the DHS/FBI is really ‘fair & balanced’ when it comes to looking at threats on both sides of the ‘extremist’ spectrum? Or is it just the 'right' that they look at, as some of you seem to believe? http://www.foxnews.com/politics/first100days/2009/04/14/homeland-security-warns-rise-right-wing-extremism/ http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "", 
        "reply": "I'm shocked; shocked I tell you that there was also an intelligence and analysis assessment done on the ‘threat’ from left-wing extremist by DHS/FBI back in January. So does that mean that the DHS/FBI is really ‘fair & balanced’ when it comes to looking at threats on both sides of the ‘extremist’ spectrum? Or is it just the 'right' that they look at, as some of you seem to believe? http://www.foxnews.com/politics/first100days/2009/04/14/homeland-security-warns-rise-right-wing-extremism/ http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-15 14:22:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "They look at extremism from all angles. It's just that some people are more sensitive about it than others.", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "", 
        "reply": "They look at extremism from all angles. It's just that some people are more sensitive about it than others.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-15 14:30:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others.", 
        "reply": " Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-15 14:33:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town. That doesn't count.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town.", 
        "reply": " That doesn't count.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-15 14:44:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by jdksfcret: quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town. That doesn't count. But wait a minute, aren’t domestic terrorists just as dangerous as Islamic terrorists? This BS about the report targeting ‘veterans’ is way out in left field; doesn’t anyone think that government agencies might just as easily recruit veterans to infiltrate right wing and left wing ‘extremist’ groups to bring them down as well? By the way; why didn’t similar ‘assessments’ ever come out during the previous administration? The DHS under President Bush was apparently more reluctant to make such assessments about the right. According to CQ, a 2005 report outlining terrorist threats does not mention anti-government groups, white supremacists and other radical right-wing movements.\" >>>http://alaric2rh.home.sprynet.com/science/christianterrorists050325.txt", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by jdksfcret: quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town. That doesn't count.", 
        "reply": " But wait a minute, aren’t domestic terrorists just as dangerous as Islamic terrorists? This BS about the report targeting ‘veterans’ is way out in left field; doesn’t anyone think that government agencies might just as easily recruit veterans to infiltrate right wing and left wing ‘extremist’ groups to bring them down as well? By the way; why didn’t similar ‘assessments’ ever come out during the previous administration? The DHS under President Bush was apparently more reluctant to make such assessments about the right. According to CQ, a 2005 report outlining terrorist threats does not mention anti-government groups, white supremacists and other radical right-wing movements.\" >>>http://alaric2rh.home.sprynet.com/science/christianterrorists050325.txt", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-15 15:07:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Big difference, that report sited real incidents and the newest one(Right) didnt and groups that have a history of violence. And it didnt list Liberal beliefs as reasons for it. \"(U//FOUO) DHS/Office of Intelligence and Analysis defines leftwing extremists as groups or individuals who embrace radical elements of the anarchist, animal rights, or environmental movements and are often willing to violate the law to achieve their objectives.\" So are these core beliefs of Libs? \"The DHS/Office of Intelligence and Analysis (I&A) has no specific information that domestic rightwing* terrorists are currently planning acts of violence, but rightwing extremists may be gaining new recruits by playing on their fears about several emergent issues.\" Homeland Security Office of Intelligence and Analysis defines \"rightwing extremism in the United States\" as including not just racist or hate groups, but also groups that reject federal authority in favor of state or local authority. \"It may include groups and individuals that are dedicated to a single-issue, such as opposition to abortion or immigration,\" the warning says. No data no history just speculation.", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others.", 
        "reply": " Big difference, that report sited real incidents and the newest one(Right) didnt and groups that have a history of violence. And it didnt list Liberal beliefs as reasons for it. \"(U//FOUO) DHS/Office of Intelligence and Analysis defines leftwing extremists as groups or individuals who embrace radical elements of the anarchist, animal rights, or environmental movements and are often willing to violate the law to achieve their objectives.\" So are these core beliefs of Libs? \"The DHS/Office of Intelligence and Analysis (I&A) has no specific information that domestic rightwing* terrorists are currently planning acts of violence, but rightwing extremists may be gaining new recruits by playing on their fears about several emergent issues.\" Homeland Security Office of Intelligence and Analysis defines \"rightwing extremism in the United States\" as including not just racist or hate groups, but also groups that reject federal authority in favor of state or local authority. \"It may include groups and individuals that are dedicated to a single-issue, such as opposition to abortion or immigration,\" the warning says. No data no history just speculation.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-16 06:13:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by mcgreer: quote: Originally posted by jdksfcret: quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town. That doesn't count. But wait a minute, aren’t domestic terrorists just as dangerous as Islamic terrorists? Ask Ayers he could answer that This BS about the report targeting ‘veterans’ is way out in left field; doesn’t anyone think that government agencies might just as easily recruit veterans to infiltrate right wing and left wing ‘extremist’ groups to bring them down as well? By the way; why didn’t similar ‘assessments’ ever come out during the previous administration? The DHS under President Bush was apparently more reluctant to make such assessments about the right. According to CQ, a 2005 report outlining terrorist threats does not mention anti-government groups, white supremacists and other radical right-wing movements.\" >>>http://alaric2rh.home.sprynet.com/science/christianterrorists050325.txt The reason it doesnt mention them is because there was no evidence of them planning and conducting attacks. Running your piehole saying stupid things is not against the law. It Seems its not only rightwingers and vets that have a problem with this: quote: The top House Democrat overseeing the Department of Homeland Security is demanding that officials there explain how and why they wrote and released a controversial report identifying veterans as potential terrorist threats. Rep. Bennie G. Thompson of Mississippi, chairman of the House Homeland Security Committee, said in a letter to DHS Secretary Janet Napolitano that he was “dumbfounded” such a report would be issued. “This report appears to raise significant issues involving the privacy and civil liberties of many Americans — including war veterans,” Mr. Thompson said in the letter sent Tuesday. “As I am certain you agree, freedom of association and freedom of speech are guaranteed to all Americans — whether a person’s beliefs, whatever their political orientation, are ‘extremist’ or not,” Mr. Thompson said.", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by mcgreer: quote: Originally posted by jdksfcret: quote: Originally posted by mcgreer: They look at extremism from all angles. It's just that some people are more sensitive about it than others. Well hey, if you got nothing to hide why worry. Wasn't that the mantra from 'almost' everyone back when the FISA/TELCOM issue was the talk of the town. That doesn't count. But wait a minute, aren’t domestic terrorists just as dangerous as Islamic terrorists? Ask Ayers he could answer that This BS about the report targeting ‘veterans’ is way out in left field; doesn’t anyone think that government agencies might just as easily recruit veterans to infiltrate right wing and left wing ‘extremist’ groups to bring them down as well? By the way; why didn’t similar ‘assessments’ ever come out during the previous administration? The DHS under President Bush was apparently more reluctant to make such assessments about the right. According to CQ, a 2005 report outlining terrorist threats does not mention anti-government groups, white supremacists and other radical right-wing movements.\" >>>http://alaric2rh.home.sprynet.com/science/christianterrorists050325.txt", 
        "reply": " The reason it doesnt mention them is because there was no evidence of them planning and conducting attacks. Running your piehole saying stupid things is not against the law. It Seems its not only rightwingers and vets that have a problem with this: quote: The top House Democrat overseeing the Department of Homeland Security is demanding that officials there explain how and why they wrote and released a controversial report identifying veterans as potential terrorist threats. Rep. Bennie G. Thompson of Mississippi, chairman of the House Homeland Security Committee, said in a letter to DHS Secretary Janet Napolitano that he was “dumbfounded” such a report would be issued. “This report appears to raise significant issues involving the privacy and civil liberties of many Americans — including war veterans,” Mr. Thompson said in the letter sent Tuesday. “As I am certain you agree, freedom of association and freedom of speech are guaranteed to all Americans — whether a person’s beliefs, whatever their political orientation, are ‘extremist’ or not,” Mr. Thompson said.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-16 06:25:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: \"It may include groups and individuals that are dedicated to a single-issue, such as opposition to abortion or immigration,\" the warning says. No data no history just speculation. So in your world the bombed Planned Parenthood Clinics and dead physicians don't count as data or history? Interesting.", 
        "intTime": 20090416, 
        "postID": 8, 
        "quote": "Originally posted by GunnyRet03: \"It may include groups and individuals that are dedicated to a single-issue, such as opposition to abortion or immigration,\" the warning says. No data no history just speculation.", 
        "reply": " So in your world the bombed Planned Parenthood Clinics and dead physicians don't count as data or history? Interesting.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-16 06:25:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by GunnyRet03: \"It may include groups and individuals that are dedicated to a single-issue, such as opposition to abortion or immigration,\" the warning says. No data no history just speculation. So in your world the bombed Planned Parenthood Clinics and dead physicians don't count as data or history? Interesting. Is that a group or movement? Did that happen since this President has been in office. That report stated 'may be' on the rise due to new President, Illegals, Abortion, Expanding Govt. But those groups sited in the other report on the left are always there.", 
        "intTime": 20090416, 
        "postID": 9, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by GunnyRet03: \"It may include groups and individuals that are dedicated to a single-issue, such as opposition to abortion or immigration,\" the warning says. No data no history just speculation. So in your world the bombed Planned Parenthood Clinics and dead physicians don't count as data or history? Interesting.", 
        "reply": " Is that a group or movement? Did that happen since this President has been in office. That report stated 'may be' on the rise due to new President, Illegals, Abortion, Expanding Govt. But those groups sited in the other report on the left are always there.", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-16 06:37:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: I'm shocked; shocked I tell you that there was also an intelligence and analysis assessment done on the ‘threat’ from left-wing extremist by DHS/FBI back in January. So does that mean that the DHS/FBI is really ‘fair & balanced’ when it comes to looking at threats on both sides of the ‘extremist’ spectrum? Or is it just the 'right' that they look at, as some of you seem to believe? http://www.foxnews.com/politics/first100days/2009/04/14/homeland-security-warns-rise-right-wing-extremism/ http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf Excellent, where do I join? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090416, 
        "postID": 10, 
        "quote": "Originally posted by jdksfcret: I'm shocked; shocked I tell you that there was also an intelligence and analysis assessment done on the ‘threat’ from left-wing extremist by DHS/FBI back in January. So does that mean that the DHS/FBI is really ‘fair & balanced’ when it comes to looking at threats on both sides of the ‘extremist’ spectrum? Or is it just the 'right' that they look at, as some of you seem to believe? http://www.foxnews.com/politics/first100days/2009/04/14/homeland-security-warns-rise-right-wing-extremism/ http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "reply": " Excellent, where do I join? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1870038022001", 
        "time": "2009-04-16 06:49:00", 
        "title": "(U//FOUO) Leftwing Extremists", 
        "userID": "jack_flats"
    }
]