[
    {
        "content": "++http://www.washingtontimes.com/news/2009/apr/10/climate-bill-could-trigger-lawsuit-landslide/++ That government of the shysters, by the shysters, and for the shysters, shall compel freedom and opportunity to perish from the earth: \"Self-proclaimed victims of global warming or those who \"expect to suffer\" from it - from beachfront property owners to asthmatics - for the first time would be able to sue the federal government or private businesses over greenhouse gas emissions under a little-noticed provision slipped into the House climate bill. \"Environmentalists say the measure was narrowly crafted to give citizens the unusual standing to sue the U.S. government as a way to force action on curbing emissions. But the U.S. Chamber of Commerce sees a new cottage industry for lawyers. . . \"The measure sets grounds for anyone \"who has suffered, or reasonably expects to suffer, a harm attributable, in whole or in part,\" to government inaction to file a \"citizen suit.\" The term \"harm\" is broadly defined as \"any effect of air pollution (including climate change), currently occurring or at risk of occurring.\" And those of us who know the nation will suffer or reasonably expect to suffer harm from the intrusions of the meddlesome shysters, who look for any opportunity to create new lawsuits no matter how frivolous. What a better way to stifle risk-taking and job creation! (But when control-freak envy and covetousness reign supreme, regrettably, this is what knowledgeable people will expect.)", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "", 
        "reply": "++http://www.washingtontimes.com/news/2009/apr/10/climate-bill-could-trigger-lawsuit-landslide/++ That government of the shysters, by the shysters, and for the shysters, shall compel freedom and opportunity to perish from the earth: \"Self-proclaimed victims of global warming or those who \"expect to suffer\" from it - from beachfront property owners to asthmatics - for the first time would be able to sue the federal government or private businesses over greenhouse gas emissions under a little-noticed provision slipped into the House climate bill. \"Environmentalists say the measure was narrowly crafted to give citizens the unusual standing to sue the U.S. government as a way to force action on curbing emissions. But the U.S. Chamber of Commerce sees a new cottage industry for lawyers. . . \"The measure sets grounds for anyone \"who has suffered, or reasonably expects to suffer, a harm attributable, in whole or in part,\" to government inaction to file a \"citizen suit.\" The term \"harm\" is broadly defined as \"any effect of air pollution (including climate change), currently occurring or at risk of occurring.\" And those of us who know the nation will suffer or reasonably expect to suffer harm from the intrusions of the meddlesome shysters, who look for any opportunity to create new lawsuits no matter how frivolous. What a better way to stifle risk-taking and job creation! (But when control-freak envy and covetousness reign supreme, regrettably, this is what knowledgeable people will expect.)", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-10 10:17:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: ++http://www.washingtontimes.com/news/2009/apr/10/climate-bill-could-trigger-lawsuit-landslide/++ That government of the shysters, by the shysters, and for the shysters, shall compel freedom and opportunity to perish from the earth: \"Self-proclaimed victims of global warming or those who \"expect to suffer\" from it - from beachfront property owners to asthmatics - for the first time would be able to sue the federal government or private businesses over greenhouse gas emissions under a little-noticed provision slipped into the House climate bill. \"Environmentalists say the measure was narrowly crafted to give citizens the unusual standing to sue the U.S. government as a way to force action on curbing emissions. But the U.S. Chamber of Commerce sees a new cottage industry for lawyers. . . \"The measure sets grounds for anyone \"who has suffered, or reasonably expects to suffer, a harm attributable, in whole or in part,\" to government inaction to file a \"citizen suit.\" The term \"harm\" is broadly defined as \"any effect of air pollution (including climate change), currently occurring or at risk of occurring.\" And those of us who know the nation will suffer or reasonably expect to suffer harm from the intrusions of the meddlesome shysters, who look for any opportunity to create new lawsuits no matter how frivolous. What a better way to stifle risk-taking and job creation! (But when control-freak envy and covetousness reign supreme, regrettably, this is what knowledgeable people will expect.) Basically what this law means is that those citizens who are dying of Mercury poisoning will now be able to have their day in Court. It's going to be a wake up call to all those who think that their greed trumps human lives. quote: Coal-fired electric power plants comprise the largest single source, producing about one-third of U.S. emissions. Mercury is an impurity in coal, released into the air when the coal is burned. Because coal is cheap and abundant, these power plants enjoy widespread use both domestically and internationally. Most U.S. power plants are exempt from the pollution controls mandated by the Clean Air Act, and power plant mercury emissions are not yet specifically regulated. \"http://leahy.senate.gov/issues/environment/mercury/hg_prime.html\" But then again, allowing people to stop such pollutants is just an example of the collectivist/communist approach to simple problems, that if left to themselves would be cured by the simple solution of letting these people die. Dave", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "Originally posted by RRR52: ++http://www.washingtontimes.com/news/2009/apr/10/climate-bill-could-trigger-lawsuit-landslide/++ That government of the shysters, by the shysters, and for the shysters, shall compel freedom and opportunity to perish from the earth: \"Self-proclaimed victims of global warming or those who \"expect to suffer\" from it - from beachfront property owners to asthmatics - for the first time would be able to sue the federal government or private businesses over greenhouse gas emissions under a little-noticed provision slipped into the House climate bill. \"Environmentalists say the measure was narrowly crafted to give citizens the unusual standing to sue the U.S. government as a way to force action on curbing emissions. But the U.S. Chamber of Commerce sees a new cottage industry for lawyers. . . \"The measure sets grounds for anyone \"who has suffered, or reasonably expects to suffer, a harm attributable, in whole or in part,\" to government inaction to file a \"citizen suit.\" The term \"harm\" is broadly defined as \"any effect of air pollution (including climate change), currently occurring or at risk of occurring.\" And those of us who know the nation will suffer or reasonably expect to suffer harm from the intrusions of the meddlesome shysters, who look for any opportunity to create new lawsuits no matter how frivolous. What a better way to stifle risk-taking and job creation! (But when control-freak envy and covetousness reign supreme, regrettably, this is what knowledgeable people will expect.)", 
        "reply": " Basically what this law means is that those citizens who are dying of Mercury poisoning will now be able to have their day in Court. It's going to be a wake up call to all those who think that their greed trumps human lives. quote: Coal-fired electric power plants comprise the largest single source, producing about one-third of U.S. emissions. Mercury is an impurity in coal, released into the air when the coal is burned. Because coal is cheap and abundant, these power plants enjoy widespread use both domestically and internationally. Most U.S. power plants are exempt from the pollution controls mandated by the Clean Air Act, and power plant mercury emissions are not yet specifically regulated. \"http://leahy.senate.gov/issues/environment/mercury/hg_prime.html\" But then again, allowing people to stop such pollutants is just an example of the collectivist/communist approach to simple problems, that if left to themselves would be cured by the simple solution of letting these people die. Dave", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-10 10:33:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "Grachus"
    }, 
    {
        "content": "And, what it means is that we loose more jobs to other countries.", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "", 
        "reply": "And, what it means is that we loose more jobs to other countries.", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-10 21:54:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "you should say \"shyster\" a few more times so we get the full effect", 
        "intTime": 20090410, 
        "postID": 4, 
        "quote": "", 
        "reply": "you should say \"shyster\" a few more times so we get the full effect", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-10 21:57:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: And, what it means is that we loose more jobs to other countries. That is one of the major outcomes, yes.", 
        "intTime": 20090412, 
        "postID": 5, 
        "quote": "Originally posted by fishnfanatic: And, what it means is that we loose more jobs to other countries.", 
        "reply": " That is one of the major outcomes, yes.", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-12 09:59:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Grachus: But then again, allowing people to stop such pollutants is just an example of the collectivist/communist approach to simple problems, that if left to themselves would be cured by the simple solution of letting these people die. They can stop what they wish, and the enforced idiocy of \"cap and tax\" is another economy-degrading solution. \"Allowing to stop\" is a world of freedom away from involuntary gun-at-the-head guvmint non-solutions to problems exaggerated so that the environut knaves can make their money and cultivate their value-destroying jobs. They remain such shysters. The kind of economic and financial sense that teh shysters of the Congress dumped onto America by their stupid Fannie ande Freddie \"policies,\" allowing people to stop common-sense lending practices for a polytickle power and control-freak game.", 
        "intTime": 20090412, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: But then again, allowing people to stop such pollutants is just an example of the collectivist/communist approach to simple problems, that if left to themselves would be cured by the simple solution of letting these people die.", 
        "reply": " They can stop what they wish, and the enforced idiocy of \"cap and tax\" is another economy-degrading solution. \"Allowing to stop\" is a world of freedom away from involuntary gun-at-the-head guvmint non-solutions to problems exaggerated so that the environut knaves can make their money and cultivate their value-destroying jobs. They remain such shysters. The kind of economic and financial sense that teh shysters of the Congress dumped onto America by their stupid Fannie ande Freddie \"policies,\" allowing people to stop common-sense lending practices for a polytickle power and control-freak game.", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-12 10:05:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Grachus: But then again, allowing people to stop such pollutants is just an example of the collectivist/communist approach to simple problems, that if left to themselves would be cured by the simple solution of letting these people die. They can stop what they wish, and the enforced idiocy of \"cap and tax\" is another economy-degrading solution. \"Allowing to stop\" is a world of freedom away from involuntary gun-at-the-head guvmint non-solutions to problems exaggerated so that the environut knaves can make their money and cultivate their value-destroying jobs. They remain such shysters. The kind of economic and financial sense that teh shysters of the Congress dumped onto America by their stupid Fannie ande Freddie \"policies,\" allowing people to stop common-sense lending practices for a polytickle power and control-freak game. And a real shame that our Communist Collectivist government put Dow CHemical out of business with their exagerated junk science about asbestos. Can you imagine? They actually claimed that millions of people were being put at risk by Dow. Heck, a real self reliant American will eat asbestos for breakfest, and use a benzine chaser to settle his stumuch. Dave", 
        "intTime": 20090412, 
        "postID": 7, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Grachus: But then again, allowing people to stop such pollutants is just an example of the collectivist/communist approach to simple problems, that if left to themselves would be cured by the simple solution of letting these people die. They can stop what they wish, and the enforced idiocy of \"cap and tax\" is another economy-degrading solution. \"Allowing to stop\" is a world of freedom away from involuntary gun-at-the-head guvmint non-solutions to problems exaggerated so that the environut knaves can make their money and cultivate their value-destroying jobs. They remain such shysters. The kind of economic and financial sense that teh shysters of the Congress dumped onto America by their stupid Fannie ande Freddie \"policies,\" allowing people to stop common-sense lending practices for a polytickle power and control-freak game.", 
        "reply": " And a real shame that our Communist Collectivist government put Dow CHemical out of business with their exagerated junk science about asbestos. Can you imagine? They actually claimed that millions of people were being put at risk by Dow. Heck, a real self reliant American will eat asbestos for breakfest, and use a benzine chaser to settle his stumuch. Dave", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-12 11:26:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: And a real shame that our Communist Collectivist government put Dow CHemical out of business with their exagerated junk science about asbestos. Can you imagine? They actually claimed that millions of people were being put at risk by Dow. Heck, a real self reliant American will eat asbestos for breakfest, and use a benzine chaser to settle his stumuch. [What we struggle to stomach is the attempted \"cutesy\" but nonsensical responses you struggle to create.] Their initial ignorance of the threats was NOT the same as the deceptive, pseudo-science industry that has developed by spreading the Big Lie with unfounded collectivist-created \"rationales.\" We know that whatever these people dream up will inevitably (a) curtail freedom and (b) cost more and (c) keep them well-paid. The Global Warming idiocy is a lie unto itself. [Dow Chemical still creates many other products that make our lives better (++http://www.dow.com/products_services/az.htm++); it EARNS $58 billion in annual revenue and creates 46,000 good job; capitalism is great.] The Global Warming crap just steals more money from people's pockets, degrading their lives. They do not need handouts from guvmint to remain in business; they create value on the basis of their own research and creativity. Were it not for the deceptions associated with Global Warming, very little funding would be available to such people who cannot find more useful work to do. And asbestos still comes into this nation from Canadian and Mexican building materials. There is much more to the matter of asbestos than some people realize. You assured us all that you would not respond to me any longer. Shucks, we were hoping you'd adhere to your word. Due to the nonsense you spew, that was welcome news. If you would have any effectiveness, say what you mean and mean what you say. And you continue to ignore the vital question I asked you about economics and taxation. (Pinning leftists down to facts and distinct decisions is so challenging.)", 
        "intTime": 20090412, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: And a real shame that our Communist Collectivist government put Dow CHemical out of business with their exagerated junk science about asbestos. Can you imagine? They actually claimed that millions of people were being put at risk by Dow. Heck, a real self reliant American will eat asbestos for breakfest, and use a benzine chaser to settle his stumuch. [What we struggle to stomach is the attempted \"cutesy\" but nonsensical responses you struggle to create.]", 
        "reply": " Their initial ignorance of the threats was NOT the same as the deceptive, pseudo-science industry that has developed by spreading the Big Lie with unfounded collectivist-created \"rationales.\" We know that whatever these people dream up will inevitably (a) curtail freedom and (b) cost more and (c) keep them well-paid. The Global Warming idiocy is a lie unto itself. [Dow Chemical still creates many other products that make our lives better (++http://www.dow.com/products_services/az.htm++); it EARNS $58 billion in annual revenue and creates 46,000 good job; capitalism is great.] The Global Warming crap just steals more money from people's pockets, degrading their lives. They do not need handouts from guvmint to remain in business; they create value on the basis of their own research and creativity. Were it not for the deceptions associated with Global Warming, very little funding would be available to such people who cannot find more useful work to do. And asbestos still comes into this nation from Canadian and Mexican building materials. There is much more to the matter of asbestos than some people realize. You assured us all that you would not respond to me any longer. Shucks, we were hoping you'd adhere to your word. Due to the nonsense you spew, that was welcome news. If you would have any effectiveness, say what you mean and mean what you say. And you continue to ignore the vital question I asked you about economics and taxation. (Pinning leftists down to facts and distinct decisions is so challenging.)", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-12 12:08:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: [b]You assured us all that you would not respond to me any longer. Shucks, we were hoping you'd adhere to your word. Sorry, NO, that's not what I said. Dave", 
        "intTime": 20090412, 
        "postID": 9, 
        "quote": "Originally posted by RRR52: [b]You assured us all that you would not respond to me any longer. Shucks, we were hoping you'd adhere to your word.", 
        "reply": " Sorry, NO, that's not what I said. Dave", 
        "threadID": "672198221_8370053022001", 
        "time": "2009-04-12 12:20:00", 
        "title": "What any sensible citizen expects of the shysters", 
        "userID": "Grachus"
    }
]