[
    {
        "content": "\"Threatened Federal Sanctions Against NYPD, Secret Service, FBI & Mayor's Office If Secret Ever Got Out\" \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" This is the kind of government menatlity your dealing with and you trust these agencies to protect and defend this nation? Not just an Obama thing either, these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does.", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"Threatened Federal Sanctions Against NYPD, Secret Service, FBI & Mayor's Office If Secret Ever Got Out\" \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" This is the kind of government menatlity your dealing with and you trust these agencies to protect and defend this nation? Not just an Obama thing either, these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 15:55:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 15:58:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate. Or a group found a way to get theirs there first. Never should have flown in that area with photoshop availible.", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate.", 
        "reply": " Or a group found a way to get theirs there first. Never should have flown in that area with photoshop availible.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 20:17:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down?", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "", 
        "reply": "Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down?", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 20:18:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "these are the same people that have been runnning the FAA for years.", 
        "reply": " oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 21:28:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Not just an Obama thing either, these are the same people that have been runnning the FAA for years. CJ should reread the story. The FAA thought it was a bad idea. This came from the White House. \"The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background...\"", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "Not just an Obama thing either, these are the same people that have been runnning the FAA for years.", 
        "reply": " CJ should reread the story. The FAA thought it was a bad idea. This came from the White House. \"The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background...\"", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 23:53:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down? That would be akward shooting down air force one", 
        "intTime": 20090429, 
        "postID": 7, 
        "quote": "Originally posted by stillkit: Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down?", 
        "reply": " That would be akward shooting down air force one", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 00:09:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "intTime": 20090429, 
        "postID": 8, 
        "quote": "The GUberment does not change just because the POTUS does.", 
        "reply": " So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 01:22:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House. I seriously doubt that the President is aware of the status of either of the aircraft used as AF One when he is not on board. This debacle was the result of ignorance on the part of members of his staff and should be addressed accordingly. Aside from being a profound waste of money, it is also about the most ignorant stunt imaginable.", 
        "intTime": 20090429, 
        "postID": 9, 
        "quote": "Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "reply": " I seriously doubt that the President is aware of the status of either of the aircraft used as AF One when he is not on board. This debacle was the result of ignorance on the part of members of his staff and should be addressed accordingly. Aside from being a profound waste of money, it is also about the most ignorant stunt imaginable.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 02:46:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House. Since he is the CinC, I guess he should know what every a/c in \"his\" Air Force is doing. You have no idea how the bureaucracy works. The POTUS does NOT get involved in routine updates of PR films. he has bigger fish to fry and people to handle the small stuff. Unless of course, one of his people, in this case the military director at the WH, screws up big time. Then he has to get involved.", 
        "intTime": 20090429, 
        "postID": 10, 
        "quote": "Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "reply": " Since he is the CinC, I guess he should know what every a/c in \"his\" Air Force is doing. You have no idea how the bureaucracy works. The POTUS does NOT get involved in routine updates of PR films. he has bigger fish to fry and people to handle the small stuff. Unless of course, one of his people, in this case the military director at the WH, screws up big time. Then he has to get involved.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 03:53:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "Motive25"
    }, 
    {
        "content": "I'm definitely not an Obama fan but I seriously doubt he knew about this ahead of time. It was clearly a bonehead move on the part of his staff. I really resent the fact that conservatives are falling into the same blame game mentality that the far left have indulged in for the last eight years. The messiah is making plenty of poor choices and dangerous decisions that are hurting our nation. We do not have to pile on about petty crap like this.", 
        "intTime": 20090429, 
        "postID": 11, 
        "quote": "", 
        "reply": "I'm definitely not an Obama fan but I seriously doubt he knew about this ahead of time. It was clearly a bonehead move on the part of his staff. I really resent the fact that conservatives are falling into the same blame game mentality that the far left have indulged in for the last eight years. The messiah is making plenty of poor choices and dangerous decisions that are hurting our nation. We do not have to pile on about petty crap like this.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 04:05:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "M123Driver"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does. All right. I'll bite. We've had 2 Administrators and 3 Acting Administrators since 9/11. Which of these has been \"running the FAA for years\"? Seriously...I want to know. I've only been working for them for 13 years and stationed here in DC for 10 years. Obviously you have some great insight into who's been in charge. Please enlighten me.", 
        "intTime": 20090429, 
        "postID": 12, 
        "quote": "Originally posted by crackerjacks61: these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does.", 
        "reply": " All right. I'll bite. We've had 2 Administrators and 3 Acting Administrators since 9/11. Which of these has been \"running the FAA for years\"? Seriously...I want to know. I've only been working for them for 13 years and stationed here in DC for 10 years. Obviously you have some great insight into who's been in charge. Please enlighten me.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 04:21:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt", 
        "intTime": 20090429, 
        "postID": 13, 
        "quote": "Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple.", 
        "reply": " There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 04:26:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? quote: Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "intTime": 20090429, 
        "postID": 14, 
        "quote": "Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "reply": "When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? ", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 05:15:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? quote: Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic) Bush and Cheney ordered that the law be broken. It is not -illegal- for AF 1 to fly over New York. Walt", 
        "intTime": 20090429, 
        "postID": 15, 
        "quote": "Originally posted by fishnfanatic: When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? quote: Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "reply": " Bush and Cheney ordered that the law be broken. It is not -illegal- for AF 1 to fly over New York. Walt", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt While I sincerely doubt that the President had any part in this farce it is fairly obvious that none of \"his political guys\" said \"Whoa, hold it\" either.", 
        "intTime": 20090429, 
        "postID": 16, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt", 
        "reply": " While I sincerely doubt that the President had any part in this farce it is fairly obvious that none of \"his political guys\" said \"Whoa, hold it\" either.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: One of his political guys would have said, \"Whoa, hold it.\" More like one of his political guys said \"Giddyup\" ... quote: The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background -- had President Obama seeing red. He ordered a probe and apologized. \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" The Office of Military Affairs is headed by Louis Caldera ... and Obama political appointee.", 
        "intTime": 20090429, 
        "postID": 17, 
        "quote": "One of his political guys would have said, \"Whoa, hold it.\"", 
        "reply": " More like one of his political guys said \"Giddyup\" ... quote: The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background -- had President Obama seeing red. He ordered a probe and apologized. \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" The Office of Military Affairs is headed by Louis Caldera ... and Obama political appointee.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:18:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: It is not -illegal- for AF 1 to fly over New York. It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects?", 
        "intTime": 20090429, 
        "postID": 18, 
        "quote": "It is not -illegal- for AF 1 to fly over New York.", 
        "reply": " It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects?", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:28:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It is not -illegal- for AF 1 to fly over New York. It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects? Whether illegal or not, it was a stupid decision. The FAA admitted it could cause a panic but approved it anyway. If the stated reason is true, they wanted to get a photo shot of Air Force 1 flying by the Statue of Liberty, why not \"photoshop it\". Easier, cheaper and a good graphic designer could make it so realistic it would take a lab to tell the difference. Stupid decision.", 
        "intTime": 20090429, 
        "postID": 19, 
        "quote": "Originally posted by soscorpio: quote: It is not -illegal- for AF 1 to fly over New York. It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects?", 
        "reply": " Whether illegal or not, it was a stupid decision. The FAA admitted it could cause a panic but approved it anyway. If the stated reason is true, they wanted to get a photo shot of Air Force 1 flying by the Statue of Liberty, why not \"photoshop it\". Easier, cheaper and a good graphic designer could make it so realistic it would take a lab to tell the difference. Stupid decision.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:41:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Stupid decision. I guess employment in the kingdom is not as precious as outside.", 
        "intTime": 20090429, 
        "postID": 20, 
        "quote": "Stupid decision.", 
        "reply": " I guess employment in the kingdom is not as precious as outside.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:56:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "soscorpio"
    }, 
    {
        "content": "\"Threatened Federal Sanctions Against NYPD, Secret Service, FBI & Mayor's Office If Secret Ever Got Out\" \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" This is the kind of government menatlity your dealing with and you trust these agencies to protect and defend this nation? Not just an Obama thing either, these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does.", 
        "intTime": 20090428, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"Threatened Federal Sanctions Against NYPD, Secret Service, FBI & Mayor's Office If Secret Ever Got Out\" \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" This is the kind of government menatlity your dealing with and you trust these agencies to protect and defend this nation? Not just an Obama thing either, these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 15:55:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090428, 
        "postID": 22, 
        "quote": "", 
        "reply": "I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 15:58:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate. Or a group found a way to get theirs there first. Never should have flown in that area with photoshop availible.", 
        "intTime": 20090428, 
        "postID": 23, 
        "quote": "Originally posted by L0A1: I just wonder if they had told folks and a terrorist did shot it down, what would you have said? Not trying to be arguementive, just play devils advocate.", 
        "reply": " Or a group found a way to get theirs there first. Never should have flown in that area with photoshop availible.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 20:17:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down?", 
        "intTime": 20090428, 
        "postID": 24, 
        "quote": "", 
        "reply": "Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down?", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 20:18:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "intTime": 20090428, 
        "postID": 25, 
        "quote": "these are the same people that have been runnning the FAA for years.", 
        "reply": " oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 21:28:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Not just an Obama thing either, these are the same people that have been runnning the FAA for years. CJ should reread the story. The FAA thought it was a bad idea. This came from the White House. \"The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background...\"", 
        "intTime": 20090428, 
        "postID": 26, 
        "quote": "Not just an Obama thing either, these are the same people that have been runnning the FAA for years.", 
        "reply": " CJ should reread the story. The FAA thought it was a bad idea. This came from the White House. \"The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background...\"", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-28 23:53:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down? That would be akward shooting down air force one", 
        "intTime": 20090429, 
        "postID": 27, 
        "quote": "Originally posted by stillkit: Conversely, what would they have to say if the NY Air National Guard had scrambled and shot it down?", 
        "reply": " That would be akward shooting down air force one", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 00:09:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "intTime": 20090429, 
        "postID": 28, 
        "quote": "The GUberment does not change just because the POTUS does.", 
        "reply": " So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 01:22:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House. I seriously doubt that the President is aware of the status of either of the aircraft used as AF One when he is not on board. This debacle was the result of ignorance on the part of members of his staff and should be addressed accordingly. Aside from being a profound waste of money, it is also about the most ignorant stunt imaginable.", 
        "intTime": 20090429, 
        "postID": 29, 
        "quote": "Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "reply": " I seriously doubt that the President is aware of the status of either of the aircraft used as AF One when he is not on board. This debacle was the result of ignorance on the part of members of his staff and should be addressed accordingly. Aside from being a profound waste of money, it is also about the most ignorant stunt imaginable.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 02:46:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House. Since he is the CinC, I guess he should know what every a/c in \"his\" Air Force is doing. You have no idea how the bureaucracy works. The POTUS does NOT get involved in routine updates of PR films. he has bigger fish to fry and people to handle the small stuff. Unless of course, one of his people, in this case the military director at the WH, screws up big time. Then he has to get involved.", 
        "intTime": 20090429, 
        "postID": 30, 
        "quote": "Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. To act like he didnt know his aircraft would be conducting this photo op is ridiculous. Dont blame the FAA for following direct orders from the White House.", 
        "reply": " Since he is the CinC, I guess he should know what every a/c in \"his\" Air Force is doing. You have no idea how the bureaucracy works. The POTUS does NOT get involved in routine updates of PR films. he has bigger fish to fry and people to handle the small stuff. Unless of course, one of his people, in this case the military director at the WH, screws up big time. Then he has to get involved.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 03:53:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "Motive25"
    }, 
    {
        "content": "I'm definitely not an Obama fan but I seriously doubt he knew about this ahead of time. It was clearly a bonehead move on the part of his staff. I really resent the fact that conservatives are falling into the same blame game mentality that the far left have indulged in for the last eight years. The messiah is making plenty of poor choices and dangerous decisions that are hurting our nation. We do not have to pile on about petty crap like this.", 
        "intTime": 20090429, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'm definitely not an Obama fan but I seriously doubt he knew about this ahead of time. It was clearly a bonehead move on the part of his staff. I really resent the fact that conservatives are falling into the same blame game mentality that the far left have indulged in for the last eight years. The messiah is making plenty of poor choices and dangerous decisions that are hurting our nation. We do not have to pile on about petty crap like this.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 04:05:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "M123Driver"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does. All right. I'll bite. We've had 2 Administrators and 3 Acting Administrators since 9/11. Which of these has been \"running the FAA for years\"? Seriously...I want to know. I've only been working for them for 13 years and stationed here in DC for 10 years. Obviously you have some great insight into who's been in charge. Please enlighten me.", 
        "intTime": 20090429, 
        "postID": 32, 
        "quote": "Originally posted by crackerjacks61: these are the same people that have been runnning the FAA for years. The GUberment does not change just because the POTUS does.", 
        "reply": " All right. I'll bite. We've had 2 Administrators and 3 Acting Administrators since 9/11. Which of these has been \"running the FAA for years\"? Seriously...I want to know. I've only been working for them for 13 years and stationed here in DC for 10 years. Obviously you have some great insight into who's been in charge. Please enlighten me.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 04:21:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt", 
        "intTime": 20090429, 
        "postID": 33, 
        "quote": "Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple.", 
        "reply": " There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 04:26:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? quote: Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "intTime": 20090429, 
        "postID": 34, 
        "quote": "Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "reply": "When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? ", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 05:15:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? quote: Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic) Bush and Cheney ordered that the law be broken. It is not -illegal- for AF 1 to fly over New York. Walt", 
        "intTime": 20090429, 
        "postID": 35, 
        "quote": "Originally posted by fishnfanatic: When the Republicans are in office, its always their fault. When the Dumbocrats are in office, its still the Republican's fault. Didn't ya know, Dumbocrats are little angels? quote: Originally posted by scooter_mech: quote: The GUberment does not change just because the POTUS does. So that means Bush/Cheney were no more responsible for whatever wrongs they are alledged to have committed than Obama/Biden are. After all, it's not their fault, it's the \"GUberment.\" (sic)", 
        "reply": " Bush and Cheney ordered that the law be broken. It is not -illegal- for AF 1 to fly over New York. Walt", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 05:46:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt While I sincerely doubt that the President had any part in this farce it is fairly obvious that none of \"his political guys\" said \"Whoa, hold it\" either.", 
        "intTime": 20090429, 
        "postID": 36, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by FlankerFlyer: quote: these are the same people that have been runnning the FAA for years. oh yeah, the FAA ordered the flyover and the secrecy Obama wanted this done or it wouldnt have been done, plain and simple. There is no reason to think that. One of his political guys would have said, \"Whoa, hold it.\" Walt", 
        "reply": " While I sincerely doubt that the President had any part in this farce it is fairly obvious that none of \"his political guys\" said \"Whoa, hold it\" either.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:09:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: One of his political guys would have said, \"Whoa, hold it.\" More like one of his political guys said \"Giddyup\" ... quote: The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background -- had President Obama seeing red. He ordered a probe and apologized. \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" The Office of Military Affairs is headed by Louis Caldera ... and Obama political appointee.", 
        "intTime": 20090429, 
        "postID": 37, 
        "quote": "One of his political guys would have said, \"Whoa, hold it.\"", 
        "reply": " More like one of his political guys said \"Giddyup\" ... quote: The flyover -- apparently ordered by the White House Office of Military Affairs so it would have souvenir photos of Air Force One with the Statue of Liberty in the background -- had President Obama seeing red. He ordered a probe and apologized. \"http://wcbstv.com/topstories/air.force.one.2.996457.html\" The Office of Military Affairs is headed by Louis Caldera ... and Obama political appointee.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:18:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: It is not -illegal- for AF 1 to fly over New York. It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects?", 
        "intTime": 20090429, 
        "postID": 38, 
        "quote": "It is not -illegal- for AF 1 to fly over New York.", 
        "reply": " It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects?", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:28:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: It is not -illegal- for AF 1 to fly over New York. It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects? Whether illegal or not, it was a stupid decision. The FAA admitted it could cause a panic but approved it anyway. If the stated reason is true, they wanted to get a photo shot of Air Force 1 flying by the Statue of Liberty, why not \"photoshop it\". Easier, cheaper and a good graphic designer could make it so realistic it would take a lab to tell the difference. Stupid decision.", 
        "intTime": 20090429, 
        "postID": 39, 
        "quote": "Originally posted by soscorpio: quote: It is not -illegal- for AF 1 to fly over New York. It's illegal to yell \"FIRE\" in a movie theater......won't the two have similar effects?", 
        "reply": " Whether illegal or not, it was a stupid decision. The FAA admitted it could cause a panic but approved it anyway. If the stated reason is true, they wanted to get a photo shot of Air Force 1 flying by the Statue of Liberty, why not \"photoshop it\". Easier, cheaper and a good graphic designer could make it so realistic it would take a lab to tell the difference. Stupid decision.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:41:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Stupid decision. I guess employment in the kingdom is not as precious as outside.", 
        "intTime": 20090429, 
        "postID": 40, 
        "quote": "Stupid decision.", 
        "reply": " I guess employment in the kingdom is not as precious as outside.", 
        "threadID": "672198221_7290000222001", 
        "time": "2009-04-29 06:56:00", 
        "title": "FAA Memo: Feds Knew NYC Flyover Would Cause Panic", 
        "userID": "soscorpio"
    }
]