[
    {
        "content": "quote: It began calmly enough with a march down the high street after midday prayers at the mosque. Palestinian villagers were surrounded by dozens of foreigners singing and waving flags. They turned and headed out to the olive-tree fields and up towards the broad path of Israel's West Bank barrier. There, behind a concrete hilltop bunker, the Israeli soldiers looked down on them. The crowd approached the barrier, still singing. One man flew a paper kite shaped as a plane. \"This land is a closed military zone,\" an Israeli soldier shouted in flawless Arabic over a loudspeaker. \"You are not allowed near the wall.\" Then the soldiers fired a barrage of teargas. It has been like this every Friday in the village of Bil'in for more than four years – the most persistent popular demonstration against Israel's vast steel and concrete barrier. It is a protest founded on non-violence that is spreading to other West Bank villages. But it has become increasingly dangerous. On April 17, on the hillside at Bil'in, a Palestinian named Basem Abu Rahmeh, 31, was shot with a high-velocity Israeli teargas canister that sliced a hole into his chest, caused massive internal bleeding and quickly killed him. Video footage shot by another demonstrator shows he was unarmed, many metres from the barrier and posing no threat to the soldiers. The Israeli military said it faced a \"violent and illegal riot\" and is investigating. On Friday the demonstrators at Bil'in wore Rameh's image on T-shirts and carried it on posters. Last month another demonstrator, an American named Tristan Anderson, 38, was hit in the head by an identical high-velocity teargas canister in a protest against the barrier at the nearby village of Na'alin. He was severely injured, losing the sight in his right eye and suffering brain damage. \"To shoot peaceful demonstrators is really horrifying to us,\" said his mother, Nancy. (....) Didn’t somebody here say Non-Violent protestors would work for the Palestinians? +http://www.guardian.co.uk/world/2009/apr/27/israel-security-barrier-protests \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090427, 
        "postID": 1, 
        "quote": "It began calmly enough with a march down the high street after midday prayers at the mosque. Palestinian villagers were surrounded by dozens of foreigners singing and waving flags. They turned and headed out to the olive-tree fields and up towards the broad path of Israel's West Bank barrier. There, behind a concrete hilltop bunker, the Israeli soldiers looked down on them. The crowd approached the barrier, still singing. One man flew a paper kite shaped as a plane. \"This land is a closed military zone,\" an Israeli soldier shouted in flawless Arabic over a loudspeaker. \"You are not allowed near the wall.\" Then the soldiers fired a barrage of teargas. It has been like this every Friday in the village of Bil'in for more than four years – the most persistent popular demonstration against Israel's vast steel and concrete barrier. It is a protest founded on non-violence that is spreading to other West Bank villages. But it has become increasingly dangerous. On April 17, on the hillside at Bil'in, a Palestinian named Basem Abu Rahmeh, 31, was shot with a high-velocity Israeli teargas canister that sliced a hole into his chest, caused massive internal bleeding and quickly killed him. Video footage shot by another demonstrator shows he was unarmed, many metres from the barrier and posing no threat to the soldiers. The Israeli military said it faced a \"violent and illegal riot\" and is investigating. On Friday the demonstrators at Bil'in wore Rameh's image on T-shirts and carried it on posters. Last month another demonstrator, an American named Tristan Anderson, 38, was hit in the head by an identical high-velocity teargas canister in a protest against the barrier at the nearby village of Na'alin. He was severely injured, losing the sight in his right eye and suffering brain damage. \"To shoot peaceful demonstrators is really horrifying to us,\" said his mother, Nancy. (....)", 
        "reply": " Didn’t somebody here say Non-Violent protestors would work for the Palestinians? +http://www.guardian.co.uk/world/2009/apr/27/israel-security-barrier-protests \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 07:29:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "NSNN"
    }, 
    {
        "content": "I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong.", 
        "intTime": 20090427, 
        "postID": 2, 
        "quote": "", 
        "reply": "I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong.", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 07:38:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong. I am an acquaintance of a guy who took still images of the murder of Basem. Not a hint of violence. Indeed he was shot while walking over to Israeli soldiers to warn them that there were kids in the crowd. Amazing photographs he posted. Dave", 
        "intTime": 20090427, 
        "postID": 3, 
        "quote": "Originally posted by PanzerMeister: I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong.", 
        "reply": " I am an acquaintance of a guy who took still images of the murder of Basem. Not a hint of violence. Indeed he was shot while walking over to Israeli soldiers to warn them that there were kids in the crowd. Amazing photographs he posted. Dave", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 09:07:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong. If the Zionists had used non-violent tactics do you think there would be an Israel in its present form Panzermeiser?", 
        "intTime": 20090427, 
        "postID": 4, 
        "quote": "Originally posted by PanzerMeister: I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong.", 
        "reply": " If the Zionists had used non-violent tactics do you think there would be an Israel in its present form Panzermeiser?", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 10:39:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Dave-You cannot aim the gas grenade (unless you shoot it from a point blank range). It was an unfortunate incident. Besides the gas grenades were there in the first place because of the violent past of these demonstrations. However, in this particular demonstration, according to the info that i have for now, there was no need for the gas grenades. It was peaceful enough so not to evoke such drastic measures. The responsible should be reprimanded and punished. If the soldier shot it from point blank range, he should be charged with murder. Bladensburg-If you mean the vote of UN in favor of creating Israel, my answer will be Yes. The majority of the reasoning that counted in UN vote were the refugees and the testimonies from death camps. With these, Zionist leadership made propaganda, and the British acted like morons, sending refugees into the same camps/states they have run from. The terrorist activity by Irgun, Lehi etc, was largely irrelevant to the issue. The only thing that they have achieved was to hurry the process a bit. The Jewish terror was not worth it in my opinion. Israel could have been created half a year or even a year later and noting especially awful would have happened. If you mean non violent response in the war of independence, i will naturally say No.", 
        "intTime": 20090427, 
        "postID": 5, 
        "quote": "", 
        "reply": "Dave-You cannot aim the gas grenade (unless you shoot it from a point blank range). It was an unfortunate incident. Besides the gas grenades were there in the first place because of the violent past of these demonstrations. However, in this particular demonstration, according to the info that i have for now, there was no need for the gas grenades. It was peaceful enough so not to evoke such drastic measures. The responsible should be reprimanded and punished. If the soldier shot it from point blank range, he should be charged with murder. Bladensburg-If you mean the vote of UN in favor of creating Israel, my answer will be Yes. The majority of the reasoning that counted in UN vote were the refugees and the testimonies from death camps. With these, Zionist leadership made propaganda, and the British acted like morons, sending refugees into the same camps/states they have run from. The terrorist activity by Irgun, Lehi etc, was largely irrelevant to the issue. The only thing that they have achieved was to hurry the process a bit. The Jewish terror was not worth it in my opinion. Israel could have been created half a year or even a year later and noting especially awful would have happened. If you mean non violent response in the war of independence, i will naturally say No.", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 11:14:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong. It doesn't seem to make any difference to some Israelis that people on the west bank, coming near a wall that didn't exist until a year ago, to protest that the wall has cut them off from their livlihood and AlFatah terrorists blowing up buses and firing rockets, may not be the same. It appears that there is some 'slow learning' involved in developing the notion that there are people who will fight you to keep their land as hard as you fight them to take it. If they had the panalopy of arms that Israel has been enabled to amass, they might use them, as Israel does, in their own 'defence'. As it is, often they have only a stone, or even just a voice, to fight with. The world knows the sensitivity, and the hard hand, of the Israel-ite to 'offence' - real, or imagined. Once before Judeans called out for someone's blood - \"on our heads and our children\".It worked so well, that, to-day, it's attributed to Arabs - and they're punished accordingly. This message has been edited. Last edited by: popsiq, Mon 27 April 2009 12:10 PM", 
        "intTime": 20090427, 
        "postID": 6, 
        "quote": "Originally posted by PanzerMeister: I say it, and still stand by it. However, given the fact that i am on your ignore list, i do not think that i will receive a reply from you. If Palestinians has used such tactic each time, it would have worked. However, the protest demonstrations are usually very violent. Furthermore, picking ONE (or even a 10) peaceful demonstrations and COMPLETELY IGNORING the VIOLENT acts (like suicide attacks and quassam rockets) is fallacy. Gandi did not blow buses, NSNN. If you think that Blowing buses is redeemed by peaceful demonstrations, you are wrong.", 
        "reply": " It doesn't seem to make any difference to some Israelis that people on the west bank, coming near a wall that didn't exist until a year ago, to protest that the wall has cut them off from their livlihood and AlFatah terrorists blowing up buses and firing rockets, may not be the same. It appears that there is some 'slow learning' involved in developing the notion that there are people who will fight you to keep their land as hard as you fight them to take it. If they had the panalopy of arms that Israel has been enabled to amass, they might use them, as Israel does, in their own 'defence'. As it is, often they have only a stone, or even just a voice, to fight with. The world knows the sensitivity, and the hard hand, of the Israel-ite to 'offence' - real, or imagined. Once before Judeans called out for someone's blood - \"on our heads and our children\".It worked so well, that, to-day, it's attributed to Arabs - and they're punished accordingly. This message has been edited. Last edited by: popsiq, Mon 27 April 2009 12:10 PM", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 11:54:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "popsiq"
    }, 
    {
        "content": "The wall protects us from terrorist attacks. I do not care for the reasons that cause them to fire rockets and blow buses. As long as they will continue to do so, the wall will stand. Besides, in the wall there are gates that allow Palestinians access to their fields. So, when we have to decide what is more important, OUR lives or their QUALITY of life, the decision is obvious. I do not think that i need remind that the wall was the response to terrorist attacks and not vice versa. They have attacked us even before Israel existed, Popsiq, so your notions of \"You took their land s they want it back\" point only to a part of the story. I find it hard to explain with your kind of explanation Mufti's his goons and his electorate behavior. Aiding Hitler, is not fighting for the land, it is fighting for Jews' genocide.", 
        "intTime": 20090427, 
        "postID": 7, 
        "quote": "", 
        "reply": "The wall protects us from terrorist attacks. I do not care for the reasons that cause them to fire rockets and blow buses. As long as they will continue to do so, the wall will stand. Besides, in the wall there are gates that allow Palestinians access to their fields. So, when we have to decide what is more important, OUR lives or their QUALITY of life, the decision is obvious. I do not think that i need remind that the wall was the response to terrorist attacks and not vice versa. They have attacked us even before Israel existed, Popsiq, so your notions of \"You took their land s they want it back\" point only to a part of the story. I find it hard to explain with your kind of explanation Mufti's his goons and his electorate behavior. Aiding Hitler, is not fighting for the land, it is fighting for Jews' genocide.", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 12:35:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "This is just a bunch of Palistinians trying to get in the news, they've been suffering from lack of spotlight lately!", 
        "intTime": 20090427, 
        "postID": 8, 
        "quote": "", 
        "reply": "This is just a bunch of Palistinians trying to get in the news, they've been suffering from lack of spotlight lately!", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-27 15:30:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: The wall protects us from terrorist attacks. I do not care for the reasons that cause them to fire rockets and blow buses. As long as they will continue to do so, the wall will stand. Besides, in the wall there are gates that allow Palestinians access to their fields. So, when we have to decide what is more important, OUR lives or their QUALITY of life, the decision is obvious. But how long before your lot decide that the Pals obviously aren't farming those - curiously some of the best - bits of land that you've accidentally on purpose managed to effectively cut off from their owners and prevent said owners from working on and decide to appropriate them?", 
        "intTime": 20090428, 
        "postID": 9, 
        "quote": "Originally posted by PanzerMeister: The wall protects us from terrorist attacks. I do not care for the reasons that cause them to fire rockets and blow buses. As long as they will continue to do so, the wall will stand. Besides, in the wall there are gates that allow Palestinians access to their fields. So, when we have to decide what is more important, OUR lives or their QUALITY of life, the decision is obvious.", 
        "reply": " But how long before your lot decide that the Pals obviously aren't farming those - curiously some of the best - bits of land that you've accidentally on purpose managed to effectively cut off from their owners and prevent said owners from working on and decide to appropriate them?", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-28 06:40:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "In the wall there are gates that allow Palestinians access to their fields. The real damage is done by destroying the trees and fields on the space were the wall (and few more meters to the side) actually stands. I have served in the aforementioned gates in Baka-al Garbia area. If we were late as much as in 5 minutes in opening these gates, there was hell to pay. So, if they want to farm them, they can farm them. If they complain about it, they can go and complain to their terrorist neighbors. They have started it, not we. And the land is not all that good, BTW. I have seen better.", 
        "intTime": 20090428, 
        "postID": 10, 
        "quote": "", 
        "reply": "In the wall there are gates that allow Palestinians access to their fields. The real damage is done by destroying the trees and fields on the space were the wall (and few more meters to the side) actually stands. I have served in the aforementioned gates in Baka-al Garbia area. If we were late as much as in 5 minutes in opening these gates, there was hell to pay. So, if they want to farm them, they can farm them. If they complain about it, they can go and complain to their terrorist neighbors. They have started it, not we. And the land is not all that good, BTW. I have seen better.", 
        "threadID": "672198221_7040078122001", 
        "time": "2009-04-28 11:09:00", 
        "title": "Non-violent protests against West Bank barrier turn increasingly dangerous", 
        "userID": "PanzerMeister"
    }
]