[
    {
        "content": "from an article by Peter J. Boyer in the New Yorker, Apr 27 issue called The Road Ahead:Smyrna, TN vs. Detroit. \"Obama's creation of the task force offered an elegant solution. He eventually put (investment banker Steven)Rattner on it, naming him senior advisor to Geithner, but his first appointment to the group, with stature equal to Rattner's, was an adviser to the United Steelworker's Union, Ron Bloom.The naming of Bloom comforted labor and signalled that a turnaround of the failed American automobile industry might be possible. It had happened in steel and Bloom had been part of it.\" The article goes on to explain Ron Bloom's participation in reviving the moribund steel industry that resulted in the companies shedding most of their legacy costs and turned out a leaner, more efficient industry that was soon turning a profit once again. Re- the car industry: \"Bloom is not dewy-eyed about the hard-won benefits that get tossed aside at such restructurings. By the time he arrives at the table, the business has failed, and he is willing to acknowledge labor's role in the failure. His talent lies in helping to insure that labor is not asked to accept more than its fair share of sacrifice. 'The term of art that was invented by the labor unions, and that we always use, is 'equality of sacrifice,'\" Psaros says. Bloom described his negotiating philosophy more graphically in a 2006 speech. \"We are big believers in dentist chair bargaining,\" he told a gathering of insolvency lawyers and accountants. \"For those of you not familiar with this approach, it is inspired by the story of the man who walks into his dentist's office, grabs the dentist by the balls, and says, 'Now, let's not hurt each other.'\"... In late February, Bloom and Rattner began studying the industry and what they learned was sobering. They learned, as just one example, the GM's dealership-distribution system is hopelessly out of proportion. Honda has thirteen hundred dealerships in the US, and Toyota- GM's chief rival- has about fifteen hundred. GM has more than six thousand dealers, who are protected by state franchise laws. it will cost the company billions of dollars just to reach parity with the Japanese owned companies.\" These excerpts are from a very illuminating article about exactly what some of the challenges the car companies are currently facing. There are some very good people in the Obama administration and some Republicans like Bob Corker of Tennessee that are struggling hard to make things work out. Full article at: \"http://www.newyorker.com/reporting/2009/04/27/090427fa_fact_boyer", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "", 
        "reply": "from an article by Peter J. Boyer in the New Yorker, Apr 27 issue called The Road Ahead:Smyrna, TN vs. Detroit. \"Obama's creation of the task force offered an elegant solution. He eventually put (investment banker Steven)Rattner on it, naming him senior advisor to Geithner, but his first appointment to the group, with stature equal to Rattner's, was an adviser to the United Steelworker's Union, Ron Bloom.The naming of Bloom comforted labor and signalled that a turnaround of the failed American automobile industry might be possible. It had happened in steel and Bloom had been part of it.\" The article goes on to explain Ron Bloom's participation in reviving the moribund steel industry that resulted in the companies shedding most of their legacy costs and turned out a leaner, more efficient industry that was soon turning a profit once again. Re- the car industry: \"Bloom is not dewy-eyed about the hard-won benefits that get tossed aside at such restructurings. By the time he arrives at the table, the business has failed, and he is willing to acknowledge labor's role in the failure. His talent lies in helping to insure that labor is not asked to accept more than its fair share of sacrifice. 'The term of art that was invented by the labor unions, and that we always use, is 'equality of sacrifice,'\" Psaros says. Bloom described his negotiating philosophy more graphically in a 2006 speech. \"We are big believers in dentist chair bargaining,\" he told a gathering of insolvency lawyers and accountants. \"For those of you not familiar with this approach, it is inspired by the story of the man who walks into his dentist's office, grabs the dentist by the balls, and says, 'Now, let's not hurt each other.'\"... In late February, Bloom and Rattner began studying the industry and what they learned was sobering. They learned, as just one example, the GM's dealership-distribution system is hopelessly out of proportion. Honda has thirteen hundred dealerships in the US, and Toyota- GM's chief rival- has about fifteen hundred. GM has more than six thousand dealers, who are protected by state franchise laws. it will cost the company billions of dollars just to reach parity with the Japanese owned companies.\" These excerpts are from a very illuminating article about exactly what some of the challenges the car companies are currently facing. There are some very good people in the Obama administration and some Republicans like Bob Corker of Tennessee that are struggling hard to make things work out. Full article at: \"http://www.newyorker.com/reporting/2009/04/27/090427fa_fact_boyer", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 00:15:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "Time will tell. GM definitely must make some major alterations to their business model if they ever hope to compete on a level playing field with the imports from Japan and Korea. The place to start is the overly generous union contracts that are far out of line with those of the foreign manufacturers with U.S. assembly lines. If the UAW had not been so intransigent for so long GM might have been able to restructure much sooner.", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "Time will tell. GM definitely must make some major alterations to their business model if they ever hope to compete on a level playing field with the imports from Japan and Korea. The place to start is the overly generous union contracts that are far out of line with those of the foreign manufacturers with U.S. assembly lines. If the UAW had not been so intransigent for so long GM might have been able to restructure much sooner.", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 02:32:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "M123Driver"
    }, 
    {
        "content": "quote: Originally posted by M123Driver: Time will tell. GM definitely must make some major alterations to their business model if they ever hope to compete on a level playing field with the imports from Japan and Korea. The place to start is the overly generous union contracts that are far out of line with those of the foreign manufacturers with U.S. assembly lines. If the UAW had not been so intransigent for so long GM might have been able to restructure much sooner. I think you are being too kind by using the term intransigent! Now, the unions have an ally in obama and biden that they bought and paid for!", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "Originally posted by M123Driver: Time will tell. GM definitely must make some major alterations to their business model if they ever hope to compete on a level playing field with the imports from Japan and Korea. The place to start is the overly generous union contracts that are far out of line with those of the foreign manufacturers with U.S. assembly lines. If the UAW had not been so intransigent for so long GM might have been able to restructure much sooner.", 
        "reply": " I think you are being too kind by using the term intransigent! Now, the unions have an ally in obama and biden that they bought and paid for!", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 02:39:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Perhaps, but I try to be generous so that I am not dismissed off hand by those with opposing views. If we can cut through the partisan attacks, perhaps we can actually influence the other side rather than just call each other names.", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "", 
        "reply": "Perhaps, but I try to be generous so that I am not dismissed off hand by those with opposing views. If we can cut through the partisan attacks, perhaps we can actually influence the other side rather than just call each other names.", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 02:52:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "M123Driver"
    }, 
    {
        "content": "quote: Originally posted by M123Driver: Perhaps, but I try to be generous so that I am not dismissed off hand by those with opposing views. If we can cut through the partisan attacks, perhaps we can actually influence the other side rather than just call each other names. Understood! My biggest concern is the hypocrisy from both sides!", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "Originally posted by M123Driver: Perhaps, but I try to be generous so that I am not dismissed off hand by those with opposing views. If we can cut through the partisan attacks, perhaps we can actually influence the other side rather than just call each other names.", 
        "reply": " Understood! My biggest concern is the hypocrisy from both sides!", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 02:57:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by M123Driver: Perhaps, but I try to be generous so that I am not dismissed off hand by those with opposing views. If we can cut through the partisan attacks, perhaps we can actually influence the other side rather than just call each other names. Understood! My biggest concern is the hypocrisy from both sides! Agreed.", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by M123Driver: Perhaps, but I try to be generous so that I am not dismissed off hand by those with opposing views. If we can cut through the partisan attacks, perhaps we can actually influence the other side rather than just call each other names. Understood! My biggest concern is the hypocrisy from both sides!", 
        "reply": " Agreed.", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 03:13:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "M123Driver"
    }, 
    {
        "content": "GM has sooooooo many problems! Where to start?!?!? -Quality of interior components -Discounts are too generous -Designs are bland -Fuel economy is awful -They already owe $2,300 per car made in union health care and retirement -The Camaro still isn't out (YOU KNOW WHAT, DON'T EVEN BOTHER! SERIOUSLY, YOU HAD YOUR CHANCE, THE NEW MUSCLE CAR ERA IS ALREADY OVER NICE TRY YOU SUCK!!!!!)", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "", 
        "reply": "GM has sooooooo many problems! Where to start?!?!? -Quality of interior components -Discounts are too generous -Designs are bland -Fuel economy is awful -They already owe $2,300 per car made in union health care and retirement -The Camaro still isn't out (YOU KNOW WHAT, DON'T EVEN BOTHER! SERIOUSLY, YOU HAD YOUR CHANCE, THE NEW MUSCLE CAR ERA IS ALREADY OVER NICE TRY YOU SUCK!!!!!)", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 08:44:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: GM has sooooooo many problems! Where to start?!?!? -Quality of interior components Have you ever seen the inside of a Toyota Camry? Feels like you stepped back in time to the 1980's -Discounts are too generous Have to be to cover legacy costs and have a competitive price with the nonunion manufacturers -Designs are bland 2010 camaro, 'nuff said -Fuel economy is awful my 2008 Silverado gets better mpg than any of the foreign name plates -They already owe $2,300 per car made in union health care and retirement only factual statement you made -The Camaro still isn't out (YOU KNOW WHAT, DON'T EVEN BOTHER! SERIOUSLY, YOU HAD YOUR CHANCE, THE NEW MUSCLE CAR ERA IS ALREADY OVER NICE TRY YOU SUCK!!!!!)It is out, I have driven it, and yes, it is spectacular! Chevy's issue is too many brands, too many dealerships, and they pay too much in labor. Fix these things and they will be fine.", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "Originally posted by mrmixitup: GM has sooooooo many problems! Where to start?!?!? -Quality of interior components Have you ever seen the inside of a Toyota Camry? Feels like you stepped back in time to the 1980's -Discounts are too generous Have to be to cover legacy costs and have a competitive price with the nonunion manufacturers -Designs are bland 2010 camaro, 'nuff said -Fuel economy is awful my 2008 Silverado gets better mpg than any of the foreign name plates -They already owe $2,300 per car made in union health care and retirement only factual statement you made -The Camaro still isn't out (YOU KNOW WHAT, DON'T EVEN BOTHER! SERIOUSLY, YOU HAD YOUR CHANCE, THE NEW MUSCLE CAR ERA IS ALREADY OVER NICE TRY YOU SUCK!!!!!)It is out, I have driven it, and yes, it is spectacular!", 
        "reply": " Chevy's issue is too many brands, too many dealerships, and they pay too much in labor. Fix these things and they will be fine.", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-15 10:04:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: GM has sooooooo many problems! Where to start?!?!? -Quality of interior components ** Got some facts on that? -Discounts are too generous ** They are? -Designs are bland ** Oppinion -Fuel economy is awful ** Maybe -They already owe $2,300 per car made in union health care and retirement ** So what? Management gets much more pay and allowances than the workers do. Just another tactic to beat up unions with so you and the Reps can move your agenda to slave labor. -The Camaro still isn't out (YOU KNOW WHAT, DON'T EVEN BOTHER! SERIOUSLY, YOU HAD YOUR CHANCE, THE NEW MUSCLE CAR ERA IS ALREADY OVER NICE TRY YOU SUCK!!!!!)", 
        "intTime": 20090516, 
        "postID": 9, 
        "quote": "Originally posted by mrmixitup: GM has sooooooo many problems! Where to start?!?!? -Quality of interior components ** Got some facts on that? -Discounts are too generous ** They are? -Designs are bland ** Oppinion -Fuel economy is awful ** Maybe -They already owe $2,300 per car made in union health care and retirement ** So what? Management gets much more pay and allowances than the workers do. Just another tactic to beat up unions with so you and the Reps can move your agenda to slave labor. -The Camaro still isn't out (YOU KNOW WHAT, DON'T EVEN BOTHER! SERIOUSLY, YOU HAD YOUR CHANCE, THE NEW MUSCLE CAR ERA IS ALREADY OVER NICE TRY YOU SUCK!!!!!)", 
        "reply": "", 
        "threadID": "672198221_5590043322001", 
        "time": "2009-05-16 14:33:00", 
        "title": "The Road Ahead: Smyrna, TN vs. Detroit", 
        "userID": "crackerjacks61"
    }
]