[
    {
        "content": "NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts?", 
        "intTime": 20090309, 
        "postID": 1, 
        "quote": "", 
        "reply": "NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts?", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-09 20:33:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "BamaBoy91291"
    }, 
    {
        "content": "Let us just hope that he is a much better President than Carter was; or these will be a very long 4 years with him in office.", 
        "intTime": 20090309, 
        "postID": 2, 
        "quote": "", 
        "reply": "Let us just hope that he is a much better President than Carter was; or these will be a very long 4 years with him in office.", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-09 21:00:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "blackflagg509"
    }, 
    {
        "content": "I wouldn't doubt it if he were to put his arm over their shoulders and say \"OK boys, this is how we devide it up........\" One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "", 
        "reply": "I wouldn't doubt it if he were to put his arm over their shoulders and say \"OK boys, this is how we devide it up........\" One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-09 21:11:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? All of the above happened under President Bush, as well, and President Clinton. And neither got involved militarily. None of these men is stupid. Total war with North Korea would result in North Korea wiping out rather a large number of South Korean civilians who are well within range of traditional artillery and God knows what else. China could stop trading with us and pull out of all our treasury bonds - this would literally wipe out our entire economy within hours. It would make the current recession look a cakewalk by comparison. Neither of those wars would be worth fighting until our citizens were actually targeted, maybe not even until after they were killed. The cost is too high. That's why neither Clinton nor Bush reacted overly much to North Korea's talk, nor even to China detaining the entire crew of an EP3 military plane when they force landed in its territory. Obama will make the right call if any country (or international terrorist group) poses a serious threat to our country, rather than just being obnoxious.", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts?", 
        "reply": " All of the above happened under President Bush, as well, and President Clinton. And neither got involved militarily. None of these men is stupid. Total war with North Korea would result in North Korea wiping out rather a large number of South Korean civilians who are well within range of traditional artillery and God knows what else. China could stop trading with us and pull out of all our treasury bonds - this would literally wipe out our entire economy within hours. It would make the current recession look a cakewalk by comparison. Neither of those wars would be worth fighting until our citizens were actually targeted, maybe not even until after they were killed. The cost is too high. That's why neither Clinton nor Bush reacted overly much to North Korea's talk, nor even to China detaining the entire crew of an EP3 military plane when they force landed in its territory. Obama will make the right call if any country (or international terrorist group) poses a serious threat to our country, rather than just being obnoxious.", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-09 21:13:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? Yea sure. Start a war with China. Get serious. Thats what diplomats are for. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts?", 
        "reply": " Yea sure. Start a war with China. Get serious. Thats what diplomats are for. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-09 21:17:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? Yea sure. Start a war with China. Get serious. Thats what diplomats are for. They can also stall for time....Like the 2 diplomats Japan had in Washington D.C. in the months leading up to 7 December 1941... Anybody who thinks our enemies can be defeated or our Nation protected from those enemies by using \"diplomacy\" is a freakin' idiot..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090310, 
        "postID": 6, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? Yea sure. Start a war with China. Get serious. Thats what diplomats are for.", 
        "reply": " They can also stall for time....Like the 2 diplomats Japan had in Washington D.C. in the months leading up to 7 December 1941... Anybody who thinks our enemies can be defeated or our Nation protected from those enemies by using \"diplomacy\" is a freakin' idiot..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 01:54:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Anybody who thinks our enemies can be defeated or our Nation protected from those enemies by using \"diplomacy\" is a freakin' idiot..... yet something tells me you have no problem buying crap from walmart that says \"made in china\"", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "Anybody who thinks our enemies can be defeated or our Nation protected from those enemies by using \"diplomacy\" is a freakin' idiot.....", 
        "reply": " yet something tells me you have no problem buying crap from walmart that says \"made in china\"", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 02:17:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "I hope Obama will act on real threats, not hallucinations. That unarmed naval vessal was in international waters, right? It was off the coast of China, and they interfered with it, so we'll go with their definition of international waters?", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "", 
        "reply": "I hope Obama will act on real threats, not hallucinations. That unarmed naval vessal was in international waters, right? It was off the coast of China, and they interfered with it, so we'll go with their definition of international waters?", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 04:42:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? All of the above happened under President Bush, as well, and President Clinton. And neither got involved militarily. None of these men is stupid. Total war with North Korea would result in North Korea wiping out rather a large number of South Korean civilians who are well within range of traditional artillery and God knows what else. China could stop trading with us and pull out of all our treasury bonds - this would literally wipe out our entire economy within hours. It would make the current recession look a cakewalk by comparison. Neither of those wars would be worth fighting until our citizens were actually targeted, maybe not even until after they were killed. The cost is too high. That's why neither Clinton nor Bush reacted overly much to North Korea's talk, nor even to China detaining the entire crew of an EP3 military plane when they force landed in its territory. Obama will make the right call if any country (or international terrorist group) poses a serious threat to our country, rather than just being obnoxious. Great post! China has us by the you know what and they know it. I think you will see a lot more of this in the future unless we stop allowing Chine to own so much of our economy. This will be ture under both dems and repubs!", 
        "intTime": 20090310, 
        "postID": 9, 
        "quote": "Originally posted by Ruanne: quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? All of the above happened under President Bush, as well, and President Clinton. And neither got involved militarily. None of these men is stupid. Total war with North Korea would result in North Korea wiping out rather a large number of South Korean civilians who are well within range of traditional artillery and God knows what else. China could stop trading with us and pull out of all our treasury bonds - this would literally wipe out our entire economy within hours. It would make the current recession look a cakewalk by comparison. Neither of those wars would be worth fighting until our citizens were actually targeted, maybe not even until after they were killed. The cost is too high. That's why neither Clinton nor Bush reacted overly much to North Korea's talk, nor even to China detaining the entire crew of an EP3 military plane when they force landed in its territory. Obama will make the right call if any country (or international terrorist group) poses a serious threat to our country, rather than just being obnoxious.", 
        "reply": " Great post! China has us by the you know what and they know it. I think you will see a lot more of this in the future unless we stop allowing Chine to own so much of our economy. This will be ture under both dems and repubs!", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 04:43:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "Independence62"
    }, 
    {
        "content": "A US Navy 'research' vessel 115 Km off the Chinese island of Hainan and inside what the Chinese call an 'economic exclusion zone' gets 'harassed' by unprofessional Chinese civilians and a fishery patrol vessel. Had the Chinese been serious they would have forced it into port, and returned the pieces next month.", 
        "intTime": 20090310, 
        "postID": 10, 
        "quote": "", 
        "reply": "A US Navy 'research' vessel 115 Km off the Chinese island of Hainan and inside what the Chinese call an 'economic exclusion zone' gets 'harassed' by unprofessional Chinese civilians and a fishery patrol vessel. Had the Chinese been serious they would have forced it into port, and returned the pieces next month.", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 04:59:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "popsiq"
    }, 
    {
        "content": "How has North Korea threated us?? Other than whatever they have been saying for years now?", 
        "intTime": 20090310, 
        "postID": 11, 
        "quote": "", 
        "reply": "How has North Korea threated us?? Other than whatever they have been saying for years now?", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 06:13:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts? Aren't two wars enough right now? You want to attack everyone who doesn't like us? North Korea has been talking smack for about the last, oh...50 years! You want to go to war with China? So much for your wife's shopping spree at WalMart. PS. China doesn't need to attack us, just quit buying up our debt...", 
        "intTime": 20090310, 
        "postID": 12, 
        "quote": "Originally posted by BamaBoy91291: NKorea have threatened us already, China messed with an unarmed Navy Vessel, whats next? I don't think Obama has the intestinal fortitude to go to war, or protect our interests. And i know he is our CinC, but come on, the world is walking all over us and he's just sitting on the sidelines. Thoughts?", 
        "reply": " Aren't two wars enough right now? You want to attack everyone who doesn't like us? North Korea has been talking smack for about the last, oh...50 years! You want to go to war with China? So much for your wife's shopping spree at WalMart. PS. China doesn't need to attack us, just quit buying up our debt...", 
        "threadID": "672198221_5300014712001", 
        "time": "2009-03-10 06:47:00", 
        "title": "Will Obama do anything about other countries threatening us?", 
        "userID": "Ol_Doc"
    }
]