[
    {
        "content": "\"http://www.msnbc.msn.com/id/30140288\"", 
        "intTime": 20090409, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.msnbc.msn.com/id/30140288\"", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 21:30:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "Forgive me this is my first thread, I have seen arguments from the left that Prez Obama is gonna bring us out of this war. Hasnt happened, they also state that Obama will get us out of Iraq by 2010. Isnt that the agenda that the Bush admin set? I'm not the smartest tool in the shed but I'm pretty sure nothing has changed", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "", 
        "reply": "Forgive me this is my first thread, I have seen arguments from the left that Prez Obama is gonna bring us out of this war. Hasnt happened, they also state that Obama will get us out of Iraq by 2010. Isnt that the agenda that the Bush admin set? I'm not the smartest tool in the shed but I'm pretty sure nothing has changed", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 21:45:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "quote: I have seen arguments from the left that Prez Obama is gonna bring us out of this war. Hasnt happened, they also state that Obama will get us out of Iraq by 2010. Isnt that the agenda that the Bush admin set? I'm not the smartest tool in the shed but I'm pretty sure nothing has changed Obama said nearly from the start \"16 months\" of draw down in Iraq and ramping things up in Afghanistan. The \"agenda\" that Bush set wasn't until during the election.", 
        "intTime": 20090409, 
        "postID": 3, 
        "quote": "I have seen arguments from the left that Prez Obama is gonna bring us out of this war. Hasnt happened, they also state that Obama will get us out of Iraq by 2010. Isnt that the agenda that the Bush admin set? I'm not the smartest tool in the shed but I'm pretty sure nothing has changed", 
        "reply": " Obama said nearly from the start \"16 months\" of draw down in Iraq and ramping things up in Afghanistan. The \"agenda\" that Bush set wasn't until during the election.", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 21:55:00", 
        "title": "change?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Bush didn't even know there was an insurgency going until what, late 2006??", 
        "intTime": 20090409, 
        "postID": 4, 
        "quote": "", 
        "reply": "Bush didn't even know there was an insurgency going until what, late 2006??", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 21:57:00", 
        "title": "change?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Ok read the article", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "", 
        "reply": "Ok read the article", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 22:02:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "I did. if you have a point then make it.", 
        "intTime": 20090409, 
        "postID": 6, 
        "quote": "", 
        "reply": "I did. if you have a point then make it.", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 22:06:00", 
        "title": "change?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it", 
        "intTime": 20090409, 
        "postID": 7, 
        "quote": "", 
        "reply": "Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 22:11:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "quote: Except that this prez has lacked on his promises what promises? The war in Iraq? If that's what you believe then you didn't listen to what he said during the campaign.", 
        "intTime": 20090409, 
        "postID": 8, 
        "quote": "Except that this prez has lacked on his promises", 
        "reply": " what promises? The war in Iraq? If that's what you believe then you didn't listen to what he said during the campaign.", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 22:13:00", 
        "title": "change?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Wow are you serious?? you later, no point om this conversation Edited by me...cant be the mean one This message has been edited. Last edited by: Bad_Moon_Rising, Sat 11 April 2009 12:13 AM", 
        "intTime": 20090409, 
        "postID": 9, 
        "quote": "", 
        "reply": "Wow are you serious?? you later, no point om this conversation Edited by me...cant be the mean one This message has been edited. Last edited by: Bad_Moon_Rising, Sat 11 April 2009 12:13 AM", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 22:18:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "quote: no point om this conversation no kidding", 
        "intTime": 20090409, 
        "postID": 10, 
        "quote": "no point om this conversation", 
        "reply": " no kidding", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-09 22:27:00", 
        "title": "change?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "yea change is what we the people will be left with....", 
        "intTime": 20090410, 
        "postID": 11, 
        "quote": "", 
        "reply": "yea change is what we the people will be left with....", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-10 02:03:00", 
        "title": "change?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Bad_Moon_Rising: Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it It's very easy to be critical of the president as Obama was of Bush when one does not have all the information needed. Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. And karlhungusjr was correct in his earlier post. Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys.", 
        "intTime": 20090410, 
        "postID": 12, 
        "quote": "Originally posted by Bad_Moon_Rising: Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it", 
        "reply": " It's very easy to be critical of the president as Obama was of Bush when one does not have all the information needed. Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. And karlhungusjr was correct in his earlier post. Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys.", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-10 02:37:00", 
        "title": "change?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. yea hahahahaha funny how that is huh.... quote: Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. and thats what bush was wanting to do also ..but he didnt want to commit on a date... not in the best interest to publicly... then the enemy will know how long to wait and they will just sit it out and wait till we are gone.... quote: And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys a 100 nations have so far rejected all of them... regardless of what obama publicly says we will get them because they can not be sent back to their countries because they will be put to death.... these are bad people everyone of them even those that have left who most are still waging a propaganda war against us... obama has already put in motion their release its just a matter of time now....", 
        "intTime": 20090410, 
        "postID": 13, 
        "quote": "Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be.", 
        "reply": " yea hahahahaha funny how that is huh.... quote: Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. and thats what bush was wanting to do also ..but he didnt want to commit on a date... not in the best interest to publicly... then the enemy will know how long to wait and they will just sit it out and wait till we are gone.... quote: And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys a 100 nations have so far rejected all of them... regardless of what obama publicly says we will get them because they can not be sent back to their countries because they will be put to death.... these are bad people everyone of them even those that have left who most are still waging a propaganda war against us... obama has already put in motion their release its just a matter of time now....", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-10 03:02:00", 
        "title": "change?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: and thats what bush was wanting to do also ..but he didnt want to commit on a date... Well, he did commit on a date when the new security agreement was signed a month before Obama was elected. Move along.", 
        "intTime": 20090410, 
        "postID": 14, 
        "quote": "Originally posted by outlaws93: and thats what bush was wanting to do also ..but he didnt want to commit on a date...", 
        "reply": " Well, he did commit on a date when the new security agreement was signed a month before Obama was elected. Move along.", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-10 08:24:00", 
        "title": "change?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by Bad_Moon_Rising: Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it It's very easy to be critical of the president as Obama was of Bush when one does not have all the information needed. Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. And karlhungusjr was correct in his earlier post. Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys. Yeah Scooter but if people like you and I know that there are things going on that we arent supposed to know, why wouldnt a pesidential candidate realize this before making promises? These people should know that even as Governors or Senators or whatever, they just aint getting the whole picture. Anyway thanks for the input, you seem like a good person", 
        "intTime": 20090410, 
        "postID": 15, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by Bad_Moon_Rising: Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it It's very easy to be critical of the president as Obama was of Bush when one does not have all the information needed. Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. And karlhungusjr was correct in his earlier post. Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys.", 
        "reply": " Yeah Scooter but if people like you and I know that there are things going on that we arent supposed to know, why wouldnt a pesidential candidate realize this before making promises? These people should know that even as Governors or Senators or whatever, they just aint getting the whole picture. Anyway thanks for the input, you seem like a good person", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-10 23:45:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "quote: Originally posted by Bad_Moon_Rising: quote: Originally posted by scooter_mech: quote: Originally posted by Bad_Moon_Rising: Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it It's very easy to be critical of the president as Obama was of Bush when one does not have all the information needed. Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. And karlhungusjr was correct in his earlier post. Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys. Yeah Scooter but if people like you and I know that there are things going on that we arent supposed to know, why wouldnt a pesidential candidate realize this before making promises? These people should know that even as Governors or Senators or whatever, they just aint getting the whole picture. Anyway thanks for the input, you seem like a good person One of the \"things\", that you have to learn about ITN, is that sometimes a thick skin is required to hang around here... Most folks on here are pretty great folks but then... LOL Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 16, 
        "quote": "Originally posted by Bad_Moon_Rising: quote: Originally posted by scooter_mech: quote: Originally posted by Bad_Moon_Rising: Actually the point to be made is not mine to be made. Except that this prez has lacked on his promises, it kinda hurts but I'll live with it It's very easy to be critical of the president as Obama was of Bush when one does not have all the information needed. Now that Obama has been briefed by the joint Chiefs as well as the CIA he may have a different opinion of what the best course of action may be. And karlhungusjr was correct in his earlier post. Gradual drawdown from Iraq and a \"surge\" in Afganistan is what Obama has been promoting for some time. And it is also my opinion that the president will eventually change his mind on Guantanamo Bay. He's not going to want to release those guys. Yeah Scooter but if people like you and I know that there are things going on that we arent supposed to know, why wouldnt a pesidential candidate realize this before making promises? These people should know that even as Governors or Senators or whatever, they just aint getting the whole picture. Anyway thanks for the input, you seem like a good person", 
        "reply": " One of the \"things\", that you have to learn about ITN, is that sometimes a thick skin is required to hang around here... Most folks on here are pretty great folks but then... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-11 00:39:00", 
        "title": "change?", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Sunliner, Ive kinda \"hovered\" around this site for a while, I may not be as PC as most of you but my skin IS pretty thick thanks brother", 
        "intTime": 20090411, 
        "postID": 17, 
        "quote": "", 
        "reply": "Sunliner, Ive kinda \"hovered\" around this site for a while, I may not be as PC as most of you but my skin IS pretty thick thanks brother", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-11 00:48:00", 
        "title": "change?", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "quote: Originally posted by Bad_Moon_Rising: Sunliner, Ive kinda \"hovered\" around this site for a while, I may not be as PC as most of you but my skin IS pretty thick thanks brother Not a problem and welcome on board by the way... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 18, 
        "quote": "Originally posted by Bad_Moon_Rising: Sunliner, Ive kinda \"hovered\" around this site for a while, I may not be as PC as most of you but my skin IS pretty thick thanks brother", 
        "reply": " Not a problem and welcome on board by the way... Respectfully, SUNLINER81", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-11 00:56:00", 
        "title": "change?", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by outlaws93: and thats what bush was wanting to do also ..but he didnt want to commit on a date... Well, he did commit on a date when the new security agreement was signed a month before Obama was elected. Move along. Move on, Move on, Move on, Off World, Off World", 
        "intTime": 20090411, 
        "postID": 19, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by outlaws93: and thats what bush was wanting to do also ..but he didnt want to commit on a date... Well, he did commit on a date when the new security agreement was signed a month before Obama was elected. Move along.", 
        "reply": " Move on, Move on, Move on, Off World, Off World", 
        "threadID": "672198221_4370023022001", 
        "time": "2009-04-11 04:58:00", 
        "title": "change?", 
        "userID": "EAG154"
    }
]