[
    {
        "content": ">http://www.thestar.com/comment/article/634549 In return for killing 400 - 800 claimed 'insurgents', the PAK army has put almost a million refugees into the 'schools for jihad' that used to be in Afghanistan. Now they're demanding more assistance which is still no guarantee they'll be able to hold their gains in Swat. Meanwhile the Pakistani government is losing the confidence of everybody, except Americans who believe it's the only show in town.",
        "intTime": 20090515,
        "postID": 1,
        "quote": "",
        "reply": ">http://www.thestar.com/comment/article/634549 In return for killing 400 - 800 claimed 'insurgents', the PAK army has put almost a million refugees into the 'schools for jihad' that used to be in Afghanistan. Now they're demanding more assistance which is still no guarantee they'll be able to hold their gains in Swat. Meanwhile the Pakistani government is losing the confidence of everybody, except Americans who believe it's the only show in town.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-15 18:39:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "popsiq"
    },
    {
        "content": "There are no easy solutions to the problems of Pakistan and Afghanistan. Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand. Following the unnecessary diversion of our military from Afghanistan into Iraq and the mess we created in Iraq, I lamented that we would have military in Iraq for perhaps 30 years and that we would fail in Afghanistan. Unhappily, I seem to have been right. And, now we have Pakistan! I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we. As to Pakistan, we don't yet \"own\" that problem. Our principal concern is to keep the nukes out of Taliban hands and that is a problem for the nations of the world as well. We should not make it our problem. We should learn from our history.",
        "intTime": 20090516,
        "postID": 2,
        "quote": "",
        "reply": "There are no easy solutions to the problems of Pakistan and Afghanistan. Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand. Following the unnecessary diversion of our military from Afghanistan into Iraq and the mess we created in Iraq, I lamented that we would have military in Iraq for perhaps 30 years and that we would fail in Afghanistan. Unhappily, I seem to have been right. And, now we have Pakistan! I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we. As to Pakistan, we don't yet \"own\" that problem. Our principal concern is to keep the nukes out of Taliban hands and that is a problem for the nations of the world as well. We should not make it our problem. We should learn from our history.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 07:35:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "fnewt"
    },
    {
        "content": "I agree to a point, but it always comes back to a nation with nukes and few with broad shoulders to guarantee their safety. America has been aligned with Pakistan when Afghanistan was under siege, before that, when India was allied with the Soviets probably tracing our presence to the 60's. There is a history of military operations including the existing bases, road and airspace access during the current event. Yesterday, the legislature was calling to renew the the peace accords of the same hostile group that started in incursion towards the capital. SAP for the politician there to seek peace through weakness. No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The General won a election or two in parliament, resigned his commission and there is a good chance in the future of winning an general election to office. The only stable government since the founding of the nation by Muhammad Ali Jinnah was when the military ruled. Civilian governments no matter how preferred, become corrupted or weaken in a very short time. Mention the word secular guarantees a fight to the death in most quarters of the nation but Jinnah conviction that theocratic regime would be a ruination of any democracy as proven next door in Afghanistan. The arguement is 60 years and growing. The mad mullahs may measure but 20% of the population but with loud voices and demanding nature dictates to the faint hearted assembly. Consideration from the Asian and subcontinent community is token. India is hated, China supplements the hate, Russia lost standing from the cold war and Afghanistan incursions. The real arbiter that holds influence is Saudi Arabia. Another country, lacking in the eyes of the American.",
        "intTime": 20090516,
        "postID": 3,
        "quote": "",
        "reply": "I agree to a point, but it always comes back to a nation with nukes and few with broad shoulders to guarantee their safety. America has been aligned with Pakistan when Afghanistan was under siege, before that, when India was allied with the Soviets probably tracing our presence to the 60's. There is a history of military operations including the existing bases, road and airspace access during the current event. Yesterday, the legislature was calling to renew the the peace accords of the same hostile group that started in incursion towards the capital. SAP for the politician there to seek peace through weakness. No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The General won a election or two in parliament, resigned his commission and there is a good chance in the future of winning an general election to office. The only stable government since the founding of the nation by Muhammad Ali Jinnah was when the military ruled. Civilian governments no matter how preferred, become corrupted or weaken in a very short time. Mention the word secular guarantees a fight to the death in most quarters of the nation but Jinnah conviction that theocratic regime would be a ruination of any democracy as proven next door in Afghanistan. The arguement is 60 years and growing. The mad mullahs may measure but 20% of the population but with loud voices and demanding nature dictates to the faint hearted assembly. Consideration from the Asian and subcontinent community is token. India is hated, China supplements the hate, Russia lost standing from the cold war and Afghanistan incursions. The real arbiter that holds influence is Saudi Arabia. Another country, lacking in the eyes of the American.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 09:24:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "On the bright side it looks like Congress is going to hold on to power in India so the Pakistan situation will not be muddied by BJP nationalism.",
        "intTime": 20090516,
        "postID": 4,
        "quote": "",
        "reply": "On the bright side it looks like Congress is going to hold on to power in India so the Pakistan situation will not be muddied by BJP nationalism.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 10:46:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Bladensburg"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave",
        "intTime": 20090516,
        "postID": 5,
        "quote": "Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention.",
        "reply": " The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 11:15:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite.",
        "intTime": 20090516,
        "postID": 6,
        "quote": "Originally posted by Grachus: quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave",
        "reply": " As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 13:32:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by fnewt: Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand. History will always repeat itself when people ignorant to history ignore it.",
        "intTime": 20090516,
        "postID": 7,
        "quote": "Originally posted by fnewt: Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand.",
        "reply": " History will always repeat itself when people ignorant to history ignore it.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 13:32:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "mrmixitup"
    },
    {
        "content": "Pakistan harbors nuclear weapons and is more strategic than Afghanistan...and more controllable in a strategic sense. Take it from there. IF we had a stable Pakistan and Iraq, we could exert considerable influence across the ME...including Iran, Syria, and Afghanistan. May become a requirement to do so in the future, as the Wahhabes spread their influence among desperate peoples...",
        "intTime": 20090516,
        "postID": 8,
        "quote": "",
        "reply": "Pakistan harbors nuclear weapons and is more strategic than Afghanistan...and more controllable in a strategic sense. Take it from there. IF we had a stable Pakistan and Iraq, we could exert considerable influence across the ME...including Iran, Syria, and Afghanistan. May become a requirement to do so in the future, as the Wahhabes spread their influence among desperate peoples...",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 14:41:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "strobelvets"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. quote: Originally posted by Grachus: The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave quote: Originally posted by rayevinsonsr: As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. Wow Ray, you trying to kill me by making me die laughing? I guess the \"attempted coup\" by the Court was filled the streets with blood? quote: Originally posted by rayevinsonsr: While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. And? Oh the horror, the Courts said that the \"elected civilian government was the \"legal government.\" How bizzare. What a naive concept. quote: Originally posted by rayevinsonsr: Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. Musarif, won elections? I'll bet he did. Stalin won elections. Hitler won elections. By golly, proof positive that we slander these guys. Now for your information the Mussharif government signed at least a dozen treaties with the Taliban (when I stopped counting) - Even going so far as to return to them captured arms. Why he's the very picture of an anti-Taliban fighter. quote: Originally posted by rayevinsonsr: The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite. While India has thrived despite it's flawed Democracy and corruption, Pakistan is at about the same level it was when it became independant. And that's because the military, and the military within the military - The ISA, have been so incompetent as to prevent any and all progress. So India is actually loaning us money while Pakistan is begging us FOR money. You have a very one sided view of this Ray. Pakistan under military rule has collapsed. And every time it hits bottom, they turn it over to the civilians again. And corruption and all, when Pakistan tries to actually progress, we get another \"bloodless\" military coup. Cheers! Dave",
        "intTime": 20090516,
        "postID": 9,
        "quote": "Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention.",
        "reply": " quote: Originally posted by Grachus: The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave quote: Originally posted by rayevinsonsr: As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. Wow Ray, you trying to kill me by making me die laughing? I guess the \"attempted coup\" by the Court was filled the streets with blood? quote: Originally posted by rayevinsonsr: While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. And? Oh the horror, the Courts said that the \"elected civilian government was the \"legal government.\" How bizzare. What a naive concept. quote: Originally posted by rayevinsonsr: Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. Musarif, won elections? I'll bet he did. Stalin won elections. Hitler won elections. By golly, proof positive that we slander these guys. Now for your information the Mussharif government signed at least a dozen treaties with the Taliban (when I stopped counting) - Even going so far as to return to them captured arms. Why he's the very picture of an anti-Taliban fighter. quote: Originally posted by rayevinsonsr: The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite. While India has thrived despite it's flawed Democracy and corruption, Pakistan is at about the same level it was when it became independant. And that's because the military, and the military within the military - The ISA, have been so incompetent as to prevent any and all progress. So India is actually loaning us money while Pakistan is begging us FOR money. You have a very one sided view of this Ray. Pakistan under military rule has collapsed. And every time it hits bottom, they turn it over to the civilians again. And corruption and all, when Pakistan tries to actually progress, we get another \"bloodless\" military coup. Cheers! Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 17:29:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by fnewt: I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we. I hear you Frank, but \"Adults\" are now running the war in Afghanistan. I say give them a shot before we advocate pulling out. Dave",
        "intTime": 20090516,
        "postID": 10,
        "quote": "Originally posted by fnewt: I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we.",
        "reply": " I hear you Frank, but \"Adults\" are now running the war in Afghanistan. I say give them a shot before we advocate pulling out. Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 17:32:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you.",
        "intTime": 20090516,
        "postID": 11,
        "quote": "",
        "reply": "The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:23:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you. That's ok Ray, I don't bore easily. \"Little Pakistan,\" is located on Coney Island Avenue in Brooklyn. I got a kick out of passing the place during the recent elections. Every damn store had pictures of Bhutto in their windows. Sorry, not one damn picture of Mushariff... Dave",
        "intTime": 20090516,
        "postID": 12,
        "quote": "Originally posted by rayevinsonsr: The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you.",
        "reply": " That's ok Ray, I don't bore easily. \"Little Pakistan,\" is located on Coney Island Avenue in Brooklyn. I got a kick out of passing the place during the recent elections. Every damn store had pictures of Bhutto in their windows. Sorry, not one damn picture of Mushariff... Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:31:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again....",
        "intTime": 20090516,
        "postID": 13,
        "quote": "",
        "reply": "Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again....",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:48:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again.... And why pray tell would you believe Mushafif over her? EDvery stinking Fascist in history overthrows a Democracy with the \"excuse\" that they wer corrupt. First documented case goes back 2500 years and is related by Thucydiddes. What makes you think times have changed? Yeah right, Bhutto was selling smack out of the Presidential Palace... Dave",
        "intTime": 20090516,
        "postID": 14,
        "quote": "Originally posted by rayevinsonsr: Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again....",
        "reply": " And why pray tell would you believe Mushafif over her? EDvery stinking Fascist in history overthrows a Democracy with the \"excuse\" that they wer corrupt. First documented case goes back 2500 years and is related by Thucydiddes. What makes you think times have changed? Yeah right, Bhutto was selling smack out of the Presidential Palace... Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:52:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff!",
        "intTime": 20090516,
        "postID": 15,
        "quote": "",
        "reply": "Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff!",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 19:10:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "fnewt"
    },
    {
        "content": "quote: Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff! E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave",
        "intTime": 20090517,
        "postID": 16,
        "quote": "Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff!",
        "reply": " E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 09:29:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "why the American goverment give up support the China Kuomintang PARTY in 1949, why why ??? China KMT ,the ally with American in the second WAR,who save many ,many american and english soldiers life in the second war against Japan. But KMT can not save american and english people life any longer in the neclear war.if the China Communist party army use the neclear weapons attack America , Tens of millions of American people will be killed at least. When thousands of nuclear bombs fly into sky.Oh,my God!!! The earth has no peace forever. Let us prepare to fight. China Communist party ,the most evil and dreadful power in the world.They are liar and dictatorship.Never trust CCP. CCP has a lot of spys on the west country, I think West country should made KMT and Taiwan stronger. Don't let CCP unify and cheat KMT,or cheat anybody. I come from Taiwan .I am the Kuomintang PARTY member .",
        "intTime": 20090517,
        "postID": 17,
        "quote": "",
        "reply": "why the American goverment give up support the China Kuomintang PARTY in 1949, why why ??? China KMT ,the ally with American in the second WAR,who save many ,many american and english soldiers life in the second war against Japan. But KMT can not save american and english people life any longer in the neclear war.if the China Communist party army use the neclear weapons attack America , Tens of millions of American people will be killed at least. When thousands of nuclear bombs fly into sky.Oh,my God!!! The earth has no peace forever. Let us prepare to fight. China Communist party ,the most evil and dreadful power in the world.They are liar and dictatorship.Never trust CCP. CCP has a lot of spys on the west country, I think West country should made KMT and Taiwan stronger. Don't let CCP unify and cheat KMT,or cheat anybody. I come from Taiwan .I am the Kuomintang PARTY member .",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 09:38:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "throw111"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff! E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave Dave - You can't possibly teach me anything about Brooklyn: I was born and brought up in that \"foreign country\". I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. However, I know that you are a very accomplished photographer. I would like to take your photographic safari. My opinion on Afghanistan is, I believe, fact-based. Since we are escalating (\"surge\" tactic), I sincerely hope that I am wrong. Still, lamentably, I doubt that the \"surge\" will succeed. Frank",
        "intTime": 20090517,
        "postID": 18,
        "quote": "Originally posted by Grachus: quote: Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff! E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave",
        "reply": " Dave - You can't possibly teach me anything about Brooklyn: I was born and brought up in that \"foreign country\". I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. However, I know that you are a very accomplished photographer. I would like to take your photographic safari. My opinion on Afghanistan is, I believe, fact-based. Since we are escalating (\"surge\" tactic), I sincerely hope that I am wrong. Still, lamentably, I doubt that the \"surge\" will succeed. Frank",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 10:09:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "fnewt"
    },
    {
        "content": "[QUOTE]Originally posted by fnewt: I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. There is Brooklyn, and then there is Brooklyn... I thought I knew Brooklyn, but I didn't... Dave",
        "intTime": 20090517,
        "postID": 19,
        "quote": "",
        "reply": "[QUOTE]Originally posted by fnewt: I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. There is Brooklyn, and then there is Brooklyn... I thought I knew Brooklyn, but I didn't... Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 10:15:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by fnewt: Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. True that. I also think that our decision to attack Iraq was based on the idea that we had pretty much won in Afghanistan. Whoops.",
        "intTime": 20090517,
        "postID": 20,
        "quote": "Originally posted by fnewt: Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission.",
        "reply": " True that. I also think that our decision to attack Iraq was based on the idea that we had pretty much won in Afghanistan. Whoops.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 10:24:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "mrmixitup"
    },
    {
        "content": ">http://www.thestar.com/comment/article/634549 In return for killing 400 - 800 claimed 'insurgents', the PAK army has put almost a million refugees into the 'schools for jihad' that used to be in Afghanistan. Now they're demanding more assistance which is still no guarantee they'll be able to hold their gains in Swat. Meanwhile the Pakistani government is losing the confidence of everybody, except Americans who believe it's the only show in town.",
        "intTime": 20090515,
        "postID": 21,
        "quote": "",
        "reply": ">http://www.thestar.com/comment/article/634549 In return for killing 400 - 800 claimed 'insurgents', the PAK army has put almost a million refugees into the 'schools for jihad' that used to be in Afghanistan. Now they're demanding more assistance which is still no guarantee they'll be able to hold their gains in Swat. Meanwhile the Pakistani government is losing the confidence of everybody, except Americans who believe it's the only show in town.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-15 18:39:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "popsiq"
    },
    {
        "content": "There are no easy solutions to the problems of Pakistan and Afghanistan. Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand. Following the unnecessary diversion of our military from Afghanistan into Iraq and the mess we created in Iraq, I lamented that we would have military in Iraq for perhaps 30 years and that we would fail in Afghanistan. Unhappily, I seem to have been right. And, now we have Pakistan! I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we. As to Pakistan, we don't yet \"own\" that problem. Our principal concern is to keep the nukes out of Taliban hands and that is a problem for the nations of the world as well. We should not make it our problem. We should learn from our history.",
        "intTime": 20090516,
        "postID": 22,
        "quote": "",
        "reply": "There are no easy solutions to the problems of Pakistan and Afghanistan. Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand. Following the unnecessary diversion of our military from Afghanistan into Iraq and the mess we created in Iraq, I lamented that we would have military in Iraq for perhaps 30 years and that we would fail in Afghanistan. Unhappily, I seem to have been right. And, now we have Pakistan! I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we. As to Pakistan, we don't yet \"own\" that problem. Our principal concern is to keep the nukes out of Taliban hands and that is a problem for the nations of the world as well. We should not make it our problem. We should learn from our history.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 07:35:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "fnewt"
    },
    {
        "content": "I agree to a point, but it always comes back to a nation with nukes and few with broad shoulders to guarantee their safety. America has been aligned with Pakistan when Afghanistan was under siege, before that, when India was allied with the Soviets probably tracing our presence to the 60's. There is a history of military operations including the existing bases, road and airspace access during the current event. Yesterday, the legislature was calling to renew the the peace accords of the same hostile group that started in incursion towards the capital. SAP for the politician there to seek peace through weakness. No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The General won a election or two in parliament, resigned his commission and there is a good chance in the future of winning an general election to office. The only stable government since the founding of the nation by Muhammad Ali Jinnah was when the military ruled. Civilian governments no matter how preferred, become corrupted or weaken in a very short time. Mention the word secular guarantees a fight to the death in most quarters of the nation but Jinnah conviction that theocratic regime would be a ruination of any democracy as proven next door in Afghanistan. The arguement is 60 years and growing. The mad mullahs may measure but 20% of the population but with loud voices and demanding nature dictates to the faint hearted assembly. Consideration from the Asian and subcontinent community is token. India is hated, China supplements the hate, Russia lost standing from the cold war and Afghanistan incursions. The real arbiter that holds influence is Saudi Arabia. Another country, lacking in the eyes of the American.",
        "intTime": 20090516,
        "postID": 23,
        "quote": "",
        "reply": "I agree to a point, but it always comes back to a nation with nukes and few with broad shoulders to guarantee their safety. America has been aligned with Pakistan when Afghanistan was under siege, before that, when India was allied with the Soviets probably tracing our presence to the 60's. There is a history of military operations including the existing bases, road and airspace access during the current event. Yesterday, the legislature was calling to renew the the peace accords of the same hostile group that started in incursion towards the capital. SAP for the politician there to seek peace through weakness. No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The General won a election or two in parliament, resigned his commission and there is a good chance in the future of winning an general election to office. The only stable government since the founding of the nation by Muhammad Ali Jinnah was when the military ruled. Civilian governments no matter how preferred, become corrupted or weaken in a very short time. Mention the word secular guarantees a fight to the death in most quarters of the nation but Jinnah conviction that theocratic regime would be a ruination of any democracy as proven next door in Afghanistan. The arguement is 60 years and growing. The mad mullahs may measure but 20% of the population but with loud voices and demanding nature dictates to the faint hearted assembly. Consideration from the Asian and subcontinent community is token. India is hated, China supplements the hate, Russia lost standing from the cold war and Afghanistan incursions. The real arbiter that holds influence is Saudi Arabia. Another country, lacking in the eyes of the American.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 09:24:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "On the bright side it looks like Congress is going to hold on to power in India so the Pakistan situation will not be muddied by BJP nationalism.",
        "intTime": 20090516,
        "postID": 24,
        "quote": "",
        "reply": "On the bright side it looks like Congress is going to hold on to power in India so the Pakistan situation will not be muddied by BJP nationalism.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 10:46:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Bladensburg"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave",
        "intTime": 20090516,
        "postID": 25,
        "quote": "Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention.",
        "reply": " The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 11:15:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite.",
        "intTime": 20090516,
        "postID": 26,
        "quote": "Originally posted by Grachus: quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave",
        "reply": " As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 13:32:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by fnewt: Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand. History will always repeat itself when people ignorant to history ignore it.",
        "intTime": 20090516,
        "postID": 27,
        "quote": "Originally posted by fnewt: Learning from history, our history, we should not undertake preemptive wars. Certainly, we should not undertake preemptive wars in those part of the world whose peoples, cultures and religions we do not understand.",
        "reply": " History will always repeat itself when people ignorant to history ignore it.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 13:32:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "mrmixitup"
    },
    {
        "content": "Pakistan harbors nuclear weapons and is more strategic than Afghanistan...and more controllable in a strategic sense. Take it from there. IF we had a stable Pakistan and Iraq, we could exert considerable influence across the ME...including Iran, Syria, and Afghanistan. May become a requirement to do so in the future, as the Wahhabes spread their influence among desperate peoples...",
        "intTime": 20090516,
        "postID": 28,
        "quote": "",
        "reply": "Pakistan harbors nuclear weapons and is more strategic than Afghanistan...and more controllable in a strategic sense. Take it from there. IF we had a stable Pakistan and Iraq, we could exert considerable influence across the ME...including Iran, Syria, and Afghanistan. May become a requirement to do so in the future, as the Wahhabes spread their influence among desperate peoples...",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 14:41:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "strobelvets"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention. quote: Originally posted by Grachus: The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave quote: Originally posted by rayevinsonsr: As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. Wow Ray, you trying to kill me by making me die laughing? I guess the \"attempted coup\" by the Court was filled the streets with blood? quote: Originally posted by rayevinsonsr: While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. And? Oh the horror, the Courts said that the \"elected civilian government was the \"legal government.\" How bizzare. What a naive concept. quote: Originally posted by rayevinsonsr: Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. Musarif, won elections? I'll bet he did. Stalin won elections. Hitler won elections. By golly, proof positive that we slander these guys. Now for your information the Mussharif government signed at least a dozen treaties with the Taliban (when I stopped counting) - Even going so far as to return to them captured arms. Why he's the very picture of an anti-Taliban fighter. quote: Originally posted by rayevinsonsr: The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite. While India has thrived despite it's flawed Democracy and corruption, Pakistan is at about the same level it was when it became independant. And that's because the military, and the military within the military - The ISA, have been so incompetent as to prevent any and all progress. So India is actually loaning us money while Pakistan is begging us FOR money. You have a very one sided view of this Ray. Pakistan under military rule has collapsed. And every time it hits bottom, they turn it over to the civilians again. And corruption and all, when Pakistan tries to actually progress, we get another \"bloodless\" military coup. Cheers! Dave",
        "intTime": 20090516,
        "postID": 29,
        "quote": "Originally posted by rayevinsonsr: No one wanted a military take over when Musharaff took the reins. Early in his take over the court tried a coup while he was airborne about to land in Islamabad and the military backed the General. The Pakistan Supremes were ousted for this intervention.",
        "reply": " quote: Originally posted by Grachus: The Court tried a coup? You have got to be kidding me, Musharif didn't \"take the reins,\" he illegally seized them. The Court telling a military dictator that he just overthrew the government is not a \"coup.\" Dave quote: Originally posted by rayevinsonsr: As always you argue with limited knowledge. The Military coup was bloodless. What you're seeing today of all out war was brought about by lawyers trying to force the elected government to comply to their demands. Wow Ray, you trying to kill me by making me die laughing? I guess the \"attempted coup\" by the Court was filled the streets with blood? quote: Originally posted by rayevinsonsr: While military leaders were out of country the Court declared their supremacy trying to enact a civilian government where none existed. Bhutto and hubby had already left Pakistan being fugitives from six different countries including their own. And? Oh the horror, the Courts said that the \"elected civilian government was the \"legal government.\" How bizzare. What a naive concept. quote: Originally posted by rayevinsonsr: Musharraf stood for election on two occasions and resigned his commission in the military. What else would you prefer, blood? That too, since it looks like the military is the only salvation the country has against MMM and Taliban. Musarif, won elections? I'll bet he did. Stalin won elections. Hitler won elections. By golly, proof positive that we slander these guys. Now for your information the Mussharif government signed at least a dozen treaties with the Taliban (when I stopped counting) - Even going so far as to return to them captured arms. Why he's the very picture of an anti-Taliban fighter. quote: Originally posted by rayevinsonsr: The only semblance of governance in this country was when the military was in power in its short history. Not that I'll ever condone the Khans and the genocide of 79' in East Pakistan, or the wars fought with India. Millions have been murdered in these acts of fighting a common enemy for the sake Pakistan patriotism. Military officers have been known of displacing minorities from property or look the other way after they suffer in business and personal abuse. Minority = Christian or Shiite. While India has thrived despite it's flawed Democracy and corruption, Pakistan is at about the same level it was when it became independant. And that's because the military, and the military within the military - The ISA, have been so incompetent as to prevent any and all progress. So India is actually loaning us money while Pakistan is begging us FOR money. You have a very one sided view of this Ray. Pakistan under military rule has collapsed. And every time it hits bottom, they turn it over to the civilians again. And corruption and all, when Pakistan tries to actually progress, we get another \"bloodless\" military coup. Cheers! Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 17:29:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by fnewt: I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we. I hear you Frank, but \"Adults\" are now running the war in Afghanistan. I say give them a shot before we advocate pulling out. Dave",
        "intTime": 20090516,
        "postID": 30,
        "quote": "Originally posted by fnewt: I would say that we should get out of Afghanistan: not waste another military life and not waste more military materiel. The British and the Russians couldn't win there and neither can we.",
        "reply": " I hear you Frank, but \"Adults\" are now running the war in Afghanistan. I say give them a shot before we advocate pulling out. Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 17:32:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you.",
        "intTime": 20090516,
        "postID": 31,
        "quote": "",
        "reply": "The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:23:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you. That's ok Ray, I don't bore easily. \"Little Pakistan,\" is located on Coney Island Avenue in Brooklyn. I got a kick out of passing the place during the recent elections. Every damn store had pictures of Bhutto in their windows. Sorry, not one damn picture of Mushariff... Dave",
        "intTime": 20090516,
        "postID": 32,
        "quote": "Originally posted by rayevinsonsr: The PPP wins the election giving the General an overwhelming victory in Parliament just like PM Brown in Great Britain or a dozen other countries. He also gained a popular vote of the whole country. You must have missed the part about me not favoring military expediency over democracy, but then the other part, anarchy , dictatorship looks pretty good. The last 21 days proves me right. It wasn't a simple task of the Court ruling in favor of civilian rule, or maintaining a military person cannot hold office, it was naming themselves the ruling authority. But a supporter of ACLU as yourself would probably favor lawyers ruling the world. If my views are simplistic it's only because they are forged by communication from several Pakistani on a forum called the \"Frontier\" years ago. It was shut down by the government later to open in San Fransico. You wouldn't be so flippant if you had any understanding what it was about over there and your accusation of my simply dialogue only means yours is too shallow to add to it. Momim, a Lahor resident, well versed on all subject, objected to the western powers etc but refused to wallow in pity or blame. His was a catch 22, loving his country and religion and because of it fell into a selection of expendable ****e infidel held by the same standards of a westerner, which by any strecth of the imagination is the utmost insult. His foremost enemy was by the Deobandi band of cutthroats that killed their fellow citizens at a rate of one a day for over the two years that we corresponded. Their targets were professional men or women, openly defiant of police or government. Much as the Wahabism movement. I can assure you the uprising you're seeing both Iraq, Afghanistan and Pakistan is not because of the loss of the preceeding administration, but testing the New ADMINISTRATION. Obviously! Sorry to bore you.",
        "reply": " That's ok Ray, I don't bore easily. \"Little Pakistan,\" is located on Coney Island Avenue in Brooklyn. I got a kick out of passing the place during the recent elections. Every damn store had pictures of Bhutto in their windows. Sorry, not one damn picture of Mushariff... Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:31:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again....",
        "intTime": 20090516,
        "postID": 33,
        "quote": "",
        "reply": "Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again....",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:48:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again.... And why pray tell would you believe Mushafif over her? EDvery stinking Fascist in history overthrows a Democracy with the \"excuse\" that they wer corrupt. First documented case goes back 2500 years and is related by Thucydiddes. What makes you think times have changed? Yeah right, Bhutto was selling smack out of the Presidential Palace... Dave",
        "intTime": 20090516,
        "postID": 34,
        "quote": "Originally posted by rayevinsonsr: Wasn't a debate of Bhutto or the General. If it were he'd win hands down. She and her husband were indicted by the same court you keep talking about. Fraud, misuse of funds and theft. Like I said six countrys had charges against them. Well documented. They also informed us that she had a hand in the poppy trade from Afghanistan that was funnel through Karachi port. Musshy might have been Al Capone, but this child was Medusa. I wonder who would they pick today. Knowing her followers they dig her up and run her again....",
        "reply": " And why pray tell would you believe Mushafif over her? EDvery stinking Fascist in history overthrows a Democracy with the \"excuse\" that they wer corrupt. First documented case goes back 2500 years and is related by Thucydiddes. What makes you think times have changed? Yeah right, Bhutto was selling smack out of the Presidential Palace... Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 18:52:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff!",
        "intTime": 20090516,
        "postID": 35,
        "quote": "",
        "reply": "Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff!",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-16 19:10:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "fnewt"
    },
    {
        "content": "quote: Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff! E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave",
        "intTime": 20090517,
        "postID": 36,
        "quote": "Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff!",
        "reply": " E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 09:29:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "why the American goverment give up support the China Kuomintang PARTY in 1949, why why ??? China KMT ,the ally with American in the second WAR,who save many ,many american and english soldiers life in the second war against Japan. But KMT can not save american and english people life any longer in the neclear war.if the China Communist party army use the neclear weapons attack America , Tens of millions of American people will be killed at least. When thousands of nuclear bombs fly into sky.Oh,my God!!! The earth has no peace forever. Let us prepare to fight. China Communist party ,the most evil and dreadful power in the world.They are liar and dictatorship.Never trust CCP. CCP has a lot of spys on the west country, I think West country should made KMT and Taiwan stronger. Don't let CCP unify and cheat KMT,or cheat anybody. I come from Taiwan .I am the Kuomintang PARTY member .",
        "intTime": 20090517,
        "postID": 37,
        "quote": "",
        "reply": "why the American goverment give up support the China Kuomintang PARTY in 1949, why why ??? China KMT ,the ally with American in the second WAR,who save many ,many american and english soldiers life in the second war against Japan. But KMT can not save american and english people life any longer in the neclear war.if the China Communist party army use the neclear weapons attack America , Tens of millions of American people will be killed at least. When thousands of nuclear bombs fly into sky.Oh,my God!!! The earth has no peace forever. Let us prepare to fight. China Communist party ,the most evil and dreadful power in the world.They are liar and dictatorship.Never trust CCP. CCP has a lot of spys on the west country, I think West country should made KMT and Taiwan stronger. Don't let CCP unify and cheat KMT,or cheat anybody. I come from Taiwan .I am the Kuomintang PARTY member .",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 09:38:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "throw111"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff! E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave Dave - You can't possibly teach me anything about Brooklyn: I was born and brought up in that \"foreign country\". I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. However, I know that you are a very accomplished photographer. I would like to take your photographic safari. My opinion on Afghanistan is, I believe, fact-based. Since we are escalating (\"surge\" tactic), I sincerely hope that I am wrong. Still, lamentably, I doubt that the \"surge\" will succeed. Frank",
        "intTime": 20090517,
        "postID": 38,
        "quote": "Originally posted by Grachus: quote: Originally posted by fnewt: Dave - We \"Adults\" have been screwing things up for years and we have learned little, if anything, over all those years. Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. So, let's get out -- that would be an \"ADULT\" solution. Making a losing effort in Afghanistan is only \"KID\" stuff! E-Mail Mainedawg for my e-mail address. It's Spring, and I want to take you on a photographic safari to the foreign country where I was born - Brooklyn... We can discuss this in more detail as your running for your life from Chato. This might change your opinion to agree with me. Dave",
        "reply": " Dave - You can't possibly teach me anything about Brooklyn: I was born and brought up in that \"foreign country\". I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. However, I know that you are a very accomplished photographer. I would like to take your photographic safari. My opinion on Afghanistan is, I believe, fact-based. Since we are escalating (\"surge\" tactic), I sincerely hope that I am wrong. Still, lamentably, I doubt that the \"surge\" will succeed. Frank",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 10:09:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "fnewt"
    },
    {
        "content": "[QUOTE]Originally posted by fnewt: I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. There is Brooklyn, and then there is Brooklyn... I thought I knew Brooklyn, but I didn't... Dave",
        "intTime": 20090517,
        "postID": 39,
        "quote": "",
        "reply": "[QUOTE]Originally posted by fnewt: I went to James Madison High School on Bedford Avenue and Avenue P. I also attended Brooklyn College for one year before being inducted into the US Army. There is Brooklyn, and then there is Brooklyn... I thought I knew Brooklyn, but I didn't... Dave",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 10:15:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by fnewt: Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission. True that. I also think that our decision to attack Iraq was based on the idea that we had pretty much won in Afghanistan. Whoops.",
        "intTime": 20090517,
        "postID": 40,
        "quote": "Originally posted by fnewt: Remember, our original goal in Afghanistan was not to establish a democracy. No, it was to get bin Ladin and alQaeda. When we diverted to Iraq, we lost that opportunity, therefor, our military mission.",
        "reply": " True that. I also think that our decision to attack Iraq was based on the idea that we had pretty much won in Afghanistan. Whoops.",
        "threadID": "672198221_9500024322001",
        "time": "2009-05-17 10:24:00",
        "title": "Pakistan: the Next BIG problem",
        "userID": "mrmixitup"
    }
]