[
    {
        "content": "\"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 08:35:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 08:36:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice...", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "", 
        "reply": "I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice...", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 08:56:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. LOL....Its amazing isn't it sir?", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW.", 
        "reply": " LOL....Its amazing isn't it sir?", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:03:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice... LOL, that's a fact. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "Originally posted by Ol_Doc: I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice...", 
        "reply": " LOL, that's a fact. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:12:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:13:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture.", 
        "reply": " So now you are equating Gitmo with torture? This is getting interesting. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:15:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting.", 
        "reply": " During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:28:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States. BS, the Red Cross Passed Gitmo during the Bush Administration, get off your partisan crap and understand NOTHING is different in Gitmo now or then. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States.", 
        "reply": " BS, the Red Cross Passed Gitmo during the Bush Administration, get off your partisan crap and understand NOTHING is different in Gitmo now or then. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:30:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down.", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW.", 
        "reply": " We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down.", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:35:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "IT has been said, that terrorists fear being a prisoner more than dying......i guess the do-gooders feel it their responbility to comfort them........THINK OF IT....we have a invisible enemythat has no intention of taking prisoners......and when they do,,,,they end up body parts.....hmmnnnnn,I guess if we TOOK NO PRISONERSthe media wouldnt have this FODDER.....to go with their non support agenda........ what we do, or do not do IS NONE OF OUR BUSINESS......unless you want to increase the advantage, the BRAVE CAVEMAN and his vermin have........really ,,,,why should we have \"accountablity\" when they have zero.......", 
        "intTime": 20090526, 
        "postID": 11, 
        "quote": "", 
        "reply": "IT has been said, that terrorists fear being a prisoner more than dying......i guess the do-gooders feel it their responbility to comfort them........THINK OF IT....we have a invisible enemythat has no intention of taking prisoners......and when they do,,,,they end up body parts.....hmmnnnnn,I guess if we TOOK NO PRISONERSthe media wouldnt have this FODDER.....to go with their non support agenda........ what we do, or do not do IS NONE OF OUR BUSINESS......unless you want to increase the advantage, the BRAVE CAVEMAN and his vermin have........really ,,,,why should we have \"accountablity\" when they have zero.......", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:42:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "corporalJT"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: ,,,,why should we have \"accountablity\" when they have zero....... Because we are civilized, they are not. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 12, 
        "quote": "Originally posted by corporalJT: ,,,,why should we have \"accountablity\" when they have zero.......", 
        "reply": " Because we are civilized, they are not. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 10:12:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs!", 
        "intTime": 20090526, 
        "postID": 13, 
        "quote": "", 
        "reply": "Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs!", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 11:02:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs! Building Gitmo was such a monumentally stupid idea. 0-4 in the Supreme Court? Yea, that's about as bad as it gets.", 
        "intTime": 20090526, 
        "postID": 14, 
        "quote": "Originally posted by fnewt: Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs!", 
        "reply": " Building Gitmo was such a monumentally stupid idea. 0-4 in the Supreme Court? Yea, that's about as bad as it gets.", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 12:48:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090526, 
        "postID": 15, 
        "quote": "", 
        "reply": "Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 14:44:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore?", 
        "intTime": 20090526, 
        "postID": 16, 
        "quote": "", 
        "reply": "The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore?", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 15:48:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore? I won't argue your points, that said there are a few inmates that don't want to leave. They are living better now then in their original country. If released back to said country would find themselves in front of a firing squad or hung. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 17, 
        "quote": "Originally posted by AliBubba: The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore?", 
        "reply": " I won't argue your points, that said there are a few inmates that don't want to leave. They are living better now then in their original country. If released back to said country would find themselves in front of a firing squad or hung. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 15:56:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this. Talk about a flip flop! Not too long ago, you were one of the ones screaming it was something else.", 
        "intTime": 20090526, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: \"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this.", 
        "reply": " Talk about a flip flop! Not too long ago, you were one of the ones screaming it was something else.", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 16:17:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down. You should know. And you do. Agreed! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 19, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down.", 
        "reply": " You should know. And you do. Agreed! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 16:22:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now. American prison inmates also have a sense of honor and would jump at a chance to prove their patriotism. The GITMO terrorist prisoner in a US prison would earn for him a status somewhere below that of a child molester, of that you can count on. Time to stop treating these terrorist thugs as rock stars with special right and privileges, prayer time 6 times a day, special diets, free top notch health care that not even the average American can get, and start treating then as the common criminal that they are in a normal population of prisoners. Even Gen. Patreus, the man revered here, in an interview with \"Radio Free Europe\" says he now wants GITMO closed, that torture accomplished nothing of any great significance, and actually supports the President on GITMO. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 20, 
        "quote": "Originally posted by Anbar7: Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now.", 
        "reply": " American prison inmates also have a sense of honor and would jump at a chance to prove their patriotism. The GITMO terrorist prisoner in a US prison would earn for him a status somewhere below that of a child molester, of that you can count on. Time to stop treating these terrorist thugs as rock stars with special right and privileges, prayer time 6 times a day, special diets, free top notch health care that not even the average American can get, and start treating then as the common criminal that they are in a normal population of prisoners. Even Gen. Patreus, the man revered here, in an interview with \"Radio Free Europe\" says he now wants GITMO closed, that torture accomplished nothing of any great significance, and actually supports the President on GITMO. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 16:31:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "\"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 08:35:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 22, 
        "quote": "", 
        "reply": "According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 08:36:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice...", 
        "intTime": 20090526, 
        "postID": 23, 
        "quote": "", 
        "reply": "I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice...", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 08:56:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. LOL....Its amazing isn't it sir?", 
        "intTime": 20090526, 
        "postID": 24, 
        "quote": "Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW.", 
        "reply": " LOL....Its amazing isn't it sir?", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:03:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice... LOL, that's a fact. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 25, 
        "quote": "Originally posted by Ol_Doc: I wouldn't charactorize GETMO as a picnic by any stretch of the imagination. That having been said, I'm also not so sure what the life expectancy of a convicted AQ Terrorist dropped into a US prison general population would be. Might turn into an interesting study in justice...", 
        "reply": " LOL, that's a fact. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:12:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 26, 
        "quote": "", 
        "reply": "\"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:13:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 27, 
        "quote": "Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture.", 
        "reply": " So now you are equating Gitmo with torture? This is getting interesting. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:15:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 28, 
        "quote": "Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting.", 
        "reply": " During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:28:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States. BS, the Red Cross Passed Gitmo during the Bush Administration, get off your partisan crap and understand NOTHING is different in Gitmo now or then. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 29, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by L0A1: quote: Originally posted by jack_flats: \"http://www.rferl.org/content/transcript_RFERL_Interviews_US_Central_Command_Chief_General_David_Petraeus/1738626.html\" General Patreus also supports closing GITMO, and ending torture. So now you are equating Gitmo with torture? This is getting interesting. During the Bush Administration, GITMO was \"torture central.\" Not any longer. GITMO just has it's bad name associated with it amongst civilized nations and peoples, and has become more of a badge of honor to those kept there, where it's terrorist inmates are admired as living martyr's by their peers and bretheran in their homelands. Torture, however, is still being practiced elsewhere by foreign governments against terrorists. The General is against the use of torture to obtain intelligence because the information extracted is unreliable and often lies, not only that, torture goes against everything this nation stands for. GITMO is an embarrassment to the United States.", 
        "reply": " BS, the Red Cross Passed Gitmo during the Bush Administration, get off your partisan crap and understand NOTHING is different in Gitmo now or then. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:30:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down.", 
        "intTime": 20090526, 
        "postID": 30, 
        "quote": "Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW.", 
        "reply": " We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down.", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:35:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "IT has been said, that terrorists fear being a prisoner more than dying......i guess the do-gooders feel it their responbility to comfort them........THINK OF IT....we have a invisible enemythat has no intention of taking prisoners......and when they do,,,,they end up body parts.....hmmnnnnn,I guess if we TOOK NO PRISONERSthe media wouldnt have this FODDER.....to go with their non support agenda........ what we do, or do not do IS NONE OF OUR BUSINESS......unless you want to increase the advantage, the BRAVE CAVEMAN and his vermin have........really ,,,,why should we have \"accountablity\" when they have zero.......", 
        "intTime": 20090526, 
        "postID": 31, 
        "quote": "", 
        "reply": "IT has been said, that terrorists fear being a prisoner more than dying......i guess the do-gooders feel it their responbility to comfort them........THINK OF IT....we have a invisible enemythat has no intention of taking prisoners......and when they do,,,,they end up body parts.....hmmnnnnn,I guess if we TOOK NO PRISONERSthe media wouldnt have this FODDER.....to go with their non support agenda........ what we do, or do not do IS NONE OF OUR BUSINESS......unless you want to increase the advantage, the BRAVE CAVEMAN and his vermin have........really ,,,,why should we have \"accountablity\" when they have zero.......", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 09:42:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "corporalJT"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: ,,,,why should we have \"accountablity\" when they have zero....... Because we are civilized, they are not. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 32, 
        "quote": "Originally posted by corporalJT: ,,,,why should we have \"accountablity\" when they have zero.......", 
        "reply": " Because we are civilized, they are not. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 10:12:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs!", 
        "intTime": 20090526, 
        "postID": 33, 
        "quote": "", 
        "reply": "Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs!", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 11:02:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs! Building Gitmo was such a monumentally stupid idea. 0-4 in the Supreme Court? Yea, that's about as bad as it gets.", 
        "intTime": 20090526, 
        "postID": 34, 
        "quote": "Originally posted by fnewt: Whatever one thinks about the Gitmo prison, it must be closed. Gitmo has caused more embarrassment for the United States than any security it may have provided. Opinion here in the US is overwhelmingly for Gitmo\"s closing and its closing would be applauded throughout the world. Let's got this monkey off our backs!", 
        "reply": " Building Gitmo was such a monumentally stupid idea. 0-4 in the Supreme Court? Yea, that's about as bad as it gets.", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 12:48:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090526, 
        "postID": 35, 
        "quote": "", 
        "reply": "Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 14:44:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore?", 
        "intTime": 20090526, 
        "postID": 36, 
        "quote": "", 
        "reply": "The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore?", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 15:48:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore? I won't argue your points, that said there are a few inmates that don't want to leave. They are living better now then in their original country. If released back to said country would find themselves in front of a firing squad or hung. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 37, 
        "quote": "Originally posted by AliBubba: The 'torture' process was field-tested at Gitmo, and shipped to Abu Gharib. But we can leave that as they've stopped torturing in both places, or so we're told. Gitmo may be better than some US prisons but it needs to have something to make up for the fact that you can't get put in a US prison without your day in court and actually being 'proven' guilty of something. At the other end there's a prospect of actually getting out of a US prison. But if things are so good, how come the only American who wants to get in there is Mike Moore?", 
        "reply": " I won't argue your points, that said there are a few inmates that don't want to leave. They are living better now then in their original country. If released back to said country would find themselves in front of a firing squad or hung. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 15:56:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this. Talk about a flip flop! Not too long ago, you were one of the ones screaming it was something else.", 
        "intTime": 20090526, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: \"http://www.mcclatchydc.com/homepage/story/68816.html\" Exactly why I've been saying. GITMO is a country club. The worst thing that could ever happen to a GITMO prisoner would be to become a prisoner at a US prison, treated like a normal US prisoner, as just another number, and not as some honorable soldier fighting for their cause, being treated like a rock-star with their special GITMO status. Honored and revered by their comrades and by people in the Muslim world because they are living martyrs at GITMO, where they have first class free health care that American citizens don't even have, special diets, special prayer times several times a day, special clothing and laundry services, plus tying up our US troops time where we are not being better served by catering to the whims of terrorist prisoners, and them not chasing real terrorists as they should be doing. Even Gen. Patreus in an interview with \"Radio Free Europe\" says he now wants GITMO closed and supports the President on this.", 
        "reply": " Talk about a flip flop! Not too long ago, you were one of the ones screaming it was something else.", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 16:17:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down. You should know. And you do. Agreed! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 39, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by L0A1: According to the Media and a lot of folks on the left, it was a torture dungeon, now it's nicer then our prisons? WOW. We did torture people there. And having been stationed there, I can tell you it's pretty nice now that we have built permanent facilities. Camp Delta was just a line of cages and the only compound for the first 5 years. So yes, it's better. Seven years later. And now it's time to close it down.", 
        "reply": " You should know. And you do. Agreed! \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 16:22:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now. American prison inmates also have a sense of honor and would jump at a chance to prove their patriotism. The GITMO terrorist prisoner in a US prison would earn for him a status somewhere below that of a child molester, of that you can count on. Time to stop treating these terrorist thugs as rock stars with special right and privileges, prayer time 6 times a day, special diets, free top notch health care that not even the average American can get, and start treating then as the common criminal that they are in a normal population of prisoners. Even Gen. Patreus, the man revered here, in an interview with \"Radio Free Europe\" says he now wants GITMO closed, that torture accomplished nothing of any great significance, and actually supports the President on GITMO. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 40, 
        "quote": "Originally posted by Anbar7: Yes, let's bring over the terrorist to our prisons so they can recruit even faster than they are now.", 
        "reply": " American prison inmates also have a sense of honor and would jump at a chance to prove their patriotism. The GITMO terrorist prisoner in a US prison would earn for him a status somewhere below that of a child molester, of that you can count on. Time to stop treating these terrorist thugs as rock stars with special right and privileges, prayer time 6 times a day, special diets, free top notch health care that not even the average American can get, and start treating then as the common criminal that they are in a normal population of prisoners. Even Gen. Patreus, the man revered here, in an interview with \"Radio Free Europe\" says he now wants GITMO closed, that torture accomplished nothing of any great significance, and actually supports the President on GITMO. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4060003422001", 
        "time": "2009-05-26 16:31:00", 
        "title": "GITMO a Picnic Compared to Some US Prisons", 
        "userID": "jack_flats"
    }
]