[
    {
        "content": "Seems Iran is following Turkey's example. quote: ++http://www.wired.com/dangerroom/2009/05/iran-launches-airstrikes-on-iraqi-villages/ Iran Launches Airstrikes on Iraqi Villages By Noah Shachtman May 4, 2009 | 10:18 am | Categories: Iraq, Paper Pushers, Beltway Bandits, Politicians, Rogue States, Tactics, Strategy and Logistics Iranian aircraft attacked three villages inside Iraq over the weekend. The airstrikes — Iran’s first on Iraqi soil since the U.S. invasion — could complicate the Obama administration’s efforts to normalize relations with Tehran. “The bombardments appeared to have targeted the Party of Free Life of Kurdistan (PJAK), an Iranian Kurdish separatist group which has launched attacks on Iran from rear-supply bases in the mountains of northern Iraq,” AFP reports. Iran has attacked the Kurdish group before, with artillery. But this is the first time the Iranians followed up, with assaults from the air. (...) Details on the airstrikes remain sketchy. Voice of America says the attacks were carried out by helicopters, which remained in Iranian airspace. Al-Arabiyah television, on the other hand, says it was “Iranian planes [that] raided those villages.” It is a serious development because the Iraqi airspace is under the control of the US Air Force and under US protection. So the raids are either approved by the United States, as was the case when a US nod was previously given to the Turkish Army, or such operation was a surprise by the Iranians. According to eyewitnesses, the planes were flying at very low altitudes, which may indicate that they were trying to escape detection by radars. So these planes were able to attack many locations. Eyewitnesses and official Kurdish sources said that the raids were carried out by fighter jets and not helicopters. In February... and: ++http://pajamasmedia.com/instapundit/ quote: Funny this hasn’t gotten more attention. But maybe the press is taking its cue from this: “In February, American fighter jets shot down an Iranian drone flying over Iraq. Such an incursion would’ve likely provoked an angry response from the previous administration. But the reaction to the drone incident was muted — perhaps in the interest of keeping the dialogue with Tehran going.” UPDATE: Reader Fred LaSor thinks the causation works the other way: “My reading is that our ‘muted’ reaction after the drone shootdown was a consideration when the Iranians contemplated their weekend airstrikes inside Iraq. I take this action on their part to be more than a random act — it is another probe to see if Obama will react. Far from keeping dialogue going, our muted response will only encourage Iran to continue its belligerence. Not a good sign.”", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "++http://www.wired.com/dangerroom/2009/05/iran-launches-airstrikes-on-iraqi-villages/ Iran Launches Airstrikes on Iraqi Villages By Noah Shachtman May 4, 2009 | 10:18 am | Categories: Iraq, Paper Pushers, Beltway Bandits, Politicians, Rogue States, Tactics, Strategy and Logistics Iranian aircraft attacked three villages inside Iraq over the weekend. The airstrikes — Iran’s first on Iraqi soil since the U.S. invasion — could complicate the Obama administration’s efforts to normalize relations with Tehran. “The bombardments appeared to have targeted the Party of Free Life of Kurdistan (PJAK), an Iranian Kurdish separatist group which has launched attacks on Iran from rear-supply bases in the mountains of northern Iraq,” AFP reports. Iran has attacked the Kurdish group before, with artillery. But this is the first time the Iranians followed up, with assaults from the air. (...) Details on the airstrikes remain sketchy. Voice of America says the attacks were carried out by helicopters, which remained in Iranian airspace. Al-Arabiyah television, on the other hand, says it was “Iranian planes [that] raided those villages.” It is a serious development because the Iraqi airspace is under the control of the US Air Force and under US protection. So the raids are either approved by the United States, as was the case when a US nod was previously given to the Turkish Army, or such operation was a surprise by the Iranians. According to eyewitnesses, the planes were flying at very low altitudes, which may indicate that they were trying to escape detection by radars. So these planes were able to attack many locations. Eyewitnesses and official Kurdish sources said that the raids were carried out by fighter jets and not helicopters. In February...", 
        "reply": "Seems Iran is following Turkey's example.  and: ++http://pajamasmedia.com/instapundit/ quote: Funny this hasn’t gotten more attention. But maybe the press is taking its cue from this: “In February, American fighter jets shot down an Iranian drone flying over Iraq. Such an incursion would’ve likely provoked an angry response from the previous administration. But the reaction to the drone incident was muted — perhaps in the interest of keeping the dialogue with Tehran going.” UPDATE: Reader Fred LaSor thinks the causation works the other way: “My reading is that our ‘muted’ reaction after the drone shootdown was a consideration when the Iranians contemplated their weekend airstrikes inside Iraq. I take this action on their part to be more than a random act — it is another probe to see if Obama will react. Far from keeping dialogue going, our muted response will only encourage Iran to continue its belligerence. Not a good sign.”", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-06 19:37:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "And to think...everyone thinks Turkey is the only one that isn't all giggled up about an independent Kurdish state.", 
        "intTime": 20090507, 
        "postID": 2, 
        "quote": "", 
        "reply": "And to think...everyone thinks Turkey is the only one that isn't all giggled up about an independent Kurdish state.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-07 12:23:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: And to think...everyone thinks Turkey is the only one that isn't all giggled up about an independent Kurdish state. Nobody wants to see “Kurdistan”. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090507, 
        "postID": 3, 
        "quote": "Originally posted by jwr6: And to think...everyone thinks Turkey is the only one that isn't all giggled up about an independent Kurdish state.", 
        "reply": " Nobody wants to see “Kurdistan”. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-07 12:36:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "NSNN"
    }, 
    {
        "content": "Well, well... Seems Iran has no problems supplying those in Iraq that oppose us or allowing their territory to be used as some sort of safe haven, but does not like the shoe on the other foot. As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. NSSN - if Kurdistan came to be, what do you see as the downside (other than everyone seems to dislike the Kurds)?", 
        "intTime": 20090507, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well, well... Seems Iran has no problems supplying those in Iraq that oppose us or allowing their territory to be used as some sort of safe haven, but does not like the shoe on the other foot. As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. NSSN - if Kurdistan came to be, what do you see as the downside (other than everyone seems to dislike the Kurds)?", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-07 12:41:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "sw614"
    }, 
    {
        "content": "I'm glad our efforts to stabalize Iraq and ensure peace in the area have paid off..", 
        "intTime": 20090507, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm glad our efforts to stabalize Iraq and ensure peace in the area have paid off..", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-07 18:00:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "IMHO. if they are doing the same as the PKK, they need to be hit. The Kurds should take care of them very quickly. They haven't moved against the PKK and I doubt they will against this group.", 
        "intTime": 20090507, 
        "postID": 6, 
        "quote": "", 
        "reply": "IMHO. if they are doing the same as the PKK, they need to be hit. The Kurds should take care of them very quickly. They haven't moved against the PKK and I doubt they will against this group.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-07 20:02:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "It should be interesting when Iraq gets its F-16s.", 
        "intTime": 20090507, 
        "postID": 7, 
        "quote": "", 
        "reply": "It should be interesting when Iraq gets its F-16s.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-07 21:31:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I say put Black Water back over there.", 
        "intTime": 20090508, 
        "postID": 8, 
        "quote": "", 
        "reply": "I say put Black Water back over there.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 03:36:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by jwr6: And to think...everyone thinks Turkey is the only one that isn't all giggled up about an independent Kurdish state. Nobody wants to see “Kurdistan”. \"Nobody wants to see “Kurdistan”.\" The Kurds do", 
        "intTime": 20090508, 
        "postID": 9, 
        "quote": "Originally posted by NSNN: quote: Originally posted by jwr6: And to think...everyone thinks Turkey is the only one that isn't all giggled up about an independent Kurdish state. Nobody wants to see “Kurdistan”. \"Nobody wants to see “Kurdistan”.\" The Kurds do", 
        "reply": "", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 06:53:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by NSNN: Nobody wants to see “Kurdistan”. The Kurds do Considering who and what they are up against, it realistically doesn’t matter what they want. This new age self determination is only possible if an outside power swoops in and makes it happen for you! Considering one of the nations opposed to Kurdistan is not only armed to the teeth, but also a NATO member, it would take an act of god for it to come to fruition. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090508, 
        "postID": 10, 
        "quote": "Originally posted by 6837602: quote: Originally posted by NSNN: Nobody wants to see “Kurdistan”. The Kurds do", 
        "reply": " Considering who and what they are up against, it realistically doesn’t matter what they want. This new age self determination is only possible if an outside power swoops in and makes it happen for you! Considering one of the nations opposed to Kurdistan is not only armed to the teeth, but also a NATO member, it would take an act of god for it to come to fruition. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 07:27:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. The more likely scenario is that Iraq, Iran and Turkey would enter a mutual support agreement and allow cross-border strikes into kurdish areas if the kurdish seperatists get any worse. quote: NSSN - if Kurdistan came to be, what do you see as the downside (other than everyone seems to dislike the Kurds)? How would you propose telling Turkey, Iraq and Iran that they needed to fork over significant amounts of their most heavily natural resource laden territory? If, let's say, the UN demands they do so, you would now have three countries working together to prevent it...most significantly, one of them is a NATO ally and would have justification to demand NATO support to protect the integrity of their borders.", 
        "intTime": 20090508, 
        "postID": 11, 
        "quote": "Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have.", 
        "reply": " The more likely scenario is that Iraq, Iran and Turkey would enter a mutual support agreement and allow cross-border strikes into kurdish areas if the kurdish seperatists get any worse. quote: NSSN - if Kurdistan came to be, what do you see as the downside (other than everyone seems to dislike the Kurds)? How would you propose telling Turkey, Iraq and Iran that they needed to fork over significant amounts of their most heavily natural resource laden territory? If, let's say, the UN demands they do so, you would now have three countries working together to prevent it...most significantly, one of them is a NATO ally and would have justification to demand NATO support to protect the integrity of their borders.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 08:27:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right?", 
        "intTime": 20090508, 
        "postID": 12, 
        "quote": "Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have.", 
        "reply": " We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right?", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 09:57:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right? We go after people who attacked us first. Is there a large, well organized opposition faction operating out of Iraq and into Iran? Are you saying it is Ok for Iran to do this?", 
        "intTime": 20090508, 
        "postID": 13, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right?", 
        "reply": " We go after people who attacked us first. Is there a large, well organized opposition faction operating out of Iraq and into Iran? Are you saying it is Ok for Iran to do this?", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 12:17:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by mrmixitup: quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right? We go after people who attacked us first. Is there a large, well organized opposition faction operating out of Iraq and into Iran? Are you saying it is Ok for Iran to do this? Of course. They are hitting an organization that we ourselves have labeled \"terrorists\", and after all, until we changed the name to \"COC\", this was the Global War on Terror. Why shouldn't a country be able to hit terrorists that attack them? We, of all people, have NO leg to stand on to tell other countries they shouldn't do so. That's the reason we didn't really poke Turkey in the eye over their cross-border stikes into Iraq to hit PKK bases.", 
        "intTime": 20090508, 
        "postID": 14, 
        "quote": "Originally posted by sw614: quote: Originally posted by mrmixitup: quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right? We go after people who attacked us first. Is there a large, well organized opposition faction operating out of Iraq and into Iran? Are you saying it is Ok for Iran to do this?", 
        "reply": " Of course. They are hitting an organization that we ourselves have labeled \"terrorists\", and after all, until we changed the name to \"COC\", this was the Global War on Terror. Why shouldn't a country be able to hit terrorists that attack them? We, of all people, have NO leg to stand on to tell other countries they shouldn't do so. That's the reason we didn't really poke Turkey in the eye over their cross-border stikes into Iraq to hit PKK bases.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 12:37:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by sw614: quote: Originally posted by mrmixitup: quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right? We go after people who attacked us first. Is there a large, well organized opposition faction operating out of Iraq and into Iran? Are you saying it is Ok for Iran to do this? Of course. They are hitting an organization that we ourselves have labeled \"terrorists\", and after all, until we changed the name to \"COC\", this was the Global War on Terror. Why shouldn't a country be able to hit terrorists that attack them? We, of all people, have NO leg to stand on to tell other countries they shouldn't do so. That's the reason we didn't really poke Turkey in the eye over their cross-border stikes into Iraq to hit PKK bases. Then Iran should coordinate and inform. Incursions by acft is going to lead to unintended consequences. Has Iran sat down with Iraq to address the issue and come up with a way of dealing with it? While Pakistan may not know of every strike we do, they do know about, and have usually given guarded permission for, the overall operations.", 
        "intTime": 20090508, 
        "postID": 15, 
        "quote": "Originally posted by jwr6: quote: Originally posted by sw614: quote: Originally posted by mrmixitup: quote: Originally posted by sw614: As much as I hate to say it, if any more attacks occur in the future, we might have to retaliate. Iram can not be allowed to enter Iraqi airspace for any reason they may have. We bomb Pakistan for the same reason. (Cross border incursions and promotion of civil unrest). I guess it's okay if we do it, right? We go after people who attacked us first. Is there a large, well organized opposition faction operating out of Iraq and into Iran? Are you saying it is Ok for Iran to do this? Of course. They are hitting an organization that we ourselves have labeled \"terrorists\", and after all, until we changed the name to \"COC\", this was the Global War on Terror. Why shouldn't a country be able to hit terrorists that attack them? We, of all people, have NO leg to stand on to tell other countries they shouldn't do so. That's the reason we didn't really poke Turkey in the eye over their cross-border stikes into Iraq to hit PKK bases.", 
        "reply": " Then Iran should coordinate and inform. Incursions by acft is going to lead to unintended consequences. Has Iran sat down with Iraq to address the issue and come up with a way of dealing with it? While Pakistan may not know of every strike we do, they do know about, and have usually given guarded permission for, the overall operations.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-08 13:18:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by 6837602: quote: Originally posted by NSNN: Nobody wants to see “Kurdistan”. The Kurds do Considering who and what they are up against, it realistically doesn’t matter what they want. This new age self determination is only possible if an outside power swoops in and makes it happen for you! Considering one of the nations opposed to Kurdistan is not only armed to the teeth, but also a NATO member, it would take an act of god for it to come to fruition. \"it would take an act of god for it to come to fruition\" Well maybe he will act.", 
        "intTime": 20090511, 
        "postID": 16, 
        "quote": "Originally posted by NSNN: quote: Originally posted by 6837602: quote: Originally posted by NSNN: Nobody wants to see “Kurdistan”. The Kurds do Considering who and what they are up against, it realistically doesn’t matter what they want. This new age self determination is only possible if an outside power swoops in and makes it happen for you! Considering one of the nations opposed to Kurdistan is not only armed to the teeth, but also a NATO member, it would take an act of god for it to come to fruition.", 
        "reply": " \"it would take an act of god for it to come to fruition\" Well maybe he will act.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-11 06:21:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by sw614: Then Iran should coordinate and inform. Incursions by acft is going to lead to unintended consequences. Has Iran sat down with Iraq to address the issue and come up with a way of dealing with it? While Pakistan may not know of every strike we do, they do know about, and have usually given guarded permission for, the overall operations. Actually, no. We will let them do whatever the hell they want because we don't care and are too busy dealing with the 55,000 other things going on in this country that are out of our control.", 
        "intTime": 20090511, 
        "postID": 17, 
        "quote": "Originally posted by sw614: Then Iran should coordinate and inform. Incursions by acft is going to lead to unintended consequences. Has Iran sat down with Iraq to address the issue and come up with a way of dealing with it? While Pakistan may not know of every strike we do, they do know about, and have usually given guarded permission for, the overall operations.", 
        "reply": " Actually, no. We will let them do whatever the hell they want because we don't care and are too busy dealing with the 55,000 other things going on in this country that are out of our control.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-11 06:23:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by sw614: Then Iran should coordinate and inform. Incursions by acft is going to lead to unintended consequences. Has Iran sat down with Iraq to address the issue and come up with a way of dealing with it? While Pakistan may not know of every strike we do, they do know about, and have usually given guarded permission for, the overall operations. Actually, no. We will let them do whatever the hell they want because we don't care and are too busy dealing with the 55,000 other things going on in this country that are out of our control. That is why Iraq and Iran should be talking, not us. It worries me that Iranian acft may be entering Iraqi airspace unannounced which could lead to confrontations with us.", 
        "intTime": 20090511, 
        "postID": 18, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by sw614: Then Iran should coordinate and inform. Incursions by acft is going to lead to unintended consequences. Has Iran sat down with Iraq to address the issue and come up with a way of dealing with it? While Pakistan may not know of every strike we do, they do know about, and have usually given guarded permission for, the overall operations. Actually, no. We will let them do whatever the hell they want because we don't care and are too busy dealing with the 55,000 other things going on in this country that are out of our control.", 
        "reply": " That is why Iraq and Iran should be talking, not us. It worries me that Iranian acft may be entering Iraqi airspace unannounced which could lead to confrontations with us.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-11 06:51:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "sw614"
    }, 
    {
        "content": "Dont you people remember that Iraq and Iran hate each other. Do you really think that all has been forgiven for the war they had? I dont but hey I am just a lonely Sgt that spent time there and talked with some people. If the leaders set down to talk it would be over who will run who over. That would be like Germany and Russia talking during world war II. Well I say Iraq wants us out then they need to step up and start using some of thier Air Force, Never mind they couldnt stop them if they tried. But they have to try or they will fall. Stand on their own or fail. That is what they are facing.", 
        "intTime": 20090511, 
        "postID": 19, 
        "quote": "", 
        "reply": "Dont you people remember that Iraq and Iran hate each other. Do you really think that all has been forgiven for the war they had? I dont but hey I am just a lonely Sgt that spent time there and talked with some people. If the leaders set down to talk it would be over who will run who over. That would be like Germany and Russia talking during world war II. Well I say Iraq wants us out then they need to step up and start using some of thier Air Force, Never mind they couldnt stop them if they tried. But they have to try or they will fall. Stand on their own or fail. That is what they are facing.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-11 07:06:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Dont you people remember that Iraq and Iran hate each other. Do you really think that all has been forgiven for the war they had? I dont but hey I am just a lonely Sgt that spent time there and talked with some people. If the leaders set down to talk it would be over who will run who over. That would be like Germany and Russia talking during world war II. Well I say Iraq wants us out then they need to step up and start using some of thier Air Force, Never mind they couldnt stop them if they tried. But they have to try or they will fall. Stand on their own or fail. That is what they are facing. No, have not forgotten the animosity between them. But they have spoken diplomatically on other issues, so why not this one as well? Heck neither of them like the Kurds. Plus once we leave Iraq needs to be able to swallow some pride and talk to their neighbors. The Iraqi Air Force? What Iraqi Air Force? It will be some years before they can defend against armed incursions in the air.", 
        "intTime": 20090511, 
        "postID": 20, 
        "quote": "Originally posted by Usamp27: Dont you people remember that Iraq and Iran hate each other. Do you really think that all has been forgiven for the war they had? I dont but hey I am just a lonely Sgt that spent time there and talked with some people. If the leaders set down to talk it would be over who will run who over. That would be like Germany and Russia talking during world war II. Well I say Iraq wants us out then they need to step up and start using some of thier Air Force, Never mind they couldnt stop them if they tried. But they have to try or they will fall. Stand on their own or fail. That is what they are facing.", 
        "reply": " No, have not forgotten the animosity between them. But they have spoken diplomatically on other issues, so why not this one as well? Heck neither of them like the Kurds. Plus once we leave Iraq needs to be able to swallow some pride and talk to their neighbors. The Iraqi Air Force? What Iraqi Air Force? It will be some years before they can defend against armed incursions in the air.", 
        "threadID": "672198221_1660086222001", 
        "time": "2009-05-11 07:25:00", 
        "title": "Iran AF bombs Iraqi villages", 
        "userID": "sw614"
    }
]