[
    {
        "content": "It's about time the individual States start standing up for themselves and tell the Federal Government \"Thanks, but no thanks\" by invoking their 10th Amendment rights. quote: For small-government die-hards, the $787 billion economic stimulus bill recently passed by Congress isn't a life saver. It's the last straw. Lawmakers across the country are sponsoring resolutions — most of them only symbolic — asserting state sovereignty, in effect the right to ignore any federal law or policies they deem unconstitutional, including the stimulus bill, the No Child Left Behind Act and any new assault rifle ban. In New Hampshire, the House is scheduled to vote on Republican state Rep. Daniel Itse's resolution Wednesday. Supporters are planning a rally at the Statehouse before the vote. \"I think that the specter of some assaults on our liberty have become so real and immediate that there is a reaction,\" Itse said. Lawmakers in at least 15 states are sponsoring similar resolutions. They say they're fighting back against decades of federal overreach, culminating in the stimulus package. \"http://www.google.com/hostednews/ap/article/ALeqM5jt3az5VG6IknYbPlaelNSr-SJblgD96M31OG0\"", 
        "intTime": 20090303, 
        "postID": 1, 
        "quote": "For small-government die-hards, the $787 billion economic stimulus bill recently passed by Congress isn't a life saver. It's the last straw. Lawmakers across the country are sponsoring resolutions — most of them only symbolic — asserting state sovereignty, in effect the right to ignore any federal law or policies they deem unconstitutional, including the stimulus bill, the No Child Left Behind Act and any new assault rifle ban. In New Hampshire, the House is scheduled to vote on Republican state Rep. Daniel Itse's resolution Wednesday. Supporters are planning a rally at the Statehouse before the vote. \"I think that the specter of some assaults on our liberty have become so real and immediate that there is a reaction,\" Itse said. Lawmakers in at least 15 states are sponsoring similar resolutions. They say they're fighting back against decades of federal overreach, culminating in the stimulus package.", 
        "reply": "It's about time the individual States start standing up for themselves and tell the Federal Government \"Thanks, but no thanks\" by invoking their 10th Amendment rights.  \"http://www.google.com/hostednews/ap/article/ALeqM5jt3az5VG6IknYbPlaelNSr-SJblgD96M31OG0\"", 
        "threadID": "672198221_2640038612001", 
        "time": "2009-03-03 17:31:00", 
        "title": "Some State Lawmakers Fighting Federal Stimulus", 
        "userID": "stec74"
    }, 
    {
        "content": "Right on. Now that is representing the people. But they better heed to what they are fighting for, and ensure their states reform their budgets and eliminate wasteful spending, bogus contracts, and all the BS that wastes tax payer dollars.", 
        "intTime": 20090303, 
        "postID": 2, 
        "quote": "", 
        "reply": "Right on. Now that is representing the people. But they better heed to what they are fighting for, and ensure their states reform their budgets and eliminate wasteful spending, bogus contracts, and all the BS that wastes tax payer dollars.", 
        "threadID": "672198221_2640038612001", 
        "time": "2009-03-03 17:50:00", 
        "title": "Some State Lawmakers Fighting Federal Stimulus", 
        "userID": "Boilerman_01"
    }
]