[
    {
        "content": "Note: This is an updated and retitled thread. Please scroll down and turn to the last page for the latest update. Btw, ANZAC_Biscuit, if you are reading this, please try to post any updates about this subject at this thread, to prevent duplicate threads. An update about the current Pakistani Army offensive against the Taliban in Pakistan. It seems the Islamabad government wants to make sure the country doesn't fall to the militants/ Taliban. ++http://www.cnn.com/2009/WORLD/asiapcf/05/03/pakistan.fighting/index.html?iref=mpstoryview quote: Pakistan kills 80 in assault on Taliban Story Highlights Pakistani security forces kill at least 80 militants in country's tribal region Pakistani army has been waging a week-long crackdown on Taliban Three soldiers killed, eight wounded in crackdown in northwest of country ISLAMABAD, Pakistan (CNN) -- Pakistani armed forces have killed 80 militants since launching an assault on a region recently held by the Taliban, the military announced Sunday. Three soldiers have been killed and eight wounded in the crackdown in the Buner district in the northwest of the country, the military statement said. The Pakistani offensive started in the province last Sunday, after Taliban militants moved into Buner, a move that alarmed U.S. and Pakistani officials. Pakistani security forces also killed at least 16 militants late Friday and early Saturday in the Mohmand district, in the country's volatile tribal region, the country's military said on Saturday. The incident appears to be separate from the hostilities in Buner. However, it reflects the tensions in the region and could signal a spread of fighting resulting from the crackdown. In the incident, about 100 militants attacked a Frontier Corps post in the Mohmand Agency, or district, an area where militants hold great sway. Troops returned fire and killed the 16 militants, the military said. Mohmand is in the country's Federally Administered Tribal Areas that border a volatile region in war-torn Afghanistan and Pakistan's North West Frontier Province. Earlier this year, Pakistan had entered into an agreement with militants, allowing them to enforce Islamic law, or sharia, in parts of Swat Valley in exchange for ceasing violence. The Swat Valley is a broader area that includes several provincial districts, including Chitral, Swat, Shangla, Malakand, Upper Dir, and Lower Dir. But Pakistani officials say the armed militants' advance into Buner district violated the agreement and briefly halted peace talks between the two sides in North West Frontier Province... This message has been edited. Last edited by: Canuck_Centaur, Sun 01 November 2009 05:54 PM", 
        "intTime": 20090503, 
        "postID": 1, 
        "quote": "Pakistan kills 80 in assault on Taliban Story Highlights Pakistani security forces kill at least 80 militants in country's tribal region Pakistani army has been waging a week-long crackdown on Taliban Three soldiers killed, eight wounded in crackdown in northwest of country ISLAMABAD, Pakistan (CNN) -- Pakistani armed forces have killed 80 militants since launching an assault on a region recently held by the Taliban, the military announced Sunday. Three soldiers have been killed and eight wounded in the crackdown in the Buner district in the northwest of the country, the military statement said. The Pakistani offensive started in the province last Sunday, after Taliban militants moved into Buner, a move that alarmed U.S. and Pakistani officials. Pakistani security forces also killed at least 16 militants late Friday and early Saturday in the Mohmand district, in the country's volatile tribal region, the country's military said on Saturday. The incident appears to be separate from the hostilities in Buner. However, it reflects the tensions in the region and could signal a spread of fighting resulting from the crackdown. In the incident, about 100 militants attacked a Frontier Corps post in the Mohmand Agency, or district, an area where militants hold great sway. Troops returned fire and killed the 16 militants, the military said. Mohmand is in the country's Federally Administered Tribal Areas that border a volatile region in war-torn Afghanistan and Pakistan's North West Frontier Province. Earlier this year, Pakistan had entered into an agreement with militants, allowing them to enforce Islamic law, or sharia, in parts of Swat Valley in exchange for ceasing violence. The Swat Valley is a broader area that includes several provincial districts, including Chitral, Swat, Shangla, Malakand, Upper Dir, and Lower Dir. But Pakistani officials say the armed militants' advance into Buner district violated the agreement and briefly halted peace talks between the two sides in North West Frontier Province...", 
        "reply": "Note: This is an updated and retitled thread. Please scroll down and turn to the last page for the latest update. Btw, ANZAC_Biscuit, if you are reading this, please try to post any updates about this subject at this thread, to prevent duplicate threads. An update about the current Pakistani Army offensive against the Taliban in Pakistan. It seems the Islamabad government wants to make sure the country doesn't fall to the militants/ Taliban. ++http://www.cnn.com/2009/WORLD/asiapcf/05/03/pakistan.fighting/index.html?iref=mpstoryview  This message has been edited. Last edited by: Canuck_Centaur, Sun 01 November 2009 05:54 PM", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 11:29:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "intTime": 20090503, 
        "postID": 2, 
        "quote": "", 
        "reply": "How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 12:35:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "intTime": 20090503, 
        "postID": 3, 
        "quote": "Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years?", 
        "reply": " Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 15:23:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Looks like it's gonna be harder to dislodge the Taliban from Swat. quote: The Taliban Tightens Hold In Pakistan's Swat Region ++http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050400189.html By Pamela ConstableWashington Post Foreign Service Tuesday, May 5, 2009 ISLAMABAD, Pakistan, May 4 -- Taliban forces tightened their grip on Pakistan's Swat region Monday and continued resisting the military's efforts to dislodge them from neighboring Buner, bringing a fragile peace accord closer to collapse and the volatile northwest region nearer to full-fledged conflict. Yet even as the Taliban continued its rampage and rejected the government's latest concession to its demands -- the appointment of Islamic-law judges in Swat -- Pakistan's military leaders clung to hopes for a nonviolent solution, saying that security forces were \"still exercising restraint to honor the peace agreement.\" Behind this strained hope for a peaceful solution lie an array of factors -- competing military priorities, reluctance to fight fellow Muslims, lack of strong executive leadership and some internal sympathy for the insurgents -- that analysts say have long prevented the Pakistani army from making a full-fledged assault on violent Islamist groups. Over the past two days, extremists in the northwest have attacked a military convoy, beheaded two soldiers, imposed a curfew and blown up a boys' high school and a police station. Troop reinforcements were sent into Buner on Monday after heavy fighting, and there were reports that the army would imminently launch an attack on Swat, an action that could coincide with a crucial aid-seeking visit to Washington this week by President Asif Ali Zardari, whose government has been criticized by U.S. officials for capitulating to the insurgents...", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "The Taliban Tightens Hold In Pakistan's Swat Region ++http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050400189.html By Pamela ConstableWashington Post Foreign Service Tuesday, May 5, 2009 ISLAMABAD, Pakistan, May 4 -- Taliban forces tightened their grip on Pakistan's Swat region Monday and continued resisting the military's efforts to dislodge them from neighboring Buner, bringing a fragile peace accord closer to collapse and the volatile northwest region nearer to full-fledged conflict. Yet even as the Taliban continued its rampage and rejected the government's latest concession to its demands -- the appointment of Islamic-law judges in Swat -- Pakistan's military leaders clung to hopes for a nonviolent solution, saying that security forces were \"still exercising restraint to honor the peace agreement.\" Behind this strained hope for a peaceful solution lie an array of factors -- competing military priorities, reluctance to fight fellow Muslims, lack of strong executive leadership and some internal sympathy for the insurgents -- that analysts say have long prevented the Pakistani army from making a full-fledged assault on violent Islamist groups. Over the past two days, extremists in the northwest have attacked a military convoy, beheaded two soldiers, imposed a curfew and blown up a boys' high school and a police station. Troop reinforcements were sent into Buner on Monday after heavy fighting, and there were reports that the army would imminently launch an attack on Swat, an action that could coincide with a crucial aid-seeking visit to Washington this week by President Asif Ali Zardari, whose government has been criticized by U.S. officials for capitulating to the insurgents...", 
        "reply": "Looks like it's gonna be harder to dislodge the Taliban from Swat. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 06:29:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "intTime": 20090505, 
        "postID": 5, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "reply": " Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 07:11:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "popsiq"
    }, 
    {
        "content": "Yeh, they were just like the Taliban, beheading everyone that they didn't like - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 6, 
        "quote": "", 
        "reply": "Yeh, they were just like the Taliban, beheading everyone that they didn't like - - Wandering and Wondering", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 17:37:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries. I suspect that the Khans just blew through every now and again and slaughtered everyone that resisted, they weren't much interested in the day to day running of their conquests. The Moghuls on the other hand, I seem to recall reading, had similar problems in the NW Frontier to the Raj, near constant low grade warfare after the initial period of Muslim brotherhood.", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "Originally posted by popsiq: quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "reply": " I suspect that the Khans just blew through every now and again and slaughtered everyone that resisted, they weren't much interested in the day to day running of their conquests. The Moghuls on the other hand, I seem to recall reading, had similar problems in the NW Frontier to the Raj, near constant low grade warfare after the initial period of Muslim brotherhood.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 05:16:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "It's pretty easy to keep a lid on any region if you kill everyone there. But that method has worn out it's welcome in most societies. Even in our recent history civilian casualties was excepted and even expected.(world wars ect...) Now a days if a \"civilian\" gets dirt on them when their holding hands with a valid target it's a war crime. Please. Most poeple have no clue what a waring society is like. I can only imagine. But this, and other, part(s) of the world have been in some state of war for thousands of years. I doubt it could be resolved at all. But if it is not at least managed (keep a lid on it) it will (and has) without a doubt spill over into the rest of (our) the world. I would still go there (myself) rather than have it here.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "", 
        "reply": "It's pretty easy to keep a lid on any region if you kill everyone there. But that method has worn out it's welcome in most societies. Even in our recent history civilian casualties was excepted and even expected.(world wars ect...) Now a days if a \"civilian\" gets dirt on them when their holding hands with a valid target it's a war crime. Please. Most poeple have no clue what a waring society is like. I can only imagine. But this, and other, part(s) of the world have been in some state of war for thousands of years. I doubt it could be resolved at all. But if it is not at least managed (keep a lid on it) it will (and has) without a doubt spill over into the rest of (our) the world. I would still go there (myself) rather than have it here.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 05:57:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "reply": " Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 06:52:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons? The Indians (particularly if the BJP wins their general election) would got completely loopy and probably let off a bit of bottled sunshine - if the Israelis didn't beat them to it. I thank Yaweh every day that he hasn't seen fit to give his chosen people aircraft carriers or they'd already have done it.", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "reply": " The Indians (particularly if the BJP wins their general election) would got completely loopy and probably let off a bit of bottled sunshine - if the Israelis didn't beat them to it. I thank Yaweh every day that he hasn't seen fit to give his chosen people aircraft carriers or they'd already have done it.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 17:12:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Does anyone actually believe that the Paks will prevail in this war with the Tallies ? How long have we been at war in that region ---6/7 years ? How long was Russia in that area ? Nope, the Paks have lost---they just don't know it yet and we'll probaqbly have to fight their war too, unless the Paks decide to drop a nuke on the Tallies, which can happen. We have 100x more firepower than the Paks and we're still at it. The next 60 days will be the tell of the tape---ohh well, let's see.", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "", 
        "reply": "Does anyone actually believe that the Paks will prevail in this war with the Tallies ? How long have we been at war in that region ---6/7 years ? How long was Russia in that area ? Nope, the Paks have lost---they just don't know it yet and we'll probaqbly have to fight their war too, unless the Paks decide to drop a nuke on the Tallies, which can happen. We have 100x more firepower than the Paks and we're still at it. The next 60 days will be the tell of the tape---ohh well, let's see.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 20:15:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "Looks like this war has moved south because of the numbers of local civilians displaced. Look up the \"Durand Line\". At least the Pakistani Army has reportedly killed about 143 militants so far. ++http://en.wikipedia.org/wiki/Durand_Line. quote: Pakistan moves against Swat militants, civilians flee Reuters By Junaid Khan Junaid Khan – Fri May 8, 11:22 am ET MINGORA, Pakistan (Reuters) – Pakistani forces attacked Taliban militants in the Swat valley on Friday as concern grew about the fate of nearly a million people displaced by an upsurge in violence. The military said 143 militants had been killed in the Islamist bastion of Swat over the past 24 hours. There was no independent confirmation. Seven soldiers had been killed, an army spokesman said. The struggle in the scenic northwestern valley 130 km (80 miles) from Islamabad and a former center for tourism has become a test of Pakistan's resolve to fight a growing Taliban insurgency that has alarmed the United States. Civilians have poured out of the valley since fighting intensified on Wednesday and aid groups have warned of an intensifying humanitarian crisis. The U.N. refugee agency said a \"massive displacement\" was underway. Citing provincial government estimates, it said up to 200,000 people had left their homes over recent days with another 300,000 on the move or about to move. They are joining another 555,000 people displaced in other areas because of fighting since August, it said. The government has ordered the army to strike at \"militants and terrorists\" it said were trying to hold the country hostage at gunpoint. (...)", 
        "intTime": 20090509, 
        "postID": 12, 
        "quote": "Pakistan moves against Swat militants, civilians flee Reuters By Junaid Khan Junaid Khan – Fri May 8, 11:22 am ET MINGORA, Pakistan (Reuters) – Pakistani forces attacked Taliban militants in the Swat valley on Friday as concern grew about the fate of nearly a million people displaced by an upsurge in violence. The military said 143 militants had been killed in the Islamist bastion of Swat over the past 24 hours. There was no independent confirmation. Seven soldiers had been killed, an army spokesman said. The struggle in the scenic northwestern valley 130 km (80 miles) from Islamabad and a former center for tourism has become a test of Pakistan's resolve to fight a growing Taliban insurgency that has alarmed the United States. Civilians have poured out of the valley since fighting intensified on Wednesday and aid groups have warned of an intensifying humanitarian crisis. The U.N. refugee agency said a \"massive displacement\" was underway. Citing provincial government estimates, it said up to 200,000 people had left their homes over recent days with another 300,000 on the move or about to move. They are joining another 555,000 people displaced in other areas because of fighting since August, it said. The government has ordered the army to strike at \"militants and terrorists\" it said were trying to hold the country hostage at gunpoint. (...)", 
        "reply": "Looks like this war has moved south because of the numbers of local civilians displaced. Look up the \"Durand Line\". At least the Pakistani Army has reportedly killed about 143 militants so far. ++http://en.wikipedia.org/wiki/Durand_Line. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-09 08:44:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Good. quote: Agence France-Presse - 5/9/2009 3:45 PM GMT Taliban 'on the run' after Pakistan offensive Pakistan's military said on Saturday that a full-scale offensive in the northwest has put militants on the back foot following a pledge from President Asif Ali Zardari to eliminate the Taliban. Warplanes pounded rebel hideouts in the Swat valley, an ex-ski resort where up to 15,000 security forces have been deployed under orders to crush extremists in an escalating conflict that has displaced hundreds of thousands. (...) But the statement added that Taliban fighters were \"trying to block the exodus of innocent civilians by preventing their departure through coercion, IEDs (improvised explosive devices), road blocks with trees and even (making them) hostages\". Meanwhile a suspected US drone fired missiles at a compound used by militants in South Waziristan tribal district bordering Afghanistan, killing six militants and injuring 10 others, officials said. The military said Friday an air and ground offensive to crush the Taliban in the northwest killed more than 140 militants. It was impossible to confirm the death tolls independently, given ongoing operations across three districts which began late last month when the hardline insurgents advanced to within 100 kilometres (60 miles) of Islamabad. Meanwhile, fresh troops were entering the Malakand district which neighbours Swat valley, a local military official told AFP. (...) The offensive was launched after Prime Minister Yousuf Raza Gilani late Thursday appealed for unity against extremists whom he said were risking the sovereignty of the nuclear-armed nation and violated the peace deal.", 
        "intTime": 20090509, 
        "postID": 13, 
        "quote": "Agence France-Presse - 5/9/2009 3:45 PM GMT Taliban 'on the run' after Pakistan offensive Pakistan's military said on Saturday that a full-scale offensive in the northwest has put militants on the back foot following a pledge from President Asif Ali Zardari to eliminate the Taliban. Warplanes pounded rebel hideouts in the Swat valley, an ex-ski resort where up to 15,000 security forces have been deployed under orders to crush extremists in an escalating conflict that has displaced hundreds of thousands. (...) But the statement added that Taliban fighters were \"trying to block the exodus of innocent civilians by preventing their departure through coercion, IEDs (improvised explosive devices), road blocks with trees and even (making them) hostages\". Meanwhile a suspected US drone fired missiles at a compound used by militants in South Waziristan tribal district bordering Afghanistan, killing six militants and injuring 10 others, officials said. The military said Friday an air and ground offensive to crush the Taliban in the northwest killed more than 140 militants. It was impossible to confirm the death tolls independently, given ongoing operations across three districts which began late last month when the hardline insurgents advanced to within 100 kilometres (60 miles) of Islamabad. Meanwhile, fresh troops were entering the Malakand district which neighbours Swat valley, a local military official told AFP. (...) The offensive was launched after Prime Minister Yousuf Raza Gilani late Thursday appealed for unity against extremists whom he said were risking the sovereignty of the nuclear-armed nation and violated the peace deal.", 
        "reply": "Good. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-09 14:51:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "And the Pakistani Army campaign against the Taliban continues. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_as/as_pakistan quote: By ZARAR KHAN, Associated Press Writer Zarar Khan, Associated Press Writer – 21 mins ago ISLAMABAD – Pakistani troops killed 80 militants and drove the Taliban from a major urban stronghold on Wednesday, the army said, as U.S. military planes brought aid for refugees fleeing fierce fighting across the northwest. One soldier was killed and nine seriously wounded as troops battled insurgents still holding several other towns in the neighboring Swat Valley, a military spokesman said. Pakistani troops launched an offensive last month after Taliban militants based in Swat pushed into Buner, bringing them within 60 miles (100 kilometers) of the capital of Islamabad and prompting intense U.S. pressure for a stiff response. (...) U.S. Secretary of State Hillary Rodham Clinton announced Tuesday that Washington would provide $110 million in immediate humanitarian assistance to Pakistan. As part of that effort, two American military planes touched down on Wednesday at an air base near Islamabad laden with supplies including air-conditioned tents and 120,000 pre-packed meals, the U.S. Embassy said...", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "By ZARAR KHAN, Associated Press Writer Zarar Khan, Associated Press Writer – 21 mins ago ISLAMABAD – Pakistani troops killed 80 militants and drove the Taliban from a major urban stronghold on Wednesday, the army said, as U.S. military planes brought aid for refugees fleeing fierce fighting across the northwest. One soldier was killed and nine seriously wounded as troops battled insurgents still holding several other towns in the neighboring Swat Valley, a military spokesman said. Pakistani troops launched an offensive last month after Taliban militants based in Swat pushed into Buner, bringing them within 60 miles (100 kilometers) of the capital of Islamabad and prompting intense U.S. pressure for a stiff response. (...) U.S. Secretary of State Hillary Rodham Clinton announced Tuesday that Washington would provide $110 million in immediate humanitarian assistance to Pakistan. As part of that effort, two American military planes touched down on Wednesday at an air base near Islamabad laden with supplies including air-conditioned tents and 120,000 pre-packed meals, the U.S. Embassy said...", 
        "reply": "And the Pakistani Army campaign against the Taliban continues. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_as/as_pakistan ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-20 07:47:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "reply": "So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 06:34:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...) .....BY LIBERAL LOGIC THIS PAKISTANI ARMY IS PROMOTING TERRORIST RECRUITMENT SO NO....THE END WILL NEVER COME...BETTER TO GO HOME AND DRINK TEA... Already past the future", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "Originally posted by Canuck_Centaur: So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "reply": " .....BY LIBERAL LOGIC THIS PAKISTANI ARMY IS PROMOTING TERRORIST RECRUITMENT SO NO....THE END WILL NEVER COME...BETTER TO GO HOME AND DRINK TEA... Already past the future", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 20:12:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "6486143"
    }, 
    {
        "content": "Hey, whats the worry everyone? Our savior in the Oval office has it all under control.", 
        "intTime": 20090530, 
        "postID": 17, 
        "quote": "", 
        "reply": "Hey, whats the worry everyone? Our savior in the Oval office has it all under control.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 21:22:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "Note: This is an updated and retitled thread. Please scroll down and turn to the last page for the latest update. Btw, ANZAC_Biscuit, if you are reading this, please try to post any updates about this subject at this thread, to prevent duplicate threads. An update about the current Pakistani Army offensive against the Taliban in Pakistan. It seems the Islamabad government wants to make sure the country doesn't fall to the militants/ Taliban. ++http://www.cnn.com/2009/WORLD/asiapcf/05/03/pakistan.fighting/index.html?iref=mpstoryview quote: Pakistan kills 80 in assault on Taliban Story Highlights Pakistani security forces kill at least 80 militants in country's tribal region Pakistani army has been waging a week-long crackdown on Taliban Three soldiers killed, eight wounded in crackdown in northwest of country ISLAMABAD, Pakistan (CNN) -- Pakistani armed forces have killed 80 militants since launching an assault on a region recently held by the Taliban, the military announced Sunday. Three soldiers have been killed and eight wounded in the crackdown in the Buner district in the northwest of the country, the military statement said. The Pakistani offensive started in the province last Sunday, after Taliban militants moved into Buner, a move that alarmed U.S. and Pakistani officials. Pakistani security forces also killed at least 16 militants late Friday and early Saturday in the Mohmand district, in the country's volatile tribal region, the country's military said on Saturday. The incident appears to be separate from the hostilities in Buner. However, it reflects the tensions in the region and could signal a spread of fighting resulting from the crackdown. In the incident, about 100 militants attacked a Frontier Corps post in the Mohmand Agency, or district, an area where militants hold great sway. Troops returned fire and killed the 16 militants, the military said. Mohmand is in the country's Federally Administered Tribal Areas that border a volatile region in war-torn Afghanistan and Pakistan's North West Frontier Province. Earlier this year, Pakistan had entered into an agreement with militants, allowing them to enforce Islamic law, or sharia, in parts of Swat Valley in exchange for ceasing violence. The Swat Valley is a broader area that includes several provincial districts, including Chitral, Swat, Shangla, Malakand, Upper Dir, and Lower Dir. But Pakistani officials say the armed militants' advance into Buner district violated the agreement and briefly halted peace talks between the two sides in North West Frontier Province... This message has been edited. Last edited by: Canuck_Centaur, Sun 01 November 2009 05:54 PM", 
        "intTime": 20090503, 
        "postID": 21, 
        "quote": "Pakistan kills 80 in assault on Taliban Story Highlights Pakistani security forces kill at least 80 militants in country's tribal region Pakistani army has been waging a week-long crackdown on Taliban Three soldiers killed, eight wounded in crackdown in northwest of country ISLAMABAD, Pakistan (CNN) -- Pakistani armed forces have killed 80 militants since launching an assault on a region recently held by the Taliban, the military announced Sunday. Three soldiers have been killed and eight wounded in the crackdown in the Buner district in the northwest of the country, the military statement said. The Pakistani offensive started in the province last Sunday, after Taliban militants moved into Buner, a move that alarmed U.S. and Pakistani officials. Pakistani security forces also killed at least 16 militants late Friday and early Saturday in the Mohmand district, in the country's volatile tribal region, the country's military said on Saturday. The incident appears to be separate from the hostilities in Buner. However, it reflects the tensions in the region and could signal a spread of fighting resulting from the crackdown. In the incident, about 100 militants attacked a Frontier Corps post in the Mohmand Agency, or district, an area where militants hold great sway. Troops returned fire and killed the 16 militants, the military said. Mohmand is in the country's Federally Administered Tribal Areas that border a volatile region in war-torn Afghanistan and Pakistan's North West Frontier Province. Earlier this year, Pakistan had entered into an agreement with militants, allowing them to enforce Islamic law, or sharia, in parts of Swat Valley in exchange for ceasing violence. The Swat Valley is a broader area that includes several provincial districts, including Chitral, Swat, Shangla, Malakand, Upper Dir, and Lower Dir. But Pakistani officials say the armed militants' advance into Buner district violated the agreement and briefly halted peace talks between the two sides in North West Frontier Province...", 
        "reply": "Note: This is an updated and retitled thread. Please scroll down and turn to the last page for the latest update. Btw, ANZAC_Biscuit, if you are reading this, please try to post any updates about this subject at this thread, to prevent duplicate threads. An update about the current Pakistani Army offensive against the Taliban in Pakistan. It seems the Islamabad government wants to make sure the country doesn't fall to the militants/ Taliban. ++http://www.cnn.com/2009/WORLD/asiapcf/05/03/pakistan.fighting/index.html?iref=mpstoryview  This message has been edited. Last edited by: Canuck_Centaur, Sun 01 November 2009 05:54 PM", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 11:29:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "intTime": 20090503, 
        "postID": 22, 
        "quote": "", 
        "reply": "How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 12:35:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "intTime": 20090503, 
        "postID": 23, 
        "quote": "Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years?", 
        "reply": " Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 15:23:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Looks like it's gonna be harder to dislodge the Taliban from Swat. quote: The Taliban Tightens Hold In Pakistan's Swat Region ++http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050400189.html By Pamela ConstableWashington Post Foreign Service Tuesday, May 5, 2009 ISLAMABAD, Pakistan, May 4 -- Taliban forces tightened their grip on Pakistan's Swat region Monday and continued resisting the military's efforts to dislodge them from neighboring Buner, bringing a fragile peace accord closer to collapse and the volatile northwest region nearer to full-fledged conflict. Yet even as the Taliban continued its rampage and rejected the government's latest concession to its demands -- the appointment of Islamic-law judges in Swat -- Pakistan's military leaders clung to hopes for a nonviolent solution, saying that security forces were \"still exercising restraint to honor the peace agreement.\" Behind this strained hope for a peaceful solution lie an array of factors -- competing military priorities, reluctance to fight fellow Muslims, lack of strong executive leadership and some internal sympathy for the insurgents -- that analysts say have long prevented the Pakistani army from making a full-fledged assault on violent Islamist groups. Over the past two days, extremists in the northwest have attacked a military convoy, beheaded two soldiers, imposed a curfew and blown up a boys' high school and a police station. Troop reinforcements were sent into Buner on Monday after heavy fighting, and there were reports that the army would imminently launch an attack on Swat, an action that could coincide with a crucial aid-seeking visit to Washington this week by President Asif Ali Zardari, whose government has been criticized by U.S. officials for capitulating to the insurgents...", 
        "intTime": 20090505, 
        "postID": 24, 
        "quote": "The Taliban Tightens Hold In Pakistan's Swat Region ++http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050400189.html By Pamela ConstableWashington Post Foreign Service Tuesday, May 5, 2009 ISLAMABAD, Pakistan, May 4 -- Taliban forces tightened their grip on Pakistan's Swat region Monday and continued resisting the military's efforts to dislodge them from neighboring Buner, bringing a fragile peace accord closer to collapse and the volatile northwest region nearer to full-fledged conflict. Yet even as the Taliban continued its rampage and rejected the government's latest concession to its demands -- the appointment of Islamic-law judges in Swat -- Pakistan's military leaders clung to hopes for a nonviolent solution, saying that security forces were \"still exercising restraint to honor the peace agreement.\" Behind this strained hope for a peaceful solution lie an array of factors -- competing military priorities, reluctance to fight fellow Muslims, lack of strong executive leadership and some internal sympathy for the insurgents -- that analysts say have long prevented the Pakistani army from making a full-fledged assault on violent Islamist groups. Over the past two days, extremists in the northwest have attacked a military convoy, beheaded two soldiers, imposed a curfew and blown up a boys' high school and a police station. Troop reinforcements were sent into Buner on Monday after heavy fighting, and there were reports that the army would imminently launch an attack on Swat, an action that could coincide with a crucial aid-seeking visit to Washington this week by President Asif Ali Zardari, whose government has been criticized by U.S. officials for capitulating to the insurgents...", 
        "reply": "Looks like it's gonna be harder to dislodge the Taliban from Swat. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 06:29:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "intTime": 20090505, 
        "postID": 25, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "reply": " Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 07:11:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "popsiq"
    }, 
    {
        "content": "Yeh, they were just like the Taliban, beheading everyone that they didn't like - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 26, 
        "quote": "", 
        "reply": "Yeh, they were just like the Taliban, beheading everyone that they didn't like - - Wandering and Wondering", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 17:37:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries. I suspect that the Khans just blew through every now and again and slaughtered everyone that resisted, they weren't much interested in the day to day running of their conquests. The Moghuls on the other hand, I seem to recall reading, had similar problems in the NW Frontier to the Raj, near constant low grade warfare after the initial period of Muslim brotherhood.", 
        "intTime": 20090506, 
        "postID": 27, 
        "quote": "Originally posted by popsiq: quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "reply": " I suspect that the Khans just blew through every now and again and slaughtered everyone that resisted, they weren't much interested in the day to day running of their conquests. The Moghuls on the other hand, I seem to recall reading, had similar problems in the NW Frontier to the Raj, near constant low grade warfare after the initial period of Muslim brotherhood.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 05:16:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "It's pretty easy to keep a lid on any region if you kill everyone there. But that method has worn out it's welcome in most societies. Even in our recent history civilian casualties was excepted and even expected.(world wars ect...) Now a days if a \"civilian\" gets dirt on them when their holding hands with a valid target it's a war crime. Please. Most poeple have no clue what a waring society is like. I can only imagine. But this, and other, part(s) of the world have been in some state of war for thousands of years. I doubt it could be resolved at all. But if it is not at least managed (keep a lid on it) it will (and has) without a doubt spill over into the rest of (our) the world. I would still go there (myself) rather than have it here.", 
        "intTime": 20090506, 
        "postID": 28, 
        "quote": "", 
        "reply": "It's pretty easy to keep a lid on any region if you kill everyone there. But that method has worn out it's welcome in most societies. Even in our recent history civilian casualties was excepted and even expected.(world wars ect...) Now a days if a \"civilian\" gets dirt on them when their holding hands with a valid target it's a war crime. Please. Most poeple have no clue what a waring society is like. I can only imagine. But this, and other, part(s) of the world have been in some state of war for thousands of years. I doubt it could be resolved at all. But if it is not at least managed (keep a lid on it) it will (and has) without a doubt spill over into the rest of (our) the world. I would still go there (myself) rather than have it here.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 05:57:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "intTime": 20090506, 
        "postID": 29, 
        "quote": "Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "reply": " Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 06:52:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons? The Indians (particularly if the BJP wins their general election) would got completely loopy and probably let off a bit of bottled sunshine - if the Israelis didn't beat them to it. I thank Yaweh every day that he hasn't seen fit to give his chosen people aircraft carriers or they'd already have done it.", 
        "intTime": 20090506, 
        "postID": 30, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "reply": " The Indians (particularly if the BJP wins their general election) would got completely loopy and probably let off a bit of bottled sunshine - if the Israelis didn't beat them to it. I thank Yaweh every day that he hasn't seen fit to give his chosen people aircraft carriers or they'd already have done it.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 17:12:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Does anyone actually believe that the Paks will prevail in this war with the Tallies ? How long have we been at war in that region ---6/7 years ? How long was Russia in that area ? Nope, the Paks have lost---they just don't know it yet and we'll probaqbly have to fight their war too, unless the Paks decide to drop a nuke on the Tallies, which can happen. We have 100x more firepower than the Paks and we're still at it. The next 60 days will be the tell of the tape---ohh well, let's see.", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "", 
        "reply": "Does anyone actually believe that the Paks will prevail in this war with the Tallies ? How long have we been at war in that region ---6/7 years ? How long was Russia in that area ? Nope, the Paks have lost---they just don't know it yet and we'll probaqbly have to fight their war too, unless the Paks decide to drop a nuke on the Tallies, which can happen. We have 100x more firepower than the Paks and we're still at it. The next 60 days will be the tell of the tape---ohh well, let's see.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 20:15:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "Looks like this war has moved south because of the numbers of local civilians displaced. Look up the \"Durand Line\". At least the Pakistani Army has reportedly killed about 143 militants so far. ++http://en.wikipedia.org/wiki/Durand_Line. quote: Pakistan moves against Swat militants, civilians flee Reuters By Junaid Khan Junaid Khan – Fri May 8, 11:22 am ET MINGORA, Pakistan (Reuters) – Pakistani forces attacked Taliban militants in the Swat valley on Friday as concern grew about the fate of nearly a million people displaced by an upsurge in violence. The military said 143 militants had been killed in the Islamist bastion of Swat over the past 24 hours. There was no independent confirmation. Seven soldiers had been killed, an army spokesman said. The struggle in the scenic northwestern valley 130 km (80 miles) from Islamabad and a former center for tourism has become a test of Pakistan's resolve to fight a growing Taliban insurgency that has alarmed the United States. Civilians have poured out of the valley since fighting intensified on Wednesday and aid groups have warned of an intensifying humanitarian crisis. The U.N. refugee agency said a \"massive displacement\" was underway. Citing provincial government estimates, it said up to 200,000 people had left their homes over recent days with another 300,000 on the move or about to move. They are joining another 555,000 people displaced in other areas because of fighting since August, it said. The government has ordered the army to strike at \"militants and terrorists\" it said were trying to hold the country hostage at gunpoint. (...)", 
        "intTime": 20090509, 
        "postID": 32, 
        "quote": "Pakistan moves against Swat militants, civilians flee Reuters By Junaid Khan Junaid Khan – Fri May 8, 11:22 am ET MINGORA, Pakistan (Reuters) – Pakistani forces attacked Taliban militants in the Swat valley on Friday as concern grew about the fate of nearly a million people displaced by an upsurge in violence. The military said 143 militants had been killed in the Islamist bastion of Swat over the past 24 hours. There was no independent confirmation. Seven soldiers had been killed, an army spokesman said. The struggle in the scenic northwestern valley 130 km (80 miles) from Islamabad and a former center for tourism has become a test of Pakistan's resolve to fight a growing Taliban insurgency that has alarmed the United States. Civilians have poured out of the valley since fighting intensified on Wednesday and aid groups have warned of an intensifying humanitarian crisis. The U.N. refugee agency said a \"massive displacement\" was underway. Citing provincial government estimates, it said up to 200,000 people had left their homes over recent days with another 300,000 on the move or about to move. They are joining another 555,000 people displaced in other areas because of fighting since August, it said. The government has ordered the army to strike at \"militants and terrorists\" it said were trying to hold the country hostage at gunpoint. (...)", 
        "reply": "Looks like this war has moved south because of the numbers of local civilians displaced. Look up the \"Durand Line\". At least the Pakistani Army has reportedly killed about 143 militants so far. ++http://en.wikipedia.org/wiki/Durand_Line. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-09 08:44:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Good. quote: Agence France-Presse - 5/9/2009 3:45 PM GMT Taliban 'on the run' after Pakistan offensive Pakistan's military said on Saturday that a full-scale offensive in the northwest has put militants on the back foot following a pledge from President Asif Ali Zardari to eliminate the Taliban. Warplanes pounded rebel hideouts in the Swat valley, an ex-ski resort where up to 15,000 security forces have been deployed under orders to crush extremists in an escalating conflict that has displaced hundreds of thousands. (...) But the statement added that Taliban fighters were \"trying to block the exodus of innocent civilians by preventing their departure through coercion, IEDs (improvised explosive devices), road blocks with trees and even (making them) hostages\". Meanwhile a suspected US drone fired missiles at a compound used by militants in South Waziristan tribal district bordering Afghanistan, killing six militants and injuring 10 others, officials said. The military said Friday an air and ground offensive to crush the Taliban in the northwest killed more than 140 militants. It was impossible to confirm the death tolls independently, given ongoing operations across three districts which began late last month when the hardline insurgents advanced to within 100 kilometres (60 miles) of Islamabad. Meanwhile, fresh troops were entering the Malakand district which neighbours Swat valley, a local military official told AFP. (...) The offensive was launched after Prime Minister Yousuf Raza Gilani late Thursday appealed for unity against extremists whom he said were risking the sovereignty of the nuclear-armed nation and violated the peace deal.", 
        "intTime": 20090509, 
        "postID": 33, 
        "quote": "Agence France-Presse - 5/9/2009 3:45 PM GMT Taliban 'on the run' after Pakistan offensive Pakistan's military said on Saturday that a full-scale offensive in the northwest has put militants on the back foot following a pledge from President Asif Ali Zardari to eliminate the Taliban. Warplanes pounded rebel hideouts in the Swat valley, an ex-ski resort where up to 15,000 security forces have been deployed under orders to crush extremists in an escalating conflict that has displaced hundreds of thousands. (...) But the statement added that Taliban fighters were \"trying to block the exodus of innocent civilians by preventing their departure through coercion, IEDs (improvised explosive devices), road blocks with trees and even (making them) hostages\". Meanwhile a suspected US drone fired missiles at a compound used by militants in South Waziristan tribal district bordering Afghanistan, killing six militants and injuring 10 others, officials said. The military said Friday an air and ground offensive to crush the Taliban in the northwest killed more than 140 militants. It was impossible to confirm the death tolls independently, given ongoing operations across three districts which began late last month when the hardline insurgents advanced to within 100 kilometres (60 miles) of Islamabad. Meanwhile, fresh troops were entering the Malakand district which neighbours Swat valley, a local military official told AFP. (...) The offensive was launched after Prime Minister Yousuf Raza Gilani late Thursday appealed for unity against extremists whom he said were risking the sovereignty of the nuclear-armed nation and violated the peace deal.", 
        "reply": "Good. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-09 14:51:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "And the Pakistani Army campaign against the Taliban continues. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_as/as_pakistan quote: By ZARAR KHAN, Associated Press Writer Zarar Khan, Associated Press Writer – 21 mins ago ISLAMABAD – Pakistani troops killed 80 militants and drove the Taliban from a major urban stronghold on Wednesday, the army said, as U.S. military planes brought aid for refugees fleeing fierce fighting across the northwest. One soldier was killed and nine seriously wounded as troops battled insurgents still holding several other towns in the neighboring Swat Valley, a military spokesman said. Pakistani troops launched an offensive last month after Taliban militants based in Swat pushed into Buner, bringing them within 60 miles (100 kilometers) of the capital of Islamabad and prompting intense U.S. pressure for a stiff response. (...) U.S. Secretary of State Hillary Rodham Clinton announced Tuesday that Washington would provide $110 million in immediate humanitarian assistance to Pakistan. As part of that effort, two American military planes touched down on Wednesday at an air base near Islamabad laden with supplies including air-conditioned tents and 120,000 pre-packed meals, the U.S. Embassy said...", 
        "intTime": 20090520, 
        "postID": 34, 
        "quote": "By ZARAR KHAN, Associated Press Writer Zarar Khan, Associated Press Writer – 21 mins ago ISLAMABAD – Pakistani troops killed 80 militants and drove the Taliban from a major urban stronghold on Wednesday, the army said, as U.S. military planes brought aid for refugees fleeing fierce fighting across the northwest. One soldier was killed and nine seriously wounded as troops battled insurgents still holding several other towns in the neighboring Swat Valley, a military spokesman said. Pakistani troops launched an offensive last month after Taliban militants based in Swat pushed into Buner, bringing them within 60 miles (100 kilometers) of the capital of Islamabad and prompting intense U.S. pressure for a stiff response. (...) U.S. Secretary of State Hillary Rodham Clinton announced Tuesday that Washington would provide $110 million in immediate humanitarian assistance to Pakistan. As part of that effort, two American military planes touched down on Wednesday at an air base near Islamabad laden with supplies including air-conditioned tents and 120,000 pre-packed meals, the U.S. Embassy said...", 
        "reply": "And the Pakistani Army campaign against the Taliban continues. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_as/as_pakistan ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-20 07:47:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "intTime": 20090530, 
        "postID": 35, 
        "quote": "Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "reply": "So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 06:34:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...) .....BY LIBERAL LOGIC THIS PAKISTANI ARMY IS PROMOTING TERRORIST RECRUITMENT SO NO....THE END WILL NEVER COME...BETTER TO GO HOME AND DRINK TEA... Already past the future", 
        "intTime": 20090530, 
        "postID": 36, 
        "quote": "Originally posted by Canuck_Centaur: So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "reply": " .....BY LIBERAL LOGIC THIS PAKISTANI ARMY IS PROMOTING TERRORIST RECRUITMENT SO NO....THE END WILL NEVER COME...BETTER TO GO HOME AND DRINK TEA... Already past the future", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 20:12:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "6486143"
    }, 
    {
        "content": "Hey, whats the worry everyone? Our savior in the Oval office has it all under control.", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "", 
        "reply": "Hey, whats the worry everyone? Our savior in the Oval office has it all under control.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 21:22:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "Note: This is an updated and retitled thread. Please scroll down and turn to the last page for the latest update. Btw, ANZAC_Biscuit, if you are reading this, please try to post any updates about this subject at this thread, to prevent duplicate threads. An update about the current Pakistani Army offensive against the Taliban in Pakistan. It seems the Islamabad government wants to make sure the country doesn't fall to the militants/ Taliban. ++http://www.cnn.com/2009/WORLD/asiapcf/05/03/pakistan.fighting/index.html?iref=mpstoryview quote: Pakistan kills 80 in assault on Taliban Story Highlights Pakistani security forces kill at least 80 militants in country's tribal region Pakistani army has been waging a week-long crackdown on Taliban Three soldiers killed, eight wounded in crackdown in northwest of country ISLAMABAD, Pakistan (CNN) -- Pakistani armed forces have killed 80 militants since launching an assault on a region recently held by the Taliban, the military announced Sunday. Three soldiers have been killed and eight wounded in the crackdown in the Buner district in the northwest of the country, the military statement said. The Pakistani offensive started in the province last Sunday, after Taliban militants moved into Buner, a move that alarmed U.S. and Pakistani officials. Pakistani security forces also killed at least 16 militants late Friday and early Saturday in the Mohmand district, in the country's volatile tribal region, the country's military said on Saturday. The incident appears to be separate from the hostilities in Buner. However, it reflects the tensions in the region and could signal a spread of fighting resulting from the crackdown. In the incident, about 100 militants attacked a Frontier Corps post in the Mohmand Agency, or district, an area where militants hold great sway. Troops returned fire and killed the 16 militants, the military said. Mohmand is in the country's Federally Administered Tribal Areas that border a volatile region in war-torn Afghanistan and Pakistan's North West Frontier Province. Earlier this year, Pakistan had entered into an agreement with militants, allowing them to enforce Islamic law, or sharia, in parts of Swat Valley in exchange for ceasing violence. The Swat Valley is a broader area that includes several provincial districts, including Chitral, Swat, Shangla, Malakand, Upper Dir, and Lower Dir. But Pakistani officials say the armed militants' advance into Buner district violated the agreement and briefly halted peace talks between the two sides in North West Frontier Province... This message has been edited. Last edited by: Canuck_Centaur, Sun 01 November 2009 05:54 PM", 
        "intTime": 20090503, 
        "postID": 41, 
        "quote": "Pakistan kills 80 in assault on Taliban Story Highlights Pakistani security forces kill at least 80 militants in country's tribal region Pakistani army has been waging a week-long crackdown on Taliban Three soldiers killed, eight wounded in crackdown in northwest of country ISLAMABAD, Pakistan (CNN) -- Pakistani armed forces have killed 80 militants since launching an assault on a region recently held by the Taliban, the military announced Sunday. Three soldiers have been killed and eight wounded in the crackdown in the Buner district in the northwest of the country, the military statement said. The Pakistani offensive started in the province last Sunday, after Taliban militants moved into Buner, a move that alarmed U.S. and Pakistani officials. Pakistani security forces also killed at least 16 militants late Friday and early Saturday in the Mohmand district, in the country's volatile tribal region, the country's military said on Saturday. The incident appears to be separate from the hostilities in Buner. However, it reflects the tensions in the region and could signal a spread of fighting resulting from the crackdown. In the incident, about 100 militants attacked a Frontier Corps post in the Mohmand Agency, or district, an area where militants hold great sway. Troops returned fire and killed the 16 militants, the military said. Mohmand is in the country's Federally Administered Tribal Areas that border a volatile region in war-torn Afghanistan and Pakistan's North West Frontier Province. Earlier this year, Pakistan had entered into an agreement with militants, allowing them to enforce Islamic law, or sharia, in parts of Swat Valley in exchange for ceasing violence. The Swat Valley is a broader area that includes several provincial districts, including Chitral, Swat, Shangla, Malakand, Upper Dir, and Lower Dir. But Pakistani officials say the armed militants' advance into Buner district violated the agreement and briefly halted peace talks between the two sides in North West Frontier Province...", 
        "reply": "Note: This is an updated and retitled thread. Please scroll down and turn to the last page for the latest update. Btw, ANZAC_Biscuit, if you are reading this, please try to post any updates about this subject at this thread, to prevent duplicate threads. An update about the current Pakistani Army offensive against the Taliban in Pakistan. It seems the Islamabad government wants to make sure the country doesn't fall to the militants/ Taliban. ++http://www.cnn.com/2009/WORLD/asiapcf/05/03/pakistan.fighting/index.html?iref=mpstoryview  This message has been edited. Last edited by: Canuck_Centaur, Sun 01 November 2009 05:54 PM", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 11:29:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "intTime": 20090503, 
        "postID": 42, 
        "quote": "", 
        "reply": "How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 12:35:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "intTime": 20090503, 
        "postID": 43, 
        "quote": "Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years?", 
        "reply": " Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-03 15:23:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Looks like it's gonna be harder to dislodge the Taliban from Swat. quote: The Taliban Tightens Hold In Pakistan's Swat Region ++http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050400189.html By Pamela ConstableWashington Post Foreign Service Tuesday, May 5, 2009 ISLAMABAD, Pakistan, May 4 -- Taliban forces tightened their grip on Pakistan's Swat region Monday and continued resisting the military's efforts to dislodge them from neighboring Buner, bringing a fragile peace accord closer to collapse and the volatile northwest region nearer to full-fledged conflict. Yet even as the Taliban continued its rampage and rejected the government's latest concession to its demands -- the appointment of Islamic-law judges in Swat -- Pakistan's military leaders clung to hopes for a nonviolent solution, saying that security forces were \"still exercising restraint to honor the peace agreement.\" Behind this strained hope for a peaceful solution lie an array of factors -- competing military priorities, reluctance to fight fellow Muslims, lack of strong executive leadership and some internal sympathy for the insurgents -- that analysts say have long prevented the Pakistani army from making a full-fledged assault on violent Islamist groups. Over the past two days, extremists in the northwest have attacked a military convoy, beheaded two soldiers, imposed a curfew and blown up a boys' high school and a police station. Troop reinforcements were sent into Buner on Monday after heavy fighting, and there were reports that the army would imminently launch an attack on Swat, an action that could coincide with a crucial aid-seeking visit to Washington this week by President Asif Ali Zardari, whose government has been criticized by U.S. officials for capitulating to the insurgents...", 
        "intTime": 20090505, 
        "postID": 44, 
        "quote": "The Taliban Tightens Hold In Pakistan's Swat Region ++http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050400189.html By Pamela ConstableWashington Post Foreign Service Tuesday, May 5, 2009 ISLAMABAD, Pakistan, May 4 -- Taliban forces tightened their grip on Pakistan's Swat region Monday and continued resisting the military's efforts to dislodge them from neighboring Buner, bringing a fragile peace accord closer to collapse and the volatile northwest region nearer to full-fledged conflict. Yet even as the Taliban continued its rampage and rejected the government's latest concession to its demands -- the appointment of Islamic-law judges in Swat -- Pakistan's military leaders clung to hopes for a nonviolent solution, saying that security forces were \"still exercising restraint to honor the peace agreement.\" Behind this strained hope for a peaceful solution lie an array of factors -- competing military priorities, reluctance to fight fellow Muslims, lack of strong executive leadership and some internal sympathy for the insurgents -- that analysts say have long prevented the Pakistani army from making a full-fledged assault on violent Islamist groups. Over the past two days, extremists in the northwest have attacked a military convoy, beheaded two soldiers, imposed a curfew and blown up a boys' high school and a police station. Troop reinforcements were sent into Buner on Monday after heavy fighting, and there were reports that the army would imminently launch an attack on Swat, an action that could coincide with a crucial aid-seeking visit to Washington this week by President Asif Ali Zardari, whose government has been criticized by U.S. officials for capitulating to the insurgents...", 
        "reply": "Looks like it's gonna be harder to dislodge the Taliban from Swat. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 06:29:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "intTime": 20090505, 
        "postID": 45, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan.", 
        "reply": " Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 07:11:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "popsiq"
    }, 
    {
        "content": "Yeh, they were just like the Taliban, beheading everyone that they didn't like - - Wandering and Wondering", 
        "intTime": 20090505, 
        "postID": 46, 
        "quote": "", 
        "reply": "Yeh, they were just like the Taliban, beheading everyone that they didn't like - - Wandering and Wondering", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-05 17:37:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries. I suspect that the Khans just blew through every now and again and slaughtered everyone that resisted, they weren't much interested in the day to day running of their conquests. The Moghuls on the other hand, I seem to recall reading, had similar problems in the NW Frontier to the Raj, near constant low grade warfare after the initial period of Muslim brotherhood.", 
        "intTime": 20090506, 
        "postID": 47, 
        "quote": "Originally posted by popsiq: quote: Originally posted by Bladensburg: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? Ha, you could just as easily say 100 -120 or 1000 - 1200 years. The NW Frontier has never been stable no matter who has run what is now called Pakistan. Genghiz Khan and the Moghuls managed to keep a lid on the place for 3 or 4 centuries.", 
        "reply": " I suspect that the Khans just blew through every now and again and slaughtered everyone that resisted, they weren't much interested in the day to day running of their conquests. The Moghuls on the other hand, I seem to recall reading, had similar problems in the NW Frontier to the Raj, near constant low grade warfare after the initial period of Muslim brotherhood.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 05:16:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "It's pretty easy to keep a lid on any region if you kill everyone there. But that method has worn out it's welcome in most societies. Even in our recent history civilian casualties was excepted and even expected.(world wars ect...) Now a days if a \"civilian\" gets dirt on them when their holding hands with a valid target it's a war crime. Please. Most poeple have no clue what a waring society is like. I can only imagine. But this, and other, part(s) of the world have been in some state of war for thousands of years. I doubt it could be resolved at all. But if it is not at least managed (keep a lid on it) it will (and has) without a doubt spill over into the rest of (our) the world. I would still go there (myself) rather than have it here.", 
        "intTime": 20090506, 
        "postID": 48, 
        "quote": "", 
        "reply": "It's pretty easy to keep a lid on any region if you kill everyone there. But that method has worn out it's welcome in most societies. Even in our recent history civilian casualties was excepted and even expected.(world wars ect...) Now a days if a \"civilian\" gets dirt on them when their holding hands with a valid target it's a war crime. Please. Most poeple have no clue what a waring society is like. I can only imagine. But this, and other, part(s) of the world have been in some state of war for thousands of years. I doubt it could be resolved at all. But if it is not at least managed (keep a lid on it) it will (and has) without a doubt spill over into the rest of (our) the world. I would still go there (myself) rather than have it here.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 05:57:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "intTime": 20090506, 
        "postID": 49, 
        "quote": "Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain.", 
        "reply": " Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 06:52:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons? The Indians (particularly if the BJP wins their general election) would got completely loopy and probably let off a bit of bottled sunshine - if the Israelis didn't beat them to it. I thank Yaweh every day that he hasn't seen fit to give his chosen people aircraft carriers or they'd already have done it.", 
        "intTime": 20090506, 
        "postID": 50, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by popsiq: How long has the tribal regions 'war' been going on now, 10-12 years? The Paks have been up and down the punitive expedition route many times, to date without a permanent result. They've 'taken and held' territory, but as soon as the main forces are posted elsewhere, the locals start destroying the 'infrastructure'. What, thus far, has caused the main force to be posted elsewhere has been a degenerating security situation in urban centres. Let's see if that's what happens again this round. All they're really accomplishing is a spreading mass of refugees, well-salted with fighters. Short-term gain ,for long term pain. Admittedly it is an unstable region, has been for a very long time. The problem is the world can't just ignore P-stan anymore. What do you suppose would \"be accomplished\" should the Taliban gain control of the Government and it's nuclear weapons?", 
        "reply": " The Indians (particularly if the BJP wins their general election) would got completely loopy and probably let off a bit of bottled sunshine - if the Israelis didn't beat them to it. I thank Yaweh every day that he hasn't seen fit to give his chosen people aircraft carriers or they'd already have done it.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 17:12:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Does anyone actually believe that the Paks will prevail in this war with the Tallies ? How long have we been at war in that region ---6/7 years ? How long was Russia in that area ? Nope, the Paks have lost---they just don't know it yet and we'll probaqbly have to fight their war too, unless the Paks decide to drop a nuke on the Tallies, which can happen. We have 100x more firepower than the Paks and we're still at it. The next 60 days will be the tell of the tape---ohh well, let's see.", 
        "intTime": 20090506, 
        "postID": 51, 
        "quote": "", 
        "reply": "Does anyone actually believe that the Paks will prevail in this war with the Tallies ? How long have we been at war in that region ---6/7 years ? How long was Russia in that area ? Nope, the Paks have lost---they just don't know it yet and we'll probaqbly have to fight their war too, unless the Paks decide to drop a nuke on the Tallies, which can happen. We have 100x more firepower than the Paks and we're still at it. The next 60 days will be the tell of the tape---ohh well, let's see.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-06 20:15:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "JmacOSI"
    }, 
    {
        "content": "Looks like this war has moved south because of the numbers of local civilians displaced. Look up the \"Durand Line\". At least the Pakistani Army has reportedly killed about 143 militants so far. ++http://en.wikipedia.org/wiki/Durand_Line. quote: Pakistan moves against Swat militants, civilians flee Reuters By Junaid Khan Junaid Khan – Fri May 8, 11:22 am ET MINGORA, Pakistan (Reuters) – Pakistani forces attacked Taliban militants in the Swat valley on Friday as concern grew about the fate of nearly a million people displaced by an upsurge in violence. The military said 143 militants had been killed in the Islamist bastion of Swat over the past 24 hours. There was no independent confirmation. Seven soldiers had been killed, an army spokesman said. The struggle in the scenic northwestern valley 130 km (80 miles) from Islamabad and a former center for tourism has become a test of Pakistan's resolve to fight a growing Taliban insurgency that has alarmed the United States. Civilians have poured out of the valley since fighting intensified on Wednesday and aid groups have warned of an intensifying humanitarian crisis. The U.N. refugee agency said a \"massive displacement\" was underway. Citing provincial government estimates, it said up to 200,000 people had left their homes over recent days with another 300,000 on the move or about to move. They are joining another 555,000 people displaced in other areas because of fighting since August, it said. The government has ordered the army to strike at \"militants and terrorists\" it said were trying to hold the country hostage at gunpoint. (...)", 
        "intTime": 20090509, 
        "postID": 52, 
        "quote": "Pakistan moves against Swat militants, civilians flee Reuters By Junaid Khan Junaid Khan – Fri May 8, 11:22 am ET MINGORA, Pakistan (Reuters) – Pakistani forces attacked Taliban militants in the Swat valley on Friday as concern grew about the fate of nearly a million people displaced by an upsurge in violence. The military said 143 militants had been killed in the Islamist bastion of Swat over the past 24 hours. There was no independent confirmation. Seven soldiers had been killed, an army spokesman said. The struggle in the scenic northwestern valley 130 km (80 miles) from Islamabad and a former center for tourism has become a test of Pakistan's resolve to fight a growing Taliban insurgency that has alarmed the United States. Civilians have poured out of the valley since fighting intensified on Wednesday and aid groups have warned of an intensifying humanitarian crisis. The U.N. refugee agency said a \"massive displacement\" was underway. Citing provincial government estimates, it said up to 200,000 people had left their homes over recent days with another 300,000 on the move or about to move. They are joining another 555,000 people displaced in other areas because of fighting since August, it said. The government has ordered the army to strike at \"militants and terrorists\" it said were trying to hold the country hostage at gunpoint. (...)", 
        "reply": "Looks like this war has moved south because of the numbers of local civilians displaced. Look up the \"Durand Line\". At least the Pakistani Army has reportedly killed about 143 militants so far. ++http://en.wikipedia.org/wiki/Durand_Line. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-09 08:44:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Good. quote: Agence France-Presse - 5/9/2009 3:45 PM GMT Taliban 'on the run' after Pakistan offensive Pakistan's military said on Saturday that a full-scale offensive in the northwest has put militants on the back foot following a pledge from President Asif Ali Zardari to eliminate the Taliban. Warplanes pounded rebel hideouts in the Swat valley, an ex-ski resort where up to 15,000 security forces have been deployed under orders to crush extremists in an escalating conflict that has displaced hundreds of thousands. (...) But the statement added that Taliban fighters were \"trying to block the exodus of innocent civilians by preventing their departure through coercion, IEDs (improvised explosive devices), road blocks with trees and even (making them) hostages\". Meanwhile a suspected US drone fired missiles at a compound used by militants in South Waziristan tribal district bordering Afghanistan, killing six militants and injuring 10 others, officials said. The military said Friday an air and ground offensive to crush the Taliban in the northwest killed more than 140 militants. It was impossible to confirm the death tolls independently, given ongoing operations across three districts which began late last month when the hardline insurgents advanced to within 100 kilometres (60 miles) of Islamabad. Meanwhile, fresh troops were entering the Malakand district which neighbours Swat valley, a local military official told AFP. (...) The offensive was launched after Prime Minister Yousuf Raza Gilani late Thursday appealed for unity against extremists whom he said were risking the sovereignty of the nuclear-armed nation and violated the peace deal.", 
        "intTime": 20090509, 
        "postID": 53, 
        "quote": "Agence France-Presse - 5/9/2009 3:45 PM GMT Taliban 'on the run' after Pakistan offensive Pakistan's military said on Saturday that a full-scale offensive in the northwest has put militants on the back foot following a pledge from President Asif Ali Zardari to eliminate the Taliban. Warplanes pounded rebel hideouts in the Swat valley, an ex-ski resort where up to 15,000 security forces have been deployed under orders to crush extremists in an escalating conflict that has displaced hundreds of thousands. (...) But the statement added that Taliban fighters were \"trying to block the exodus of innocent civilians by preventing their departure through coercion, IEDs (improvised explosive devices), road blocks with trees and even (making them) hostages\". Meanwhile a suspected US drone fired missiles at a compound used by militants in South Waziristan tribal district bordering Afghanistan, killing six militants and injuring 10 others, officials said. The military said Friday an air and ground offensive to crush the Taliban in the northwest killed more than 140 militants. It was impossible to confirm the death tolls independently, given ongoing operations across three districts which began late last month when the hardline insurgents advanced to within 100 kilometres (60 miles) of Islamabad. Meanwhile, fresh troops were entering the Malakand district which neighbours Swat valley, a local military official told AFP. (...) The offensive was launched after Prime Minister Yousuf Raza Gilani late Thursday appealed for unity against extremists whom he said were risking the sovereignty of the nuclear-armed nation and violated the peace deal.", 
        "reply": "Good. ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-09 14:51:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "And the Pakistani Army campaign against the Taliban continues. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_as/as_pakistan quote: By ZARAR KHAN, Associated Press Writer Zarar Khan, Associated Press Writer – 21 mins ago ISLAMABAD – Pakistani troops killed 80 militants and drove the Taliban from a major urban stronghold on Wednesday, the army said, as U.S. military planes brought aid for refugees fleeing fierce fighting across the northwest. One soldier was killed and nine seriously wounded as troops battled insurgents still holding several other towns in the neighboring Swat Valley, a military spokesman said. Pakistani troops launched an offensive last month after Taliban militants based in Swat pushed into Buner, bringing them within 60 miles (100 kilometers) of the capital of Islamabad and prompting intense U.S. pressure for a stiff response. (...) U.S. Secretary of State Hillary Rodham Clinton announced Tuesday that Washington would provide $110 million in immediate humanitarian assistance to Pakistan. As part of that effort, two American military planes touched down on Wednesday at an air base near Islamabad laden with supplies including air-conditioned tents and 120,000 pre-packed meals, the U.S. Embassy said...", 
        "intTime": 20090520, 
        "postID": 54, 
        "quote": "By ZARAR KHAN, Associated Press Writer Zarar Khan, Associated Press Writer – 21 mins ago ISLAMABAD – Pakistani troops killed 80 militants and drove the Taliban from a major urban stronghold on Wednesday, the army said, as U.S. military planes brought aid for refugees fleeing fierce fighting across the northwest. One soldier was killed and nine seriously wounded as troops battled insurgents still holding several other towns in the neighboring Swat Valley, a military spokesman said. Pakistani troops launched an offensive last month after Taliban militants based in Swat pushed into Buner, bringing them within 60 miles (100 kilometers) of the capital of Islamabad and prompting intense U.S. pressure for a stiff response. (...) U.S. Secretary of State Hillary Rodham Clinton announced Tuesday that Washington would provide $110 million in immediate humanitarian assistance to Pakistan. As part of that effort, two American military planes touched down on Wednesday at an air base near Islamabad laden with supplies including air-conditioned tents and 120,000 pre-packed meals, the U.S. Embassy said...", 
        "reply": "And the Pakistani Army campaign against the Taliban continues. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_as/as_pakistan ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-20 07:47:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "intTime": 20090530, 
        "postID": 55, 
        "quote": "Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "reply": "So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan ", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 06:34:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...) .....BY LIBERAL LOGIC THIS PAKISTANI ARMY IS PROMOTING TERRORIST RECRUITMENT SO NO....THE END WILL NEVER COME...BETTER TO GO HOME AND DRINK TEA... Already past the future", 
        "intTime": 20090530, 
        "postID": 56, 
        "quote": "Originally posted by Canuck_Centaur: So is the end of this campaign within sight? ++http://news.yahoo.com/s/ap/20090530/ap_on_re_as/as_pakistan quote: Military retakes largest town in Swat Valley By ROHAN SULLIVAN, Associated Press Writer Rohan Sullivan, Associated Press Writer – 1 min ago ISLAMABAD – Pakistani troops have retaken the largest town in the Swat Valley from the Taliban as the army presses its offensive against militants in the country's northwest, the army spokesman said Saturday. Government forces had full control of Mingora, though they were still meeting pockets of resistance from fighters on the outskirts of the town, Maj. Gen. Athar Abbas said. Abbas said many militants had fled the town instead of confronting troops in a final battle, despite the military saying earlier that escape routes had been closed. \"They had prepared Mingora city ... with bunkers, but when they realized that they were being encircled and the noose was tightening they decided not to give a pitched battle,\" Abbas said. The military launched a major offensive one month ago in the Swat Valley and neighboring areas to oust Taliban militants who were extending their control over the northwestern region, near the border with Afghanistan. The campaign is strongly backed by Washington and the government's other Western allies... (...) The fighting has caused more than 2 million people to flee the region, raising fears of a humanitarian crisis. More than 160,000 people are taking refuge in sweltering refugee camps south of the battle zone, while the rest are staying with relatives or relying on goodwill from local residents. (...) Abbas said on Saturday that 1,217 militants have been killed in the Swat offensive and 79 arrested; 81 soldiers have died. The military has not released civilian casualties and has said all care has been taken to minimize them. (...)", 
        "reply": " .....BY LIBERAL LOGIC THIS PAKISTANI ARMY IS PROMOTING TERRORIST RECRUITMENT SO NO....THE END WILL NEVER COME...BETTER TO GO HOME AND DRINK TEA... Already past the future", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 20:12:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "6486143"
    }, 
    {
        "content": "Hey, whats the worry everyone? Our savior in the Oval office has it all under control.", 
        "intTime": 20090530, 
        "postID": 57, 
        "quote": "", 
        "reply": "Hey, whats the worry everyone? Our savior in the Oval office has it all under control.", 
        "threadID": "672198221_5270093222001", 
        "time": "2009-05-30 21:22:00", 
        "title": "Update:Pakistan Army kills 7 militants as anti-Taliban offensive continues", 
        "userID": "fishnfanatic"
    }
]