[
    {
        "content": "quote: WASHINGTON (Reuters) - Senator Arlen Specter's switch to the Democratic Party appears to be paying off with a poll on Monday showing him ahead in his 2010 re-election race in Pennsylvania. Last week Specter, 79, abandoned the Republican Party to run for re-election as a Democrat, a move denounced by fellow Republicans but welcomed by the country's top Democrat, President Barack Obama. Specter said his philosophy was more in line now with Democrats than Republicans, who fired back that he was simply bending to the political winds in order to hang on to power. (....) http://www.reuters.com/article/politicsNews/idUSTRE5433IH20090504 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "WASHINGTON (Reuters) - Senator Arlen Specter's switch to the Democratic Party appears to be paying off with a poll on Monday showing him ahead in his 2010 re-election race in Pennsylvania. Last week Specter, 79, abandoned the Republican Party to run for re-election as a Democrat, a move denounced by fellow Republicans but welcomed by the country's top Democrat, President Barack Obama. Specter said his philosophy was more in line now with Democrats than Republicans, who fired back that he was simply bending to the political winds in order to hang on to power. (....)", 
        "reply": " http://www.reuters.com/article/politicsNews/idUSTRE5433IH20090504 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 07:57:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "NSNN"
    }, 
    {
        "content": "Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008!", 
        "intTime": 20090504, 
        "postID": 2, 
        "quote": "", 
        "reply": "Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008!", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:06:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008! A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama?", 
        "intTime": 20090504, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008!", 
        "reply": " A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama?", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:13:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging up Bush dirt until 2010, it'll be another landslide. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture.", 
        "intTime": 20090504, 
        "postID": 4, 
        "quote": "Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama?", 
        "reply": " If they keep digging up Bush dirt until 2010, it'll be another landslide. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:20:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined as being subjected to yet another fluff piece on the Obama family.", 
        "intTime": 20090504, 
        "postID": 5, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture.", 
        "reply": " By November 2010 \"torture\" may well be defined as being subjected to yet another fluff piece on the Obama family.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:58:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "intTime": 20090504, 
        "postID": 6, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family.", 
        "reply": " First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:03:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "intTime": 20090504, 
        "postID": 7, 
        "quote": "Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "reply": " The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:11:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite.", 
        "intTime": 20090504, 
        "postID": 8, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "reply": " Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:18:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite. Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.”", 
        "intTime": 20090504, 
        "postID": 9, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite.", 
        "reply": " Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.”", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:24:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen.", 
        "intTime": 20090504, 
        "postID": 10, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "reply": " - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:27:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite. Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.” And you dispute this statement? What lies did the democrats spread to win the 2006 and 2008 elections? Dude...Bush handed it to them...and continues to by proxy. If it's not Rice saying if the president does it, by definition it can't be illegal (shades of Nixon). It's Bolton preaching revolution in P-Stan, or Cheney preaching that torture is a good thing. Come on man, the Bush administration won't go away and continues to be the gift that keeps on giving.", 
        "intTime": 20090504, 
        "postID": 11, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite. Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.”", 
        "reply": " And you dispute this statement? What lies did the democrats spread to win the 2006 and 2008 elections? Dude...Bush handed it to them...and continues to by proxy. If it's not Rice saying if the president does it, by definition it can't be illegal (shades of Nixon). It's Bolton preaching revolution in P-Stan, or Cheney preaching that torture is a good thing. Come on man, the Bush administration won't go away and continues to be the gift that keeps on giving.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:32:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen. All that in 19 months? Not bloody likely.", 
        "intTime": 20090504, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen.", 
        "reply": " All that in 19 months? Not bloody likely.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:32:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. Ol_Doc a LOT of Demos voted for Mr. Specter int he past. Specter (who I dislike) is a conservative leaning moderate who for years has been voted into office by a combination of moderate Repubs, Independents and moderate Demos. Many of the moderate Repubs in Pa have left the Repub party so Mr. Specter is hoping that he can get nominated as the Demo party candidate because IF he is on the ticket for the General election he is very likely to win. Th reason for going Demo rather than Independent like Mr. Lieberman is that the Repubs and Demos parties in Pa have made it almost impossible to run for a statewide office as an Independent.", 
        "intTime": 20090504, 
        "postID": 13, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "reply": " Ol_Doc a LOT of Demos voted for Mr. Specter int he past. Specter (who I dislike) is a conservative leaning moderate who for years has been voted into office by a combination of moderate Repubs, Independents and moderate Demos. Many of the moderate Repubs in Pa have left the Repub party so Mr. Specter is hoping that he can get nominated as the Demo party candidate because IF he is on the ticket for the General election he is very likely to win. Th reason for going Demo rather than Independent like Mr. Lieberman is that the Repubs and Demos parties in Pa have made it almost impossible to run for a statewide office as an Independent.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:47:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics. Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Specter has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted Mr. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub. This message has been edited. Last edited by: rayld2, Mon 04 May 2009 11:29 AM", 
        "intTime": 20090504, 
        "postID": 14, 
        "quote": "Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics.", 
        "reply": " Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Specter has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted Mr. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub. This message has been edited. Last edited by: rayld2, Mon 04 May 2009 11:29 AM", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:54:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "rayld2"
    }, 
    {
        "content": "If voting party lines is important and not your convictions, then why even bother to vote? Could that possibly explain why we get dems and reps in office 99.9% of the time.", 
        "intTime": 20090504, 
        "postID": 15, 
        "quote": "", 
        "reply": "If voting party lines is important and not your convictions, then why even bother to vote? Could that possibly explain why we get dems and reps in office 99.9% of the time.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:59:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics. Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Spectoer has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted M. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub. Specter is going to walk away with the next election. The Republicans are going to nominate a pure as snow Right Wing Ideologue, and the Democrats are going to suck up to Specter BIG TIME. Leftist Democrats will hold their nose and vote for him, Independants will vote for him, and what's left of moderate Republicans will vote for him. The election will be a shoe in for him. The Democratic Party is lining up to brown nose him. Dave", 
        "intTime": 20090504, 
        "postID": 16, 
        "quote": "Originally posted by rayld2: quote: Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics. Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Spectoer has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted M. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub.", 
        "reply": " Specter is going to walk away with the next election. The Republicans are going to nominate a pure as snow Right Wing Ideologue, and the Democrats are going to suck up to Specter BIG TIME. Leftist Democrats will hold their nose and vote for him, Independants will vote for him, and what's left of moderate Republicans will vote for him. The election will be a shoe in for him. The Democratic Party is lining up to brown nose him. Dave", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 11:01:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go!", 
        "intTime": 20090504, 
        "postID": 17, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "reply": " He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go!", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 13:32:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "stosh301"
    }, 
    {
        "content": "quote: Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go! de-nile -- not just a river In Egypt. -- Savage", 
        "intTime": 20090504, 
        "postID": 18, 
        "quote": "Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go!", 
        "reply": " de-nile -- not just a river In Egypt. -- Savage", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 13:45:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go! de-nile -- not just a river In Egypt. -- Savage So what is the point?? Are you denying that a big chunk of the Republican party is sick and tired of these moderates?? It is far to early for the left to predict the demise of the Republican Party.. I think it has more to do with the Left's fear of a conservative awakening. BTW the river in Eqypt is called the Coplay Creek.....It flows into the Lehigh River, but that is in Bethlehem.", 
        "intTime": 20090504, 
        "postID": 19, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go! de-nile -- not just a river In Egypt. -- Savage", 
        "reply": " So what is the point?? Are you denying that a big chunk of the Republican party is sick and tired of these moderates?? It is far to early for the left to predict the demise of the Republican Party.. I think it has more to do with the Left's fear of a conservative awakening. BTW the river in Eqypt is called the Coplay Creek.....It flows into the Lehigh River, but that is in Bethlehem.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 15:25:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "stosh301"
    }, 
    {
        "content": "quote: WASHINGTON (Reuters) - Senator Arlen Specter's switch to the Democratic Party appears to be paying off with a poll on Monday showing him ahead in his 2010 re-election race in Pennsylvania. Last week Specter, 79, abandoned the Republican Party to run for re-election as a Democrat, a move denounced by fellow Republicans but welcomed by the country's top Democrat, President Barack Obama. Specter said his philosophy was more in line now with Democrats than Republicans, who fired back that he was simply bending to the political winds in order to hang on to power. (....) http://www.reuters.com/article/politicsNews/idUSTRE5433IH20090504 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090504, 
        "postID": 20, 
        "quote": "WASHINGTON (Reuters) - Senator Arlen Specter's switch to the Democratic Party appears to be paying off with a poll on Monday showing him ahead in his 2010 re-election race in Pennsylvania. Last week Specter, 79, abandoned the Republican Party to run for re-election as a Democrat, a move denounced by fellow Republicans but welcomed by the country's top Democrat, President Barack Obama. Specter said his philosophy was more in line now with Democrats than Republicans, who fired back that he was simply bending to the political winds in order to hang on to power. (....)", 
        "reply": " http://www.reuters.com/article/politicsNews/idUSTRE5433IH20090504 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 07:57:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "NSNN"
    }, 
    {
        "content": "Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008!", 
        "intTime": 20090504, 
        "postID": 21, 
        "quote": "", 
        "reply": "Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008!", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:06:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008! A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama?", 
        "intTime": 20090504, 
        "postID": 22, 
        "quote": "Originally posted by mrmixitup: Here's a simple key to victory in 2010: Be a Democrat. Hey, it worked in 2006 and 2008!", 
        "reply": " A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama?", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:13:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging up Bush dirt until 2010, it'll be another landslide. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture.", 
        "intTime": 20090504, 
        "postID": 23, 
        "quote": "Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama?", 
        "reply": " If they keep digging up Bush dirt until 2010, it'll be another landslide. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:20:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined as being subjected to yet another fluff piece on the Obama family.", 
        "intTime": 20090504, 
        "postID": 24, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture.", 
        "reply": " By November 2010 \"torture\" may well be defined as being subjected to yet another fluff piece on the Obama family.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 08:58:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "intTime": 20090504, 
        "postID": 25, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family.", 
        "reply": " First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:03:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "intTime": 20090504, 
        "postID": 26, 
        "quote": "Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "reply": " The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:11:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite.", 
        "intTime": 20090504, 
        "postID": 27, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "reply": " Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:18:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite. Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.”", 
        "intTime": 20090504, 
        "postID": 28, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite.", 
        "reply": " Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.”", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:24:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen.", 
        "intTime": 20090504, 
        "postID": 29, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand.", 
        "reply": " - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:27:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite. Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.” And you dispute this statement? What lies did the democrats spread to win the 2006 and 2008 elections? Dude...Bush handed it to them...and continues to by proxy. If it's not Rice saying if the president does it, by definition it can't be illegal (shades of Nixon). It's Bolton preaching revolution in P-Stan, or Cheney preaching that torture is a good thing. Come on man, the Bush administration won't go away and continues to be the gift that keeps on giving.", 
        "intTime": 20090504, 
        "postID": 30, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is a absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. Just curious, why do you take my comments as absolutes? To begin with, I did not claim \"all partisan attacks on W have merit\". If it is a \"partisan\" attack, by definition it's merits are suspect. Secondly, I'm making no prediction about the 2010 election beyond Specter is not a shoe in. Unless he \"walks the walk\" as a democrat, he'll be seen as another republican-lite. Your own comment says all that need be said: “First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo.”", 
        "reply": " And you dispute this statement? What lies did the democrats spread to win the 2006 and 2008 elections? Dude...Bush handed it to them...and continues to by proxy. If it's not Rice saying if the president does it, by definition it can't be illegal (shades of Nixon). It's Bolton preaching revolution in P-Stan, or Cheney preaching that torture is a good thing. Come on man, the Bush administration won't go away and continues to be the gift that keeps on giving.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:32:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen. All that in 19 months? Not bloody likely.", 
        "intTime": 20090504, 
        "postID": 31, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by adminnco1: quote: Originally posted by Ol_Doc: First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. The claim that all the partisan attacks on W have merit is as absurd as some of them have been. It should not be forgotten that the voters are generally only as loyal as the last news clip so predicting how they will vote in 19 months is a fool’s errand. - If the economy is any better than being in the toilet. - If Iraq is anything better than a complete disaster. - If unemployment decreases by at least 2%. - If the housing market is starting to look the least bit better. It's Democrat across the board. Then again, all of those events are likely to happen.", 
        "reply": " All that in 19 months? Not bloody likely.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:32:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. Ol_Doc a LOT of Demos voted for Mr. Specter int he past. Specter (who I dislike) is a conservative leaning moderate who for years has been voted into office by a combination of moderate Repubs, Independents and moderate Demos. Many of the moderate Repubs in Pa have left the Repub party so Mr. Specter is hoping that he can get nominated as the Demo party candidate because IF he is on the ticket for the General election he is very likely to win. Th reason for going Demo rather than Independent like Mr. Lieberman is that the Repubs and Demos parties in Pa have made it almost impossible to run for a statewide office as an Independent.", 
        "intTime": 20090504, 
        "postID": 32, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "reply": " Ol_Doc a LOT of Demos voted for Mr. Specter int he past. Specter (who I dislike) is a conservative leaning moderate who for years has been voted into office by a combination of moderate Repubs, Independents and moderate Demos. Many of the moderate Repubs in Pa have left the Repub party so Mr. Specter is hoping that he can get nominated as the Demo party candidate because IF he is on the ticket for the General election he is very likely to win. Th reason for going Demo rather than Independent like Mr. Lieberman is that the Repubs and Demos parties in Pa have made it almost impossible to run for a statewide office as an Independent.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:47:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics. Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Specter has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted Mr. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub. This message has been edited. Last edited by: rayld2, Mon 04 May 2009 11:29 AM", 
        "intTime": 20090504, 
        "postID": 33, 
        "quote": "Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics.", 
        "reply": " Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Specter has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted Mr. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub. This message has been edited. Last edited by: rayld2, Mon 04 May 2009 11:29 AM", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:54:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "rayld2"
    }, 
    {
        "content": "If voting party lines is important and not your convictions, then why even bother to vote? Could that possibly explain why we get dems and reps in office 99.9% of the time.", 
        "intTime": 20090504, 
        "postID": 34, 
        "quote": "", 
        "reply": "If voting party lines is important and not your convictions, then why even bother to vote? Could that possibly explain why we get dems and reps in office 99.9% of the time.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 09:59:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics. Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Spectoer has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted M. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub. Specter is going to walk away with the next election. The Republicans are going to nominate a pure as snow Right Wing Ideologue, and the Democrats are going to suck up to Specter BIG TIME. Leftist Democrats will hold their nose and vote for him, Independants will vote for him, and what's left of moderate Republicans will vote for him. The election will be a shoe in for him. The Democratic Party is lining up to brown nose him. Dave", 
        "intTime": 20090504, 
        "postID": 35, 
        "quote": "Originally posted by rayld2: quote: Originally posted by klassylady25: If winning is what is important and not your convictions ... then by all means change parties. Must be hard to find a serious job at his age, considering his experience in politics. Of course this IGNORES the FACT that the current Repub party in Pa does NOT represent MOST of the people that voted for Mr. Specter int he general election, you know the one that counts. Mr. Spectoer has been winning for years with a combination of Moderate Repubs, Independents and Moderate Demos. Since many of the moderate Repubs have left the Pa Repub party the Pa Repub party no longer contains very many of the people that voted him into office. Heck in the last election many conservative Repubs in Pa wanted M. specter to lose so that there would not be a long term incumbent to fight in this election. In the last elect (before the right wing had taken even tighter control of the party in Pa.) they THOUGHT they had a better chance of getting a conservative Repub in office against a Demo than against an incumbent moderate Repub.", 
        "reply": " Specter is going to walk away with the next election. The Republicans are going to nominate a pure as snow Right Wing Ideologue, and the Democrats are going to suck up to Specter BIG TIME. Leftist Democrats will hold their nose and vote for him, Independants will vote for him, and what's left of moderate Republicans will vote for him. The election will be a shoe in for him. The Democratic Party is lining up to brown nose him. Dave", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 11:01:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go!", 
        "intTime": 20090504, 
        "postID": 36, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads.", 
        "reply": " He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go!", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 13:32:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "stosh301"
    }, 
    {
        "content": "quote: Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go! de-nile -- not just a river In Egypt. -- Savage", 
        "intTime": 20090504, 
        "postID": 37, 
        "quote": "Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go!", 
        "reply": " de-nile -- not just a river In Egypt. -- Savage", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 13:45:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go! de-nile -- not just a river In Egypt. -- Savage So what is the point?? Are you denying that a big chunk of the Republican party is sick and tired of these moderates?? It is far to early for the left to predict the demise of the Republican Party.. I think it has more to do with the Left's fear of a conservative awakening. BTW the river in Eqypt is called the Coplay Creek.....It flows into the Lehigh River, but that is in Bethlehem.", 
        "intTime": 20090504, 
        "postID": 38, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by stosh301: quote: Originally posted by Ol_Doc: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by adminnco1: A bit early for that bit of speculation. At the moment the political pendulum is reacting to rhetoric and promises of change. Reality has yet to rear its troublesome head. On a good day voters are fickle, so it will not take much to swing things in the other direction. As an example, in 2007 who outside of Illinois had ever heard of Obama? If they keep digging making up Bush dirt until 2010, it'll be another landslide for the Republicans. Everytime a news clip hits about Bush doing whatever he wanted, I want to vote Democrat across the board. Oh, and FYI: the Republians are now officially the party of torture. By November 2010 \"torture\" may well be defined and being subjected to yet another fluff piece on the Obama family. First of all, the Democrats don't need to make up anything regarding the Bush administration. They've provided the Dems with plenty of ammo. Second, of course he leads in the polls, he has no real opposition yet. Hundreds of thousands of Democrats won't forget who they voted against all these years. He claims he won't tow the party line. As 2010 approaches, we'll see if he still leads. He has no real opposition yet. Oh really?? Pat Toomey damn near took his nomination 6 years ago..Spector was scared to death of another rematch with Pat. The Tea Parties were the handwriting on the wall for the likes of the Arlan Spectors, Olympia Snows, Susan Collins and Lincoln Chaffes of the Republican Left..These people are the reason Republicans have been losing . Either they (Republicrats) become a true opposition party or split into the moderate country club Republican Party and a true right wing party of Conservatism. Today's Democrat Party has become a Socialist Party and the Republicans have become the Democrat Party of the '40's & '50's. The Republicans are just trying to play from the middle and get along to keep in power. They have to learn to play hardball just like the NeoBolshiviks or a competing right wing party will emerge, and this scares the crap out of the left. And Toomey walks the walk. He quit his congressional seat after 3 terms because he swore to term limits... The people in the out-back in Pa. think a lot of Toomey. It is the Philly, Pittsburgh & Lehigh Valley mega centers that call the tune in this state. Hey Arlan!! Sionara!! Hasta la Vista!! and don't let the door hit you on the butt on the way out... Go! Pat Go! de-nile -- not just a river In Egypt. -- Savage", 
        "reply": " So what is the point?? Are you denying that a big chunk of the Republican party is sick and tired of these moderates?? It is far to early for the left to predict the demise of the Republican Party.. I think it has more to do with the Left's fear of a conservative awakening. BTW the river in Eqypt is called the Coplay Creek.....It flows into the Lehigh River, but that is in Bethlehem.", 
        "threadID": "672198221_1230054222001", 
        "time": "2009-05-04 15:25:00", 
        "title": "As Democrat, Specter leads in home state: poll", 
        "userID": "stosh301"
    }
]