[
    {
        "content": "quote: EXCLUSIVE: Defense Secretary Robert M. Gates denied permission for the U.S. Northern Command to use the Pentagon's most powerful sea-based radar to monitor North Korea's recent missile launch, precluding officials from collecting finely detailed launch data or testing the radar in a real-time crisis, current and former defense officials said. Jamie Graybeal, Northcom public affairs director, confirmed to The Washington Times that Air Force Gen. Gene Renuart, the Northcom commander, requested the radar's use but referred all other questions to the Pentagon. Pentagon spokesman Bryan Whitman said Mr. Gates' decision not to use the $900 million radar, known as SBX, was \"based on the fact that there were numerous ground- and sea-based radars and sensors in the region to support the operational requirements for this launch.\" SBX, deployed in 2005, can track and identify warheads, decoys and debris in space with very high precision. Officials said the radar is so powerful it could detect a baseball hit out of a ballpark from more than 3,000 miles away, and that other radars used by the U.S. would not be able to provide the same level of detail about North Korea's missile capabilities. \"http://washingtontimes.com/news/2009/apr/15/us-failed-to-use-best-radar-for-n-korea-missile/print/\" What an interesting policy! i wonder if Gates acted unilaterally, or...was 'instructed' to deny this General's request. Why use the best radar (SBX) available? /rhetorical \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "EXCLUSIVE: Defense Secretary Robert M. Gates denied permission for the U.S. Northern Command to use the Pentagon's most powerful sea-based radar to monitor North Korea's recent missile launch, precluding officials from collecting finely detailed launch data or testing the radar in a real-time crisis, current and former defense officials said. Jamie Graybeal, Northcom public affairs director, confirmed to The Washington Times that Air Force Gen. Gene Renuart, the Northcom commander, requested the radar's use but referred all other questions to the Pentagon. Pentagon spokesman Bryan Whitman said Mr. Gates' decision not to use the $900 million radar, known as SBX, was \"based on the fact that there were numerous ground- and sea-based radars and sensors in the region to support the operational requirements for this launch.\" SBX, deployed in 2005, can track and identify warheads, decoys and debris in space with very high precision. Officials said the radar is so powerful it could detect a baseball hit out of a ballpark from more than 3,000 miles away, and that other radars used by the U.S. would not be able to provide the same level of detail about North Korea's missile capabilities.", 
        "reply": " \"http://washingtontimes.com/news/2009/apr/15/us-failed-to-use-best-radar-for-n-korea-missile/print/\" What an interesting policy! i wonder if Gates acted unilaterally, or...was 'instructed' to deny this General's request. Why use the best radar (SBX) available? /rhetorical \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:24:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "rxsid4"
    }, 
    {
        "content": "Why use radar? Apparently you could see the sucker.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "", 
        "reply": "Why use radar? Apparently you could see the sucker.", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:26:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Why use radar? Apparently you could see the sucker. \"precluding officials from collecting finely detailed launch data or testing the radar in a real-time crisis, current and former defense officials said\" \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "Originally posted by popsiq: Why use radar? Apparently you could see the sucker.", 
        "reply": " \"precluding officials from collecting finely detailed launch data or testing the radar in a real-time crisis, current and former defense officials said\" \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:29:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "rxsid4"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Why use radar? Apparently you could see the sucker. Good eyesight Pop. It's 3738 miles between points of interest. Article pretty well spells it out. The radar would give fine detail of intell. Since Mr. Gates denied the request I expect dthis information was already known.", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "Originally posted by popsiq: Why use radar? Apparently you could see the sucker.", 
        "reply": " Good eyesight Pop. It's 3738 miles between points of interest. Article pretty well spells it out. The radar would give fine detail of intell. Since Mr. Gates denied the request I expect dthis information was already known.", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:36:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: there were numerous ground- and sea-based radars and sensors in the region to support the operational requirements for this launch.\" Nuff said! This is another politically motivated rant! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090416, 
        "postID": 5, 
        "quote": "there were numerous ground- and sea-based radars and sensors in the region to support the operational requirements for this launch.\"", 
        "reply": " Nuff said! This is another politically motivated rant! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:37:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: there were numerous ground- and sea-based radars and sensors in the region to support the operational requirements for this launch.\" Nuff said! This is another politically motivated rant! \"and that other radars used by the U.S. would not be able to provide the same level of detail about North Korea's missile capabilities.\" why not scrap the new radar then? what's the point of having it, if it's not going to be used (or further tested) in a real world scenario? while we're at it, why not scrap our nukes (which has already been mentioned) \"The bigger the government, the smaller the citizen.\"", 
        "intTime": 20090416, 
        "postID": 6, 
        "quote": "Originally posted by NSNN: quote: there were numerous ground- and sea-based radars and sensors in the region to support the operational requirements for this launch.\" Nuff said! This is another politically motivated rant!", 
        "reply": " \"and that other radars used by the U.S. would not be able to provide the same level of detail about North Korea's missile capabilities.\" why not scrap the new radar then? what's the point of having it, if it's not going to be used (or further tested) in a real world scenario? while we're at it, why not scrap our nukes (which has already been mentioned) \"The bigger the government, the smaller the citizen.\"", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:43:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "rxsid4"
    }, 
    {
        "content": "quote: Originally posted by rxsid4: quote: Originally posted by popsiq: Why use radar? Apparently you could see the sucker. \"precluding officials from collecting finely detailed launch data or testing the radar in a real-time crisis, current and former defense officials said\" How is parking five Aegis warships off the Korean coast, activating an X-Band radar in Japan, and orbiting spy planes at the edge of NK airspace considered not collecting data? Dave", 
        "intTime": 20090416, 
        "postID": 7, 
        "quote": "Originally posted by rxsid4: quote: Originally posted by popsiq: Why use radar? Apparently you could see the sucker. \"precluding officials from collecting finely detailed launch data or testing the radar in a real-time crisis, current and former defense officials said\"", 
        "reply": " How is parking five Aegis warships off the Korean coast, activating an X-Band radar in Japan, and orbiting spy planes at the edge of NK airspace considered not collecting data? Dave", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-16 16:43:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Current and former defense officials offered other factors that likely affected the decision, ranging from the fact that the radar was undergoing maintenance about the time of the launch to concerns about provoking the North Koreans. One current and two former specialists in strategic defenses said the administration rejected the request because it feared that moving the huge floating radar system would be viewed by North Korea as provocative and upset diplomatic efforts aimed at restarting six-nation nuclear talks.\" Lots of armchair generals and Secdefs here.", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "", 
        "reply": "\"Current and former defense officials offered other factors that likely affected the decision, ranging from the fact that the radar was undergoing maintenance about the time of the launch to concerns about provoking the North Koreans. One current and two former specialists in strategic defenses said the administration rejected the request because it feared that moving the huge floating radar system would be viewed by North Korea as provocative and upset diplomatic efforts aimed at restarting six-nation nuclear talks.\" Lots of armchair generals and Secdefs here.", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-17 06:21:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: \"Current and former defense officials offered other factors that likely affected the decision, ranging from the fact that the radar was undergoing maintenance about the time of the launch to concerns about provoking the North Koreans. One current and two former specialists in strategic defenses said the administration rejected the request because it feared that moving the huge floating radar system would be viewed by North Korea as provocative and upset diplomatic efforts aimed at restarting six-nation nuclear talks.\" Lots of armchair generals and Secdefs here. Glad we didn't provoke the North Koreans. Then they might do something crazy like violate UN sanctions and test a ballistic missile.", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "Originally posted by Motive25: \"Current and former defense officials offered other factors that likely affected the decision, ranging from the fact that the radar was undergoing maintenance about the time of the launch to concerns about provoking the North Koreans. One current and two former specialists in strategic defenses said the administration rejected the request because it feared that moving the huge floating radar system would be viewed by North Korea as provocative and upset diplomatic efforts aimed at restarting six-nation nuclear talks.\" Lots of armchair generals and Secdefs here.", 
        "reply": " Glad we didn't provoke the North Koreans. Then they might do something crazy like violate UN sanctions and test a ballistic missile.", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-17 06:28:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "stec74"
    }, 
    {
        "content": "Turnning on that radar gives it`s position away,....for a low speed, easy to hit, draw you out rocket....C`mon !! This message has been edited. Last edited by: OddBall1st, Fri 17 April 2009 07:04 AM", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "", 
        "reply": "Turnning on that radar gives it`s position away,....for a low speed, easy to hit, draw you out rocket....C`mon !! This message has been edited. Last edited by: OddBall1st, Fri 17 April 2009 07:04 AM", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-17 06:49:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "quote: Originally posted by Motive25: \"Current and former defense officials offered other factors that likely affected the decision, ranging from the fact that the radar was undergoing maintenance about the time of the launch to concerns about provoking the North Koreans. One current and two former specialists in strategic defenses said the administration rejected the request because it feared that moving the huge floating radar system would be viewed by North Korea as provocative and upset diplomatic efforts aimed at restarting six-nation nuclear talks.\" Lots of armchair generals and Secdefs here. and your poit is..appezement. F333 what Nk thinks.. the radar should have been position to study the misile launch.. Period. Armchairgenerials.. alot of us know the working of NK.. whats your beef?", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by Motive25: \"Current and former defense officials offered other factors that likely affected the decision, ranging from the fact that the radar was undergoing maintenance about the time of the launch to concerns about provoking the North Koreans. One current and two former specialists in strategic defenses said the administration rejected the request because it feared that moving the huge floating radar system would be viewed by North Korea as provocative and upset diplomatic efforts aimed at restarting six-nation nuclear talks.\" Lots of armchair generals and Secdefs here.", 
        "reply": " and your poit is..appezement. F333 what Nk thinks.. the radar should have been position to study the misile launch.. Period. Armchairgenerials.. alot of us know the working of NK.. whats your beef?", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-17 06:56:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "Migbuster"
    }, 
    {
        "content": "The article contradicts itself. It states the SBX can pick up a baseball hit out of a ballpark at 3,000 miles but then claims it wasn't used. The SBX is based out of the far western Aleutian islands easily within the supposed 3,000 mile range. If it was used or not is none of the Washington Times business anyway. I spent two tours in missile warning both in CONUS and far above the Arctic Circle, and those sites are still there and are constantly watching.", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "", 
        "reply": "The article contradicts itself. It states the SBX can pick up a baseball hit out of a ballpark at 3,000 miles but then claims it wasn't used. The SBX is based out of the far western Aleutian islands easily within the supposed 3,000 mile range. If it was used or not is none of the Washington Times business anyway. I spent two tours in missile warning both in CONUS and far above the Arctic Circle, and those sites are still there and are constantly watching.", 
        "threadID": "672198221_3370059022001", 
        "time": "2009-04-17 06:59:00", 
        "title": "U.S. failed to use best radar for N. Korea missile", 
        "userID": "nspreitler"
    }
]