[
    {
        "content": "NOTE: This is an updated, retitled thread. please scroll down for the latest update. And here is a sudden re-escalation since that rise of tensions last year between the two neighbours over that border dispute. From the Associated Press: quote: Cambodia, Thailand exchange fire Updated April 03, 2009 08:00 PM PHNOM PENH (AP) - Four Thai soldiers are dead and 10 others have been detained after a clash at the Thai-Cambodian border. A Cambodian government spokesman says Thai and Cambodian soldiers fired at each other with machine guns and rocket launchers today along a disputed border. The fighting represents an escalation of tension in a longstanding feud near the 11th century Preah Vihear temple. (...) The fighting is the latest flare-up near the temple, which is on the Cambodian side of an ill-defined border. This message has been edited. Last edited by: Canuck_Centaur, Thu 05 November 2009 08:14 AM",
        "intTime": 20090403,
        "postID": 1,
        "quote": "Cambodia, Thailand exchange fire Updated April 03, 2009 08:00 PM PHNOM PENH (AP) - Four Thai soldiers are dead and 10 others have been detained after a clash at the Thai-Cambodian border. A Cambodian government spokesman says Thai and Cambodian soldiers fired at each other with machine guns and rocket launchers today along a disputed border. The fighting represents an escalation of tension in a longstanding feud near the 11th century Preah Vihear temple. (...) The fighting is the latest flare-up near the temple, which is on the Cambodian side of an ill-defined border.",
        "reply": "NOTE: This is an updated, retitled thread. please scroll down for the latest update. And here is a sudden re-escalation since that rise of tensions last year between the two neighbours over that border dispute. From the Associated Press:  This message has been edited. Last edited by: Canuck_Centaur, Thu 05 November 2009 08:14 AM",
        "threadID": "672198221_9690027912001",
        "time": "2009-04-03 08:00:00",
        "title": "Update:Thailand and Cambodia recall ambassadors over Thaksin row",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Just another update, plus file pictures of Thai and Cambodian troops for everyone's reference. quote: Agence France-Presse - 4/3/2009 1:11 PM GMT Thailand, Cambodia in deadly border clashes Thai and Cambodian troops fought heavy gun-battles on their disputed border Friday, leaving at least two soldiers dead in the biggest flare-up for months in a bitter feud over an ancient temple. Soldiers exchanged rocket, machine-gun and mortar fire near the 11th-century Preah Vihear temple on the frontier, following a brief skirmish earlier in the day, officials from both sides said. The area was the scene of several clashes last year after Cambodia successfully applied for United Nations world heritage status for the ruins in July, with four soldiers killed in a battle there in October. One Thai soldier died at the site of the clash on Friday and another passed away in hospital later, while 10 others were injured, regional Thai military spokesman Lieutenant Colonel Wichit Makarun said. Cambodian government spokesman Khieu Kanharith initially announced that two soldiers from his country were killed, but later retracted the statement, saying it was an unofficial figure but without providing further details. (...) Tensions first flared along the border in July last year over the granting of UN heritage to the temple on the border, although the countries have been at loggerheads over the site for decades. Subsequent talks between Cambodia and Thailand have not resolved the dispute and Thailand's foreign minister was forced to apologise Thursday, after being accused by Hun Sen of calling him a gangster. Further talks are due on Monday and Tuesday in Phnom Penh. Hun Sen and Abhisit are also scheduled to take part in a summit between the Association of Southeast Asian Nations (ASEAN) and key regional partners in the Thai resort of Pattaya, starting on April 10. Thai troops: And here are some Cambodian troops and their vehicles:",
        "intTime": 20090403,
        "postID": 2,
        "quote": "Agence France-Presse - 4/3/2009 1:11 PM GMT Thailand, Cambodia in deadly border clashes Thai and Cambodian troops fought heavy gun-battles on their disputed border Friday, leaving at least two soldiers dead in the biggest flare-up for months in a bitter feud over an ancient temple. Soldiers exchanged rocket, machine-gun and mortar fire near the 11th-century Preah Vihear temple on the frontier, following a brief skirmish earlier in the day, officials from both sides said. The area was the scene of several clashes last year after Cambodia successfully applied for United Nations world heritage status for the ruins in July, with four soldiers killed in a battle there in October. One Thai soldier died at the site of the clash on Friday and another passed away in hospital later, while 10 others were injured, regional Thai military spokesman Lieutenant Colonel Wichit Makarun said. Cambodian government spokesman Khieu Kanharith initially announced that two soldiers from his country were killed, but later retracted the statement, saying it was an unofficial figure but without providing further details. (...) Tensions first flared along the border in July last year over the granting of UN heritage to the temple on the border, although the countries have been at loggerheads over the site for decades. Subsequent talks between Cambodia and Thailand have not resolved the dispute and Thailand's foreign minister was forced to apologise Thursday, after being accused by Hun Sen of calling him a gangster. Further talks are due on Monday and Tuesday in Phnom Penh. Hun Sen and Abhisit are also scheduled to take part in a summit between the Association of Southeast Asian Nations (ASEAN) and key regional partners in the Thai resort of Pattaya, starting on April 10.",
        "reply": "Just another update, plus file pictures of Thai and Cambodian troops for everyone's reference.  Thai troops: And here are some Cambodian troops and their vehicles:",
        "threadID": "672198221_9690027912001",
        "time": "2009-04-03 13:21:00",
        "title": "Update:Thailand and Cambodia recall ambassadors over Thaksin row",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "The guys in the top pictures don't have any ammo pouches!! Did anybody actually hit anything, besides water buffalo??? Roll out the BBQ!! Wandering and Wondering",
        "intTime": 20090403,
        "postID": 3,
        "quote": "",
        "reply": "The guys in the top pictures don't have any ammo pouches!! Did anybody actually hit anything, besides water buffalo??? Roll out the BBQ!! Wandering and Wondering",
        "threadID": "672198221_9690027912001",
        "time": "2009-04-03 13:26:00",
        "title": "Update:Thailand and Cambodia recall ambassadors over Thaksin row",
        "userID": "greywolfghost"
    },
    {
        "content": "And more details and pictures from the developing situation: quote: Cambodia, Thai troops exchange fire By: AFP Published: 3/04/2009 at 10:30 AM Thai and Cambodian troops exchanged gunfire briefly on Friday in a disputed area on their border, a Thai official said, raising tensions that erupted into a deadly clash last year. The exchange of shots occurred about 7.10am after Cambodian soldiers went to investigate the area where a Thai soldier stepped on a landmine on Thursday and lost a leg, Si Sa Ket governor Seni Chittakasem said. \"There is no report of loss (of life) on the Thai side and it's ended now,'' he said. The trouble flared one kilometre inside the disputed territory, the governor said. A Cambodian soldier stationed at the border said the gunfire had further raised tensions between troops, but disputed that Thai soldiers had fired any shots. \"A group of Thai soldiers this morning entered Cambodian territory and Cambodian troops opened fire,'' Yeim Kheang told AFP by telephone. \"The situation is now tense... the Thai troops did not fire back,'' he said. Thailand's foreign ministry immediately accused Cambodia of violating its sovereignty and said it would be sending a note of protest to authorities in Phnom Penh. \"We had to retaliate because Cambodians opened fire at Thai soldiers first. We want to reiterate that this area is our territory,'' ministry spokesman Tharit Charungvat told AFP. There was no immediate comment from Cambodian authorities. The landmine incident a day earlier had put Cambodian troops on \"high alert'' he said, two days after Cambodian Prime Minister Hun Sen warned Thailand there would be fighting if its troops crossed their disputed frontier. Tensions over the long-disputed territory flared in July last year after the 11th century Preah Vihear temple at the border was granted Unesco World Heritage status. Troops clashed in the area in October and four soldiers died. Subsequent talks between Cambodia and Thailand have not resolved the dispute. The border between the two countries has never been fully demarcated, in part because it is littered with landmines left over from decades of war in Cambodia. ++http://www.bangkokpost.com/breakingnews/139454/troops-exchange-gunfire]http://www.bangkokpost.com/breakingnews/139454/troops-exchange-gunfire ---------------------------------------- Two Khmer soldiers killed in border clashes By: AFP Published: 3/04/2009 at 02:51 PM Two Cambodian soldiers were killed in a gunfight with Thai troops on the disputed area near Preah Vihear temple, a Cambodian government spokesman said Friday afternoon. \"We are fighting with each other, it is serious gunfire. Two of our soldiers have been killed,\" Khieu Kanharith told AFP. Cambodian and Thai authorities confirmed heavy gunfire had broken out about 2pm following a brief exchange of shots earlier in the day. Cambodian commander Bun Thean told AFP that shots had been fired between troops in a number of spots near the ancient temple on the border, which has not been fully demarcated. (...) ----------------------------------------------------- Cambodian troops Thai troops Troops from both countries conversing",
        "intTime": 20090404,
        "postID": 4,
        "quote": "Cambodia, Thai troops exchange fire By: AFP Published: 3/04/2009 at 10:30 AM Thai and Cambodian troops exchanged gunfire briefly on Friday in a disputed area on their border, a Thai official said, raising tensions that erupted into a deadly clash last year. The exchange of shots occurred about 7.10am after Cambodian soldiers went to investigate the area where a Thai soldier stepped on a landmine on Thursday and lost a leg, Si Sa Ket governor Seni Chittakasem said. \"There is no report of loss (of life) on the Thai side and it's ended now,'' he said. The trouble flared one kilometre inside the disputed territory, the governor said. A Cambodian soldier stationed at the border said the gunfire had further raised tensions between troops, but disputed that Thai soldiers had fired any shots. \"A group of Thai soldiers this morning entered Cambodian territory and Cambodian troops opened fire,'' Yeim Kheang told AFP by telephone. \"The situation is now tense... the Thai troops did not fire back,'' he said. Thailand's foreign ministry immediately accused Cambodia of violating its sovereignty and said it would be sending a note of protest to authorities in Phnom Penh. \"We had to retaliate because Cambodians opened fire at Thai soldiers first. We want to reiterate that this area is our territory,'' ministry spokesman Tharit Charungvat told AFP. There was no immediate comment from Cambodian authorities. The landmine incident a day earlier had put Cambodian troops on \"high alert'' he said, two days after Cambodian Prime Minister Hun Sen warned Thailand there would be fighting if its troops crossed their disputed frontier. Tensions over the long-disputed territory flared in July last year after the 11th century Preah Vihear temple at the border was granted Unesco World Heritage status. Troops clashed in the area in October and four soldiers died. Subsequent talks between Cambodia and Thailand have not resolved the dispute. The border between the two countries has never been fully demarcated, in part because it is littered with landmines left over from decades of war in Cambodia. ++http://www.bangkokpost.com/breakingnews/139454/troops-exchange-gunfire]http://www.bangkokpost.com/breakingnews/139454/troops-exchange-gunfire ---------------------------------------- Two Khmer soldiers killed in border clashes By: AFP Published: 3/04/2009 at 02:51 PM Two Cambodian soldiers were killed in a gunfight with Thai troops on the disputed area near Preah Vihear temple, a Cambodian government spokesman said Friday afternoon. \"We are fighting with each other, it is serious gunfire. Two of our soldiers have been killed,\" Khieu Kanharith told AFP. Cambodian and Thai authorities confirmed heavy gunfire had broken out about 2pm following a brief exchange of shots earlier in the day. Cambodian commander Bun Thean told AFP that shots had been fired between troops in a number of spots near the ancient temple on the border, which has not been fully demarcated. (...) ----------------------------------------------------- Cambodian troops Thai troops Troops from both countries conversing",
        "reply": "And more details and pictures from the developing situation: ",
        "threadID": "672198221_9690027912001",
        "time": "2009-04-04 13:50:00",
        "title": "Update:Thailand and Cambodia recall ambassadors over Thaksin row",
        "userID": "Canuck_Centaur"
    }
]