[
    {
        "content": "\"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.”", 
        "reply": "\"http://www.politico.com/news/stories/0309/19517.html\"  DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 17:02:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: \"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy! LMAO I knew it would happen. As I said before, if a guy like Limbaugh is the leader of the GOP, that party is in serious, serious trouble. We all view polls selectively, but the latest poll from Time has his popularity nationwide at about 29 percent (\"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"). That isn't a good thing... What many people forget is that Limbaugh, like Fox News, enjoys a small lion's share of support. When I say, \"small lion's share\", what I mean is that they might have the largest single number among a host of competitors/ contemporaries. When you look more closely at those numbers, however, you'll find that, among a certain demographic, Fox and Limbaugh have no competition, and that explains their \"success\".", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "Originally posted by spanner69: \"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "reply": " LMAO I knew it would happen. As I said before, if a guy like Limbaugh is the leader of the GOP, that party is in serious, serious trouble. We all view polls selectively, but the latest poll from Time has his popularity nationwide at about 29 percent (\"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"). That isn't a good thing... What many people forget is that Limbaugh, like Fox News, enjoys a small lion's share of support. When I say, \"small lion's share\", what I mean is that they might have the largest single number among a host of competitors/ contemporaries. When you look more closely at those numbers, however, you'll find that, among a certain demographic, Fox and Limbaugh have no competition, and that explains their \"success\".", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 17:10:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Rush speaking to the faithful at CPAC last Saturday.", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "", 
        "reply": "Rush speaking to the faithful at CPAC last Saturday.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 18:36:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 18:41:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says.", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "reply": " Well its true. The right will forgive anything Rush does and says.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 19:09:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says. You missed my point I think. While the cartoon depicts rush as a bigot, the cartoon also uses religious bigotry as a tactic. It's not so cleverly hidden, but it's there. So I say, oh the irony.", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says.", 
        "reply": " You missed my point I think. While the cartoon depicts rush as a bigot, the cartoon also uses religious bigotry as a tactic. It's not so cleverly hidden, but it's there. So I say, oh the irony.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 20:21:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: Rush speaking to the faithful at CPAC last Saturday. Didn't hear the speech, did you?... Pot one actual, to kettle one six, send your traffic over!... Thanks LineDoggie... LOL Respectfully, SUNLINER81", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "Originally posted by jdksfcret: Rush speaking to the faithful at CPAC last Saturday.", 
        "reply": " Didn't hear the speech, did you?... Pot one actual, to kettle one six, send your traffic over!... Thanks LineDoggie... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 20:57:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Count on the Democrats winning even more House and Senate Seats in upcoming elections. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "", 
        "reply": "Count on the Democrats winning even more House and Senate Seats in upcoming elections. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 22:26:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "intTime": 20090303, 
        "postID": 9, 
        "quote": "Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections.", 
        "reply": " And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 01:23:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Republicans are scared of a fat man with a big mouth. No wonder they freak whenever Michael Moore speaks.", 
        "intTime": 20090303, 
        "postID": 10, 
        "quote": "", 
        "reply": "Republicans are scared of a fat man with a big mouth. No wonder they freak whenever Michael Moore speaks.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:18:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "R102"
    }, 
    {
        "content": "Liberals are scared of real conservatism. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 11, 
        "quote": "", 
        "reply": "Liberals are scared of real conservatism. \"The World's Finest\"", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:33:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: real conservatism. real conservatism died with Goldwater.", 
        "intTime": 20090303, 
        "postID": 12, 
        "quote": "real conservatism.", 
        "reply": " real conservatism died with Goldwater.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "intTime": 20090303, 
        "postID": 13, 
        "quote": "Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater.", 
        "reply": " Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 06:48:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81 My crystal ball was right the past 2 elections and the way it's looking for Republicans, my crystal ball will prove right again - and again - and again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 14, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "reply": " My crystal ball was right the past 2 elections and the way it's looking for Republicans, my crystal ball will prove right again - and again - and again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:52:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Liberals are scared of real conservatism. I don't know how liberals feel about it, but this moderate to conservative Democrat has no problem with it, so long as the conservative is moderate leaning and not some wild eyed Rush believer or right wing radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 15, 
        "quote": "Originally posted by Kegler300: Liberals are scared of real conservatism.", 
        "reply": " I don't know how liberals feel about it, but this moderate to conservative Democrat has no problem with it, so long as the conservative is moderate leaning and not some wild eyed Rush believer or right wing radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:55:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 16, 
        "quote": "Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "reply": " If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:59:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Not really, President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 17, 
        "quote": "Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater.", 
        "reply": " Not really, President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:05:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. Agreed. A real Barry Goldwater Republican is not someone I fear not someone anyone should fear. Its a person who knows there is a middle road that we both can agree on. What the GOP today is \"make sure we don't do anything to tick off Rush\" Barry Goldwater would have told Rush to kiss his backside.", 
        "intTime": 20090303, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon.", 
        "reply": " Agreed. A real Barry Goldwater Republican is not someone I fear not someone anyone should fear. Its a person who knows there is a middle road that we both can agree on. What the GOP today is \"make sure we don't do anything to tick off Rush\" Barry Goldwater would have told Rush to kiss his backside.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:13:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: \"Barry Goldwater would have told Rush to kiss his backside.\" Yes, he certainly would have, and he wouldn't have cowered like a puppy for it either. (Oh Rush, I'm so-so sorry ... lol) \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 19, 
        "quote": "Originally posted by spanner69: \"Barry Goldwater would have told Rush to kiss his backside.\"", 
        "reply": " Yes, he certainly would have, and he wouldn't have cowered like a puppy for it either. (Oh Rush, I'm so-so sorry ... lol) \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:18:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. I have to disagree. IMO Reagan is the one who started the whole mess by over spending and his bowing to the so called \"moral majority\". since then it's a habit the GOP can't/won't break.", 
        "intTime": 20090303, 
        "postID": 20, 
        "quote": "President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical.", 
        "reply": " I have to disagree. IMO Reagan is the one who started the whole mess by over spending and his bowing to the so called \"moral majority\". since then it's a habit the GOP can't/won't break.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:24:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.”", 
        "reply": "\"http://www.politico.com/news/stories/0309/19517.html\"  DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 17:02:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: \"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy! LMAO I knew it would happen. As I said before, if a guy like Limbaugh is the leader of the GOP, that party is in serious, serious trouble. We all view polls selectively, but the latest poll from Time has his popularity nationwide at about 29 percent (\"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"). That isn't a good thing... What many people forget is that Limbaugh, like Fox News, enjoys a small lion's share of support. When I say, \"small lion's share\", what I mean is that they might have the largest single number among a host of competitors/ contemporaries. When you look more closely at those numbers, however, you'll find that, among a certain demographic, Fox and Limbaugh have no competition, and that explains their \"success\".", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "Originally posted by spanner69: \"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "reply": " LMAO I knew it would happen. As I said before, if a guy like Limbaugh is the leader of the GOP, that party is in serious, serious trouble. We all view polls selectively, but the latest poll from Time has his popularity nationwide at about 29 percent (\"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"). That isn't a good thing... What many people forget is that Limbaugh, like Fox News, enjoys a small lion's share of support. When I say, \"small lion's share\", what I mean is that they might have the largest single number among a host of competitors/ contemporaries. When you look more closely at those numbers, however, you'll find that, among a certain demographic, Fox and Limbaugh have no competition, and that explains their \"success\".", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 17:10:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Rush speaking to the faithful at CPAC last Saturday.", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "", 
        "reply": "Rush speaking to the faithful at CPAC last Saturday.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 18:36:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "", 
        "reply": "Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 18:41:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says.", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "reply": " Well its true. The right will forgive anything Rush does and says.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 19:09:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says. You missed my point I think. While the cartoon depicts rush as a bigot, the cartoon also uses religious bigotry as a tactic. It's not so cleverly hidden, but it's there. So I say, oh the irony.", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says.", 
        "reply": " You missed my point I think. While the cartoon depicts rush as a bigot, the cartoon also uses religious bigotry as a tactic. It's not so cleverly hidden, but it's there. So I say, oh the irony.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 20:21:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: Rush speaking to the faithful at CPAC last Saturday. Didn't hear the speech, did you?... Pot one actual, to kettle one six, send your traffic over!... Thanks LineDoggie... LOL Respectfully, SUNLINER81", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "Originally posted by jdksfcret: Rush speaking to the faithful at CPAC last Saturday.", 
        "reply": " Didn't hear the speech, did you?... Pot one actual, to kettle one six, send your traffic over!... Thanks LineDoggie... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 20:57:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Count on the Democrats winning even more House and Senate Seats in upcoming elections. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "", 
        "reply": "Count on the Democrats winning even more House and Senate Seats in upcoming elections. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 22:26:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "intTime": 20090303, 
        "postID": 29, 
        "quote": "Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections.", 
        "reply": " And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 01:23:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Republicans are scared of a fat man with a big mouth. No wonder they freak whenever Michael Moore speaks.", 
        "intTime": 20090303, 
        "postID": 30, 
        "quote": "", 
        "reply": "Republicans are scared of a fat man with a big mouth. No wonder they freak whenever Michael Moore speaks.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:18:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "R102"
    }, 
    {
        "content": "Liberals are scared of real conservatism. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 31, 
        "quote": "", 
        "reply": "Liberals are scared of real conservatism. \"The World's Finest\"", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:33:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: real conservatism. real conservatism died with Goldwater.", 
        "intTime": 20090303, 
        "postID": 32, 
        "quote": "real conservatism.", 
        "reply": " real conservatism died with Goldwater.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "intTime": 20090303, 
        "postID": 33, 
        "quote": "Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater.", 
        "reply": " Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 06:48:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81 My crystal ball was right the past 2 elections and the way it's looking for Republicans, my crystal ball will prove right again - and again - and again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 34, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "reply": " My crystal ball was right the past 2 elections and the way it's looking for Republicans, my crystal ball will prove right again - and again - and again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:52:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Liberals are scared of real conservatism. I don't know how liberals feel about it, but this moderate to conservative Democrat has no problem with it, so long as the conservative is moderate leaning and not some wild eyed Rush believer or right wing radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 35, 
        "quote": "Originally posted by Kegler300: Liberals are scared of real conservatism.", 
        "reply": " I don't know how liberals feel about it, but this moderate to conservative Democrat has no problem with it, so long as the conservative is moderate leaning and not some wild eyed Rush believer or right wing radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:55:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 36, 
        "quote": "Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "reply": " If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:59:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Not really, President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 37, 
        "quote": "Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater.", 
        "reply": " Not really, President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:05:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. Agreed. A real Barry Goldwater Republican is not someone I fear not someone anyone should fear. Its a person who knows there is a middle road that we both can agree on. What the GOP today is \"make sure we don't do anything to tick off Rush\" Barry Goldwater would have told Rush to kiss his backside.", 
        "intTime": 20090303, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon.", 
        "reply": " Agreed. A real Barry Goldwater Republican is not someone I fear not someone anyone should fear. Its a person who knows there is a middle road that we both can agree on. What the GOP today is \"make sure we don't do anything to tick off Rush\" Barry Goldwater would have told Rush to kiss his backside.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:13:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: \"Barry Goldwater would have told Rush to kiss his backside.\" Yes, he certainly would have, and he wouldn't have cowered like a puppy for it either. (Oh Rush, I'm so-so sorry ... lol) \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 39, 
        "quote": "Originally posted by spanner69: \"Barry Goldwater would have told Rush to kiss his backside.\"", 
        "reply": " Yes, he certainly would have, and he wouldn't have cowered like a puppy for it either. (Oh Rush, I'm so-so sorry ... lol) \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:18:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. I have to disagree. IMO Reagan is the one who started the whole mess by over spending and his bowing to the so called \"moral majority\". since then it's a habit the GOP can't/won't break.", 
        "intTime": 20090303, 
        "postID": 40, 
        "quote": "President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical.", 
        "reply": " I have to disagree. IMO Reagan is the one who started the whole mess by over spending and his bowing to the so called \"moral majority\". since then it's a habit the GOP can't/won't break.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:24:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "\"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "intTime": 20090302, 
        "postID": 41, 
        "quote": "Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.”", 
        "reply": "\"http://www.politico.com/news/stories/0309/19517.html\"  DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 17:02:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: \"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy! LMAO I knew it would happen. As I said before, if a guy like Limbaugh is the leader of the GOP, that party is in serious, serious trouble. We all view polls selectively, but the latest poll from Time has his popularity nationwide at about 29 percent (\"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"). That isn't a good thing... What many people forget is that Limbaugh, like Fox News, enjoys a small lion's share of support. When I say, \"small lion's share\", what I mean is that they might have the largest single number among a host of competitors/ contemporaries. When you look more closely at those numbers, however, you'll find that, among a certain demographic, Fox and Limbaugh have no competition, and that explains their \"success\".", 
        "intTime": 20090302, 
        "postID": 42, 
        "quote": "Originally posted by spanner69: \"http://www.politico.com/news/stories/0309/19517.html\" quote: Republican National Committee Chairman Michael Steele says he has reached out to Rush Limbaugh to tell him he meant no offense when he referred to the popular conservative radio host as an “entertainer” whose show can be “incendiary.” “My intent was not to go after Rush – I have enormous respect for Rush Limbaugh,” Steele said in a telephone interview. “I was maybe a little bit inarticulate. … There was no attempt on my part to diminish his voice or his leadership.” DADDY Limbaugh took Steele behind the wood shed and spank that \"man\" silly: DONT (Whack) you ever (Whack) Talk back to me (Whack) again (WHACK!) If you're a Republican dont EVER talk back to Daddy!", 
        "reply": " LMAO I knew it would happen. As I said before, if a guy like Limbaugh is the leader of the GOP, that party is in serious, serious trouble. We all view polls selectively, but the latest poll from Time has his popularity nationwide at about 29 percent (\"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"). That isn't a good thing... What many people forget is that Limbaugh, like Fox News, enjoys a small lion's share of support. When I say, \"small lion's share\", what I mean is that they might have the largest single number among a host of competitors/ contemporaries. When you look more closely at those numbers, however, you'll find that, among a certain demographic, Fox and Limbaugh have no competition, and that explains their \"success\".", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 17:10:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Rush speaking to the faithful at CPAC last Saturday.", 
        "intTime": 20090302, 
        "postID": 43, 
        "quote": "", 
        "reply": "Rush speaking to the faithful at CPAC last Saturday.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 18:36:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "intTime": 20090302, 
        "postID": 44, 
        "quote": "", 
        "reply": "Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 18:41:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says.", 
        "intTime": 20090302, 
        "postID": 45, 
        "quote": "Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony.", 
        "reply": " Well its true. The right will forgive anything Rush does and says.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 19:09:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says. You missed my point I think. While the cartoon depicts rush as a bigot, the cartoon also uses religious bigotry as a tactic. It's not so cleverly hidden, but it's there. So I say, oh the irony.", 
        "intTime": 20090302, 
        "postID": 46, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Philhelm: Nice. That cartoon has bigoted, anti-religious undertones. Oh the irony. Well its true. The right will forgive anything Rush does and says.", 
        "reply": " You missed my point I think. While the cartoon depicts rush as a bigot, the cartoon also uses religious bigotry as a tactic. It's not so cleverly hidden, but it's there. So I say, oh the irony.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 20:21:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: Rush speaking to the faithful at CPAC last Saturday. Didn't hear the speech, did you?... Pot one actual, to kettle one six, send your traffic over!... Thanks LineDoggie... LOL Respectfully, SUNLINER81", 
        "intTime": 20090302, 
        "postID": 47, 
        "quote": "Originally posted by jdksfcret: Rush speaking to the faithful at CPAC last Saturday.", 
        "reply": " Didn't hear the speech, did you?... Pot one actual, to kettle one six, send your traffic over!... Thanks LineDoggie... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 20:57:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Count on the Democrats winning even more House and Senate Seats in upcoming elections. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090302, 
        "postID": 48, 
        "quote": "", 
        "reply": "Count on the Democrats winning even more House and Senate Seats in upcoming elections. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-02 22:26:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "intTime": 20090303, 
        "postID": 49, 
        "quote": "Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections.", 
        "reply": " And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 01:23:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Republicans are scared of a fat man with a big mouth. No wonder they freak whenever Michael Moore speaks.", 
        "intTime": 20090303, 
        "postID": 50, 
        "quote": "", 
        "reply": "Republicans are scared of a fat man with a big mouth. No wonder they freak whenever Michael Moore speaks.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:18:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "R102"
    }, 
    {
        "content": "Liberals are scared of real conservatism. \"The World's Finest\"", 
        "intTime": 20090303, 
        "postID": 51, 
        "quote": "", 
        "reply": "Liberals are scared of real conservatism. \"The World's Finest\"", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:33:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: real conservatism. real conservatism died with Goldwater.", 
        "intTime": 20090303, 
        "postID": 52, 
        "quote": "real conservatism.", 
        "reply": " real conservatism died with Goldwater.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 03:41:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "intTime": 20090303, 
        "postID": 53, 
        "quote": "Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater.", 
        "reply": " Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 06:48:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81 My crystal ball was right the past 2 elections and the way it's looking for Republicans, my crystal ball will prove right again - and again - and again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 54, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: Count on the Democrats winning even more House and Senate Seats in upcoming elections. And you saw this in your crystal ball... Madame Zola sees all, knows all... LOL Respectfully, SUNLINER81", 
        "reply": " My crystal ball was right the past 2 elections and the way it's looking for Republicans, my crystal ball will prove right again - and again - and again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:52:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Liberals are scared of real conservatism. I don't know how liberals feel about it, but this moderate to conservative Democrat has no problem with it, so long as the conservative is moderate leaning and not some wild eyed Rush believer or right wing radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 55, 
        "quote": "Originally posted by Kegler300: Liberals are scared of real conservatism.", 
        "reply": " I don't know how liberals feel about it, but this moderate to conservative Democrat has no problem with it, so long as the conservative is moderate leaning and not some wild eyed Rush believer or right wing radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:55:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 56, 
        "quote": "Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit.", 
        "reply": " If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 07:59:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Not really, President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 57, 
        "quote": "Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater.", 
        "reply": " Not really, President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:05:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon. Agreed. A real Barry Goldwater Republican is not someone I fear not someone anyone should fear. Its a person who knows there is a middle road that we both can agree on. What the GOP today is \"make sure we don't do anything to tick off Rush\" Barry Goldwater would have told Rush to kiss his backside.", 
        "intTime": 20090303, 
        "postID": 58, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by spanner69: quote: Originally posted by karlhungusjr: quote: real conservatism. real conservatism died with Goldwater. Amen! He is turning over in his grave at what has become of his party. I think Dems do fear a real Goldwater Conservative. But not what has become the GOP now a bunch of Religious zealots who spend our money like a sailor on leave who goes over his credit limit. If the conservative is good for the country, then we Dem's shouldn't have any problem with it. But the problem is, most moderate/conservative's are either Democrats or Independents, or Democrat voters. The conservatives you are referring to are right winger radicals like Rush. So long as Rush is leading the Party and has every Republican scared out of their wits to say anything against him, no Republican majority will be happening any time soon.", 
        "reply": " Agreed. A real Barry Goldwater Republican is not someone I fear not someone anyone should fear. Its a person who knows there is a middle road that we both can agree on. What the GOP today is \"make sure we don't do anything to tick off Rush\" Barry Goldwater would have told Rush to kiss his backside.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:13:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: \"Barry Goldwater would have told Rush to kiss his backside.\" Yes, he certainly would have, and he wouldn't have cowered like a puppy for it either. (Oh Rush, I'm so-so sorry ... lol) \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090303, 
        "postID": 59, 
        "quote": "Originally posted by spanner69: \"Barry Goldwater would have told Rush to kiss his backside.\"", 
        "reply": " Yes, he certainly would have, and he wouldn't have cowered like a puppy for it either. (Oh Rush, I'm so-so sorry ... lol) \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:18:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical. I have to disagree. IMO Reagan is the one who started the whole mess by over spending and his bowing to the so called \"moral majority\". since then it's a habit the GOP can't/won't break.", 
        "intTime": 20090303, 
        "postID": 60, 
        "quote": "President Reagan, probably the greatest president of my lifetime, did a pretty good job as a true conservative. A conservative who wasn't some wild eyed rightie radical.", 
        "reply": " I have to disagree. IMO Reagan is the one who started the whole mess by over spending and his bowing to the so called \"moral majority\". since then it's a habit the GOP can't/won't break.", 
        "threadID": "672198221_3350027612001", 
        "time": "2009-03-03 08:24:00", 
        "title": "Steele to Rush: I'm sorry", 
        "userID": "karlhungusjr"
    }
]