[
    {
        "content": "quote: Western policies based on pressuring Iran to give up its nuclear program will fail because they disregard Israeli nuclear capabilities, which is \"the first and greatest threat to security in the region,\" an Egyptian Foreign Ministry spokesman said on Monday. Israeli Foreign Ministry spokesman Yigal Palmor categorically rejected that classification. \"If he can quote at least one occasion in which Israel has threatened any of its neighbors with the alleged nuclear weapon, then his statements would gain him credibility,\" Palmor said. \"Unless he produces evidence to support his claims, these kinds of remarks are completely out of line.\" Spokesman Hossam Zaki, in a declaration to editors accredited with the ministry, said Egypt's position on disarmament and nonproliferation aimed to safeguard Egyptian security and to address the threats that undermine security and stability in the Middle East, according to Egypt's official Middle East News Agency. Cairo sought to realize the aims of the Nuclear Non-Proliferation Treaty to guarantee the security of all states, whereas possession of nuclear weapons by some countries disrupted the balance of power and encouraged other nations to address this imbalance by seeking to acquire nuclear weapons, he said. Zaki called on the international community to justly and indiscriminately apply the Non-Proliferation Treaty that requires states to comply with its provisions, and asked it to refrain from the adoption of double standards in pressuring states to abandon their programs, he said. (...) +http://www.jpost.com/servlet/Satellite?cid=1239710864019&pagename=JPost%2FJPArticle%2FShowFull \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "Western policies based on pressuring Iran to give up its nuclear program will fail because they disregard Israeli nuclear capabilities, which is \"the first and greatest threat to security in the region,\" an Egyptian Foreign Ministry spokesman said on Monday. Israeli Foreign Ministry spokesman Yigal Palmor categorically rejected that classification. \"If he can quote at least one occasion in which Israel has threatened any of its neighbors with the alleged nuclear weapon, then his statements would gain him credibility,\" Palmor said. \"Unless he produces evidence to support his claims, these kinds of remarks are completely out of line.\" Spokesman Hossam Zaki, in a declaration to editors accredited with the ministry, said Egypt's position on disarmament and nonproliferation aimed to safeguard Egyptian security and to address the threats that undermine security and stability in the Middle East, according to Egypt's official Middle East News Agency. Cairo sought to realize the aims of the Nuclear Non-Proliferation Treaty to guarantee the security of all states, whereas possession of nuclear weapons by some countries disrupted the balance of power and encouraged other nations to address this imbalance by seeking to acquire nuclear weapons, he said. Zaki called on the international community to justly and indiscriminately apply the Non-Proliferation Treaty that requires states to comply with its provisions, and asked it to refrain from the adoption of double standards in pressuring states to abandon their programs, he said. (...)", 
        "reply": " +http://www.jpost.com/servlet/Satellite?cid=1239710864019&pagename=JPost%2FJPArticle%2FShowFull \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-04 19:10:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "", 
        "reply": "How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:20:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 3, 
        "quote": "Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "reply": " What do you consider stable? ME? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:28:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Has it ever been truly established that Israel has nukes? I don't think so. Yet the idea that she might has certainly had a stabilizing effect on the region. How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers.", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "reply": " Has it ever been truly established that Israel has nukes? I don't think so. Yet the idea that she might has certainly had a stabilizing effect on the region. How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:33:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday.", 
        "intTime": 20090505, 
        "postID": 5, 
        "quote": "Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME?", 
        "reply": " To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:40:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday. What question of mine did you answer? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 6, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday.", 
        "reply": " What question of mine did you answer? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:07:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 7, 
        "quote": "Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers.", 
        "reply": " Was that a serious question? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:08:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn.", 
        "intTime": 20090505, 
        "postID": 8, 
        "quote": "How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "reply": " Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:12:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan.", 
        "intTime": 20090505, 
        "postID": 9, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question?", 
        "reply": " Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:17:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? I should've put \"relatively speaking\", oops.", 
        "intTime": 20090505, 
        "postID": 10, 
        "quote": "Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME?", 
        "reply": " I should've put \"relatively speaking\", oops.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:21:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn. Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me.", 
        "intTime": 20090505, 
        "postID": 11, 
        "quote": "Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn.", 
        "reply": " Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:29:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn. Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me. My bad! Excuse my stupid remark", 
        "intTime": 20090505, 
        "postID": 12, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn. Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me.", 
        "reply": " My bad! Excuse my stupid remark", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:33:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Already forgotten.", 
        "intTime": 20090505, 
        "postID": 13, 
        "quote": "", 
        "reply": "Already forgotten.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:37:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "I like how Egypt compares Israel to Iran with regards to having nukes. Bleah...", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "", 
        "reply": "I like how Egypt compares Israel to Iran with regards to having nukes. Bleah...", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:45:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I like how Egypt compares Israel to Iran with regards to having nukes. Bleah... I think it's more window dressing then anything with Egypt. Saying what their fellow Arabs/Muslims want to hear.", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "Originally posted by ACR26: I like how Egypt compares Israel to Iran with regards to having nukes. Bleah...", 
        "reply": " I think it's more window dressing then anything with Egypt. Saying what their fellow Arabs/Muslims want to hear.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 13:09:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: quote: Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan. How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 16, 
        "quote": "Originally posted by Sand_Flea: quote: Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan.", 
        "reply": " How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 13:56:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)... Can you expound on your points? I may not be interested depending on your interpretations...but I thought I would ask.", 
        "intTime": 20090505, 
        "postID": 17, 
        "quote": "How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)...", 
        "reply": " Can you expound on your points? I may not be interested depending on your interpretations...but I thought I would ask.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 14:49:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "ACR26"
    }, 
    {
        "content": "Oh I am sure all the Arab nations would love Israel to give up thier nukes, Not a chance. Nor should they. Viva La Israel!!!", 
        "intTime": 20090505, 
        "postID": 18, 
        "quote": "", 
        "reply": "Oh I am sure all the Arab nations would love Israel to give up thier nukes, Not a chance. Nor should they. Viva La Israel!!!", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 16:09:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Egypt had amass 100,000 troops, 1,000 tanks along the border with Israel, the along with Jordan and Syria were to spring forward and eliminate the Jew in one effort. Along with troops from Arab states of Iraq, Saudi Arabia, Sudan, Tunisia, Morocco and Algeria also contributed troops and arms to the Arab forces. Like David and Goliath, David beat them to the punch. Had nothing to do with premptive sneak attack, but a wise thought out,\"I'm not going to wait and get my brains beat out\" punch. Once Egypts air force was permanently grounded, error in communications with the Syrians lost most of the aerial combatants with the assist of the Israel defense. Jordan was pushed out of Jerusalem and trans-jordan. Not to well known in those days if Israel had nukes or not. If the Arabs knew, why would they formulate such a war? Egypt would be the last Arab state to allow Iran nuclearize, they above all other are at odds with the Persian.", 
        "intTime": 20090505, 
        "postID": 19, 
        "quote": "", 
        "reply": "Egypt had amass 100,000 troops, 1,000 tanks along the border with Israel, the along with Jordan and Syria were to spring forward and eliminate the Jew in one effort. Along with troops from Arab states of Iraq, Saudi Arabia, Sudan, Tunisia, Morocco and Algeria also contributed troops and arms to the Arab forces. Like David and Goliath, David beat them to the punch. Had nothing to do with premptive sneak attack, but a wise thought out,\"I'm not going to wait and get my brains beat out\" punch. Once Egypts air force was permanently grounded, error in communications with the Syrians lost most of the aerial combatants with the assist of the Israel defense. Jordan was pushed out of Jerusalem and trans-jordan. Not to well known in those days if Israel had nukes or not. If the Arabs knew, why would they formulate such a war? Egypt would be the last Arab state to allow Iran nuclearize, they above all other are at odds with the Persian.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 16:21:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I know NSNN that you cannot read my posts, but i will reply to your bashing nonetheless. \"How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful?\" Nukes were after 67. Prior to that there have been no nukes. Furthermore, in 67 Israel had cause belli-Egypt has closed the straits, and thus broke the freedom of the seas law. Need i to remind you that US had TWICE fought for this very reason? One of these reasons was ww1, which was hundreds of times more bloodier than the pitiful sandbox brawl we had up here. In 56 we had cause belli as well-the fedayun attacks from Egypt. In 48 WE have been attacked. After 67, we have been attacked in 73 (DESPITE having nukes, so your bashing is baseless once again). In 1982 we had attacked PLO, not Lebanon, and this too, after numerous rocket attacks and suicide attacks and other attacks. So, as usual, this is clueless bashing. Way to go, Mr. Finally, if these nukes are so destabilizing, we should have seen much more wars because of them. Strangely enough, all we had was only ONE \"real\" war (1973). The rest were wars against terrorists. Oh, and we had 2 peace agreements. As to your baseless and clueless claim that we had used nuclear blackmail in order to get a better deal in these agreements, i will task you to prove it, and explain why we had returned to Egypt EVERYTHING we took.", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "", 
        "reply": "I know NSNN that you cannot read my posts, but i will reply to your bashing nonetheless. \"How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful?\" Nukes were after 67. Prior to that there have been no nukes. Furthermore, in 67 Israel had cause belli-Egypt has closed the straits, and thus broke the freedom of the seas law. Need i to remind you that US had TWICE fought for this very reason? One of these reasons was ww1, which was hundreds of times more bloodier than the pitiful sandbox brawl we had up here. In 56 we had cause belli as well-the fedayun attacks from Egypt. In 48 WE have been attacked. After 67, we have been attacked in 73 (DESPITE having nukes, so your bashing is baseless once again). In 1982 we had attacked PLO, not Lebanon, and this too, after numerous rocket attacks and suicide attacks and other attacks. So, as usual, this is clueless bashing. Way to go, Mr. Finally, if these nukes are so destabilizing, we should have seen much more wars because of them. Strangely enough, all we had was only ONE \"real\" war (1973). The rest were wars against terrorists. Oh, and we had 2 peace agreements. As to your baseless and clueless claim that we had used nuclear blackmail in order to get a better deal in these agreements, i will task you to prove it, and explain why we had returned to Egypt EVERYTHING we took.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-07 08:00:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Western policies based on pressuring Iran to give up its nuclear program will fail because they disregard Israeli nuclear capabilities, which is \"the first and greatest threat to security in the region,\" an Egyptian Foreign Ministry spokesman said on Monday. Israeli Foreign Ministry spokesman Yigal Palmor categorically rejected that classification. \"If he can quote at least one occasion in which Israel has threatened any of its neighbors with the alleged nuclear weapon, then his statements would gain him credibility,\" Palmor said. \"Unless he produces evidence to support his claims, these kinds of remarks are completely out of line.\" Spokesman Hossam Zaki, in a declaration to editors accredited with the ministry, said Egypt's position on disarmament and nonproliferation aimed to safeguard Egyptian security and to address the threats that undermine security and stability in the Middle East, according to Egypt's official Middle East News Agency. Cairo sought to realize the aims of the Nuclear Non-Proliferation Treaty to guarantee the security of all states, whereas possession of nuclear weapons by some countries disrupted the balance of power and encouraged other nations to address this imbalance by seeking to acquire nuclear weapons, he said. Zaki called on the international community to justly and indiscriminately apply the Non-Proliferation Treaty that requires states to comply with its provisions, and asked it to refrain from the adoption of double standards in pressuring states to abandon their programs, he said. (...) +http://www.jpost.com/servlet/Satellite?cid=1239710864019&pagename=JPost%2FJPArticle%2FShowFull \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090504, 
        "postID": 21, 
        "quote": "Western policies based on pressuring Iran to give up its nuclear program will fail because they disregard Israeli nuclear capabilities, which is \"the first and greatest threat to security in the region,\" an Egyptian Foreign Ministry spokesman said on Monday. Israeli Foreign Ministry spokesman Yigal Palmor categorically rejected that classification. \"If he can quote at least one occasion in which Israel has threatened any of its neighbors with the alleged nuclear weapon, then his statements would gain him credibility,\" Palmor said. \"Unless he produces evidence to support his claims, these kinds of remarks are completely out of line.\" Spokesman Hossam Zaki, in a declaration to editors accredited with the ministry, said Egypt's position on disarmament and nonproliferation aimed to safeguard Egyptian security and to address the threats that undermine security and stability in the Middle East, according to Egypt's official Middle East News Agency. Cairo sought to realize the aims of the Nuclear Non-Proliferation Treaty to guarantee the security of all states, whereas possession of nuclear weapons by some countries disrupted the balance of power and encouraged other nations to address this imbalance by seeking to acquire nuclear weapons, he said. Zaki called on the international community to justly and indiscriminately apply the Non-Proliferation Treaty that requires states to comply with its provisions, and asked it to refrain from the adoption of double standards in pressuring states to abandon their programs, he said. (...)", 
        "reply": " +http://www.jpost.com/servlet/Satellite?cid=1239710864019&pagename=JPost%2FJPArticle%2FShowFull \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-04 19:10:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "intTime": 20090505, 
        "postID": 22, 
        "quote": "", 
        "reply": "How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:20:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 23, 
        "quote": "Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "reply": " What do you consider stable? ME? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:28:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Has it ever been truly established that Israel has nukes? I don't think so. Yet the idea that she might has certainly had a stabilizing effect on the region. How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers.", 
        "intTime": 20090505, 
        "postID": 24, 
        "quote": "Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "reply": " Has it ever been truly established that Israel has nukes? I don't think so. Yet the idea that she might has certainly had a stabilizing effect on the region. How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:33:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday.", 
        "intTime": 20090505, 
        "postID": 25, 
        "quote": "Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME?", 
        "reply": " To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 11:40:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday. What question of mine did you answer? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 26, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? To answer your question it was the early 50's in cooperation with France. Testing done in the Tahitian islands, the Kiwi's raised considerable hell over it. Strange the Egyptian minister that condemned Israel at the same time they and Iran are having a contest of threats each other about Hizbullah attacks . Plus the fact Israel bombed tunnels from Gaza to Egypt yesterday.", 
        "reply": " What question of mine did you answer? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:07:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 27, 
        "quote": "Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers.", 
        "reply": " Was that a serious question? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:08:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn.", 
        "intTime": 20090505, 
        "postID": 28, 
        "quote": "How long has Israel have nukes? I don't think the region is any less stable due to them having nukes.", 
        "reply": " Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:12:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan.", 
        "intTime": 20090505, 
        "postID": 29, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question?", 
        "reply": " Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:17:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME? I should've put \"relatively speaking\", oops.", 
        "intTime": 20090505, 
        "postID": 30, 
        "quote": "Originally posted by NSNN: quote: Originally posted by 67NOV: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. What do you consider stable? ME?", 
        "reply": " I should've put \"relatively speaking\", oops.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:21:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn. Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me.", 
        "intTime": 20090505, 
        "postID": 31, 
        "quote": "Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn.", 
        "reply": " Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:29:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn. Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me. My bad! Excuse my stupid remark", 
        "intTime": 20090505, 
        "postID": 32, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by rayevinsonsr: quote: How long has Israel have nukes? I don't think the region is any less stable due to them having nukes. Being your old sarcastic self? Damn should have known better of including any portion of a conversation with you....Lesson learn. Ray, WTF, over. Where's the sarcasm? If I was being sarcastic, I would've put a blinking smiley face. I don't know who pizzed in your Wheaties, but it wasn't me.", 
        "reply": " My bad! Excuse my stupid remark", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:33:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Already forgotten.", 
        "intTime": 20090505, 
        "postID": 33, 
        "quote": "", 
        "reply": "Already forgotten.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:37:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "I like how Egypt compares Israel to Iran with regards to having nukes. Bleah...", 
        "intTime": 20090505, 
        "postID": 34, 
        "quote": "", 
        "reply": "I like how Egypt compares Israel to Iran with regards to having nukes. Bleah...", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 12:45:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: I like how Egypt compares Israel to Iran with regards to having nukes. Bleah... I think it's more window dressing then anything with Egypt. Saying what their fellow Arabs/Muslims want to hear.", 
        "intTime": 20090505, 
        "postID": 35, 
        "quote": "Originally posted by ACR26: I like how Egypt compares Israel to Iran with regards to having nukes. Bleah...", 
        "reply": " I think it's more window dressing then anything with Egypt. Saying what their fellow Arabs/Muslims want to hear.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 13:09:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Sand_Flea: quote: Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan. How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 36, 
        "quote": "Originally posted by Sand_Flea: quote: Originally posted by NSNN: quote: Originally posted by Sand_Flea: How many wars, prior to the alleged acquisition of nukes by Israel, were fought? Now compare that to the post acquisition numbers. Was that a serious question? Yes And to be honest i don't know the answer but the reasoning is simple. If Egypt, Syria, Jordan et.al. have stopped trying to directly confront and throw the Jews into the sea, then the answer is yes the threat of nukes has had a stabilizing effect. It does not address state sponsored terrorism eg. the intfadeh but that does not compare to the battles in the Sinai or Golan.", 
        "reply": " How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 13:56:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)... Can you expound on your points? I may not be interested depending on your interpretations...but I thought I would ask.", 
        "intTime": 20090505, 
        "postID": 37, 
        "quote": "How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful? Also, if I remember correctly, 6 day war was Israeli initiated supposedly pre-emptive attack. We could also argue how decades of Arab resentment (due to Israeli unilateral actions in ME) transferred over to us (sole benefactor)...", 
        "reply": " Can you expound on your points? I may not be interested depending on your interpretations...but I thought I would ask.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 14:49:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "ACR26"
    }, 
    {
        "content": "Oh I am sure all the Arab nations would love Israel to give up thier nukes, Not a chance. Nor should they. Viva La Israel!!!", 
        "intTime": 20090505, 
        "postID": 38, 
        "quote": "", 
        "reply": "Oh I am sure all the Arab nations would love Israel to give up thier nukes, Not a chance. Nor should they. Viva La Israel!!!", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 16:09:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Egypt had amass 100,000 troops, 1,000 tanks along the border with Israel, the along with Jordan and Syria were to spring forward and eliminate the Jew in one effort. Along with troops from Arab states of Iraq, Saudi Arabia, Sudan, Tunisia, Morocco and Algeria also contributed troops and arms to the Arab forces. Like David and Goliath, David beat them to the punch. Had nothing to do with premptive sneak attack, but a wise thought out,\"I'm not going to wait and get my brains beat out\" punch. Once Egypts air force was permanently grounded, error in communications with the Syrians lost most of the aerial combatants with the assist of the Israel defense. Jordan was pushed out of Jerusalem and trans-jordan. Not to well known in those days if Israel had nukes or not. If the Arabs knew, why would they formulate such a war? Egypt would be the last Arab state to allow Iran nuclearize, they above all other are at odds with the Persian.", 
        "intTime": 20090505, 
        "postID": 39, 
        "quote": "", 
        "reply": "Egypt had amass 100,000 troops, 1,000 tanks along the border with Israel, the along with Jordan and Syria were to spring forward and eliminate the Jew in one effort. Along with troops from Arab states of Iraq, Saudi Arabia, Sudan, Tunisia, Morocco and Algeria also contributed troops and arms to the Arab forces. Like David and Goliath, David beat them to the punch. Had nothing to do with premptive sneak attack, but a wise thought out,\"I'm not going to wait and get my brains beat out\" punch. Once Egypts air force was permanently grounded, error in communications with the Syrians lost most of the aerial combatants with the assist of the Israel defense. Jordan was pushed out of Jerusalem and trans-jordan. Not to well known in those days if Israel had nukes or not. If the Arabs knew, why would they formulate such a war? Egypt would be the last Arab state to allow Iran nuclearize, they above all other are at odds with the Persian.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-05 16:21:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I know NSNN that you cannot read my posts, but i will reply to your bashing nonetheless. \"How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful?\" Nukes were after 67. Prior to that there have been no nukes. Furthermore, in 67 Israel had cause belli-Egypt has closed the straits, and thus broke the freedom of the seas law. Need i to remind you that US had TWICE fought for this very reason? One of these reasons was ww1, which was hundreds of times more bloodier than the pitiful sandbox brawl we had up here. In 56 we had cause belli as well-the fedayun attacks from Egypt. In 48 WE have been attacked. After 67, we have been attacked in 73 (DESPITE having nukes, so your bashing is baseless once again). In 1982 we had attacked PLO, not Lebanon, and this too, after numerous rocket attacks and suicide attacks and other attacks. So, as usual, this is clueless bashing. Way to go, Mr. Finally, if these nukes are so destabilizing, we should have seen much more wars because of them. Strangely enough, all we had was only ONE \"real\" war (1973). The rest were wars against terrorists. Oh, and we had 2 peace agreements. As to your baseless and clueless claim that we had used nuclear blackmail in order to get a better deal in these agreements, i will task you to prove it, and explain why we had returned to Egypt EVERYTHING we took.", 
        "intTime": 20090507, 
        "postID": 40, 
        "quote": "", 
        "reply": "I know NSNN that you cannot read my posts, but i will reply to your bashing nonetheless. \"How many times has Israel attacked its neighbors knowing full well they would not dare strike back? What concessions have they been \"forced\" to make In order to make the peace process successful?\" Nukes were after 67. Prior to that there have been no nukes. Furthermore, in 67 Israel had cause belli-Egypt has closed the straits, and thus broke the freedom of the seas law. Need i to remind you that US had TWICE fought for this very reason? One of these reasons was ww1, which was hundreds of times more bloodier than the pitiful sandbox brawl we had up here. In 56 we had cause belli as well-the fedayun attacks from Egypt. In 48 WE have been attacked. After 67, we have been attacked in 73 (DESPITE having nukes, so your bashing is baseless once again). In 1982 we had attacked PLO, not Lebanon, and this too, after numerous rocket attacks and suicide attacks and other attacks. So, as usual, this is clueless bashing. Way to go, Mr. Finally, if these nukes are so destabilizing, we should have seen much more wars because of them. Strangely enough, all we had was only ONE \"real\" war (1973). The rest were wars against terrorists. Oh, and we had 2 peace agreements. As to your baseless and clueless claim that we had used nuclear blackmail in order to get a better deal in these agreements, i will task you to prove it, and explain why we had returned to Egypt EVERYTHING we took.", 
        "threadID": "672198221_2500015222001", 
        "time": "2009-05-07 08:00:00", 
        "title": "Egypt: Israeli nukes 'greatest threat'", 
        "userID": "PanzerMeister"
    }
]