[
    {
        "content": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them?", 
        "reply": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right?  Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 03:36:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 04:59:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know?", 
        "reply": " Nothing.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\"", 
        "reply": " Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 07:32:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Esample1"
    }, 
    {
        "content": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "", 
        "reply": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:11:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "intTime": 20090530, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: Oh the horror!", 
        "reply": " No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:14:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "", 
        "reply": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:22:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now. This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "reply": " This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:30:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 12, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:19:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "", 
        "reply": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:41:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "reply": " Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:46:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want.", 
        "reply": " Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:53:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:54:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "intTime": 20090530, 
        "postID": 17, 
        "quote": "Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:00:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "intTime": 20090530, 
        "postID": 18, 
        "quote": "", 
        "reply": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:05:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "typo above>>> Their..not thier! Oops!", 
        "intTime": 20090530, 
        "postID": 19, 
        "quote": "", 
        "reply": "typo above>>> Their..not thier! Oops!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:07:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave Don't listen to Rush. Nevertheless, it is true.", 
        "intTime": 20090530, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "reply": " Don't listen to Rush. Nevertheless, it is true.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:09:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 21, 
        "quote": "It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them?", 
        "reply": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right?  Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 03:36:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "intTime": 20090530, 
        "postID": 22, 
        "quote": "", 
        "reply": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 04:59:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "intTime": 20090530, 
        "postID": 23, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know?", 
        "reply": " Nothing.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 24, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "intTime": 20090530, 
        "postID": 25, 
        "quote": "", 
        "reply": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "intTime": 20090530, 
        "postID": 26, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\"", 
        "reply": " Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 07:32:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Esample1"
    }, 
    {
        "content": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "intTime": 20090530, 
        "postID": 27, 
        "quote": "", 
        "reply": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "intTime": 20090530, 
        "postID": 28, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:11:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "intTime": 20090530, 
        "postID": 29, 
        "quote": "Originally posted by Grachus: Oh the horror!", 
        "reply": " No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:14:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 30, 
        "quote": "", 
        "reply": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:22:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now. This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "intTime": 20090530, 
        "postID": 31, 
        "quote": "Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "reply": " This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:30:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 32, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:19:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "intTime": 20090530, 
        "postID": 33, 
        "quote": "", 
        "reply": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:41:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "intTime": 20090530, 
        "postID": 34, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "reply": " Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:46:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 35, 
        "quote": "Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want.", 
        "reply": " Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:53:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 36, 
        "quote": "Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:54:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:00:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "intTime": 20090530, 
        "postID": 38, 
        "quote": "", 
        "reply": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:05:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "typo above>>> Their..not thier! Oops!", 
        "intTime": 20090530, 
        "postID": 39, 
        "quote": "", 
        "reply": "typo above>>> Their..not thier! Oops!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:07:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave Don't listen to Rush. Nevertheless, it is true.", 
        "intTime": 20090530, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "reply": " Don't listen to Rush. Nevertheless, it is true.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:09:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 41, 
        "quote": "It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them?", 
        "reply": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right?  Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 03:36:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "intTime": 20090530, 
        "postID": 42, 
        "quote": "", 
        "reply": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 04:59:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "intTime": 20090530, 
        "postID": 43, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know?", 
        "reply": " Nothing.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 44, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "intTime": 20090530, 
        "postID": 45, 
        "quote": "", 
        "reply": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "intTime": 20090530, 
        "postID": 46, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\"", 
        "reply": " Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 07:32:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Esample1"
    }, 
    {
        "content": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "intTime": 20090530, 
        "postID": 47, 
        "quote": "", 
        "reply": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "intTime": 20090530, 
        "postID": 48, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:11:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "intTime": 20090530, 
        "postID": 49, 
        "quote": "Originally posted by Grachus: Oh the horror!", 
        "reply": " No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:14:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 50, 
        "quote": "", 
        "reply": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:22:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now. This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "intTime": 20090530, 
        "postID": 51, 
        "quote": "Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "reply": " This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:30:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 52, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:19:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "intTime": 20090530, 
        "postID": 53, 
        "quote": "", 
        "reply": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:41:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "intTime": 20090530, 
        "postID": 54, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "reply": " Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:46:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 55, 
        "quote": "Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want.", 
        "reply": " Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:53:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 56, 
        "quote": "Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:54:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "intTime": 20090530, 
        "postID": 57, 
        "quote": "Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:00:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "intTime": 20090530, 
        "postID": 58, 
        "quote": "", 
        "reply": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:05:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "typo above>>> Their..not thier! Oops!", 
        "intTime": 20090530, 
        "postID": 59, 
        "quote": "", 
        "reply": "typo above>>> Their..not thier! Oops!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:07:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave Don't listen to Rush. Nevertheless, it is true.", 
        "intTime": 20090530, 
        "postID": 60, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "reply": " Don't listen to Rush. Nevertheless, it is true.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:09:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 61, 
        "quote": "It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them?", 
        "reply": "What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right?  Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 03:36:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "intTime": 20090530, 
        "postID": 62, 
        "quote": "", 
        "reply": "A translation from what? Pravda? From porn stars to missile systems them Rooshians are 'wannabees'. They forgot about commodities futures. And derivitives ... the road to salivation is paved with derivatives. And religion? Faith is a multi-billion dollar (make that multi quadrillion ruble) corporate enterprise. Gawd is the original CEO, and junior is his point man.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 04:59:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "intTime": 20090530, 
        "postID": 63, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know?", 
        "reply": " Nothing.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 64, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " Exactly, just like their close kin here in America - socialists and Dear Leader. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "intTime": 20090530, 
        "postID": 65, 
        "quote": "", 
        "reply": "Izvestia (\"News\") was a daily newspaper in Russia, and Pravda (\"Truth\") was the official newspaper of the Communist Party of the Soviet Union. There is an old Russian expression, taught us at the Defense Language Institute, West Coast in 1969, which translates into English as: \"In Truth (Pravda) there is no News (Izvestia), and in News (Izvestia) there is no Truth (Pravda).\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 06:50:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "intTime": 20090530, 
        "postID": 66, 
        "quote": "Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? quote: It must be said, that like the breaking of a great dam, the American decent into Marxism is happening with breath taking speed, against the back drop of a passive, hapless sheeple, excuse me dear reader, I meant people. True, the situation has been well prepared on and off for the past century, especially the past twenty years. The initial testing grounds was conducted upon our Holy Russia and a bloody test it was. But we Russians would not just roll over and give up our freedoms and our souls, no matter how much money Wall Street poured into the fists of the Marxists. Those lessons were taken and used to properly prepare the American populace for the surrender of their freedoms and souls, to the whims of their elites and betters. First, the population was dumbed down through a politicized and substandard education system based on pop culture, rather then the classics. Americans know more about their favorite TV dramas then the drama in DC that directly affects their lives. They care more for their \"right\" to choke down a McDonalds burger or a BurgerKing burger than for their constitutional rights. Then they turn around and lecture us about our rights and about our \"democracy\". Pride blind the foolish. Then their faith in God was destroyed, until their churches, all tens of thousands of different \"branches and denominations\" were for the most part little more then Sunday circuses and their televangelists and top protestant mega preachers were more then happy to sell out their souls and flocks to be on the \"winning\" side of one pseudo Marxist politician or another. Their flocks may complain, but when explained that they would be on the \"winning\" side, their flocks were ever so quick to reject Christ in hopes for earthly power. Even our Holy Orthodox churches are scandalously liberalized in America. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\"", 
        "reply": " Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 07:32:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Esample1"
    }, 
    {
        "content": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "intTime": 20090530, 
        "postID": 67, 
        "quote": "", 
        "reply": "The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:06:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "intTime": 20090530, 
        "postID": 68, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing.", 
        "reply": " An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:11:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "intTime": 20090530, 
        "postID": 69, 
        "quote": "Originally posted by Grachus: Oh the horror!", 
        "reply": " No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:14:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "RRR52"
    }, 
    {
        "content": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 70, 
        "quote": "", 
        "reply": "So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:22:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now. This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "intTime": 20090530, 
        "postID": 71, 
        "quote": "Originally posted by RRR52: The former Soviets should know of what they write. All the rationalizations and protestations by leftists and right apologists afraid to call the degradation of American freedom for what it has become are wrong, as honest and informed Americans have seen for a number of months now.", 
        "reply": " This article was NOT translated from the Russian. The author is one of two things, either an American Expatriat now living in Russia, or this is part of the KGB. There is in fact nothing on this guys home page that is in Russian. His writing is American English, with typical mispellings of an American. \"http://mat-rodina.blogspot.com/\" Moreover \"Pravda\" is nothing more than the Enquirer... Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 08:30:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 72, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Grachus: Oh the horror! No horror at all for leftist nihilists and their self-destructive, freedom-destroying attitudes and behaviors.", 
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:19:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "jack_flats"
    }, 
    {
        "content": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "intTime": 20090530, 
        "postID": 73, 
        "quote": "", 
        "reply": "A \"backup source\" \"http://www.gretawire.com/2009/05/30/dumbed-down-us-i-know-you-have-a-comment\" Or just go to \"http://www.gretawire.blogs.foxnews.com/\" Our very own MSM is asleep at the wheel, IMO. And, once again, the Russians are right. It should be great sport for them watching America become just another 3rd World garbage pit. Socialism/Marxism is not the American Way!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:41:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "intTime": 20090530, 
        "postID": 74, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave", 
        "reply": " Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:46:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want. Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "intTime": 20090530, 
        "postID": 75, 
        "quote": "Originally posted by jack_flats: So, in order to hear and believe exactly what you want to hear in order to comply with your beliefs, no matter how radical, people here are resorting to reading and believing a communist publication? Just goes to prove, that if one digs deep enough in the world of print, that they can find just about anything they want.", 
        "reply": " Tax revenues continue to plummet and the obama deficit soars. The government is taking over private enterprise and banks, and nationalizing healthcare. Unemployment is up to almost 10 percent and continues to rise in spite of obama's lies about \"saving\" jobs. The GDP has dropped over 6% while the economy suffers it's worst contractions in history. Cap and trade and green technology schemes are being devised which will significantly raise the price of energy and the cost of virtually all goods and services. Our blind obedience to the statists who now run America is marching this Country and our freedoms right into the waiting arms of Socialism. \"The World's Finest\"", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:53:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 76, 
        "quote": "Originally posted by Agent991: quote: Originally posted by Grachus: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: What do they know that we don't know? Nothing. An opinion piece from Russian Pravda? Well, here's more bad news for the West from the same issue... quote: Russian physiologist Leonid Kitaev-Smyk has stated that most male diseases are caused by women who adhere to provocative clothes and behaviour. As a result, the Western civilization gradually turns into the society of sexually unsatisfied men and eventually unsuccessful and physically unhealthy men, the scientist considers. Men become impotents because of women's low-cut dresses and bare legs US researchers published results of their 30-year-long work. It suggested that 80 percent of men aged over 60 who died for different reasons had prostate cancer apart from other diseases. Every third American and European male aged over 30 has problems with potency and the prostate gland. The situation is quite different in the Muslim East. Arabs have the lowest rates of prostate cancer. Scientists considered that it depends on climate and meals and studied carefully the Oriental diet and tried to find any food with preventive action. They failed, although the clue is quite obvious. Since the start of the sexual revolution women of the developed world took to wearing revealing clothes, while Oriental women still wear gowns and yashmaks, said Leonid Kitaev-Smyk, the senior research officer of the Russian Research Institute of Culturology of the Russian Academy of Sciences. In the street men cannot satisfy all desires they have. They see naked parts of the body – miniskirts and transparent tops. The modern fashion gives rise to male lust. So there is much lust, but little satisfaction. What does it have to do with the disease? We can draw an analogy with the fauna. If a male is weak, a female will see it and reject the male. This male cannot win a female, for there is a defensive mechanism in nature – this male suffers from prostatitis and impotency. Nowadays, 70 percent of impotency is a natural defensive reaction to stresses caused by constant unsatisfied arousal. But this reaction is rather long-standing. Oh the horror! Dave Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " That's a form of Stimulus isn't it? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 09:54:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "intTime": 20090530, 
        "postID": 77, 
        "quote": "Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research!", 
        "reply": " Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:00:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "intTime": 20090530, 
        "postID": 78, 
        "quote": "", 
        "reply": "quote: Originally posted by Kegler300: What do they know that we don't know? This is just the kind of \"hope and change\" Americans wanted...right? Compare Duvall Patrick and BHO side-by-side for the \"Hope and Change\" Speech. Identical as both campaigns were marketed by Axelrod. It is on YouTube. The final collapse has come with the election of Barack Obama. His speed in the past three months has been truly impressive. His spending and money printing has been a record setting, not just in America's short history but in the world. If this keeps up for more then another year, and there is no sign that it will not, America at best will resemble the Wiemar Republic and at worst Zimbabwe. YEP! IMO These past two weeks have been the most breath taking of all. First came the announcement of a planned redesign of the American Byzantine tax system, by the very thieves who used it to bankroll their thefts, loses and swindles of hundreds of billions of dollars. These make our Russian oligarchs look little more then ordinary street thugs, in comparison. Yes, the Americans have beat our own thieves in the shear volumes. Should we congratulate them? Not yet! We still have some time. So, no \"congratulations\" quite yet.I did not want the hopey-changey and YES WE CAN!! Empty Slogans? OR \"WORDS? JUST WORDS??\" The USA has thier Hope and Change! But were are we now? Quite close to Marxism, IMO! Pray it aint so!! Source: \"http://english.pravda.ru/opinion/columnists/107459-0/\" Do you realize you just posted an article that is attacking American society and capitalism? Then it calls the election of Obama \"the final collapse.\" The First Amnendment. Freedom of Speech", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:05:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "typo above>>> Their..not thier! Oops!", 
        "intTime": 20090530, 
        "postID": 79, 
        "quote": "", 
        "reply": "typo above>>> Their..not thier! Oops!", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:07:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave Don't listen to Rush. Nevertheless, it is true.", 
        "intTime": 20090530, 
        "postID": 80, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Agent991: Oh the horror! Our very own Gov't aka BHO and his \"Stimulus\" Package is funding a research in China to see if Chinese 'call-girls' put out more easily if they are intoxicated. Millions in the \"Stimulus\" just for this research! Did you make that up on your own, or did you need Rush to spoon feed it to you? Dave", 
        "reply": " Don't listen to Rush. Nevertheless, it is true.", 
        "threadID": "672198221_3710056422001", 
        "time": "2009-05-30 10:09:00", 
        "title": "PRAVDA - America Decent in Marxism at Breakneck Speed", 
        "userID": "Agent991"
    }
]