[
    {
        "content": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/ quote: From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted. Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted.", 
        "reply": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/  Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:01:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:05:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "intTime": 20090420, 
        "postID": 3, 
        "quote": "", 
        "reply": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "sw614"
    }, 
    {
        "content": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "intTime": 20090420, 
        "postID": 4, 
        "quote": "", 
        "reply": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "intTime": 20090420, 
        "postID": 5, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "intTime": 20090420, 
        "postID": 6, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:21:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "intTime": 20090420, 
        "postID": 7, 
        "quote": "Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "reply": " the red hot poker in the butt is what he should of gotten...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "intTime": 20090420, 
        "postID": 8, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "reply": " On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 11:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "intTime": 20090420, 
        "postID": 9, 
        "quote": "", 
        "reply": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:33:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Motive25"
    }, 
    {
        "content": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "intTime": 20090420, 
        "postID": 10, 
        "quote": "", 
        "reply": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "namvet656"
    }, 
    {
        "content": "quote: Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "intTime": 20090420, 
        "postID": 11, 
        "quote": "Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "reply": " Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:45:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "intTime": 20090420, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "reply": " hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "intTime": 20090420, 
        "postID": 13, 
        "quote": "", 
        "reply": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:56:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html quote: Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics): 'We do not torture' George W. Bush", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics):", 
        "reply": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html  'We do not torture' George W. Bush", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:04:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "intTime": 20090420, 
        "postID": 16, 
        "quote": "", 
        "reply": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "intTime": 20090420, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "intTime": 20090420, 
        "postID": 18, 
        "quote": "", 
        "reply": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be... George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "intTime": 20090420, 
        "postID": 19, 
        "quote": "Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "reply": " George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:13:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office. OK, is this in response to something or are you just putting out random thoughts?", 
        "intTime": 20090420, 
        "postID": 20, 
        "quote": "Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "reply": " OK, is this in response to something or are you just putting out random thoughts?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:20:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/ quote: From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted. Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "intTime": 20090420, 
        "postID": 21, 
        "quote": "From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted.", 
        "reply": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/  Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:01:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "intTime": 20090420, 
        "postID": 22, 
        "quote": "", 
        "reply": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:05:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "intTime": 20090420, 
        "postID": 23, 
        "quote": "", 
        "reply": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "sw614"
    }, 
    {
        "content": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "intTime": 20090420, 
        "postID": 24, 
        "quote": "", 
        "reply": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "intTime": 20090420, 
        "postID": 25, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "intTime": 20090420, 
        "postID": 26, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:21:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "intTime": 20090420, 
        "postID": 27, 
        "quote": "Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "reply": " the red hot poker in the butt is what he should of gotten...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "intTime": 20090420, 
        "postID": 28, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "reply": " On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 11:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "intTime": 20090420, 
        "postID": 29, 
        "quote": "", 
        "reply": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:33:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Motive25"
    }, 
    {
        "content": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "intTime": 20090420, 
        "postID": 30, 
        "quote": "", 
        "reply": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "namvet656"
    }, 
    {
        "content": "quote: Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "intTime": 20090420, 
        "postID": 31, 
        "quote": "Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "reply": " Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:45:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "intTime": 20090420, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "reply": " hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "intTime": 20090420, 
        "postID": 33, 
        "quote": "", 
        "reply": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:56:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "intTime": 20090420, 
        "postID": 34, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html quote: Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics): 'We do not torture' George W. Bush", 
        "intTime": 20090420, 
        "postID": 35, 
        "quote": "Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics):", 
        "reply": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html  'We do not torture' George W. Bush", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:04:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "intTime": 20090420, 
        "postID": 36, 
        "quote": "", 
        "reply": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "intTime": 20090420, 
        "postID": 37, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "intTime": 20090420, 
        "postID": 38, 
        "quote": "", 
        "reply": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be... George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "intTime": 20090420, 
        "postID": 39, 
        "quote": "Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "reply": " George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:13:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office. OK, is this in response to something or are you just putting out random thoughts?", 
        "intTime": 20090420, 
        "postID": 40, 
        "quote": "Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "reply": " OK, is this in response to something or are you just putting out random thoughts?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:20:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/ quote: From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted. Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "intTime": 20090420, 
        "postID": 41, 
        "quote": "From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted.", 
        "reply": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/  Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:01:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "intTime": 20090420, 
        "postID": 42, 
        "quote": "", 
        "reply": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:05:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "intTime": 20090420, 
        "postID": 43, 
        "quote": "", 
        "reply": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "sw614"
    }, 
    {
        "content": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "intTime": 20090420, 
        "postID": 44, 
        "quote": "", 
        "reply": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "intTime": 20090420, 
        "postID": 45, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "intTime": 20090420, 
        "postID": 46, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:21:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "intTime": 20090420, 
        "postID": 47, 
        "quote": "Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "reply": " the red hot poker in the butt is what he should of gotten...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "intTime": 20090420, 
        "postID": 48, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "reply": " On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 11:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "intTime": 20090420, 
        "postID": 49, 
        "quote": "", 
        "reply": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:33:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Motive25"
    }, 
    {
        "content": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "intTime": 20090420, 
        "postID": 50, 
        "quote": "", 
        "reply": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "namvet656"
    }, 
    {
        "content": "quote: Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "intTime": 20090420, 
        "postID": 51, 
        "quote": "Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "reply": " Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:45:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "intTime": 20090420, 
        "postID": 52, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "reply": " hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "intTime": 20090420, 
        "postID": 53, 
        "quote": "", 
        "reply": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:56:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "intTime": 20090420, 
        "postID": 54, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html quote: Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics): 'We do not torture' George W. Bush", 
        "intTime": 20090420, 
        "postID": 55, 
        "quote": "Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics):", 
        "reply": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html  'We do not torture' George W. Bush", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:04:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "intTime": 20090420, 
        "postID": 56, 
        "quote": "", 
        "reply": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "intTime": 20090420, 
        "postID": 57, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "intTime": 20090420, 
        "postID": 58, 
        "quote": "", 
        "reply": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be... George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "intTime": 20090420, 
        "postID": 59, 
        "quote": "Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "reply": " George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:13:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office. OK, is this in response to something or are you just putting out random thoughts?", 
        "intTime": 20090420, 
        "postID": 60, 
        "quote": "Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "reply": " OK, is this in response to something or are you just putting out random thoughts?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:20:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/ quote: From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted. Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "intTime": 20090420, 
        "postID": 61, 
        "quote": "From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted.", 
        "reply": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/  Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:01:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "intTime": 20090420, 
        "postID": 62, 
        "quote": "", 
        "reply": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:05:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "intTime": 20090420, 
        "postID": 63, 
        "quote": "", 
        "reply": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "sw614"
    }, 
    {
        "content": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "intTime": 20090420, 
        "postID": 64, 
        "quote": "", 
        "reply": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "intTime": 20090420, 
        "postID": 65, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "intTime": 20090420, 
        "postID": 66, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:21:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "intTime": 20090420, 
        "postID": 67, 
        "quote": "Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "reply": " the red hot poker in the butt is what he should of gotten...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "intTime": 20090420, 
        "postID": 68, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "reply": " On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 11:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "intTime": 20090420, 
        "postID": 69, 
        "quote": "", 
        "reply": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:33:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Motive25"
    }, 
    {
        "content": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "intTime": 20090420, 
        "postID": 70, 
        "quote": "", 
        "reply": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "namvet656"
    }, 
    {
        "content": "quote: Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "intTime": 20090420, 
        "postID": 71, 
        "quote": "Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "reply": " Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:45:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "intTime": 20090420, 
        "postID": 72, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "reply": " hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "intTime": 20090420, 
        "postID": 73, 
        "quote": "", 
        "reply": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:56:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "intTime": 20090420, 
        "postID": 74, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html quote: Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics): 'We do not torture' George W. Bush", 
        "intTime": 20090420, 
        "postID": 75, 
        "quote": "Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics):", 
        "reply": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html  'We do not torture' George W. Bush", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:04:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "intTime": 20090420, 
        "postID": 76, 
        "quote": "", 
        "reply": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "intTime": 20090420, 
        "postID": 77, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "intTime": 20090420, 
        "postID": 78, 
        "quote": "", 
        "reply": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be... George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "intTime": 20090420, 
        "postID": 79, 
        "quote": "Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "reply": " George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:13:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office. OK, is this in response to something or are you just putting out random thoughts?", 
        "intTime": 20090420, 
        "postID": 80, 
        "quote": "Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "reply": " OK, is this in response to something or are you just putting out random thoughts?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:20:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/ quote: From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted. Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "intTime": 20090420, 
        "postID": 81, 
        "quote": "From the CNN Article: WASHINGTON (CNN) -- CIA interrogators used waterboarding at least 266 times on two top al Qaeda suspects, according to a Bush-era Justice Department memo released by the Obama administration. Khalid Sheikh Mohammed, seen in a December sketch, was waterboarded 183 times in a month, a memo says. The controversial technique that simulates drowning -- and which President Obama calls torture -- was used at least 83 times in August 2002 on suspected al Qaeda leader Abu Zubaydah, according to the memo. Interrogators also waterboarded Khalid Sheikh Mohammed 183 times in March 2003. Mohammed is believed to be the mastermind behind the September 11, 2001, terrorist attacks on the United States. Obama released the memo Thursday, saying that \"exceptional circumstances surround these memos and require their release.\" Watch other tactics outlined in memos » The memo, dated May 30, 2005, was from then-Deputy Assistant Attorney General Steven G. Bradbury to John Rizzo, who was acting general counsel for the CIA. It paints a different picture from the one described by former CIA officer John Kiriakou. In a December 2007 interview with CNN, Kiriakou said Zubaydah had been waterboarded for \"about 30 seconds, 35 seconds\" and agreed to cooperate with interrogators the following day. In an interview on \"Fox News Sunday,\" Michael Hayden, who directed the CIA from 2006 to 2009, was asked about the number of times Mohammed was waterboarded. Don't Miss Bush-era memo defines torture CIA ex-chief: Obama risks security Court papers: CIA destroys interrogation tapes Senate panel to review Bush's CIA programs Hayden denounced the release of the memos and did not comment on the number, saying it was his understanding that the frequency of waterboarding was among the operational details that had not been declassified. Watch one expert say tactics 'worse than Abu Ghraib' » The 2005 memo refers to a letter that had contained the numbers as well. Part of the reference to the letter was redacted in the released memo. Waterboarding is among the interrogation tactics that Obama has prohibited through an executive order. The CIA also has admitted waterboarding Abd al-Rahim al-Nashiri, the first person charged in the United States for the 2000 attack on the USS Cole in Yemen that killed 17 U.S. sailors. Obama said last week he felt comfortable releasing the classified memos because the Bush administration acknowledged using some of the practices associated with the memos, and the interrogation techniques were widely reported and have since been banned. \"Withholding these memos would only serve to deny facts that have been in the public domain for some time,\" Obama said in a statement. \"This could contribute to an inaccurate accounting of the past, and fuel erroneous and inflammatory assumptions about actions taken by the United States.\" The president applauded the work of the U.S. intelligence community and said no one who \"carried out their duties relying in good faith upon legal advice from the Department of Justice\" would be prosecuted.", 
        "reply": "++http://www.cnn.com/2009/POLITICS/04/20/cia.waterboarding/  Wow!! 183 times! In one month?!?!? What? The first 182 didn't work????", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:01:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "intTime": 20090420, 
        "postID": 82, 
        "quote": "", 
        "reply": "yea too bad we dint do stuff like they did on the Tudors last night....", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:05:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "intTime": 20090420, 
        "postID": 83, 
        "quote": "", 
        "reply": "Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "sw614"
    }, 
    {
        "content": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "intTime": 20090420, 
        "postID": 84, 
        "quote": "", 
        "reply": "I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 09:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "intTime": 20090420, 
        "postID": 85, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " Right, why are we being such whoosies? Can you imagine? For over 200 years left wing radicals and commie symps, actually \"claimed (can you believe this) that taking the high moral ground was one of the things that made America Strong. These wimps, even as far back as the Revolution refused to adapt British tactics of murdering prisoners. Actually ordered Americans NOT to take revenge. Now finally we've seen the light, and who cares if the rest of the world is no longer making these stupid distinctions between us and them? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building? I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "intTime": 20090420, 
        "postID": 86, 
        "quote": "Originally posted by stec74: I wonder what type of torture is worse? \"Water Boarding\" or having to choose how you die, by either burning to death or jumping from a 110 story building?", 
        "reply": " I'm sorry? Did you just compare waterboarding to dying? Is that the standard? Maybe compare it to jumping off a building 183 times? Except you don't feel pain when you hit the ground. Your body would explode and you'd die instantly. So that's a bad comparison.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:21:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "intTime": 20090420, 
        "postID": 87, 
        "quote": "Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard...", 
        "reply": " the red hot poker in the butt is what he should of gotten...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 10:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "intTime": 20090420, 
        "postID": 88, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten...", 
        "reply": " On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 11:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "intTime": 20090420, 
        "postID": 89, 
        "quote": "", 
        "reply": "So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:33:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Motive25"
    }, 
    {
        "content": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "intTime": 20090420, 
        "postID": 90, 
        "quote": "", 
        "reply": "They shouldn't waterboard. Pulling finger/toe nails or crushing testicles would be more effective!!!!", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:38:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "namvet656"
    }, 
    {
        "content": "quote: Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "intTime": 20090420, 
        "postID": 91, 
        "quote": "Originally posted by Motive25: So this is what the Bush League fought (and is still fighting) tooth & nail to retain: an \"enhanced interrogation technique\" that is so ineffective that it obviously never \"broke\" the guy? The way they talked, one would think that the mere threat of repeated waterboarding after one session would be enough to get KSM and AZ to sing like canaries. Not only was it ineffective, but it severely damaged our moral standing in the world and created a great recruiting incentive for AQ- lose/lose/lose for us", 
        "reply": " Oh I think it \"worked.\" KSM has confessed publicly to crimes that he couldn't possibly have commited. If they asked him, he would confess to raping Mother Teresa. In fact, you can't get this guy to stop \"confessing.\" How anyone can call this reliable intelligence is beyond me. Might as well establish a secret intelligence facility where they sit around using a ouiji board. Here's how we USED to get reliable intelligence: \"http://www.theatlantic.com/doc/200506/budiansky\" Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:45:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "intTime": 20090420, 
        "postID": 92, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave", 
        "reply": " hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:48:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "outlaws93"
    }, 
    {
        "content": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "intTime": 20090420, 
        "postID": 93, 
        "quote": "", 
        "reply": "I have been a supporter of all enhanced interrogation tactics, but this news surprised me....I did not expect these numbers, I thought they would have waterboarded him over 1000 times...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:56:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "intTime": 20090420, 
        "postID": 94, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " You have a point there. It only USED to be torture. But if someone says it's not, then they MUST be right? Interesting the case I'm referring to with TR was a case of waterboarding. TR being a limp wristed woose, called it torture... \"http://www.politico.com/news/stories/1007/6647.html\" Can you imagine? Someone should have told him, \"Look Teddy, all you have to do is say that it's NOT torture and the sheep will stampede to believe it.\" Of course Old TR was a Democrat so you can expect things like that from them. Hmm? He was a Democrat right? Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 12:58:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html quote: Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics): 'We do not torture' George W. Bush", 
        "intTime": 20090420, 
        "postID": 95, 
        "quote": "Freezing prisoners to near-death, repeated beatings, long forced-standing, waterboarding , cold showers in air-conditioned rooms, stress positions [Arrest mit Verschaerfung], withholding of medicine and leaving wounded or sick prisoners alone in cells for days on end - all these have occurred at US detention camps under the command of president George W. Bush. Over a hundred documented deaths have occurred in these interrogation sessions. The Pentagon itself has conceded ****cide by torture in multiple cases. Notice the classic, universal and simple criterion used to define torture in 1948 (my italics):", 
        "reply": "\"Verschärfte Vernehmung\" is German for \" enhanced interrogation \". http://andrewsullivan.theatlantic.com/the_daily_dish/2007/05/verschfte_verne.html  'We do not torture' George W. Bush", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:04:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "intTime": 20090420, 
        "postID": 96, 
        "quote": "", 
        "reply": "Waterboarding is not torture.....watching liberals call themselves \"tuff\" and \"Americans\" is hard enough to stomach...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is... \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "intTime": 20090420, 
        "postID": 97, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by sw614: Maybe they should have gone for 184....You know, actually drown the rat baztard... the red hot poker in the butt is what he should of gotten... On this thread, that's MY point Outlaw. And commies like Washinton or Lincoln or even Teddy Roosevelt would actually have had you shot for doing that. In fact, Roosevelt had a General court martialed for torturing murderers, and when the guy was aquited, actually overuled the Court and tossed his butt out of the Army - Teddy was another Commie symp. Dave hehehe well you just kind of made the point i was getting at....we dont torture.... and when someone does they get into big trouble... and waterboarding isnt torture.... what the was done in the movie is what real torture is...", 
        "reply": " \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:06:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "intTime": 20090420, 
        "postID": 98, 
        "quote": "", 
        "reply": "I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:11:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be... George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "intTime": 20090420, 
        "postID": 99, 
        "quote": "Originally posted by Ol_Doc: \"After World War II, we convicted several Japanese soldiers for waterboarding American and Allied prisoners of war. At the trial of his captors, then-Lt. Chase J. Nielsen, one of the 1942 Army Air Forces officers who flew in the Doolittle Raid and was captured by the Japanese, testified: \"I was given several types of torture. . . . I was given what they call the water cure.\" He was asked what he felt when the Japanese soldiers poured the water. \"Well, I felt more or less like I was drowning,\" he replied, \"just gasping between life and death.\" Nielsen's experience was not unique. Nor was the prosecution of his captors. After Japan surrendered, the United States organized and participated in the International Military Tribunal for the Far East, generally called the Tokyo War Crimes Trials. Leading members of Japan's military and government elite were charged, among their many other crimes, with torturing Allied military personnel and civilians. The principal proof upon which their torture convictions were based was conduct that we would now call waterboarding.\" \"http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html Apparently it use to be...", 
        "reply": " George Orwell was a pretty prescient guy. \"Words mean what we say they mean.\" So waterboarding is not torture, because we say it's not torture. Big deal! So we used to call it torture? But now we don't, so how Could it be torture? What's funny in the black humour department is a certain self induced state of denial, because many of those who deny it's torture also WANT us to use torture. Talk about mental disconnects. Dave", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:13:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office. OK, is this in response to something or are you just putting out random thoughts?", 
        "intTime": 20090420, 
        "postID": 100, 
        "quote": "Originally posted by rayevinsonsr: I know too many men that gave time, labor and their lives to the commie symps you humorous refer to. Nations were were placed in bondage. Their own population suffered. I guess we we were not smart enough to think of the greater good that the Soviets were accomplishing the world over how thoughtless of us to stand in their way. A mirror image just 90 miles from our shores. The President must have used as much water as the 183 waterboarding trying to put out the fires at Langley today. A little surprise visit reiterating the importance of the CIA, taking the high morale ground, with accompanying smoke up their 6 of not being prosecuted. Releasing reports that got bad reviews from all past director's of the agency and before the morale high ground speech again it was not a matter of waterboarding or any kind of treatment was right or wrong, it's releasing the reports that sucks. Like the Marines Haditha Americans are placing thier lives on the line and some lawyer in a suit wants your blood too. A survey early on in the campaign in Iraq showed the average soldier feared ending up in an American court than getting into trouble in Iraq. The CIA can resign and walk a lot easier than a Marine. Leon must have called in reinforcements from the oval office.", 
        "reply": " OK, is this in response to something or are you just putting out random thoughts?", 
        "threadID": "672198221_2270062122001", 
        "time": "2009-04-20 13:20:00", 
        "title": "Justice Department:  KSM waterboarded 183 times!!!", 
        "userID": "Ol_Doc"
    }
]