[
    {
        "content": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "intTime": 20090324,
        "postID": 1,
        "quote": "",
        "reply": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:17:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "intTime": 20090324,
        "postID": 2,
        "quote": "",
        "reply": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:26:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt: quote: The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\" To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "intTime": 20090324,
        "postID": 3,
        "quote": "The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\"",
        "reply": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt:  To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:40:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "intTime": 20090324,
        "postID": 4,
        "quote": "",
        "reply": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 20:04:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "intTime": 20090324,
        "postID": 5,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 21:58:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "quote: overseas contingency operation Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "intTime": 20090324,
        "postID": 6,
        "quote": "overseas contingency operation",
        "reply": " Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:33:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "CYCLIC_RUNAWAY"
    },
    {
        "content": "quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "intTime": 20090324,
        "postID": 7,
        "quote": "Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror.",
        "reply": " When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "mmulder67"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "intTime": 20090324,
        "postID": 8,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "intTime": 20090324,
        "postID": 9,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:14:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: No we cannot agree. We are fighting a concept not a defined enemy. Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "intTime": 20090324,
        "postID": 10,
        "quote": "No we cannot agree. We are fighting a concept not a defined enemy.",
        "reply": " Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:27:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "intTime": 20090324,
        "postID": 11,
        "quote": "Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know.",
        "reply": " Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:56:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "intTime": 20090325,
        "postID": 12,
        "quote": "",
        "reply": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:03:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "stormtiger39"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "intTime": 20090325,
        "postID": 13,
        "quote": "Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:16:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "LineDoggie"
    },
    {
        "content": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "intTime": 20090325,
        "postID": 14,
        "quote": "",
        "reply": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "busnrete8"
    },
    {
        "content": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 15,
        "quote": "",
        "reply": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:30:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 16,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:12:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 17,
        "quote": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": "",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:43:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "intTime": 20090325,
        "postID": 18,
        "quote": "Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": " That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land? Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 19,
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "reply": " Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:54:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "intTime": 20090325,
        "postID": 20,
        "quote": "",
        "reply": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 07:00:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "intTime": 20090324,
        "postID": 21,
        "quote": "",
        "reply": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:17:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "intTime": 20090324,
        "postID": 22,
        "quote": "",
        "reply": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:26:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt: quote: The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\" To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "intTime": 20090324,
        "postID": 23,
        "quote": "The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\"",
        "reply": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt:  To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:40:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "intTime": 20090324,
        "postID": 24,
        "quote": "",
        "reply": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 20:04:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "intTime": 20090324,
        "postID": 25,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 21:58:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "quote: overseas contingency operation Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "intTime": 20090324,
        "postID": 26,
        "quote": "overseas contingency operation",
        "reply": " Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:33:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "CYCLIC_RUNAWAY"
    },
    {
        "content": "quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "intTime": 20090324,
        "postID": 27,
        "quote": "Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror.",
        "reply": " When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "mmulder67"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "intTime": 20090324,
        "postID": 28,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "intTime": 20090324,
        "postID": 29,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:14:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: No we cannot agree. We are fighting a concept not a defined enemy. Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "intTime": 20090324,
        "postID": 30,
        "quote": "No we cannot agree. We are fighting a concept not a defined enemy.",
        "reply": " Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:27:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "intTime": 20090324,
        "postID": 31,
        "quote": "Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know.",
        "reply": " Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:56:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "intTime": 20090325,
        "postID": 32,
        "quote": "",
        "reply": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:03:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "stormtiger39"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "intTime": 20090325,
        "postID": 33,
        "quote": "Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:16:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "LineDoggie"
    },
    {
        "content": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "intTime": 20090325,
        "postID": 34,
        "quote": "",
        "reply": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "busnrete8"
    },
    {
        "content": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 35,
        "quote": "",
        "reply": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:30:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 36,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:12:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 37,
        "quote": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": "",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:43:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "intTime": 20090325,
        "postID": 38,
        "quote": "Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": " That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land? Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 39,
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "reply": " Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:54:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "intTime": 20090325,
        "postID": 40,
        "quote": "",
        "reply": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 07:00:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "intTime": 20090324,
        "postID": 41,
        "quote": "",
        "reply": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:17:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "intTime": 20090324,
        "postID": 42,
        "quote": "",
        "reply": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:26:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt: quote: The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\" To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "intTime": 20090324,
        "postID": 43,
        "quote": "The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\"",
        "reply": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt:  To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:40:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "intTime": 20090324,
        "postID": 44,
        "quote": "",
        "reply": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 20:04:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "intTime": 20090324,
        "postID": 45,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 21:58:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "quote: overseas contingency operation Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "intTime": 20090324,
        "postID": 46,
        "quote": "overseas contingency operation",
        "reply": " Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:33:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "CYCLIC_RUNAWAY"
    },
    {
        "content": "quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "intTime": 20090324,
        "postID": 47,
        "quote": "Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror.",
        "reply": " When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "mmulder67"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "intTime": 20090324,
        "postID": 48,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "intTime": 20090324,
        "postID": 49,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:14:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: No we cannot agree. We are fighting a concept not a defined enemy. Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "intTime": 20090324,
        "postID": 50,
        "quote": "No we cannot agree. We are fighting a concept not a defined enemy.",
        "reply": " Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:27:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "intTime": 20090324,
        "postID": 51,
        "quote": "Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know.",
        "reply": " Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:56:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "intTime": 20090325,
        "postID": 52,
        "quote": "",
        "reply": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:03:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "stormtiger39"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "intTime": 20090325,
        "postID": 53,
        "quote": "Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:16:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "LineDoggie"
    },
    {
        "content": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "intTime": 20090325,
        "postID": 54,
        "quote": "",
        "reply": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "busnrete8"
    },
    {
        "content": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 55,
        "quote": "",
        "reply": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:30:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 56,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:12:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 57,
        "quote": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": "",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:43:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "intTime": 20090325,
        "postID": 58,
        "quote": "Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": " That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land? Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 59,
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "reply": " Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:54:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "intTime": 20090325,
        "postID": 60,
        "quote": "",
        "reply": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 07:00:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "intTime": 20090324,
        "postID": 61,
        "quote": "",
        "reply": "According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:17:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "intTime": 20090324,
        "postID": 62,
        "quote": "",
        "reply": "My only thought is...is this an opinion or an official news article...do you have a link?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:26:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt: quote: The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\" To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "intTime": 20090324,
        "postID": 63,
        "quote": "The end of the Global War on Terror -- or at least the use of that phrase -- has been codified at the Pentagon. Reports that the phrase was being retired have been circulating for some time amongst senior administration officials, and this morning speechwriters and other staff were notified via this e-mail to use \"Overseas Contingency Operation\" instead. \"Recently, in a LtGen [John] Bergman, USMC, statement for the 25 March [congressional] hearing, OMB required that the following change be made before going to the Hill,\" Dave Riedel, of the Office of Security Review, wrote in an e-mail. \"OMB says: 'This Administration prefers to avoid using the term \"Long War\" or \"Global War on Terror\" [GWOT]. Please use \"Overseas Contingency Operation.'\"",
        "reply": "Article in the Washington Post... \"In the Loop\" column. Published 24 March. Fair-use excerpt:  To answer, it's unclear in column... maybe it's an individual bureaucrat's opinion, or perhaps the formation of new policy...",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 17:40:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "FlyingRT"
    },
    {
        "content": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "intTime": 20090324,
        "postID": 64,
        "quote": "",
        "reply": "I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 20:04:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "intTime": 20090324,
        "postID": 65,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 21:58:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "quote: overseas contingency operation Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "intTime": 20090324,
        "postID": 66,
        "quote": "overseas contingency operation",
        "reply": " Sweet, I can't wait to get the Operation Overseas Contingency Medal. I bet it sports Obama sitting in a chair in front of a Mosque, similiar to the image of the Lincoln Memorial on a penny. C.R.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:33:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "CYCLIC_RUNAWAY"
    },
    {
        "content": "quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "intTime": 20090324,
        "postID": 67,
        "quote": "Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror.",
        "reply": " When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 22:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "mmulder67"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "intTime": 20090324,
        "postID": 68,
        "quote": "Originally posted by SteveDeHaven: I saw this reported on MSNBC today. Is there any word of \"overseas contingency operation\" that is incorrect in describing our involvement in Iraq and Afghanistan? I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Overseas Contingency Operation. Well. That's one bureaucratic, cowardly, ****ant way to say you've \"ended a war\". quote: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, I'm afraid there's only two possible ways to characterize your statement. Naive or disingenuous. Al Qaeda (among others) declared war. The reality based among us simply recognized it for what it really is. A total global nuclear exchange would probably take less than an hour. Not enough time for congress to declare war. I guess we'd better find a different word for the annihilation of civilization by two or more nuclear powers. While we're at it, we can fully embrace the Obama doctrine and call it something less \"scary\" and politically damaging as well. Bowling used to be called tenpin. Before that it was called ninepin. It became tenpin when \"ninepin\" was outlawed. You are correct when you assert that a war on a certain \"behavior\" doesn't lend itself to an eventual resolution, quick or otherwise. Thus it requires all the more resolve to decide to engage in one. There is war on crime. It will never end. It will ever remain necessary. There are struggles against poverty, disease, famine, ignorance etc. They can be called \"wars\" but they hardly qualify because as of yet no one has tried using heavy artillery as a solution to those issues. The Global War On Terrorists, or even Terrorism would have been a less disingenuous turn of the the tongue for the pack of political pop stars inhabiting 1600 Pennsylvania Avenue, but that just wouldn't suit their mendacious purposes would it? This message has been edited. Last edited by: M1Lase_n_Blaze, Wed 25 March 2009 04:28 AM",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "intTime": 20090324,
        "postID": 69,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " You can still post a link and it is required to do so... You merely put quotation marks \" in front of and behind the address... Respectfully, SUNLINER81",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:14:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: No we cannot agree. We are fighting a concept not a defined enemy. Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "intTime": 20090324,
        "postID": 70,
        "quote": "No we cannot agree. We are fighting a concept not a defined enemy.",
        "reply": " Yeah? Let me freaking define \"him\" for you, you.... Here he is! The guy in the back! Holding your countrymen hostage! He goes by many names: Al Qaeda, Ansar Al Sunnah, Jaish Al Mahdi, Johnny Taliban or just plain Hadji. What ever name he goes by, he and his fellow mujihideen, shahidin, and \"martyrs have one unifying purpose: The death of Americans in his time and the death of America \"God Willing\" eventually.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:27:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know. Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "intTime": 20090324,
        "postID": 71,
        "quote": "Originally posted by mmulder67: quote: Originally posted by world_king377: Unofficially we are at war. Congress may have not declared war but we are still in a war on terror. When will we know that \"terror\" has been defeated? quote: Originally posted by world_king377: Look at the \"gulf war\", Iraq never declared war on Kuwait yet it's still called the \"gulf war\". That's because there were two defined combatants. That's what makes it a \"war\". quote: Originally posted by world_king377: The \"Vietnam war\" or the \"Korean war\" both still unofficial war's or aka conflicts. Again, two defined combatants. Not just anyone who looks like they might be dangerous. quote: Originally posted by world_king377: But think about the word conflict most civil war's aren't ever declared but they are still called \"civil wars\" and not civil conflicts. How do you declare war on yourself? Do you actually think before you talk? quote: Originally posted by world_king377: The point being we have had war declared on us making the term war on terror what it is. We can all agree we are at war many of your brothers in arm's have died in this war. No we cannot agree. We are fighting a concept not a defined enemy. Terror is a broad brush that encompasses whatever the current leadership chooses to define it as. It's not a country. It's not a dictator. If it were we would know who we're fighting against. We haven't even gone after the ones that you claim have declared war on us (that being bin Laden and Afganistan) and have refocused our priorities in the wrong place. Because many of our brother's in arms have died doesn't qualify it as a war. quote: Originally posted by world_king377: What makes a war from a conflict? Should a war be called a conflict if 1 or no groups declare war on another? Who's declared war on who? When you answer that then you will know.",
        "reply": " Then you be are kidding your self if you do not think we are at war. If we aren't at war then why is it that our fellow Americans are coming home from fighting and some dieing? If they aren't fighting in a war then what are they fighting in? a paint ball game? Think before you speak you know what I meant when I said most civil wars aren't declared because most aren't yet there still called wars why is that huh. but I got to say we are in a war on terror since we are fighting define combatants who use terror as a weapon in this WAR that they declared openly against us.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-24 23:56:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "world_king377"
    },
    {
        "content": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "intTime": 20090325,
        "postID": 72,
        "quote": "",
        "reply": "Anyone who thinks that we are not fighting against terrorism are severely naive.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:03:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "stormtiger39"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them. Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "intTime": 20090325,
        "postID": 73,
        "quote": "Originally posted by SteveDeHaven: I can think of one word in \"War on Terror\" that is incorrect: \"War.\" There was no declaration of such by Congress, which is the only body authorized by the Constitution to make such a declaration. Oh, wait! I can think of another problem with \"War on Terror:\" Terror. We had the War on Poverty, the War on Drugs, the War on Illiteracy, etc. In every case, those things still exist. Concepts don't respond well to claims of war upon them.",
        "reply": " Korean War Vietnam War Indian Wars Congress didnt declare them either But they were still wars, Grasshopper.....",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 01:16:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "LineDoggie"
    },
    {
        "content": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "intTime": 20090325,
        "postID": 74,
        "quote": "",
        "reply": "Here's the text. [QUOTE] \"Obama Scraps 'Global War on Terror' for 'Overseas Contingency Operation' Obama has reportedly ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11 attacks. FOXNews.com Wednesday, March 25, 2009 Obama administration has ordered an end to use of the phrase \"Global War on Terror,\" a label adopted by the Bush administration shortly after the September 11, 2001 attacks, the Washington Post reported on Tuesday. In a memo sent this week from the Defense Department's office of security to Pentagon staffers, members were told, \"this administration prefers to avoid using the term 'Long War' or 'Global War on Terror' [GWOT.] Please use 'Overseas Contingency Operation.'\" A spokesman for the Office of Management and Budget, from whom the direction reportedly came, told the Post there was no guidance given from the agency and that it was merely the \"opinion of a career civil servant.\" The Obama administration's rhetoric has paralleled this idea, having used the \"Global Contingency Operation\" phrase for a month prior to the e-mail being sent. Craig W. Duehring, assistant secretary of the Air Force for manpower, also used the term last week. \"Key battlefield monetary incentives has allowed the Air Force to meet the demands of overseas contingency operations even as requirements continue to grow,\" he said in congressional testimony. Critics have pleaded with the Obama administration to abandon the use of \"Global War on Terror\" because they say it mischaracterizes the nature of the enemy and its abilities.[QUOTE] Let's see! I don't like the term 'toxic assets', so now we'll call them 'legacy assets'! Now, I don't like the term, 'War on Terror', so now we'll call it a \"Global Contingency Operation\"! Next week, OB or some staffer in his administration will be attacking Crayola for their definition(s) of the colors of crayons? And hope has won?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:07:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "busnrete8"
    },
    {
        "content": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 75,
        "quote": "",
        "reply": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 05:30:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts? http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 76,
        "quote": "Originally posted by FlyingRT: According to news reports (I'd post a link, but...) We will now be engaged in the Overseas Contingency Operation. Thoughts?",
        "reply": " http://www.military.com/news/article/is-war-on-terror-b...=1186032310810&wh=wh WASHINGTON -- A tiff is surfacing between the Pentagon and the U.S. Office of Management and Budget over whether excising phrases such \"global war on terror\" was ordered. In a memo distributed to Pentagon staff members, the Defense Department's Office of Security Review said \"this administration prefers to avoid using the term 'long war' or 'global war on terror'. Please use 'overseas contingency operation,'\" The Washington Post reported Wednesday. The memo said the directive came from the OMB, the executive branch agency that reviews public testimony of administration officials before it is delivered. OMB spokesman Kenneth Baer says there was no directive. \"There was no memo, no guidance,\" Baer said Tuesday. \"This is the opinion of a career civil servant.\" The Pentagon e-mail distributed Monday advised Pentagon personnel to \"please pass this onto your speechwriters and try to catch this change before statements make it to OMB.\" Baer told the Post, \"I have no reason to believe that (the phrase 'global war on terror') would be stricken\" from future congressional testimony. Former President George W. Bush adopted the phrase soon after the Sept. 11, 2001, terrorist attacks on the United States to help embody the breadth of the threat it perceived and the military operations needed to confront it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:12:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "intTime": 20090325,
        "postID": 77,
        "quote": "Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": "",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:43:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "intTime": 20090325,
        "postID": 78,
        "quote": "Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\"",
        "reply": " That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:53:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    },
    {
        "content": "quote: Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land? Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090325,
        "postID": 79,
        "quote": "Originally posted by SteveDeHaven: quote: Originally posted by ACR26: quote: Tell ya what: why don't we just paint crosses on all our equipment, and call the whole thing \"The Tenth Crusade?\" That's some insightful dee-bate right there, I tell ya what! Are you aware that The Decider used the word \"crusade\" more than once in describing this conflict? And are you aware of the historical impact of the word? Or do you willingly acknowledge these facts, and cheer for another crusade in the belief that God has told us to liberate the Holy Land?",
        "reply": " Well according to the Koran, a Great Eagle will be awakend and cleanse the land of Allah. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 06:54:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "Anbar7"
    },
    {
        "content": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "intTime": 20090325,
        "postID": 80,
        "quote": "",
        "reply": "And according to the Bible, an insect has four legs. Just goes to show you the value of so-called holy books.",
        "threadID": "672198221_8910008812001",
        "time": "2009-03-25 07:00:00",
        "title": "War on Terrorism is... OVER!",
        "userID": "SteveDeHaven"
    }
]