[
    {
        "content": "quote: (CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html I thought this was a done deal.", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "(CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html", 
        "reply": " I thought this was a done deal.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-05 16:43:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: (CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html I thought this was a done deal. Doctor Gupta did the unpardonable Democratic sin of contradicting Mike Moore in his feature movie \"Sicko\", telling the world his words were changed, turning the liberal spotlight against the Doctor for being a neurologist and not public health expert. IMO he probably was the best appointment Obama made.", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "Originally posted by I_M_Qwerty: quote: (CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html I thought this was a done deal.", 
        "reply": " Doctor Gupta did the unpardonable Democratic sin of contradicting Mike Moore in his feature movie \"Sicko\", telling the world his words were changed, turning the liberal spotlight against the Doctor for being a neurologist and not public health expert. IMO he probably was the best appointment Obama made.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-05 17:02:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "A pity, he would have done an excellent job.", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "", 
        "reply": "A pity, he would have done an excellent job.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-05 18:14:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "intTime": 20090306, 
        "postID": 4, 
        "quote": "", 
        "reply": "Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 01:35:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier?", 
        "intTime": 20090306, 
        "postID": 5, 
        "quote": "Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "reply": " Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier?", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 01:52:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: turning the liberal spotlight against the Doctor for being a neurologist and not public health expert. citation please.", 
        "intTime": 20090306, 
        "postID": 6, 
        "quote": "turning the liberal spotlight against the Doctor for being a neurologist and not public health expert.", 
        "reply": " citation please.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 02:11:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier? I don't remember that, but I do remember him helping save an Iraqi child with a head injury.", 
        "intTime": 20090306, 
        "postID": 7, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier?", 
        "reply": " I don't remember that, but I do remember him helping save an Iraqi child with a head injury.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 03:50:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "Motive25"
    }, 
    {
        "content": "Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. In the Marine's case, he had the medics sterilze a power drill so he could do his brain surgery. It was an emergency. He told Larry King that 4 yrs in D.C. and away from the practice of surgery would diminish his skills too much. He's a very young man so I don't blame him. He will make an outstanding surgeon general in 25 yrs or so.", 
        "intTime": 20090306, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. In the Marine's case, he had the medics sterilze a power drill so he could do his brain surgery. It was an emergency. He told Larry King that 4 yrs in D.C. and away from the practice of surgery would diminish his skills too much. He's a very young man so I don't blame him. He will make an outstanding surgeon general in 25 yrs or so.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 04:48:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "vsibaby"
    }, 
    {
        "content": "quote: Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. When Gupta was reporting for CNN?", 
        "intTime": 20090306, 
        "postID": 9, 
        "quote": "Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN.", 
        "reply": " When Gupta was reporting for CNN?", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 05:12:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "badmac933"
    }, 
    {
        "content": "The doctor does not need to be in a bureaucratic position as he is too good a surgeon to waste it doing this job. Too bad as he would have been one of the most honest, intelligent and truthful person in the whole administration. He is a good man and Im glad to know him personally", 
        "intTime": 20090306, 
        "postID": 10, 
        "quote": "", 
        "reply": "The doctor does not need to be in a bureaucratic position as he is too good a surgeon to waste it doing this job. Too bad as he would have been one of the most honest, intelligent and truthful person in the whole administration. He is a good man and Im glad to know him personally", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 05:17:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "His statement was that his wife and he are soon to have daughter #3,he would be away from home and his family entirely too much and he wouldnte be able to continue practicing medicine thus resulting in a massive paycut. all seem reasonable to me.", 
        "intTime": 20090306, 
        "postID": 11, 
        "quote": "", 
        "reply": "His statement was that his wife and he are soon to have daughter #3,he would be away from home and his family entirely too much and he wouldnte be able to continue practicing medicine thus resulting in a massive paycut. all seem reasonable to me.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 06:46:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "ccurtis0801"
    }, 
    {
        "content": "quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible.", 
        "intTime": 20090306, 
        "postID": 12, 
        "quote": "Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "reply": " More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 07:10:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "rayld2"
    }, 
    {
        "content": "Good choice Dr Gupta you can help more doing what you do best, saving lives then being a mouthpiece.", 
        "intTime": 20090306, 
        "postID": 13, 
        "quote": "", 
        "reply": "Good choice Dr Gupta you can help more doing what you do best, saving lives then being a mouthpiece.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 07:20:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by badmac933: quote: Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. When Gupta was reporting for CNN? The answer to your question is \"yes\" ... but vsibaby is incorrect on one point: quote: When reporting for CNN on a U.S. Navy medical team in Iraq in 2003, Gupta unexpectedly became part of the story when he was called upon to conduct emergency brain surgery on a 2-year-old Iraqi boy shot by U.S. Marines when he was in a car that did not stop at a checkpoint. The boy did not survive. \"http://www.washingtontimes.com/news/2009/jan/07/busy-gupta-performs-brain-surgery-reports-cnn/ I mention that for accuracy only, not to take anything away from Gupta who I greatly admire. As vsibaby noted, this is one of the reasons why: quote: In 2003, Gupta traveled to Iraq to cover the medical aspects of 2003 invasion of Iraq. While in Iraq, Gupta performed emergency surgery on both U.S. soldiers and Iraqi civilians. Gupta was embedded with a Navy medical unit at the time. A Marine named Jesus Vidana suffered a severe head injury, and the Marines asked for Gupta's assistance because of his background in neurosurgery. Vidana survived and was sent back to the United States for rehabilitation. \"http://en.wikipedia.org/wiki/Sanjay_Gupta", 
        "intTime": 20090306, 
        "postID": 14, 
        "quote": "Originally posted by badmac933: quote: Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. When Gupta was reporting for CNN?", 
        "reply": " The answer to your question is \"yes\" ... but vsibaby is incorrect on one point: quote: When reporting for CNN on a U.S. Navy medical team in Iraq in 2003, Gupta unexpectedly became part of the story when he was called upon to conduct emergency brain surgery on a 2-year-old Iraqi boy shot by U.S. Marines when he was in a car that did not stop at a checkpoint. The boy did not survive. \"http://www.washingtontimes.com/news/2009/jan/07/busy-gupta-performs-brain-surgery-reports-cnn/ I mention that for accuracy only, not to take anything away from Gupta who I greatly admire. As vsibaby noted, this is one of the reasons why: quote: In 2003, Gupta traveled to Iraq to cover the medical aspects of 2003 invasion of Iraq. While in Iraq, Gupta performed emergency surgery on both U.S. soldiers and Iraqi civilians. Gupta was embedded with a Navy medical unit at the time. A Marine named Jesus Vidana suffered a severe head injury, and the Marines asked for Gupta's assistance because of his background in neurosurgery. Vidana survived and was sent back to the United States for rehabilitation. \"http://en.wikipedia.org/wiki/Sanjay_Gupta", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Anybody know why he withdrew?", 
        "intTime": 20090306, 
        "postID": 15, 
        "quote": "", 
        "reply": "Anybody know why he withdrew?", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 08:33:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Anybody know why he withdrew? See ccurtis0801's comment back about 10 comments. Think that is fairly accurate.", 
        "intTime": 20090306, 
        "postID": 16, 
        "quote": "Originally posted by PhoenixDark: Anybody know why he withdrew?", 
        "reply": " See ccurtis0801's comment back about 10 comments. Think that is fairly accurate.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 08:36:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible. Hey...I can't argue with that!", 
        "intTime": 20090306, 
        "postID": 17, 
        "quote": "Originally posted by rayld2: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible.", 
        "reply": " Hey...I can't argue with that!", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 10:39:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "badmac933"
    }, 
    {
        "content": "Conyers tries to keep Gupta from surgeon general post By TODD SPANGLER • FREE PRESS WASHINGTON STAFF • January 8, 2009 Read Comments(24)Recommend(4)Print this page E-mail this article Share this article Del.icio.us Facebook Digg Reddit Newsvine Buzz up! WASHINGTON – House Judiciary Chairman John Conyers is circulating a “Dear Colleague” letter in Congress asking for help to discourage President-elect Barack Obama from nominating Novi native, CNN editor and neurosurgeon Sanjay Gupta to be his surgeon general....... \"http://www.freep.com/article/20090108/NEWS15/90108095/1009/NEWS07\"", 
        "intTime": 20090306, 
        "postID": 18, 
        "quote": "", 
        "reply": "Conyers tries to keep Gupta from surgeon general post By TODD SPANGLER • FREE PRESS WASHINGTON STAFF • January 8, 2009 Read Comments(24)Recommend(4)Print this page E-mail this article Share this article Del.icio.us Facebook Digg Reddit Newsvine Buzz up! WASHINGTON – House Judiciary Chairman John Conyers is circulating a “Dear Colleague” letter in Congress asking for help to discourage President-elect Barack Obama from nominating Novi native, CNN editor and neurosurgeon Sanjay Gupta to be his surgeon general....... \"http://www.freep.com/article/20090108/NEWS15/90108095/1009/NEWS07\"", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 11:19:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Seems to me, Congressman Conyers is \"under investigation\" (for quite some time) due to complaints that he failed to pay taxes on a Villa in the Carribean Islands. My point is anyone he opposes; likely, I'd support! Other than seeing him of TV; I know very little about Dr Gupta. As Surgeon General, I think his annual pay would be around $109K; plus Government Quarters and the other Military fringe benefits. I conclude he would be losing money IF HE TOOK THE SG Job! There seems to be a \"Lot of Internal Battles\" among Democrats about who will get the Administration Cabinet Positions and the PAST Selections of Obama really has not \"thrilled\" most Americans. Of course, I think this Presidency is a diaster and who Obama chooses as Surgeon General won't change my overall view! From A Proud Vietnam Veteran", 
        "intTime": 20090306, 
        "postID": 19, 
        "quote": "", 
        "reply": "Seems to me, Congressman Conyers is \"under investigation\" (for quite some time) due to complaints that he failed to pay taxes on a Villa in the Carribean Islands. My point is anyone he opposes; likely, I'd support! Other than seeing him of TV; I know very little about Dr Gupta. As Surgeon General, I think his annual pay would be around $109K; plus Government Quarters and the other Military fringe benefits. I conclude he would be losing money IF HE TOOK THE SG Job! There seems to be a \"Lot of Internal Battles\" among Democrats about who will get the Administration Cabinet Positions and the PAST Selections of Obama really has not \"thrilled\" most Americans. Of course, I think this Presidency is a diaster and who Obama chooses as Surgeon General won't change my overall view! From A Proud Vietnam Veteran", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 13:07:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "WesLemmon"
    }, 
    {
        "content": "1. Dr. Gupta was never formally appointed; his name was floated as one of those being considered for appointment, and he was widely seen as the front-runner. 2. Dr. Gupta is not a neurologist. He is a neurosurgeon. Big difference.", 
        "intTime": 20090306, 
        "postID": 20, 
        "quote": "", 
        "reply": "1. Dr. Gupta was never formally appointed; his name was floated as one of those being considered for appointment, and he was widely seen as the front-runner. 2. Dr. Gupta is not a neurologist. He is a neurosurgeon. Big difference.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 14:13:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: (CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html I thought this was a done deal.", 
        "intTime": 20090305, 
        "postID": 21, 
        "quote": "(CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html", 
        "reply": " I thought this was a done deal.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-05 16:43:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: (CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html I thought this was a done deal. Doctor Gupta did the unpardonable Democratic sin of contradicting Mike Moore in his feature movie \"Sicko\", telling the world his words were changed, turning the liberal spotlight against the Doctor for being a neurologist and not public health expert. IMO he probably was the best appointment Obama made.", 
        "intTime": 20090305, 
        "postID": 22, 
        "quote": "Originally posted by I_M_Qwerty: quote: (CNN) -- Dr. Sanjay Gupta, CNN's chief medical correspondent, has withdrawn his name from consideration as surgeon general of the United States, an administration official said Thursday. \"Sanjay Gupta was under serious consideration for the job of surgeon general,\" the official said in an e-mail. \"He has removed himself from consideration to focus more on his medical career and his family. We know he will continue to serve and educate the public through his work with media and in the medical arena.\" Sources said in January that Gupta met then-President-elect Obama in Chicago, Illinois, in November to discuss the post. Gupta has declined comment. <more> \"http://www.cnn.com/2009/POLITICS/03/05/gupta.surgeon.general/index.html I thought this was a done deal.", 
        "reply": " Doctor Gupta did the unpardonable Democratic sin of contradicting Mike Moore in his feature movie \"Sicko\", telling the world his words were changed, turning the liberal spotlight against the Doctor for being a neurologist and not public health expert. IMO he probably was the best appointment Obama made.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-05 17:02:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "A pity, he would have done an excellent job.", 
        "intTime": 20090305, 
        "postID": 23, 
        "quote": "", 
        "reply": "A pity, he would have done an excellent job.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-05 18:14:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "intTime": 20090306, 
        "postID": 24, 
        "quote": "", 
        "reply": "Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 01:35:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier?", 
        "intTime": 20090306, 
        "postID": 25, 
        "quote": "Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "reply": " Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier?", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 01:52:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: turning the liberal spotlight against the Doctor for being a neurologist and not public health expert. citation please.", 
        "intTime": 20090306, 
        "postID": 26, 
        "quote": "turning the liberal spotlight against the Doctor for being a neurologist and not public health expert.", 
        "reply": " citation please.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 02:11:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier? I don't remember that, but I do remember him helping save an Iraqi child with a head injury.", 
        "intTime": 20090306, 
        "postID": 27, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. Correction, anyone who actually pays their Taxes to work for him. Gupta did seem like a good choice from what I know of him. IIRC in the initial Invasion of Iraq, didnt he assist in a Surgery to save a Marine or Soldier?", 
        "reply": " I don't remember that, but I do remember him helping save an Iraqi child with a head injury.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 03:50:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "Motive25"
    }, 
    {
        "content": "Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. In the Marine's case, he had the medics sterilze a power drill so he could do his brain surgery. It was an emergency. He told Larry King that 4 yrs in D.C. and away from the practice of surgery would diminish his skills too much. He's a very young man so I don't blame him. He will make an outstanding surgeon general in 25 yrs or so.", 
        "intTime": 20090306, 
        "postID": 28, 
        "quote": "", 
        "reply": "Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. In the Marine's case, he had the medics sterilze a power drill so he could do his brain surgery. It was an emergency. He told Larry King that 4 yrs in D.C. and away from the practice of surgery would diminish his skills too much. He's a very young man so I don't blame him. He will make an outstanding surgeon general in 25 yrs or so.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 04:48:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "vsibaby"
    }, 
    {
        "content": "quote: Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. When Gupta was reporting for CNN?", 
        "intTime": 20090306, 
        "postID": 29, 
        "quote": "Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN.", 
        "reply": " When Gupta was reporting for CNN?", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 05:12:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "badmac933"
    }, 
    {
        "content": "The doctor does not need to be in a bureaucratic position as he is too good a surgeon to waste it doing this job. Too bad as he would have been one of the most honest, intelligent and truthful person in the whole administration. He is a good man and Im glad to know him personally", 
        "intTime": 20090306, 
        "postID": 30, 
        "quote": "", 
        "reply": "The doctor does not need to be in a bureaucratic position as he is too good a surgeon to waste it doing this job. Too bad as he would have been one of the most honest, intelligent and truthful person in the whole administration. He is a good man and Im glad to know him personally", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 05:17:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "His statement was that his wife and he are soon to have daughter #3,he would be away from home and his family entirely too much and he wouldnte be able to continue practicing medicine thus resulting in a massive paycut. all seem reasonable to me.", 
        "intTime": 20090306, 
        "postID": 31, 
        "quote": "", 
        "reply": "His statement was that his wife and he are soon to have daughter #3,he would be away from home and his family entirely too much and he wouldnte be able to continue practicing medicine thus resulting in a massive paycut. all seem reasonable to me.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 06:46:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "ccurtis0801"
    }, 
    {
        "content": "quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible.", 
        "intTime": 20090306, 
        "postID": 32, 
        "quote": "Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him.", 
        "reply": " More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 07:10:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "rayld2"
    }, 
    {
        "content": "Good choice Dr Gupta you can help more doing what you do best, saving lives then being a mouthpiece.", 
        "intTime": 20090306, 
        "postID": 33, 
        "quote": "", 
        "reply": "Good choice Dr Gupta you can help more doing what you do best, saving lives then being a mouthpiece.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 07:20:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by badmac933: quote: Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. When Gupta was reporting for CNN? The answer to your question is \"yes\" ... but vsibaby is incorrect on one point: quote: When reporting for CNN on a U.S. Navy medical team in Iraq in 2003, Gupta unexpectedly became part of the story when he was called upon to conduct emergency brain surgery on a 2-year-old Iraqi boy shot by U.S. Marines when he was in a car that did not stop at a checkpoint. The boy did not survive. \"http://www.washingtontimes.com/news/2009/jan/07/busy-gupta-performs-brain-surgery-reports-cnn/ I mention that for accuracy only, not to take anything away from Gupta who I greatly admire. As vsibaby noted, this is one of the reasons why: quote: In 2003, Gupta traveled to Iraq to cover the medical aspects of 2003 invasion of Iraq. While in Iraq, Gupta performed emergency surgery on both U.S. soldiers and Iraqi civilians. Gupta was embedded with a Navy medical unit at the time. A Marine named Jesus Vidana suffered a severe head injury, and the Marines asked for Gupta's assistance because of his background in neurosurgery. Vidana survived and was sent back to the United States for rehabilitation. \"http://en.wikipedia.org/wiki/Sanjay_Gupta", 
        "intTime": 20090306, 
        "postID": 34, 
        "quote": "Originally posted by badmac933: quote: Originally posted by vsibaby: Yes, he saved a Marine and an Iraqi child over there when he was reporting for CNN. When Gupta was reporting for CNN?", 
        "reply": " The answer to your question is \"yes\" ... but vsibaby is incorrect on one point: quote: When reporting for CNN on a U.S. Navy medical team in Iraq in 2003, Gupta unexpectedly became part of the story when he was called upon to conduct emergency brain surgery on a 2-year-old Iraqi boy shot by U.S. Marines when he was in a car that did not stop at a checkpoint. The boy did not survive. \"http://www.washingtontimes.com/news/2009/jan/07/busy-gupta-performs-brain-surgery-reports-cnn/ I mention that for accuracy only, not to take anything away from Gupta who I greatly admire. As vsibaby noted, this is one of the reasons why: quote: In 2003, Gupta traveled to Iraq to cover the medical aspects of 2003 invasion of Iraq. While in Iraq, Gupta performed emergency surgery on both U.S. soldiers and Iraqi civilians. Gupta was embedded with a Navy medical unit at the time. A Marine named Jesus Vidana suffered a severe head injury, and the Marines asked for Gupta's assistance because of his background in neurosurgery. Vidana survived and was sent back to the United States for rehabilitation. \"http://en.wikipedia.org/wiki/Sanjay_Gupta", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 08:30:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Anybody know why he withdrew?", 
        "intTime": 20090306, 
        "postID": 35, 
        "quote": "", 
        "reply": "Anybody know why he withdrew?", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 08:33:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Anybody know why he withdrew? See ccurtis0801's comment back about 10 comments. Think that is fairly accurate.", 
        "intTime": 20090306, 
        "postID": 36, 
        "quote": "Originally posted by PhoenixDark: Anybody know why he withdrew?", 
        "reply": " See ccurtis0801's comment back about 10 comments. Think that is fairly accurate.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 08:36:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible. Hey...I can't argue with that!", 
        "intTime": 20090306, 
        "postID": 37, 
        "quote": "Originally posted by rayld2: quote: Originally posted by badmac933: Man, that dude Obama is having a hard time finding anyone who wants to work for him. More like there are few intelligent people any who want to put up with the Gotcha political games that have been getting worse for the last couple of decades with each party using the process to make political points and get revenge. A Lot of good people are deciding that you have to put up with to much crap to make public service possible.", 
        "reply": " Hey...I can't argue with that!", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 10:39:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "badmac933"
    }, 
    {
        "content": "Conyers tries to keep Gupta from surgeon general post By TODD SPANGLER • FREE PRESS WASHINGTON STAFF • January 8, 2009 Read Comments(24)Recommend(4)Print this page E-mail this article Share this article Del.icio.us Facebook Digg Reddit Newsvine Buzz up! WASHINGTON – House Judiciary Chairman John Conyers is circulating a “Dear Colleague” letter in Congress asking for help to discourage President-elect Barack Obama from nominating Novi native, CNN editor and neurosurgeon Sanjay Gupta to be his surgeon general....... \"http://www.freep.com/article/20090108/NEWS15/90108095/1009/NEWS07\"", 
        "intTime": 20090306, 
        "postID": 38, 
        "quote": "", 
        "reply": "Conyers tries to keep Gupta from surgeon general post By TODD SPANGLER • FREE PRESS WASHINGTON STAFF • January 8, 2009 Read Comments(24)Recommend(4)Print this page E-mail this article Share this article Del.icio.us Facebook Digg Reddit Newsvine Buzz up! WASHINGTON – House Judiciary Chairman John Conyers is circulating a “Dear Colleague” letter in Congress asking for help to discourage President-elect Barack Obama from nominating Novi native, CNN editor and neurosurgeon Sanjay Gupta to be his surgeon general....... \"http://www.freep.com/article/20090108/NEWS15/90108095/1009/NEWS07\"", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 11:19:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "Seems to me, Congressman Conyers is \"under investigation\" (for quite some time) due to complaints that he failed to pay taxes on a Villa in the Carribean Islands. My point is anyone he opposes; likely, I'd support! Other than seeing him of TV; I know very little about Dr Gupta. As Surgeon General, I think his annual pay would be around $109K; plus Government Quarters and the other Military fringe benefits. I conclude he would be losing money IF HE TOOK THE SG Job! There seems to be a \"Lot of Internal Battles\" among Democrats about who will get the Administration Cabinet Positions and the PAST Selections of Obama really has not \"thrilled\" most Americans. Of course, I think this Presidency is a diaster and who Obama chooses as Surgeon General won't change my overall view! From A Proud Vietnam Veteran", 
        "intTime": 20090306, 
        "postID": 39, 
        "quote": "", 
        "reply": "Seems to me, Congressman Conyers is \"under investigation\" (for quite some time) due to complaints that he failed to pay taxes on a Villa in the Carribean Islands. My point is anyone he opposes; likely, I'd support! Other than seeing him of TV; I know very little about Dr Gupta. As Surgeon General, I think his annual pay would be around $109K; plus Government Quarters and the other Military fringe benefits. I conclude he would be losing money IF HE TOOK THE SG Job! There seems to be a \"Lot of Internal Battles\" among Democrats about who will get the Administration Cabinet Positions and the PAST Selections of Obama really has not \"thrilled\" most Americans. Of course, I think this Presidency is a diaster and who Obama chooses as Surgeon General won't change my overall view! From A Proud Vietnam Veteran", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 13:07:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "WesLemmon"
    }, 
    {
        "content": "1. Dr. Gupta was never formally appointed; his name was floated as one of those being considered for appointment, and he was widely seen as the front-runner. 2. Dr. Gupta is not a neurologist. He is a neurosurgeon. Big difference.", 
        "intTime": 20090306, 
        "postID": 40, 
        "quote": "", 
        "reply": "1. Dr. Gupta was never formally appointed; his name was floated as one of those being considered for appointment, and he was widely seen as the front-runner. 2. Dr. Gupta is not a neurologist. He is a neurosurgeon. Big difference.", 
        "threadID": "672198221_2370030712001", 
        "time": "2009-03-06 14:13:00", 
        "title": "Dr. Sanjay Gupta Withdraws from Consideration as Obama's Surgeon General Nominee", 
        "userID": "Cider33_Alpha"
    }
]