[
    {
        "content": "that I can't send e-mails to any of the members? Every time I try, I get the message, \"You don't have permission to access this page.\" And I can't even send e-mail to the Mods... What gives? (Sorry if this is not in the right forum, but it's the one I use most often) Dave", 
        "intTime": 20090412, 
        "postID": 1, 
        "quote": "", 
        "reply": "that I can't send e-mails to any of the members? Every time I try, I get the message, \"You don't have permission to access this page.\" And I can't even send e-mail to the Mods... What gives? (Sorry if this is not in the right forum, but it's the one I use most often) Dave", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:05:00", 
        "title": "Why is it", 
        "userID": "Grachus"
    }, 
    {
        "content": "This isn't news..... Where would you like me to move to. And to answer the question. It will change shortly, but for now all profiles are private and you choose who you want to chat with and add them to your buddy list. There are a few threads on all the subjects. Start in the General board for starters. MD", 
        "intTime": 20090412, 
        "postID": 2, 
        "quote": "", 
        "reply": "This isn't news..... Where would you like me to move to. And to answer the question. It will change shortly, but for now all profiles are private and you choose who you want to chat with and add them to your buddy list. There are a few threads on all the subjects. Start in the General board for starters. MD", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:13:00", 
        "title": "Why is it", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: This isn't news..... Where would you like me to move to. And to answer the question. It will change shortly, but for now all profiles are private and you choose who you want to chat with and add them to your buddy list. There are a few threads on all the subjects. Start in the General board for starters. MD Wherever you want to move it... The TOS tells me that if I want to argue with a moderator, I should send him e-mail. Hmm? Dave", 
        "intTime": 20090412, 
        "postID": 3, 
        "quote": "Originally posted by mainedawg: This isn't news..... Where would you like me to move to. And to answer the question. It will change shortly, but for now all profiles are private and you choose who you want to chat with and add them to your buddy list. There are a few threads on all the subjects. Start in the General board for starters. MD", 
        "reply": " Wherever you want to move it... The TOS tells me that if I want to argue with a moderator, I should send him e-mail. Hmm? Dave", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:17:00", 
        "title": "Why is it", 
        "userID": "Grachus"
    }, 
    {
        "content": "How about looking over my avatar?", 
        "intTime": 20090412, 
        "postID": 4, 
        "quote": "", 
        "reply": "How about looking over my avatar?", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:19:00", 
        "title": "Why is it", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: How about looking over my avatar? Is my post \"spam?\" I just tried to send you an e-mail. Dave", 
        "intTime": 20090412, 
        "postID": 5, 
        "quote": "Originally posted by mainedawg: How about looking over my avatar?", 
        "reply": " Is my post \"spam?\" I just tried to send you an e-mail. Dave", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:22:00", 
        "title": "Why is it", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: that I can't send e-mails to any of the members? Every time I try, I get the message, \"You don't have permission to access this page.\" And I can't even send e-mail to the Mods... What gives? (Sorry if this is not in the right forum, but it's the one I use most often) Dave sometmes something similar to this has happened to me... only to find I have to \"Log-on\" anew. Maybe you got logged-off somehow. Look at that option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090412, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: that I can't send e-mails to any of the members? Every time I try, I get the message, \"You don't have permission to access this page.\" And I can't even send e-mail to the Mods... What gives? (Sorry if this is not in the right forum, but it's the one I use most often) Dave", 
        "reply": " sometmes something similar to this has happened to me... only to find I have to \"Log-on\" anew. Maybe you got logged-off somehow. Look at that option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:22:00", 
        "title": "Why is it", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090412, 
        "postID": 7, 
        "quote": "", 
        "reply": "but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:23:00", 
        "title": "Why is it", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. You are forgiven... Err, are you white meat of dark meat? Just checking. See, I have this big freezer, and... Dave", 
        "intTime": 20090412, 
        "postID": 8, 
        "quote": "Originally posted by m551sheridan: but then if you are posting then my idea is mute....... so I'm stupid.... shoot me.", 
        "reply": " You are forgiven... Err, are you white meat of dark meat? Just checking. See, I have this big freezer, and... Dave", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:26:00", 
        "title": "Why is it", 
        "userID": "Grachus"
    }, 
    {
        "content": "I'll Do It I'm locking this thread in a few. All these questions are answered here on the boards. This will end up another flaming thread with people getting in trouble and I don't wish to see that.", 
        "intTime": 20090412, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'll Do It I'm locking this thread in a few. All these questions are answered here on the boards. This will end up another flaming thread with people getting in trouble and I don't wish to see that.", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:26:00", 
        "title": "Why is it", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by m551sheridan: but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. You are forgiven... Err, are you white meat of dark meat? Just checking. See, I have this big freezer, and... Dave I could no doubt feed you and yours for quite some time.... but I'm like an aged bull elk... tough and not worth nuthin but the rack.... course then you could make it all into breakfast sausage.... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090412, 
        "postID": 10, 
        "quote": "Originally posted by Grachus: quote: Originally posted by m551sheridan: but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. You are forgiven... Err, are you white meat of dark meat? Just checking. See, I have this big freezer, and... Dave", 
        "reply": " I could no doubt feed you and yours for quite some time.... but I'm like an aged bull elk... tough and not worth nuthin but the rack.... course then you could make it all into breakfast sausage.... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:30:00", 
        "title": "Why is it", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: I'll Do It I'm locking this thread in a few. All these questions are answered here on the boards. This will end up another flaming thread with people getting in trouble and I don't wish to see that. Dawg... we cannot communicate with any Mod unless he/she is willing to be \"our buddy.\" So emailing a Mod for any reason is out of the question. All we have now... is the yellow triangle. Or do we still have that????", 
        "intTime": 20090412, 
        "postID": 11, 
        "quote": "Originally posted by mainedawg: I'll Do It I'm locking this thread in a few. All these questions are answered here on the boards. This will end up another flaming thread with people getting in trouble and I don't wish to see that.", 
        "reply": " Dawg... we cannot communicate with any Mod unless he/she is willing to be \"our buddy.\" So emailing a Mod for any reason is out of the question. All we have now... is the yellow triangle. Or do we still have that????", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:37:00", 
        "title": "Why is it", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Grachus: quote: Originally posted by m551sheridan: but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. You are forgiven... Err, are you white meat of dark meat? Just checking. See, I have this big freezer, and... Dave I could no doubt feed you and yours for quite some time.... but I'm like an aged bull elk... tough and not worth nuthin but the rack.... course then you could make it all into breakfast sausage.... Ahhh! \"Mystery meat.\" I just love looking at sausage... And a friend of mine just gave me some organic sausage - Who knows? He was complaining about a neighbor of his, and the guy suddenly \"disappeared.\" People ask me what I feed my dog, and I tell them, \"One crack addict a week.\" Thus cutting down expenses, AND doing the neighborhood a favor. Dave", 
        "intTime": 20090412, 
        "postID": 12, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Grachus: quote: Originally posted by m551sheridan: but then if you are posting then my idea is mute....... so I'm stupid.... shoot me. You are forgiven... Err, are you white meat of dark meat? Just checking. See, I have this big freezer, and... Dave I could no doubt feed you and yours for quite some time.... but I'm like an aged bull elk... tough and not worth nuthin but the rack.... course then you could make it all into breakfast sausage....", 
        "reply": " Ahhh! \"Mystery meat.\" I just love looking at sausage... And a friend of mine just gave me some organic sausage - Who knows? He was complaining about a neighbor of his, and the guy suddenly \"disappeared.\" People ask me what I feed my dog, and I tell them, \"One crack addict a week.\" Thus cutting down expenses, AND doing the neighborhood a favor. Dave", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:39:00", 
        "title": "Why is it", 
        "userID": "Grachus"
    }, 
    {
        "content": "Some areas of the board have decieded not to have the triangle. We will keep it but that is not what the triangle is for. I wish it was. I have an e-mail over my avatar and i have recieved 12 e-mails on it today. Please use that and most Moderators in Hot Topics have one posted also. And, thing will be changing for the good a little at time. Please give this new system time to work out the problems.", 
        "intTime": 20090412, 
        "postID": 13, 
        "quote": "", 
        "reply": "Some areas of the board have decieded not to have the triangle. We will keep it but that is not what the triangle is for. I wish it was. I have an e-mail over my avatar and i have recieved 12 e-mails on it today. Please use that and most Moderators in Hot Topics have one posted also. And, thing will be changing for the good a little at time. Please give this new system time to work out the problems.", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:41:00", 
        "title": "Why is it", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: Some areas of the board have decieded not to have the triangle. We will keep it but that is not what the triangle is for. I wish it was. I have an e-mail over my avatar and i have recieved 12 e-mails on it today. Please use that and most Moderators in Hot Topics have one posted also. And, thing will be changing for the good a little at time. Please give this new system time to work out the problems. Well now I feel stupid - You even told me to look at your avatar and I missed it... I only wanted to send you an e-mail as a test. I'm sure your posted one works fine My bad... Dave", 
        "intTime": 20090412, 
        "postID": 14, 
        "quote": "Originally posted by mainedawg: Some areas of the board have decieded not to have the triangle. We will keep it but that is not what the triangle is for. I wish it was. I have an e-mail over my avatar and i have recieved 12 e-mails on it today. Please use that and most Moderators in Hot Topics have one posted also. And, thing will be changing for the good a little at time. Please give this new system time to work out the problems.", 
        "reply": " Well now I feel stupid - You even told me to look at your avatar and I missed it... I only wanted to send you an e-mail as a test. I'm sure your posted one works fine My bad... Dave", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:46:00", 
        "title": "Why is it", 
        "userID": "Grachus"
    }, 
    {
        "content": "No biggie. That's what I'm here for. The free beer and chicks aren't bad either", 
        "intTime": 20090412, 
        "postID": 15, 
        "quote": "", 
        "reply": "No biggie. That's what I'm here for. The free beer and chicks aren't bad either", 
        "threadID": "672198221_2450025022001", 
        "time": "2009-04-12 12:57:00", 
        "title": "Why is it", 
        "userID": "mainedawg"
    }
]