[
    {
        "content": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "intTime": 20090528, 
        "postID": 1, 
        "quote": "", 
        "reply": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:44:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Release the non-violent drug users. Makes since to me.", 
        "intTime": 20090528, 
        "postID": 2, 
        "quote": "", 
        "reply": "Release the non-violent drug users. Makes since to me.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:49:00", 
        "title": "California state prison", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "intTime": 20090528, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "intTime": 20090528, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "intTime": 20090528, 
        "postID": 5, 
        "quote": "I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak.", 
        "reply": " Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:40:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "intTime": 20090528, 
        "postID": 6, 
        "quote": "", 
        "reply": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:50:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 7, 
        "quote": "", 
        "reply": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:10:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "intTime": 20090528, 
        "postID": 8, 
        "quote": "Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh.", 
        "reply": " California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:30:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "intTime": 20090528, 
        "postID": 9, 
        "quote": "", 
        "reply": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:35:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: They want a meditation room? . you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 10, 
        "quote": "Originally posted by usa_girl: They want a meditation room? .", 
        "reply": " you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:39:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "intTime": 20090528, 
        "postID": 11, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:42:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff. The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "intTime": 20090528, 
        "postID": 12, 
        "quote": "Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "reply": " The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:44:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: It makes me sick we are so weak we have created a demand for drugs. Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "intTime": 20090528, 
        "postID": 13, 
        "quote": "It makes me sick we are so weak we have created a demand for drugs.", 
        "reply": " Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:58:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "intTime": 20090528, 
        "postID": 14, 
        "quote": "The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start...", 
        "reply": " really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:10:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "intTime": 20090528, 
        "postID": 15, 
        "quote": "", 
        "reply": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:13:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "intTime": 20090528, 
        "postID": 16, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:17:00", 
        "title": "California state prison", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "intTime": 20090528, 
        "postID": 17, 
        "quote": "", 
        "reply": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:18:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\". Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "intTime": 20090528, 
        "postID": 18, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "reply": " Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:20:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage I was including the cost of overtime...it really does reach nearly 80K...", 
        "intTime": 20090528, 
        "postID": 19, 
        "quote": "Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "reply": " I was including the cost of overtime...it really does reach nearly 80K...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:21:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Why? Do you miss your friends?", 
        "intTime": 20090528, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Why? Do you miss your friends?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:23:00", 
        "title": "California state prison", 
        "userID": "adminnco1"
    }, 
    {
        "content": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "intTime": 20090528, 
        "postID": 21, 
        "quote": "", 
        "reply": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:44:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Release the non-violent drug users. Makes since to me.", 
        "intTime": 20090528, 
        "postID": 22, 
        "quote": "", 
        "reply": "Release the non-violent drug users. Makes since to me.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:49:00", 
        "title": "California state prison", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "intTime": 20090528, 
        "postID": 23, 
        "quote": "", 
        "reply": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "intTime": 20090528, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "intTime": 20090528, 
        "postID": 25, 
        "quote": "I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak.", 
        "reply": " Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:40:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "intTime": 20090528, 
        "postID": 26, 
        "quote": "", 
        "reply": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:50:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 27, 
        "quote": "", 
        "reply": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:10:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "intTime": 20090528, 
        "postID": 28, 
        "quote": "Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh.", 
        "reply": " California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:30:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "intTime": 20090528, 
        "postID": 29, 
        "quote": "", 
        "reply": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:35:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: They want a meditation room? . you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 30, 
        "quote": "Originally posted by usa_girl: They want a meditation room? .", 
        "reply": " you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:39:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "intTime": 20090528, 
        "postID": 31, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:42:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff. The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "intTime": 20090528, 
        "postID": 32, 
        "quote": "Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "reply": " The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:44:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: It makes me sick we are so weak we have created a demand for drugs. Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "intTime": 20090528, 
        "postID": 33, 
        "quote": "It makes me sick we are so weak we have created a demand for drugs.", 
        "reply": " Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:58:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "intTime": 20090528, 
        "postID": 34, 
        "quote": "The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start...", 
        "reply": " really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:10:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "intTime": 20090528, 
        "postID": 35, 
        "quote": "", 
        "reply": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:13:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "intTime": 20090528, 
        "postID": 36, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:17:00", 
        "title": "California state prison", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "intTime": 20090528, 
        "postID": 37, 
        "quote": "", 
        "reply": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:18:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\". Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "intTime": 20090528, 
        "postID": 38, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "reply": " Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:20:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage I was including the cost of overtime...it really does reach nearly 80K...", 
        "intTime": 20090528, 
        "postID": 39, 
        "quote": "Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "reply": " I was including the cost of overtime...it really does reach nearly 80K...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:21:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Why? Do you miss your friends?", 
        "intTime": 20090528, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Why? Do you miss your friends?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:23:00", 
        "title": "California state prison", 
        "userID": "adminnco1"
    }, 
    {
        "content": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "intTime": 20090528, 
        "postID": 41, 
        "quote": "", 
        "reply": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:44:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Release the non-violent drug users. Makes since to me.", 
        "intTime": 20090528, 
        "postID": 42, 
        "quote": "", 
        "reply": "Release the non-violent drug users. Makes since to me.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:49:00", 
        "title": "California state prison", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "intTime": 20090528, 
        "postID": 43, 
        "quote": "", 
        "reply": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "intTime": 20090528, 
        "postID": 44, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "intTime": 20090528, 
        "postID": 45, 
        "quote": "I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak.", 
        "reply": " Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:40:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "intTime": 20090528, 
        "postID": 46, 
        "quote": "", 
        "reply": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:50:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 47, 
        "quote": "", 
        "reply": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:10:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "intTime": 20090528, 
        "postID": 48, 
        "quote": "Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh.", 
        "reply": " California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:30:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "intTime": 20090528, 
        "postID": 49, 
        "quote": "", 
        "reply": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:35:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: They want a meditation room? . you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 50, 
        "quote": "Originally posted by usa_girl: They want a meditation room? .", 
        "reply": " you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:39:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "intTime": 20090528, 
        "postID": 51, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:42:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff. The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "intTime": 20090528, 
        "postID": 52, 
        "quote": "Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "reply": " The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:44:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: It makes me sick we are so weak we have created a demand for drugs. Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "intTime": 20090528, 
        "postID": 53, 
        "quote": "It makes me sick we are so weak we have created a demand for drugs.", 
        "reply": " Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:58:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "intTime": 20090528, 
        "postID": 54, 
        "quote": "The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start...", 
        "reply": " really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:10:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "intTime": 20090528, 
        "postID": 55, 
        "quote": "", 
        "reply": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:13:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "intTime": 20090528, 
        "postID": 56, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:17:00", 
        "title": "California state prison", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "intTime": 20090528, 
        "postID": 57, 
        "quote": "", 
        "reply": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:18:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\". Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "intTime": 20090528, 
        "postID": 58, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "reply": " Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:20:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage I was including the cost of overtime...it really does reach nearly 80K...", 
        "intTime": 20090528, 
        "postID": 59, 
        "quote": "Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "reply": " I was including the cost of overtime...it really does reach nearly 80K...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:21:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Why? Do you miss your friends?", 
        "intTime": 20090528, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Why? Do you miss your friends?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:23:00", 
        "title": "California state prison", 
        "userID": "adminnco1"
    }, 
    {
        "content": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "intTime": 20090528, 
        "postID": 61, 
        "quote": "", 
        "reply": "California pays about $50,000 per prisoner. They are talking about releasing many of the criminals early to release the state from the financial burden. Great. That really makes sense and makes me feel safe. Some groups (I wonder who they could be) are saying the inmates were not getting proper health care and are demanding new improved health care system, including a meditation room and yoga center! Plus, the guy who was in charge of upgrading the health care system in the California prison system was clearing around $250,000 per year, not to mention what his staff was being paid at the Californian tax payers. The greatest insult of this story is that there are some hard working and retired people that can't even afford health care and we are worried about what a second and third time offender is getting? And what kind of health care? Patch up jobs from gang fights? Smoking and drug related health issues? Bad teeth from speed? I think our duty is to feed them, cloth them and keep them from violence. It is not a spa. I don't mind teaching prisoners skills should they get out. But, no way should they get a free education when I can't have one. If they do get a degree of some sort, they should have to pay it back, just like I would. It would not hurt them to have to earn their own food, clothes, housing through some type of work program, like the program Sheriff Joe does in Arizona. They can grow their own food, they can farm to have an open food market, they can tend to cleaning up the streets and city of gang tagging, they can help tend to animal shelters etc And yes, at a fair price. It will give them pride and make them feel better too. They don't need to be sitting around with so much time on their hands.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:44:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Release the non-violent drug users. Makes since to me.", 
        "intTime": 20090528, 
        "postID": 62, 
        "quote": "", 
        "reply": "Release the non-violent drug users. Makes since to me.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:49:00", 
        "title": "California state prison", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "intTime": 20090528, 
        "postID": 63, 
        "quote": "", 
        "reply": "Hiya crackerjack, I do agree with you in that we should not tie up drug offenders in the court system. I guess it should be made legal. But right now it is not legal and so they should be able to pay a fine and do maybe like some type of social work progam. I hate drugs! I have seen first hand how they change a person. I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. But that is not reality. I guess, if we were to make it legal, it would stop the profit that comes with smuggling it in? Or would there always be a black market to undercut the retail price of it?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "intTime": 20090528, 
        "postID": 64, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " So if Rush Limbaugh were locked up for, say possesion of a controlled substance like oxycontin, you would want him released. Just wondering...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 15:59:00", 
        "title": "California state prison", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak. Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "intTime": 20090528, 
        "postID": 65, 
        "quote": "I wish they would all go away and other countries would stop feeding our people that poison. It makes us weak.", 
        "reply": " Is it those other Countries Fault there is a demand for drugs here in the states? and lets switch that around a bit to other countries saying \"I wish that the USA would stop filling the demand for weapons in my country\". Please note I am not saying we need to regulate guns to protect them -- just saying that if no demand there is no market. Personally I think we should legalize all drugs and sell them like we do booze. If a person drinks or drugs self to death it might clean up the gene pool. As it stands right now a teenager can get a sack of weed easier than most adults and the law should be, if you supply or sell drugs,booze cigarettes to a minor its 5 years first offense -- no parole. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:40:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "intTime": 20090528, 
        "postID": 66, 
        "quote": "", 
        "reply": "Why don't you also bring up the California Prison Guard union and their role in this mess... The Healthcare stuff was mandate by a federal judge in response to what they considered abhorrent healthcare resources for the prisoners. California had nothing to do with that, except of course for causing the conditions that compelled the judges to rule as they did... BTW: These prisoners were probably going to be released anyway by the federal system yet again for, you guessed it, dangerous and filthy conditions due to overcrowding... Minor drug offense, Back child support....these things need to be looked at so some idiot stays out of prison, while a rapist and murderer goes in...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 16:50:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 67, 
        "quote": "", 
        "reply": "just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:10:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh. California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "intTime": 20090528, 
        "postID": 68, 
        "quote": "Originally posted by m551sheridan: just heard on the news that Califorina is thinking of stopping all welfare checks....... imagine the outrage then. Or do ya think some will go back to where they belong and others just might, maybe just might get off their azz' and find work? Nahhhhhhhh.", 
        "reply": " California, and its liberal government, has no choice....President Obama told them \"hell no\" in regards to a \"bailout,\" and they need to cut 22billion from the budget... No welfare, No healthcare, no wasteful spending.....I'm sure society will disintegrate as the liberals predict", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:30:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "intTime": 20090528, 
        "postID": 69, 
        "quote": "", 
        "reply": "good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:35:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: They want a meditation room? . you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090528, 
        "postID": 70, 
        "quote": "Originally posted by usa_girl: They want a meditation room? .", 
        "reply": " you forgot the \"aroma therapy\" room that is/was being proposed... gotta have that. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:39:00", 
        "title": "California state prison", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "intTime": 20090528, 
        "postID": 71, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " I think we talked about this in the past. There hardly any non-violent, drug users, in state prisons unless you're in China.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:42:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff. The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "intTime": 20090528, 
        "postID": 72, 
        "quote": "Originally posted by usa_girl: good points for both A Savage and Irwin.. It makes me sick we are so weak we have created a demand for drugs. Still in some countries, they have made this their only source of income, rather than say farming food.... It is just as cruel to their people. I think anyone in the US that supplies guns illegally should be in big trouble. As for the CPG union and their role in this, I missed that part, I am happy you added it. Basically you think the answer is to focus more on who we are putting in jail in the first place, so we can keep the crowds down and that is the answer to the huge cost? Irwin, I am not saying they should live in mud or be abused or not have medical attention, but come on, prison is not camp snoopy and the fact that they are even talking about a meditation center and yoga room is offensive and an abuse of tax payers money. They don't need a workout room with state of the art weights, shoot, there are many people who are not criminals that can't even afford a gym membership. They can do sit ups in their cell. They want a meditation room? They can have a work program and build it at thier cost, have it donated from personal fund raising or have family members send them a yoga matt for their cell. If the CPG wants all the fluff and extra, let it be personally donated and raised like all other charity funds and come out of thier pockets or other people that support that cause, not forced on the state of california tax payers. And even if we do cut down on people who get prison time such as drug users, back child support, etc, that does not solve the issue of managing tax payers money as it relates to the cost of housing a prisoner. I think the only way to manage this issue, is to rethink who actually gets time and make less offenders do community work and pay fines and have the hard criminals have work programs and get paid for their work and have them pay for their housing, medical, education, and fluff.", 
        "reply": " The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... Anywho...The yoga is BS, but seriously, the health care conditions were pretty bad and the state was given plenty of opportunities to clean up the mess and didnt. The federal government stepped in and told them how it was going to be fixed, who was going to fix it, and guess what? You're paying for every recommendation made as well. Minor drug offenses, Back child support/Alimony, some probation violations...etc There are alot of knuckle heads in prison that should not be there, they should give them community service up the ass. Reserve the state PRISON for harden criminals...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:44:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: It makes me sick we are so weak we have created a demand for drugs. Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "intTime": 20090528, 
        "postID": 73, 
        "quote": "It makes me sick we are so weak we have created a demand for drugs.", 
        "reply": " Please tell me when there has not be a demand for drugs. And bear in mind that alcohol in all forms and tobacco are drugs. marijuana was being used 3,000 years ago by the way. --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 17:58:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "intTime": 20090528, 
        "postID": 74, 
        "quote": "The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start...", 
        "reply": " really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:10:00", 
        "title": "California state prison", 
        "userID": "A_Savage"
    }, 
    {
        "content": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "intTime": 20090528, 
        "postID": 75, 
        "quote": "", 
        "reply": "Well, just because there has always been a demand for it, from whatever type of drug, be it powder, drink, smoke etc does not make me happy about it and it makes me sad that anyone would prey on us and want to feed us more of it. Any type of abuse is a form of weakness or sickness.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:13:00", 
        "title": "California state prison", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "intTime": 20090528, 
        "postID": 76, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:17:00", 
        "title": "California state prison", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "intTime": 20090528, 
        "postID": 77, 
        "quote": "", 
        "reply": "Our criminal justice system is staffed by public service professionals. They generally are competent and know what they're doing. They will agree that non-violent drug users don't belong in prison. In my 33 yrs of public LE I cannot ever recall one case of this happening. The offered scenario is a myth that's passed on by critics of the system. Besides the laws aren't strong enough to permit imprisonment, there's many diversionary programs existing to prevent this from happening. It's also not cost effective or rational with most courts being strained with case volume. Plus imprisoning someone for an addiction is no different than locking someone up for being broke. It's a fairy tale and doesn't happen in any state I've visited. Have faith in us gentlemen!", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:18:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\". Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "intTime": 20090528, 
        "postID": 78, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Take it from someone who's seen it up close and personal - very few drug offenders are \"non-violent\".", 
        "reply": " Many drug addicts support themselves by larcenies, burglaries, and robberies. Drug dealers tend to protect their turf at all costs and many arm themselves. These guys aren't very bright or are good shots. Their bullets have killed innocent targets.", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:20:00", 
        "title": "California state prison", 
        "userID": "scpd3045"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage I was including the cost of overtime...it really does reach nearly 80K...", 
        "intTime": 20090528, 
        "postID": 79, 
        "quote": "Originally posted by A_Savage: quote: The cost of housing a criminal must include the cost of paying the guards, who make 80,000 to start... really ? you source for your \"facts\" is? \"State guards last year collected an average base pay of $57,000, an increase of 27 percent since 2003, but less than the average base pay of a Highway Patrol officer or a San Diego police officer\" Due to overtime because of a shortage of guards some are much higher but the average base pay was $57,000 3 years ago and I do not think it jumped 23,000$ in 3 years. >http://www.signonsandiego.com/uniontrib/20060228/news_1n28guards.html --Savage", 
        "reply": " I was including the cost of overtime...it really does reach nearly 80K...", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:21:00", 
        "title": "California state prison", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me. Why? Do you miss your friends?", 
        "intTime": 20090528, 
        "postID": 80, 
        "quote": "Originally posted by crackerjacks61: Release the non-violent drug users. Makes since to me.", 
        "reply": " Why? Do you miss your friends?", 
        "threadID": "672198221_4460025422001", 
        "time": "2009-05-28 18:23:00", 
        "title": "California state prison", 
        "userID": "adminnco1"
    }
]