[
    {
        "content": "quote: Originally posted by rm444: I hope the IJN kicks some Pirate AZZ. Good for them. <pardon my nostalgia> The IJN (Imperial Japanese Navy) hasn't been called that name since the end of WW2. The name of the Jaapanese Navy today is called the JMSDF (Japanese Maritime Self-Defence Force). And here is another update which shows that at least one of the two JMSDF destroyers sent by Tokyo to fight Somali pirates have been busy: quote: Japan navy aids Singapore ship off Somalia:govt (...) The 4,650-tonne Sazanami, deployed to protect Japanese-registered vessels in and around the Gulf of Aden Noun 1. Gulf of Aden - arm of the Indian Ocean at the entrance to the Red Sea, received a radio call for help from the Singaporean ship at around 1740 GMT (Greenwich Mean Time) See UTC. GMT - Universal Time 1 on Friday, the ministry said. The warship, issued a verbal warning through loudspeakers and beamed a searchlight at the four suspicious boats, which had been pursuing the Singaporean ship, a defence ministry spokeswoman said. The four boats -- one \"sizable\" vessel and three small boats -- then left the area, the spokeswoman said, adding that neither side used weapons and that the four suspicious vessel were not identified. The incident was Japan's first action against suspected pirates off Somalia since the Sazanami and the 4,550-tonne Samidare were dispatched to join an anti-piracy mission there last month. The nation's armed forces could face combat abroad for the first time since World War II in the rare mission. Japan's major past overseas missions -- including in Iraq, near Afghanistan, and as UN peacekeepers -- have been largely for logistical and support purposes such as refuelling... (...) ++http://www.thefreelibrary.com/Japan+navy+aids+Singapore+ship+off+Somalia:govt-a01611835912", 
        "intTime": 20090525, 
        "postID": 8, 
        "quote": "Originally posted by rm444: I hope the IJN kicks some Pirate AZZ. Good for them. <pardon my nostalgia>", 
        "reply": " The IJN (Imperial Japanese Navy) hasn't been called that name since the end of WW2. The name of the Jaapanese Navy today is called the JMSDF (Japanese Maritime Self-Defence Force). And here is another update which shows that at least one of the two JMSDF destroyers sent by Tokyo to fight Somali pirates have been busy: quote: Japan navy aids Singapore ship off Somalia:govt (...) The 4,650-tonne Sazanami, deployed to protect Japanese-registered vessels in and around the Gulf of Aden Noun 1. Gulf of Aden - arm of the Indian Ocean at the entrance to the Red Sea, received a radio call for help from the Singaporean ship at around 1740 GMT (Greenwich Mean Time) See UTC. GMT - Universal Time 1 on Friday, the ministry said. The warship, issued a verbal warning through loudspeakers and beamed a searchlight at the four suspicious boats, which had been pursuing the Singaporean ship, a defence ministry spokeswoman said. The four boats -- one \"sizable\" vessel and three small boats -- then left the area, the spokeswoman said, adding that neither side used weapons and that the four suspicious vessel were not identified. The incident was Japan's first action against suspected pirates off Somalia since the Sazanami and the 4,550-tonne Samidare were dispatched to join an anti-piracy mission there last month. The nation's armed forces could face combat abroad for the first time since World War II in the rare mission. Japan's major past overseas missions -- including in Iraq, near Afghanistan, and as UN peacekeepers -- have been largely for logistical and support purposes such as refuelling... (...) ++http://www.thefreelibrary.com/Japan+navy+aids+Singapore+ship+off+Somalia:govt-a01611835912", 
        "threadID": "672198221_8220062012001", 
        "time": "2009-05-25 19:58:00", 
        "title": "Japanese Destroyer to fight Somali pirates too", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by Enssantor: So will these JMSDF sailors prove to be as fierce in combat as their IJN forebears? From the AFP via Yahoo News: [Japan has been pacifist since defeat in World War II. Under domestic law, the navy can only protect ships flying the Japanese flag or carrying Japanese passengers. Japanese forces have not fired a shot in combat since World War II. But the country has tried to take on a larger role in international security, notably through a reconstruction mission in Iraq... They may have not fired a shot in combat since WWII & can only protect ships flying the Japanese flag...But did you know the Japanese Navy helped out during the Korean War, clearing mines? Interesting article a few years back in American Legion Magazine.[/QUOTE] Their \"Coast Gaurd\", has intercepted drug smugglers and has exchanged fire with North Korean smugglers and PRC smugglers in the Sea of Japan... Respectfully, SUNLINER81", 
        "intTime": 20090525, 
        "postID": 9, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by Enssantor: So will these JMSDF sailors prove to be as fierce in combat as their IJN forebears? From the AFP via Yahoo News: [Japan has been pacifist since defeat in World War II. Under domestic law, the navy can only protect ships flying the Japanese flag or carrying Japanese passengers. Japanese forces have not fired a shot in combat since World War II. But the country has tried to take on a larger role in international security, notably through a reconstruction mission in Iraq...", 
        "reply": " They may have not fired a shot in combat since WWII & can only protect ships flying the Japanese flag...But did you know the Japanese Navy helped out during the Korean War, clearing mines? Interesting article a few years back in American Legion Magazine.[/QUOTE] Their \"Coast Gaurd\", has intercepted drug smugglers and has exchanged fire with North Korean smugglers and PRC smugglers in the Sea of Japan... Respectfully, SUNLINER81", 
        "threadID": "672198221_8220062012001", 
        "time": "2009-05-25 20:20:00", 
        "title": "Japanese Destroyer to fight Somali pirates too", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Aaaarg, these waters be gettin a bit crowded. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090525, 
        "postID": 10, 
        "quote": "", 
        "reply": "Aaaarg, these waters be gettin a bit crowded. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8220062012001", 
        "time": "2009-05-25 20:23:00", 
        "title": "Japanese Destroyer to fight Somali pirates too", 
        "userID": "m551sheridan"
    }
]