[
    {
        "content": "http://www.military.com/news/article/enemy-returns-as-g...ties.html?ESRC=eb.nl April 03, 2009 International Herald Tribune As the U.S. military prepares to withdraw from Iraqi cities, Iraqi and American security officials say jihadi and Baathist militants are rejoining the fight in areas that are largely quiet now, regrouping as a smaller but still lethal insurgency. There is much debate whether any new insurgency, at a time of relative calm in most of Iraq, could ever produce the same levels of violence as at the height of the fighting here. A recent stream of attacks, however, like bubbles that indicate fish beneath still water, suggest the potential danger, all the more perilous now because the Americans who helped pacify Iraq are leaving. Several well-planned bombings, one on a street that had recently reopened because it was thought to be safe, have killed 123 people, most of them in and around Baghdad. Three were suicide bombings, signatures of Al Qaeda in Mesopotamia, a Sunni extremist group. Assassination attempts on members of the Awakening Councils, former insurgents who switched sides for pay, have increased, as are fears that some are joining Al Qaeda or other insurgent groups. On Saturday, a major Awakening leader was arrested on charges, among others, of being a member of the military wing of the outlawed Baath Party. In most places there isn't an insurgency in Iraq anymore,\" said an American military intelligence officer in Washington, who is not permitted to speak on the record. \"What we have now is a terrorism problem, and there is going to be a terrorism problem in Iraq for a long time.\" quote: Predictions Have Been Made That Once Our Troops Leave It Would Become A Breeding Ground For Terrorist activity and training This Is Just The Beginning. This Current Administration Is Hurrying To Leave Iraq without Considering the Cost and toll It May Take On the world the war on terrorism quick decisions must be stopped and careful planning and considerations must be weighed for future actions.", 
        "intTime": 20090403, 
        "postID": 1, 
        "quote": "Predictions Have Been Made That Once Our Troops Leave It Would Become A Breeding Ground For Terrorist activity and training This Is Just The Beginning. This Current Administration Is Hurrying To Leave Iraq without Considering the Cost and toll It May Take On the world the war on terrorism quick decisions must be stopped and careful planning and considerations must be weighed for future actions.", 
        "reply": "http://www.military.com/news/article/enemy-returns-as-g...ties.html?ESRC=eb.nl April 03, 2009 International Herald Tribune As the U.S. military prepares to withdraw from Iraqi cities, Iraqi and American security officials say jihadi and Baathist militants are rejoining the fight in areas that are largely quiet now, regrouping as a smaller but still lethal insurgency. There is much debate whether any new insurgency, at a time of relative calm in most of Iraq, could ever produce the same levels of violence as at the height of the fighting here. A recent stream of attacks, however, like bubbles that indicate fish beneath still water, suggest the potential danger, all the more perilous now because the Americans who helped pacify Iraq are leaving. Several well-planned bombings, one on a street that had recently reopened because it was thought to be safe, have killed 123 people, most of them in and around Baghdad. Three were suicide bombings, signatures of Al Qaeda in Mesopotamia, a Sunni extremist group. Assassination attempts on members of the Awakening Councils, former insurgents who switched sides for pay, have increased, as are fears that some are joining Al Qaeda or other insurgent groups. On Saturday, a major Awakening leader was arrested on charges, among others, of being a member of the military wing of the outlawed Baath Party. In most places there isn't an insurgency in Iraq anymore,\" said an American military intelligence officer in Washington, who is not permitted to speak on the record. \"What we have now is a terrorism problem, and there is going to be a terrorism problem in Iraq for a long time.\" ", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-03 17:19:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "ss_287"
    }, 
    {
        "content": "it is long overdue for the Iraqi people to come to the plate... if they let this happen then they snooze, they lose. We've done our thing, we tried to teach them, we armed them -- noper, it is now up to them. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090403, 
        "postID": 2, 
        "quote": "", 
        "reply": "it is long overdue for the Iraqi people to come to the plate... if they let this happen then they snooze, they lose. We've done our thing, we tried to teach them, we armed them -- noper, it is now up to them. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-03 17:24:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Let it play out. We can not continue in Iraq. Doing so only gets in the way of The Iraqi government doing what it needs to do to maintain peace. It has come around in a full circle.", 
        "intTime": 20090403, 
        "postID": 3, 
        "quote": "", 
        "reply": "Let it play out. We can not continue in Iraq. Doing so only gets in the way of The Iraqi government doing what it needs to do to maintain peace. It has come around in a full circle.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-03 17:25:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: it is long overdue for the Iraqi people to come to the plate... if they let this happen then they snooze, they lose. We've done our thing, we tried to teach them, we armed them -- noper, it is now up to them. I hear the same story from Iraqis over and over again; they don't care about their government or their country. They just want to be left alone. I swear, sometimes I think this country needs another dictator. It's going to be decades of American presence and money before this country even resembles anything more than a war-torn sh*thole.", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "Originally posted by m551sheridan: it is long overdue for the Iraqi people to come to the plate... if they let this happen then they snooze, they lose. We've done our thing, we tried to teach them, we armed them -- noper, it is now up to them.", 
        "reply": " I hear the same story from Iraqis over and over again; they don't care about their government or their country. They just want to be left alone. I swear, sometimes I think this country needs another dictator. It's going to be decades of American presence and money before this country even resembles anything more than a war-torn sh*thole.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 07:39:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Back in the days when the surge first started, I made a comment along these lines right here on these boards and was criticized for it: Gen. Petreaus's plan is little more than a re-stating of the Marine's old CAP strategy from Vietnam, which was successful so long as the Marines remained. Once village security was turned over to the locals, the enemy returned and dealt them some very harsh blows, ultimately resulting in a return to the orginal condition. At this point, I see no reason to change my opinion about the surge strategy.", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "", 
        "reply": "Back in the days when the surge first started, I made a comment along these lines right here on these boards and was criticized for it: Gen. Petreaus's plan is little more than a re-stating of the Marine's old CAP strategy from Vietnam, which was successful so long as the Marines remained. Once village security was turned over to the locals, the enemy returned and dealt them some very harsh blows, ultimately resulting in a return to the orginal condition. At this point, I see no reason to change my opinion about the surge strategy.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 07:45:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Back in the days when the surge first started, I made a comment along these lines right here on these boards and was criticized for it: Gen. Petreaus's plan is little more than a re-stating of the Marine's old CAP strategy from Vietnam, which was successful so long as the Marines remained. Once village security was turned over to the locals, the enemy returned and dealt them some very harsh blows, ultimately resulting in a return to the orginal condition. At this point, I see no reason to change my opinion about the surge strategy. The surge was a band-aid. It's was never meant to be a long term fix to anything. It was just meant to buy time for the government. The minute we leave they're going to either stop paying the Sons of Iraq, or they are going to kick them out of all the jobs they have promised us they will give them and we'll be right back to square one. Every single problem with this country can be traced to it's squabbling on sectarian lines, and nothing we do will fix that. Hell, even the Prime Minister wants to keep Sunnis in their place.", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "Originally posted by stillkit: Back in the days when the surge first started, I made a comment along these lines right here on these boards and was criticized for it: Gen. Petreaus's plan is little more than a re-stating of the Marine's old CAP strategy from Vietnam, which was successful so long as the Marines remained. Once village security was turned over to the locals, the enemy returned and dealt them some very harsh blows, ultimately resulting in a return to the orginal condition. At this point, I see no reason to change my opinion about the surge strategy.", 
        "reply": " The surge was a band-aid. It's was never meant to be a long term fix to anything. It was just meant to buy time for the government. The minute we leave they're going to either stop paying the Sons of Iraq, or they are going to kick them out of all the jobs they have promised us they will give them and we'll be right back to square one. Every single problem with this country can be traced to it's squabbling on sectarian lines, and nothing we do will fix that. Hell, even the Prime Minister wants to keep Sunnis in their place.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 07:54:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "The last War that we actually won, WWII, had Military Control of War in fact if not in name, and Enemy Propaganda internally in the USA was not allowed. Since then, a succession of Political Leaders who have almost no Strategic ability, especially in Simultaneous Strategy against multiple Enemies (not to mention internal Strategic ability against multiple issues like Self-Defense AND Jobs) have managed to lose every War (I include Stalemating in Korea as a loss). The worst Loser Politicians were those which no Military experience whatever, namely Clinton and Obama (including Obama's prior record in Congress). Politicians with partial Military Experience outside of Combat did better but not spectacularly (G. W. Bush for example), and minus the Surge of General Petraeus which is a temporary measure, their record goes down even more. Osher Doctorow", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "", 
        "reply": "The last War that we actually won, WWII, had Military Control of War in fact if not in name, and Enemy Propaganda internally in the USA was not allowed. Since then, a succession of Political Leaders who have almost no Strategic ability, especially in Simultaneous Strategy against multiple Enemies (not to mention internal Strategic ability against multiple issues like Self-Defense AND Jobs) have managed to lose every War (I include Stalemating in Korea as a loss). The worst Loser Politicians were those which no Military experience whatever, namely Clinton and Obama (including Obama's prior record in Congress). Politicians with partial Military Experience outside of Combat did better but not spectacularly (G. W. Bush for example), and minus the Surge of General Petraeus which is a temporary measure, their record goes down even more. Osher Doctorow", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 10:23:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "19981146"
    }, 
    {
        "content": "I caught an interview with the Marine that wrote \"God Willing: My Wild Ride with the Iraqi Army\". He said that in order to truly give democracy a chance in Iraq we need to maintain a presence for at least one generation and focus on the kids of today, because the adults are irretrievably mired in the past. Don't know if he's right or not, but it's certainly food for thought.", 
        "intTime": 20090404, 
        "postID": 8, 
        "quote": "", 
        "reply": "I caught an interview with the Marine that wrote \"God Willing: My Wild Ride with the Iraqi Army\". He said that in order to truly give democracy a chance in Iraq we need to maintain a presence for at least one generation and focus on the kids of today, because the adults are irretrievably mired in the past. Don't know if he's right or not, but it's certainly food for thought.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 13:59:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "godawgz"
    }, 
    {
        "content": "Garrisoning the country, forever, or until the Iraqis get their act together (which could be the same thing) simply is not an option. We can't afford it quote: The worst Loser Politicians were those which no Military experience whatever, namely Clinton and Obama (including Obama's prior record in Congress). Politicians with partial Military Experience outside of Combat did better but not spectacularly (G. W. Bush for example) Like the dentist said to the man with a mouth full of bad teeth, I just don't know where to start. George W Bush's record, slightly better? How in the world do you figure that? Invaded Iraq, unnecessarily it turns out, then through an epic combination of arrogance and incompetence refused to put in an effective strategy and leadership in the Pentagon until he was dragged, kicking a screaming as it were, by the electorate in 2006. Hundreds of billions lost (enough to bailout GM several times over), lives wasted perusing the wrong strategy.. And we haven't talked about how Bin laden escaped, Afghanistan was left to smolder, etc...", 
        "intTime": 20090404, 
        "postID": 9, 
        "quote": "The worst Loser Politicians were those which no Military experience whatever, namely Clinton and Obama (including Obama's prior record in Congress). Politicians with partial Military Experience outside of Combat did better but not spectacularly (G. W. Bush for example)", 
        "reply": "Garrisoning the country, forever, or until the Iraqis get their act together (which could be the same thing) simply is not an option. We can't afford it  Like the dentist said to the man with a mouth full of bad teeth, I just don't know where to start. George W Bush's record, slightly better? How in the world do you figure that? Invaded Iraq, unnecessarily it turns out, then through an epic combination of arrogance and incompetence refused to put in an effective strategy and leadership in the Pentagon until he was dragged, kicking a screaming as it were, by the electorate in 2006. Hundreds of billions lost (enough to bailout GM several times over), lives wasted perusing the wrong strategy.. And we haven't talked about how Bin laden escaped, Afghanistan was left to smolder, etc...", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 14:08:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "s122604"
    }, 
    {
        "content": "I think Iraq was part of a broader ME strategy pursued on the back of terrorism, but without a full-on occupation of the country we still to this day wouldn't know tsaddam's true intentions or capabilities. and counter insurgency strategies have definitely been advanced thru our involvement.. bin Laden escaped? maybe.. effective? certainly not. going on 8 years w/o another 9/11. of course they paraded out some guy who had 'Mathematically' predicted there wouldn't be another 9/11 regardless of what we did/didn't do in response, but i don't really buy it...", 
        "intTime": 20090404, 
        "postID": 10, 
        "quote": "", 
        "reply": "I think Iraq was part of a broader ME strategy pursued on the back of terrorism, but without a full-on occupation of the country we still to this day wouldn't know tsaddam's true intentions or capabilities. and counter insurgency strategies have definitely been advanced thru our involvement.. bin Laden escaped? maybe.. effective? certainly not. going on 8 years w/o another 9/11. of course they paraded out some guy who had 'Mathematically' predicted there wouldn't be another 9/11 regardless of what we did/didn't do in response, but i don't really buy it...", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 14:42:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "godawgz"
    }, 
    {
        "content": "---- O.K.- so 8 minutes after the coalition splits Iraq, the wild-eyed diaper-heads will level all the new power & water plants, be-head halve the country, & send it back to the 14th century... so what`s the down side? - By that time, we`ll all have our George Jetson cars.", 
        "intTime": 20090404, 
        "postID": 11, 
        "quote": "", 
        "reply": "---- O.K.- so 8 minutes after the coalition splits Iraq, the wild-eyed diaper-heads will level all the new power & water plants, be-head halve the country, & send it back to the 14th century... so what`s the down side? - By that time, we`ll all have our George Jetson cars.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-04 19:46:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "GWB just could not leave well enough alone. I remember a GWB quote very early on, speaking of Saddam Hussein \"He tried to kill my dad\" that was really all there ever was too it. GWB thought that his dad screwed up in ODS and it was his job to save the family honor and at the same time prove that he had a bigger dick that the old man did. I firmly believe that had 9-11 never happened before the end of his first term GWB would have one way or another gotten his all important war with Iraq. All this other crap we heard along the way, They were working with \"the terrorist\" HINT HINT HINT IE They were behind 9-11, Weapons of Mass Destruction Blah Blah Blah, They deserve to be free .... fill in any of the things we heard over the last 8 years Saddam maybe was a brital dictator but there are plenty of them around the world. At least under him Iraq wasn't at least from the US perspective the quagmire/blackhole that it is today and unless BHO has the brains and balls to just \"say to hel77 with it\" and throw in the towel it is likely to remain.", 
        "intTime": 20090405, 
        "postID": 12, 
        "quote": "", 
        "reply": "GWB just could not leave well enough alone. I remember a GWB quote very early on, speaking of Saddam Hussein \"He tried to kill my dad\" that was really all there ever was too it. GWB thought that his dad screwed up in ODS and it was his job to save the family honor and at the same time prove that he had a bigger dick that the old man did. I firmly believe that had 9-11 never happened before the end of his first term GWB would have one way or another gotten his all important war with Iraq. All this other crap we heard along the way, They were working with \"the terrorist\" HINT HINT HINT IE They were behind 9-11, Weapons of Mass Destruction Blah Blah Blah, They deserve to be free .... fill in any of the things we heard over the last 8 years Saddam maybe was a brital dictator but there are plenty of them around the world. At least under him Iraq wasn't at least from the US perspective the quagmire/blackhole that it is today and unless BHO has the brains and balls to just \"say to hel77 with it\" and throw in the towel it is likely to remain.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-05 09:39:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by ETCPJ: Saddam maybe was a brital dictator but there are plenty of them around the world. I've said it before and I'll say it again; If GWB wanted a feather in his cap, he should have invaded Cuba. It's still a Communist country, right?!?!?! We would have won that sh*t in less than two months, and mission accomplished could have meant something. Hell, we already have troops there and their Army is a joke. Best of all no insurgency, no suicide bombers, and people ACTUALLY welcoming us with a parade.", 
        "intTime": 20090405, 
        "postID": 13, 
        "quote": "Originally posted by ETCPJ: Saddam maybe was a brital dictator but there are plenty of them around the world.", 
        "reply": " I've said it before and I'll say it again; If GWB wanted a feather in his cap, he should have invaded Cuba. It's still a Communist country, right?!?!?! We would have won that sh*t in less than two months, and mission accomplished could have meant something. Hell, we already have troops there and their Army is a joke. Best of all no insurgency, no suicide bombers, and people ACTUALLY welcoming us with a parade.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-05 09:49:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: I think Iraq was part of a broader ME strategy pursued on the back of terrorism, yeah...black gold \"texas tea\" The plan apparently back fired. Oh well less billions for the elites", 
        "intTime": 20090405, 
        "postID": 14, 
        "quote": "I think Iraq was part of a broader ME strategy pursued on the back of terrorism,", 
        "reply": " yeah...black gold \"texas tea\" The plan apparently back fired. Oh well less billions for the elites", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-05 17:51:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: it is long overdue for the Iraqi people to come to the plate... if they let this happen then they snooze, they lose. We've done our thing, we tried to teach them, we armed them -- noper, it is now up to them. Agreed. If they don't care, I don't care.", 
        "intTime": 20090406, 
        "postID": 15, 
        "quote": "Originally posted by m551sheridan: it is long overdue for the Iraqi people to come to the plate... if they let this happen then they snooze, they lose. We've done our thing, we tried to teach them, we armed them -- noper, it is now up to them.", 
        "reply": " Agreed. If they don't care, I don't care.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-06 03:35:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "vsibaby"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ETCPJ: Saddam maybe was a brital dictator but there are plenty of them around the world. I've said it before and I'll say it again; If GWB wanted a feather in his cap, he should have invaded Cuba. It's still a Communist country, right?!?!?! We would have won that sh*t in less than two months, and mission accomplished could have meant something. Hell, we already have troops there and their Army is a joke. Best of all no insurgency, no suicide bombers, and people ACTUALLY welcoming us with a parade. And cake too! Don't forget the cake. Were you in on the Iraq planning, you sound like the Rumster. The Cuban Cubans would LOVE to meet you!", 
        "intTime": 20090406, 
        "postID": 16, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ETCPJ: Saddam maybe was a brital dictator but there are plenty of them around the world. I've said it before and I'll say it again; If GWB wanted a feather in his cap, he should have invaded Cuba. It's still a Communist country, right?!?!?! We would have won that sh*t in less than two months, and mission accomplished could have meant something. Hell, we already have troops there and their Army is a joke. Best of all no insurgency, no suicide bombers, and people ACTUALLY welcoming us with a parade.", 
        "reply": " And cake too! Don't forget the cake. Were you in on the Iraq planning, you sound like the Rumster. The Cuban Cubans would LOVE to meet you!", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-06 04:27:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by crackerjacks61: quote: I think Iraq was part of a broader ME strategy pursued on the back of terrorism, yeah...black gold \"texas tea\" The plan apparently back fired. Oh well less billions for the elites Oh I don't know...Cheney's company did pretty well.", 
        "intTime": 20090406, 
        "postID": 17, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by crackerjacks61: quote: I think Iraq was part of a broader ME strategy pursued on the back of terrorism, yeah...black gold \"texas tea\" The plan apparently back fired. Oh well less billions for the elites Oh I don't know...Cheney's company did pretty well.", 
        "reply": "", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-06 06:38:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: And cake too! Don't forget the cake. Were you in on the Iraq planning, you sound like the Rumster. The Cuban Cubans would LOVE to meet you! LOL. You're right. Cuba is a huge threat, and would kick our butts with all their weapo...... er..., 1950's cars?", 
        "intTime": 20090406, 
        "postID": 18, 
        "quote": "Originally posted by AliBubba: And cake too! Don't forget the cake. Were you in on the Iraq planning, you sound like the Rumster. The Cuban Cubans would LOVE to meet you!", 
        "reply": " LOL. You're right. Cuba is a huge threat, and would kick our butts with all their weapo...... er..., 1950's cars?", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-06 07:30:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Let me remind you Bush haters out there. The Gulf War when Bush 1 was in charge, HE WAS stopped from going by a United Nations resolution that has a certain point he could go and no farther (sp). So go blow that one. Bush Two, I would like to remind you of a thing call 9/11 (ever heard of that?) Now lets back track a little. Its a well known PROVEN fact that Clinton and Kerry and the democrats stated time again and again that Iraq had WMD's Again Proven Fact. It was a Proven Fact the Clintons Intell (in which Kerry was on the Intell commitee and that other jerk Edwards, he was always gone, now we all know why, he was having an affair)that the Intell was on a score of 1 thru 10, 10 being the highest, it was a minus 5. Clinton had OBL at least twice and let him go. So don't come here whinning about Bush, Whine or suck it in for the people you voted for like Clinton and Kerry. Also would like to remind you of what Clinton did to the Armed Forces, we had 500,000 in the Gulf War, and what 160,000 in Iraq and we are thin and thats using a lot of guard and reserves! So get off your high horses and stop blaming Bush for Clintons screw ups...haven't you ever wondered what Berger stole out of the classify libary? Why did Clinton send him in there? There could only be one answer and that would point that finger straight at Clinton for 9/11 and all the crap that followed.", 
        "intTime": 20090406, 
        "postID": 19, 
        "quote": "", 
        "reply": "Let me remind you Bush haters out there. The Gulf War when Bush 1 was in charge, HE WAS stopped from going by a United Nations resolution that has a certain point he could go and no farther (sp). So go blow that one. Bush Two, I would like to remind you of a thing call 9/11 (ever heard of that?) Now lets back track a little. Its a well known PROVEN fact that Clinton and Kerry and the democrats stated time again and again that Iraq had WMD's Again Proven Fact. It was a Proven Fact the Clintons Intell (in which Kerry was on the Intell commitee and that other jerk Edwards, he was always gone, now we all know why, he was having an affair)that the Intell was on a score of 1 thru 10, 10 being the highest, it was a minus 5. Clinton had OBL at least twice and let him go. So don't come here whinning about Bush, Whine or suck it in for the people you voted for like Clinton and Kerry. Also would like to remind you of what Clinton did to the Armed Forces, we had 500,000 in the Gulf War, and what 160,000 in Iraq and we are thin and thats using a lot of guard and reserves! So get off your high horses and stop blaming Bush for Clintons screw ups...haven't you ever wondered what Berger stole out of the classify libary? Why did Clinton send him in there? There could only be one answer and that would point that finger straight at Clinton for 9/11 and all the crap that followed.", 
        "threadID": "672198221_5520087912001", 
        "time": "2009-04-06 15:49:00", 
        "title": "Enemy Returns as GIs Leave Iraq Cities", 
        "userID": "dman1948"
    }
]