[
    {
        "content": "RE: http://www.military.com/forums/0,15240,187184,00.html Iraq is having problems with political and financial corruption and instability? Sounds like the United States already! Who says our hearts and minds program wasn't going to work?!?", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/forums/0,15240,187184,00.html Iraq is having problems with political and financial corruption and instability? Sounds like the United States already! Who says our hearts and minds program wasn't going to work?!?", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-20 08:48:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "charleshuebner"
    }, 
    {
        "content": "The time is now! We have accomplished many things during this war under the Bush administration and now the Obama administration We need to pull out of Iraq and let the country pull itself together. We are losing many brothers and sisters to a war that is turning into another Vietnam. Our time has been well served and Saddam is no longer on Earth. As for Bin Laden we have NO positive intelligence that he is alive. Lets bring our military home so they can be with there families and stop the senseless dying.", 
        "intTime": 20090322, 
        "postID": 2, 
        "quote": "", 
        "reply": "The time is now! We have accomplished many things during this war under the Bush administration and now the Obama administration We need to pull out of Iraq and let the country pull itself together. We are losing many brothers and sisters to a war that is turning into another Vietnam. Our time has been well served and Saddam is no longer on Earth. As for Bin Laden we have NO positive intelligence that he is alive. Lets bring our military home so they can be with there families and stop the senseless dying.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-22 09:17:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "EAGLEREADY"
    }, 
    {
        "content": "quote: Lets bring our military home so they can be with there families and stop the senseless dying. I do not beleive that any of our men and women that have given their lives has been senceless or in vain. The only way we can discredit their sacrifice is to not see this through. Nothing on earth should keep us from honoring their sacrifice, even at the cost of more of our precious young men and women being killed. Whatever it takes to ensure stability/victory, then come home, we are almost there and this will not be another Vietnam.", 
        "intTime": 20090322, 
        "postID": 3, 
        "quote": "Lets bring our military home so they can be with there families and stop the senseless dying.", 
        "reply": " I do not beleive that any of our men and women that have given their lives has been senceless or in vain. The only way we can discredit their sacrifice is to not see this through. Nothing on earth should keep us from honoring their sacrifice, even at the cost of more of our precious young men and women being killed. Whatever it takes to ensure stability/victory, then come home, we are almost there and this will not be another Vietnam.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-22 12:47:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Lets bring our military home so they can be with there families and stop the senseless dying. I do not beleive that any of our men and women that have given their lives has been senceless or in vain. The only way we can discredit their sacrifice is to not see this through. Nothing on earth should keep us from honoring their sacrifice, even at the cost of more of our precious young men and women being killed. Whatever it takes to ensure stability/victory, then come home, we are almost there and this will not be another Vietnam. But a caveat against going to war over lies. Until the first soldier died that's what it was really all about, so we've discovered. Then it was about removing a despot and bringing 'peace' to a troubled nation. Now it's about blood, and 'honor'. It certainly wasn't about oil.", 
        "intTime": 20090322, 
        "postID": 4, 
        "quote": "Originally posted by BAGodbehere: quote: Lets bring our military home so they can be with there families and stop the senseless dying. I do not beleive that any of our men and women that have given their lives has been senceless or in vain. The only way we can discredit their sacrifice is to not see this through. Nothing on earth should keep us from honoring their sacrifice, even at the cost of more of our precious young men and women being killed. Whatever it takes to ensure stability/victory, then come home, we are almost there and this will not be another Vietnam.", 
        "reply": " But a caveat against going to war over lies. Until the first soldier died that's what it was really all about, so we've discovered. Then it was about removing a despot and bringing 'peace' to a troubled nation. Now it's about blood, and 'honor'. It certainly wasn't about oil.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-22 16:32:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "popsiq"
    }, 
    {
        "content": "President Bush and his Republicans minions were complete LIARS in the lead up to the war....that much is written in history for the rest of time. With that being said, I am at a lost to explain why any Soldier in the all-volunteer military dies in vein. The Soldier volunteers to serve his nation, by simply doing that honorably he cannot die in vein...", 
        "intTime": 20090322, 
        "postID": 5, 
        "quote": "", 
        "reply": "President Bush and his Republicans minions were complete LIARS in the lead up to the war....that much is written in history for the rest of time. With that being said, I am at a lost to explain why any Soldier in the all-volunteer military dies in vein. The Soldier volunteers to serve his nation, by simply doing that honorably he cannot die in vein...", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-22 17:15:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead.", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "", 
        "reply": "So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 05:42:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: It certainly wasn't about oil. Pops, I think it is the oil/money and have always thought so, we all do, even the ones that deny it. It's always about the money/oil and when they tell you it's not,,,thats how you know for sure that it is. We can't have lil mad men reaking havoc in oil land unless of course it's our mad man, then it's okay.", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "It certainly wasn't about oil.", 
        "reply": " Pops, I think it is the oil/money and have always thought so, we all do, even the ones that deny it. It's always about the money/oil and when they tell you it's not,,,thats how you know for sure that it is. We can't have lil mad men reaking havoc in oil land unless of course it's our mad man, then it's okay.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 10:02:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by popsiq: So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead. It is appropriate for a soldier to question his orders if he or she believes them to be immoral. At that point that soldier must be prepared to accept the consequences of their action. But for an army to question, and indeed to refuse the lawful order of their Commander and Chief is a recipe for at best chaos, anarchy, and defeat; and at worsted insurrection and coup d’État. In the normal course of warfare, individual soldiers are responsible for their own actions and able to observe and understand a limited scope of the policy that placed them in harms way. It is the soldiers who are at the mercy of the civilian authority, whose job it is to place them in harms way only as a last resort. If a soldier serves honorably in accordance to his or her oath and dies in the service of his or her country then yes, he or she died with honor, regardless of the politics.", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "Originally posted by popsiq: So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead.", 
        "reply": " It is appropriate for a soldier to question his orders if he or she believes them to be immoral. At that point that soldier must be prepared to accept the consequences of their action. But for an army to question, and indeed to refuse the lawful order of their Commander and Chief is a recipe for at best chaos, anarchy, and defeat; and at worsted insurrection and coup d’État. In the normal course of warfare, individual soldiers are responsible for their own actions and able to observe and understand a limited scope of the policy that placed them in harms way. It is the soldiers who are at the mercy of the civilian authority, whose job it is to place them in harms way only as a last resort. If a soldier serves honorably in accordance to his or her oath and dies in the service of his or her country then yes, he or she died with honor, regardless of the politics.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 11:09:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "The administration of George W. Bush made such a huge mess of the Iraq war, it now cannot possibly be won militarily. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "", 
        "reply": "The administration of George W. Bush made such a huge mess of the Iraq war, it now cannot possibly be won militarily. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 11:14:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by popsiq: So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead. It is appropriate for a soldier to question his orders if he or she believes them to be immoral. At that point that soldier must be prepared to accept the consequences of their action. But for an army to question, and indeed to refuse the lawful order of their Commander and Chief is a recipe for at best chaos, anarchy, and defeat; and at worsted insurrection and coup d’État. In the normal course of warfare, individual soldiers are responsible for their own actions and able to observe and understand a limited scope of the policy that placed them in harms way. It is the soldiers who are at the mercy of the civilian authority, whose job it is to place them in harms way only as a last resort. If a soldier serves honorably in accordance to his or her oath and dies in the service of his or her country then yes, he or she died with honor, regardless of the politics.", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by popsiq: So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead. It is appropriate for a soldier to question his orders if he or she believes them to be immoral. At that point that soldier must be prepared to accept the consequences of their action. But for an army to question, and indeed to refuse the lawful order of their Commander and Chief is a recipe for at best chaos, anarchy, and defeat; and at worsted insurrection and coup d’État. In the normal course of warfare, individual soldiers are responsible for their own actions and able to observe and understand a limited scope of the policy that placed them in harms way. It is the soldiers who are at the mercy of the civilian authority, whose job it is to place them in harms way only as a last resort. If a soldier serves honorably in accordance to his or her oath and dies in the service of his or her country then yes, he or she died with honor, regardless of the politics.", 
        "reply": "", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 11:20:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The administration of George W. Bush made such a huge mess of the Iraq war, it now cannot possibly be won militarily. Military might is one part of the puzzle to bring a lasting victory to America within the confines of OIF. I'm sorry that you are so uniformed on the subject that you would ever consider we are confined solely to military actions in Iraq. Having been there and experienced things first hand I can safely say that there are many things going on besides just military operations. Military operations help stablize and secure the country but diplomatic and reconstruction projects are also hard at work. Considering it was under the previous Administration not the current one that brought that stabillity that certainly exists at this time within that country I'd keep your partisan comments to yourself.", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "Originally posted by jack_flats: The administration of George W. Bush made such a huge mess of the Iraq war, it now cannot possibly be won militarily.", 
        "reply": " Military might is one part of the puzzle to bring a lasting victory to America within the confines of OIF. I'm sorry that you are so uniformed on the subject that you would ever consider we are confined solely to military actions in Iraq. Having been there and experienced things first hand I can safely say that there are many things going on besides just military operations. Military operations help stablize and secure the country but diplomatic and reconstruction projects are also hard at work. Considering it was under the previous Administration not the current one that brought that stabillity that certainly exists at this time within that country I'd keep your partisan comments to yourself.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 11:26:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "NickBrand"
    }, 
    {
        "content": "To ALL you people who TRY to compare Vietnam to Iraq, tell just how do you do that? Since you were never in Vietnam and most never even born yet...tell me how to you compare? You don't know jack..Iraq is no Vietnam period. Tet of 68, almost 40,000 of the enemy was killed, but yet the liberal news media said we lost, our loses were about 1 or 2 thousand. How did we lose there? Think what would happen if we killed 40,000 in one battle in Iraq today, would there be any enemy left to fight? Would you and the liberal news media say we lost again? Remember its Obama's watch, no can blame Bush no more.....", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "", 
        "reply": "To ALL you people who TRY to compare Vietnam to Iraq, tell just how do you do that? Since you were never in Vietnam and most never even born yet...tell me how to you compare? You don't know jack..Iraq is no Vietnam period. Tet of 68, almost 40,000 of the enemy was killed, but yet the liberal news media said we lost, our loses were about 1 or 2 thousand. How did we lose there? Think what would happen if we killed 40,000 in one battle in Iraq today, would there be any enemy left to fight? Would you and the liberal news media say we lost again? Remember its Obama's watch, no can blame Bush no more.....", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-23 13:56:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by popsiq: So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead. It is appropriate for a soldier to question his orders if he or she believes them to be immoral. At that point that soldier must be prepared to accept the consequences of their action. But for an army to question, and indeed to refuse the lawful order of their Commander and Chief is a recipe for at best chaos, anarchy, and defeat; and at worsted insurrection and coup d’État. In the normal course of warfare, individual soldiers are responsible for their own actions and able to observe and understand a limited scope of the policy that placed them in harms way. It is the soldiers who are at the mercy of the civilian authority, whose job it is to place them in harms way only as a last resort. If a soldier serves honorably in accordance to his or her oath and dies in the service of his or her country then yes, he or she died with honor, regardless of the politics.", 
        "intTime": 20090324, 
        "postID": 13, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by popsiq: So dying in the course of doing what you're told, because 'the country' is telling you to do it is honorable? I don't think that is necessarily true. Dying in defense of your country might be honorable. There are Iraqis who have done that and they would have a different perspective on American honor. Berliners have little respect for the Russian memorial to the fallen in that city. Honor is a subjective construct. Dead is dead. It is appropriate for a soldier to question his orders if he or she believes them to be immoral. At that point that soldier must be prepared to accept the consequences of their action. But for an army to question, and indeed to refuse the lawful order of their Commander and Chief is a recipe for at best chaos, anarchy, and defeat; and at worsted insurrection and coup d’État. In the normal course of warfare, individual soldiers are responsible for their own actions and able to observe and understand a limited scope of the policy that placed them in harms way. It is the soldiers who are at the mercy of the civilian authority, whose job it is to place them in harms way only as a last resort. If a soldier serves honorably in accordance to his or her oath and dies in the service of his or her country then yes, he or she died with honor, regardless of the politics.", 
        "reply": "", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-24 10:01:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "Ruanne"
    }, 
    {
        "content": "There is far too much emphasis placed upon the dying in vain canard. I can only speak for myself and other Marines I served with who opined in a similar fashion; we fought, were wounded & maimed, and yes some died not for many of the reasons expounded upon in this thread and in others but because we had an obligation to each other. I cannot recall during combat ever thinking about the details of the war in Vietnam, the politics of the conflict, the bantering back and forth between the many politicians involved, the socio-economic implications...I thought about my obligations at those times of doing what I promised to do...aid, defend, protect, kill or be killed if required, don't make a stupid mistake but to make sure I did all in my power to protect my fellow Marines. I have never looked at my service as a political comment in order to justify my service. And many of my fellow Marines whom I had the honor to serve with feel the same way. The sacrificing of more lives in order to believe it is an obligation to be fulfilled because ignorant politicians make assnine decisions to continue a fight that derives no benefit to America and its position in the world is specious at best and an insult to those who don a uniform of our Armed Forces. It is an attitude and belief that has led many in history down the road of regret after realizing sacrificing more lives to justify the deaths of those who died earlier would somehow change the equation, change the results and somehow change relevant and legitimate evidence. It never has and never will. The decision to go to war had better be made after all evidence has been studied and assurance of victory is predicated upon realistic appraisels of all information available and not pie in the sky manipulated intel. If Iraq and Afghanistan has proven anything, it is our political and military inability to be honest with ourselves. Even a novice could have evaluated the data available pertaining to both countries to realize involvement in a ground war in either country would be an effort in futility. In my life's experiences, if something is good then people will want it...some will want it so badly they will take it, steal it. If something is perceived to be good, one does not need to provide it at the end of the barrel of a gun or with bombs. No recipient of a good thing wants it delivered from an aircraft at 30,000 feet...smart bomb, dumb bomb makes no difference. If America is intent upon exporting democracy worldwide, we had better come up with a better way of accomplishing such a goal than our current set of tactics. Doing so will remove the canard of having to continue a war as a means of honoring those who perished earlier in the conflict by sacrificing more lives as a way of demonstrating our commitment to their memory and sacrifices. Not one person in uniform should be asked to or required to die for a concept that defies common sense. If the decision is made to go to war, it should be total war...destroy enemy forces, destroy a countries infrastructure (physical abilities and food production), subject the population to our total control and dependence upon us for their safety & survival...after accomplishing these steps, we rebuild the country and instill the democratic process within the population. If evidence indicates these steps cannot be accomplished, we do not go to war. S/F Gordon", 
        "intTime": 20090324, 
        "postID": 14, 
        "quote": "", 
        "reply": "There is far too much emphasis placed upon the dying in vain canard. I can only speak for myself and other Marines I served with who opined in a similar fashion; we fought, were wounded & maimed, and yes some died not for many of the reasons expounded upon in this thread and in others but because we had an obligation to each other. I cannot recall during combat ever thinking about the details of the war in Vietnam, the politics of the conflict, the bantering back and forth between the many politicians involved, the socio-economic implications...I thought about my obligations at those times of doing what I promised to do...aid, defend, protect, kill or be killed if required, don't make a stupid mistake but to make sure I did all in my power to protect my fellow Marines. I have never looked at my service as a political comment in order to justify my service. And many of my fellow Marines whom I had the honor to serve with feel the same way. The sacrificing of more lives in order to believe it is an obligation to be fulfilled because ignorant politicians make assnine decisions to continue a fight that derives no benefit to America and its position in the world is specious at best and an insult to those who don a uniform of our Armed Forces. It is an attitude and belief that has led many in history down the road of regret after realizing sacrificing more lives to justify the deaths of those who died earlier would somehow change the equation, change the results and somehow change relevant and legitimate evidence. It never has and never will. The decision to go to war had better be made after all evidence has been studied and assurance of victory is predicated upon realistic appraisels of all information available and not pie in the sky manipulated intel. If Iraq and Afghanistan has proven anything, it is our political and military inability to be honest with ourselves. Even a novice could have evaluated the data available pertaining to both countries to realize involvement in a ground war in either country would be an effort in futility. In my life's experiences, if something is good then people will want it...some will want it so badly they will take it, steal it. If something is perceived to be good, one does not need to provide it at the end of the barrel of a gun or with bombs. No recipient of a good thing wants it delivered from an aircraft at 30,000 feet...smart bomb, dumb bomb makes no difference. If America is intent upon exporting democracy worldwide, we had better come up with a better way of accomplishing such a goal than our current set of tactics. Doing so will remove the canard of having to continue a war as a means of honoring those who perished earlier in the conflict by sacrificing more lives as a way of demonstrating our commitment to their memory and sacrifices. Not one person in uniform should be asked to or required to die for a concept that defies common sense. If the decision is made to go to war, it should be total war...destroy enemy forces, destroy a countries infrastructure (physical abilities and food production), subject the population to our total control and dependence upon us for their safety & survival...after accomplishing these steps, we rebuild the country and instill the democratic process within the population. If evidence indicates these steps cannot be accomplished, we do not go to war. S/F Gordon", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-24 14:02:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "uh34d"
    }, 
    {
        "content": "MAYBE WE ARE WANTING TO WIN THIS WAR SO BAD,SO THAT WE CAN LET AMERICA SEE (OR THE WORLD) THAT WE ARE STILL A STRONG COUNTRY. WHATEVER YOUR BELIEF IS LET IT BE KNOWN THAT WIN OR LOSE WE NEED TO SHOW OUR MILITARY PERSONNEL THAT WE SUPPORT AND LOVE THEM NO MATTER WHAT! AS FOR VIETNAM YOUR RIGHT dman1948 I WASN'T THERE AND NOT BORN YET. VIETNAM WAS SUPPOSED TO BE A POLICING AFFAIR AND TURNED TO OUT TO BE A POLITICAL WAR AMONGST THE SOUTHEAST ASIAN COUNTRIES. IRAQ HAS ALOT OF THE SAME CHARACTERISTICS, MILITARY GOES HERE BUT CAN'T GO THERE. WHY DOESN'T IRAN LET US IN THEIR COUNTRY? BECAUSE THEY ARE HARBORING THE THE FUGITIVES THAT OUR MILITARY IS TRYING TO ERADICATE. YES, ALOT OF GOOD HAS COME FROM THE WAR, BUT NOW LET'S BRING OUR MILITARY HOME. AFTER THE REVOLUTIONARY WAR WAS OVER WHO HELPED AMERICA BUILD? NO BODY! WE ARE DONE IN IRAQ!!!!", 
        "intTime": 20090324, 
        "postID": 15, 
        "quote": "", 
        "reply": "MAYBE WE ARE WANTING TO WIN THIS WAR SO BAD,SO THAT WE CAN LET AMERICA SEE (OR THE WORLD) THAT WE ARE STILL A STRONG COUNTRY. WHATEVER YOUR BELIEF IS LET IT BE KNOWN THAT WIN OR LOSE WE NEED TO SHOW OUR MILITARY PERSONNEL THAT WE SUPPORT AND LOVE THEM NO MATTER WHAT! AS FOR VIETNAM YOUR RIGHT dman1948 I WASN'T THERE AND NOT BORN YET. VIETNAM WAS SUPPOSED TO BE A POLICING AFFAIR AND TURNED TO OUT TO BE A POLITICAL WAR AMONGST THE SOUTHEAST ASIAN COUNTRIES. IRAQ HAS ALOT OF THE SAME CHARACTERISTICS, MILITARY GOES HERE BUT CAN'T GO THERE. WHY DOESN'T IRAN LET US IN THEIR COUNTRY? BECAUSE THEY ARE HARBORING THE THE FUGITIVES THAT OUR MILITARY IS TRYING TO ERADICATE. YES, ALOT OF GOOD HAS COME FROM THE WAR, BUT NOW LET'S BRING OUR MILITARY HOME. AFTER THE REVOLUTIONARY WAR WAS OVER WHO HELPED AMERICA BUILD? NO BODY! WE ARE DONE IN IRAQ!!!!", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-24 20:50:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "EAGLEREADY"
    }, 
    {
        "content": "Last week in Iraq 77 Iraqis died and 143 injured in more than 30 bombing and shooting or security incidents. 7 unidentified bodies retrieved and 36 Iraqis reported arrested by SF. US forces reported 2 dead and 2 wounded personnel. The USAF reported flying 180 tactical air missions over Iraq. It was reported that diminished oil revenues were going to affect the pace of Iraqi reconstruction as well as plans to train and deploy larger police formations. Some bodies were reported withdrawing from the Sons of Iraq program due to non-payment of salary or no follow through on government jobs. Attacks, or other incidents, involving oil transmission were causing increased attention to security. Oil exploration in Iraq is continuing with foreign firms bidding to open new fields in the south and Kurdish north. Such explorations last week turned up another Saddam era mass grave. Kidnappers of British private security personnel indicated that these men were still alive, more than a year after they were taken.", 
        "intTime": 20090325, 
        "postID": 16, 
        "quote": "", 
        "reply": "Last week in Iraq 77 Iraqis died and 143 injured in more than 30 bombing and shooting or security incidents. 7 unidentified bodies retrieved and 36 Iraqis reported arrested by SF. US forces reported 2 dead and 2 wounded personnel. The USAF reported flying 180 tactical air missions over Iraq. It was reported that diminished oil revenues were going to affect the pace of Iraqi reconstruction as well as plans to train and deploy larger police formations. Some bodies were reported withdrawing from the Sons of Iraq program due to non-payment of salary or no follow through on government jobs. Attacks, or other incidents, involving oil transmission were causing increased attention to security. Oil exploration in Iraq is continuing with foreign firms bidding to open new fields in the south and Kurdish north. Such explorations last week turned up another Saddam era mass grave. Kidnappers of British private security personnel indicated that these men were still alive, more than a year after they were taken.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-25 05:38:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by EAGLEREADY: MAYBE WE ARE WANTING TO WIN THIS WAR SO BAD,SO THAT WE CAN LET AMERICA SEE (OR THE WORLD) THAT WE ARE STILL A STRONG COUNTRY. WHATEVER YOUR BELIEF IS LET IT BE KNOWN THAT WIN OR LOSE WE NEED TO SHOW OUR MILITARY PERSONNEL THAT WE SUPPORT AND LOVE THEM NO MATTER WHAT! AS FOR VIETNAM YOUR RIGHT dman1948 I WASN'T THERE AND NOT BORN YET. VIETNAM WAS SUPPOSED TO BE A POLICING AFFAIR AND TURNED TO OUT TO BE A POLITICAL WAR AMONGST THE SOUTHEAST ASIAN COUNTRIES. IRAQ HAS ALOT OF THE SAME CHARACTERISTICS, MILITARY GOES HERE BUT CAN'T GO THERE. WHY DOESN'T IRAN LET US IN THEIR COUNTRY? BECAUSE THEY ARE HARBORING THE THE FUGITIVES THAT OUR MILITARY IS TRYING TO ERADICATE. YES, ALOT OF GOOD HAS COME FROM THE WAR, BUT NOW LET'S BRING OUR MILITARY HOME. AFTER THE REVOLUTIONARY WAR WAS OVER WHO HELPED AMERICA BUILD? NO BODY! WE ARE DONE IN IRAQ!!!! What was 'wrecked' after America's Revolution? 99.9% of the fighting happened out in the boonies. The only Iraq-style destruction mainly affected Indians. Afterwards, Tory (including those Indians) refugees fled to Canada, the Indies or back to England - but Britain 'helped' them. Any displaced yankees had lots of 'deserted' property to claim. If you think about it, America could have built houses (schools and clinics) for a lot more people in the third world than it has been able to flatten in Iraq, or Afghanistan. And at heckuva lot less cost! Now that would have been some impressive display of 'power'.", 
        "intTime": 20090325, 
        "postID": 17, 
        "quote": "Originally posted by EAGLEREADY: MAYBE WE ARE WANTING TO WIN THIS WAR SO BAD,SO THAT WE CAN LET AMERICA SEE (OR THE WORLD) THAT WE ARE STILL A STRONG COUNTRY. WHATEVER YOUR BELIEF IS LET IT BE KNOWN THAT WIN OR LOSE WE NEED TO SHOW OUR MILITARY PERSONNEL THAT WE SUPPORT AND LOVE THEM NO MATTER WHAT! AS FOR VIETNAM YOUR RIGHT dman1948 I WASN'T THERE AND NOT BORN YET. VIETNAM WAS SUPPOSED TO BE A POLICING AFFAIR AND TURNED TO OUT TO BE A POLITICAL WAR AMONGST THE SOUTHEAST ASIAN COUNTRIES. IRAQ HAS ALOT OF THE SAME CHARACTERISTICS, MILITARY GOES HERE BUT CAN'T GO THERE. WHY DOESN'T IRAN LET US IN THEIR COUNTRY? BECAUSE THEY ARE HARBORING THE THE FUGITIVES THAT OUR MILITARY IS TRYING TO ERADICATE. YES, ALOT OF GOOD HAS COME FROM THE WAR, BUT NOW LET'S BRING OUR MILITARY HOME. AFTER THE REVOLUTIONARY WAR WAS OVER WHO HELPED AMERICA BUILD? NO BODY! WE ARE DONE IN IRAQ!!!!", 
        "reply": " What was 'wrecked' after America's Revolution? 99.9% of the fighting happened out in the boonies. The only Iraq-style destruction mainly affected Indians. Afterwards, Tory (including those Indians) refugees fled to Canada, the Indies or back to England - but Britain 'helped' them. Any displaced yankees had lots of 'deserted' property to claim. If you think about it, America could have built houses (schools and clinics) for a lot more people in the third world than it has been able to flatten in Iraq, or Afghanistan. And at heckuva lot less cost! Now that would have been some impressive display of 'power'.", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-03-25 05:46:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "popsiq"
    }, 
    {
        "content": "An Iraq update; In the last two weeks more than 154 Iraqis have died and more than 425 have been reported wounded in more than 76 shooting or bombing incidents. More than 12 unidentified bodies have been found and 8 'bad guys' reported arrested. US forces reported the deaths of 6 service personnel. The USAF reported flying 393 tacair missions in support of operations in Iraq. In other news, a series of car bombings in Baghdad culminated with a SAWHA uprising that left a number of people dead and wounded after clashes between US and Iraqi forces and Sunni militia. Reports of some sort of pogrom against homosexuals in Baghdad hit the news. Another 4 were found shot or stabbed last week. MNFI reported an increasing number of attacks using Russian-designed anti-tank hand grenades. The weapons were sourced to either Syria, or Iran which border Iraq, along with Turkey, Jordan, Kuwait and Saudi Arabia where the weapons definitely couldn't come from. The British pulled out of Basra concluding their stint in Iraq. Basra international airport was turned over to US forces and was reported 'ready for operations' after a British facelift. It has yet to re-open. But things are looking up, former Blackwater employees are finding work in Iraq. This message has been edited. Last edited by: popsiq, Wed 08 April 2009 08:32 AM", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "", 
        "reply": "An Iraq update; In the last two weeks more than 154 Iraqis have died and more than 425 have been reported wounded in more than 76 shooting or bombing incidents. More than 12 unidentified bodies have been found and 8 'bad guys' reported arrested. US forces reported the deaths of 6 service personnel. The USAF reported flying 393 tacair missions in support of operations in Iraq. In other news, a series of car bombings in Baghdad culminated with a SAWHA uprising that left a number of people dead and wounded after clashes between US and Iraqi forces and Sunni militia. Reports of some sort of pogrom against homosexuals in Baghdad hit the news. Another 4 were found shot or stabbed last week. MNFI reported an increasing number of attacks using Russian-designed anti-tank hand grenades. The weapons were sourced to either Syria, or Iran which border Iraq, along with Turkey, Jordan, Kuwait and Saudi Arabia where the weapons definitely couldn't come from. The British pulled out of Basra concluding their stint in Iraq. Basra international airport was turned over to US forces and was reported 'ready for operations' after a British facelift. It has yet to re-open. But things are looking up, former Blackwater employees are finding work in Iraq. This message has been edited. Last edited by: popsiq, Wed 08 April 2009 08:32 AM", 
        "threadID": "672198221_8390004812001", 
        "time": "2009-04-08 07:59:00", 
        "title": "Challenges Remain as Iraq War Enters 7th Year", 
        "userID": "popsiq"
    }
]