[
    {
        "content": "his picturesque community among the redwoods, once dubbed \"the Berkeley of the north\" for its reputation for unabashed liberalism, has repeatedly thumbed its nose at the federal government. Images A man walks across G Street in Arcata, where military rec...Dave Meserve, who placed the recruiting measure on the ba...Army Staff Sgt. Derrick Watt talks to the Bellach family ... View More Images More News * Swine flu empties Mexico City's churches, streets 04.26.09 * World Bank gives aid to Mexico for swine flu 04.26.09 * Seasonal vaccine no help against swine flu 04.26.09 * Developments on swine flu worldwide 04.26.09 Over the years, its civic leaders have declared this city a sanctuary for military resisters to the Persian Gulf War and barred local enforcement of the Patriot Act. If they had had enough pull, President George W. Bush would have been impeached at least once. Now Arcata is at it again, with a law blocking the military from recruiting anybody in town under the age of 18. And this time, the law has the backing not of a few City Council activists, but of thousands of voters who went to the polls in November. On the same day, voters in Eureka, a historically politically staid city a dozen miles away, surprised everybody by approving an identical measure. \"The idea that Humboldt County can fight the federal government is as ridiculous as hell, but ******* it, we're gonna try,\" said Winfield \"Win\" Sample, a World War II veteran turned Orwell-quoting pacifist who brought Arcata's measure to Eureka. In the past, Arcata's quirky pokes at Washington have been shrugged off as the antics of pot-drenched students and patchouli-scented hippies for whom the '60s never quite died. Passionate, but largely irrelevant. Heading for court This time the federal government isn't shrugging. A court hearing is scheduled in Oakland on June 9 on the government's demand that the cities' laws be overturned for seeking powers constitutionally granted to the federal government. Characteristically anti-war cities, including San Francisco and Berkeley, have tried to battle military recruitment. But nobody can recall a case where a city used the ballot box as a counter-recruitment tool, an act that has broader significance. \"It touches on a couple of core issues that really relate to the foundation of government,\" said Allen Weiner, a senior lecturer at Stanford Law School. \"The questions of what areas belong to the federal government, and what areas belong to the state.\" Until November, this town of 18,000 seemed to many residents to be dialing back its rebellious ways, booting some of its more radical activists off the City Council and focusing more on fixing potholes than foreign policy, and Eureka hardly had a history of such obstinacy. Now some in Eureka, where \"Support the Troops\" ribbons far outnumber the \"U.S. Out of Humboldt\" bumper stickers more common in Arcata, worry that Arcata's infra-blue attitude is catching on there. \"People's sense of responsibility isn't there anymore,\" said Michael Hagedorn, a former Marine and father of two teenagers in Eureka who voted against the law. \"It's a responsibility of everybody to take care of this country and serve this country. ... That should be instilled in kids.\" But others say the anti-recruiting measures appealed to Humboldt County's spirit of self-reliance and self-determination, which harks back to the Gold Rush. Tucked behind a wall of towering redwoods and lacking a railroad link to the Bay Area until 1914, its population was largely cut off from the rest of California. Today, Highway 101 provides relatively quick access to the urban centers to the south, but the sense of a Redwood Curtain dividing the county from the rest of the state has never completely faded. \"The fact that Eureka followed suit tells me it's more about independent thinking,\" said Laura Middlemiss, who was born and raised in Arcata, raised three kids there and felt that recruiters calling her kids at home went too far. \"The reason this measure passed in this region is that people don't want to be told what to do.\" The man behind the laws The law was the inspiration of former Arcata City Councilman Dave Meserve, who gained national attention after his 2002 election by spearheading a first-in-the-nation law making compliance with the USA Patriot Act illegal. The council followed up with repeated resolutions calling for Bush's impeachment and withdrawal of troops from Iraq. Meserve's failure to win re-election in 2006 is generally attributed to voter weariness of his sometimes divisive activism. Not easily deterred, in late 2007, Meserve began thinking about ways to re-engage his town against the war. He hit on military recruiting, which he saw as a link between war overseas and everyday life at home, and he decided that instead of going to the same activists or to the council, he'd go to the ballot. \"You don't get anywhere by getting the same 30 people out to the demonstration. You don't get anywhere talking in all the cliches against war, against imperialism,\" he said. The measure, which Meserve wrote to focus on the naivete of youth, easily qualified for the November ballot in Arcata, and then qualified in Eureka, after a last-minute petition drive by Sample and a handful of volunteers. \"Somebody had to start it,\" shrugged Sample, an outspoken man who hands out business cards bearing an Edward Abbey quote - \"A patriot must be ready to defend his country against his government.\" Even after it qualified, few thought Eureka would embrace Arcata's proposal. \"Twenty years ago, I don't think that would have had a ghost of a chance of making the ballot, let alone passing,\" said Eureka Mayor Virginia Bass, whose son is a Marine, and who signed the argument against Eureka's version of the law. \"Maybe (opponents) sat back and said this could never happen - I don't know.\" But when the polls closed on Nov. 4, the measure had won easily in both towns. \"I was of course happy with 73 percent in Arcata,\" Meserve said. \"But 57 percent in Eureka just blew me away.\" San Francisco's school board has battled against JROTC, and Berkeley's City Council issued a letter - since rescinded - calling local Marine recruiters \"unwelcome intruders.\" But the Humboldt County laws appear to be the most direct counter-recruitment effort mounted by a city's electorate anywhere in the nation. The Department of Defense refused to allow interviews with Humboldt County recruiters, citing the lawsuit. A department spokeswoman, responding to written questions, said it is important for recruiters to be able to help young people and their parents make informed decisions about military service. According to data by the National Priorities Project, Humboldt County youths enlist in the Army at a rate of about 1.5 per 1,000 15- to 24- year-olds - a rate a tad higher than California as a whole, and about on par with the national average. In its lawsuit, government lawyers claim the country will suffer \"irreparable harm\" if the Arcata and Eureka laws are allowed to stand. Few people believe the laws will survive the legal challenge. \"The federal government is going to win. If you look at the law it seems like almost a no-brainer,\" said Weiner, the Stanford Law School lecturer, who is not connected to the suit. The supremacy clause placing certain powers - including regulating the military - in federal hands is well established, Weiner said, and generally trumps the right to privacy being claimed by the cities. The cities are also claiming that the United States is party to international treaties prohibiting the recruitment of children under 17 - which they argue include activities such as talking about the benefits of military service. The treaties, the cities argue, hold equal standing to the supremacy clause, an argument Weiner called novel. \"If they were to have a chance, that would be the one place they had a chance,\" he said. But, he added, it is likely the court will define \"recruiting\" as not simply a matter of discussing the benefits of military service, but as a matter of actually signing someone up to serve in the armed forces. Currently, recruits must be 18 to enlist in the military - 17 with parental permission - although contact with recruiters may begin at any age. Activists take notice Win or lose, for Meserve, the election demonstrated that activists can be more effective by reaching out to mainstream voters instead of putting all their resources into rallies or symbolic resolutions - a message that is spreading among activists from Berkeley to back east. \"Activists around the country are certainly looking at this and saying, 'Hmmm, maybe we can do something like that here,' \" said Sam Diener, editor of Peacework Magazine in Cambridge, Mass. Enforcement of the laws is on hold for now, pending the court hearing. Recruiters are still operating in their small offices behind the Big 5 Sporting Goods in Eureka. Recruitment there also takes in Arcata. And young people who wish to serve are still signing on the dotted line. \"My grandpa was in the Army. I just kind of want to get out of Humboldt County and try something new,\" said Mary Bellach, a 17-year-old from Fortuna who is going through the enlistment process. Her sister, Heather Bellach, will go to Air Force boot camp next month. \"Personally, I think it's up to the kids. It's what they're going to do for the rest of their lives.\" No matter what the outcome of the legal battle, residents of Humboldt County seem to want to retain a sense of community. Charles McCann, a lifelong Arcata resident who opposed the measure, recalled in 2007 when his nephew, Peter Schmidt, came home to Arcata as the county's first - and so far only - combat casualty in Iraq. It seemed like the whole town turned out for the funeral, McCann said. So long as that spirit remains, he said, he isn't tempted to wish away all the hippies and students and rebels and turn Arcata back into the conservative logging town of his youth. \"I think we'd lose something. The broad range of members of society, I don't find that threatening,\" he said. \"That's what changes society.\" In Travel: Funky, friendly, and forever Arcata, a great, forest-shrouded place to visit. G6 The Arcata Youth Protection Act This text is an abridged version of the Arcata law passed in November 2008. Eureka passed an identical measure. No person who is employed by or an agent of the United States government shall, within the City of Arcata, in the execution of his or her job duties, recruit, initiate contact with for the purpose of recruiting, or promote the future enlistment of any person under the age of eighteen into any branch of the United States Armed Forces. Nothing in this Ordinance shall prevent any person from voluntarily visiting a military recruitment office or specifically initiating a request to meet with a recruiter. Nothing in this Ordinance shall prevent individuals who are not employed by or agents of the U.S. government from encouraging people under the age of eighteen to join the military. Any military recruiter who violates this Ordinance, as well as his or her commanding officer, shall be held responsible for said violation. Both shall be deemed guilty of an infraction and shall be subject to the penalties stated in the Arcata Municipal Code. ''''http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2009/04/26/MNE6176LK9.DTL&nopu=1\"\"\" traitors..... enough said", 
        "intTime": 20090426, 
        "postID": 1, 
        "quote": "", 
        "reply": "his picturesque community among the redwoods, once dubbed \"the Berkeley of the north\" for its reputation for unabashed liberalism, has repeatedly thumbed its nose at the federal government. Images A man walks across G Street in Arcata, where military rec...Dave Meserve, who placed the recruiting measure on the ba...Army Staff Sgt. Derrick Watt talks to the Bellach family ... View More Images More News * Swine flu empties Mexico City's churches, streets 04.26.09 * World Bank gives aid to Mexico for swine flu 04.26.09 * Seasonal vaccine no help against swine flu 04.26.09 * Developments on swine flu worldwide 04.26.09 Over the years, its civic leaders have declared this city a sanctuary for military resisters to the Persian Gulf War and barred local enforcement of the Patriot Act. If they had had enough pull, President George W. Bush would have been impeached at least once. Now Arcata is at it again, with a law blocking the military from recruiting anybody in town under the age of 18. And this time, the law has the backing not of a few City Council activists, but of thousands of voters who went to the polls in November. On the same day, voters in Eureka, a historically politically staid city a dozen miles away, surprised everybody by approving an identical measure. \"The idea that Humboldt County can fight the federal government is as ridiculous as hell, but ******* it, we're gonna try,\" said Winfield \"Win\" Sample, a World War II veteran turned Orwell-quoting pacifist who brought Arcata's measure to Eureka. In the past, Arcata's quirky pokes at Washington have been shrugged off as the antics of pot-drenched students and patchouli-scented hippies for whom the '60s never quite died. Passionate, but largely irrelevant. Heading for court This time the federal government isn't shrugging. A court hearing is scheduled in Oakland on June 9 on the government's demand that the cities' laws be overturned for seeking powers constitutionally granted to the federal government. Characteristically anti-war cities, including San Francisco and Berkeley, have tried to battle military recruitment. But nobody can recall a case where a city used the ballot box as a counter-recruitment tool, an act that has broader significance. \"It touches on a couple of core issues that really relate to the foundation of government,\" said Allen Weiner, a senior lecturer at Stanford Law School. \"The questions of what areas belong to the federal government, and what areas belong to the state.\" Until November, this town of 18,000 seemed to many residents to be dialing back its rebellious ways, booting some of its more radical activists off the City Council and focusing more on fixing potholes than foreign policy, and Eureka hardly had a history of such obstinacy. Now some in Eureka, where \"Support the Troops\" ribbons far outnumber the \"U.S. Out of Humboldt\" bumper stickers more common in Arcata, worry that Arcata's infra-blue attitude is catching on there. \"People's sense of responsibility isn't there anymore,\" said Michael Hagedorn, a former Marine and father of two teenagers in Eureka who voted against the law. \"It's a responsibility of everybody to take care of this country and serve this country. ... That should be instilled in kids.\" But others say the anti-recruiting measures appealed to Humboldt County's spirit of self-reliance and self-determination, which harks back to the Gold Rush. Tucked behind a wall of towering redwoods and lacking a railroad link to the Bay Area until 1914, its population was largely cut off from the rest of California. Today, Highway 101 provides relatively quick access to the urban centers to the south, but the sense of a Redwood Curtain dividing the county from the rest of the state has never completely faded. \"The fact that Eureka followed suit tells me it's more about independent thinking,\" said Laura Middlemiss, who was born and raised in Arcata, raised three kids there and felt that recruiters calling her kids at home went too far. \"The reason this measure passed in this region is that people don't want to be told what to do.\" The man behind the laws The law was the inspiration of former Arcata City Councilman Dave Meserve, who gained national attention after his 2002 election by spearheading a first-in-the-nation law making compliance with the USA Patriot Act illegal. The council followed up with repeated resolutions calling for Bush's impeachment and withdrawal of troops from Iraq. Meserve's failure to win re-election in 2006 is generally attributed to voter weariness of his sometimes divisive activism. Not easily deterred, in late 2007, Meserve began thinking about ways to re-engage his town against the war. He hit on military recruiting, which he saw as a link between war overseas and everyday life at home, and he decided that instead of going to the same activists or to the council, he'd go to the ballot. \"You don't get anywhere by getting the same 30 people out to the demonstration. You don't get anywhere talking in all the cliches against war, against imperialism,\" he said. The measure, which Meserve wrote to focus on the naivete of youth, easily qualified for the November ballot in Arcata, and then qualified in Eureka, after a last-minute petition drive by Sample and a handful of volunteers. \"Somebody had to start it,\" shrugged Sample, an outspoken man who hands out business cards bearing an Edward Abbey quote - \"A patriot must be ready to defend his country against his government.\" Even after it qualified, few thought Eureka would embrace Arcata's proposal. \"Twenty years ago, I don't think that would have had a ghost of a chance of making the ballot, let alone passing,\" said Eureka Mayor Virginia Bass, whose son is a Marine, and who signed the argument against Eureka's version of the law. \"Maybe (opponents) sat back and said this could never happen - I don't know.\" But when the polls closed on Nov. 4, the measure had won easily in both towns. \"I was of course happy with 73 percent in Arcata,\" Meserve said. \"But 57 percent in Eureka just blew me away.\" San Francisco's school board has battled against JROTC, and Berkeley's City Council issued a letter - since rescinded - calling local Marine recruiters \"unwelcome intruders.\" But the Humboldt County laws appear to be the most direct counter-recruitment effort mounted by a city's electorate anywhere in the nation. The Department of Defense refused to allow interviews with Humboldt County recruiters, citing the lawsuit. A department spokeswoman, responding to written questions, said it is important for recruiters to be able to help young people and their parents make informed decisions about military service. According to data by the National Priorities Project, Humboldt County youths enlist in the Army at a rate of about 1.5 per 1,000 15- to 24- year-olds - a rate a tad higher than California as a whole, and about on par with the national average. In its lawsuit, government lawyers claim the country will suffer \"irreparable harm\" if the Arcata and Eureka laws are allowed to stand. Few people believe the laws will survive the legal challenge. \"The federal government is going to win. If you look at the law it seems like almost a no-brainer,\" said Weiner, the Stanford Law School lecturer, who is not connected to the suit. The supremacy clause placing certain powers - including regulating the military - in federal hands is well established, Weiner said, and generally trumps the right to privacy being claimed by the cities. The cities are also claiming that the United States is party to international treaties prohibiting the recruitment of children under 17 - which they argue include activities such as talking about the benefits of military service. The treaties, the cities argue, hold equal standing to the supremacy clause, an argument Weiner called novel. \"If they were to have a chance, that would be the one place they had a chance,\" he said. But, he added, it is likely the court will define \"recruiting\" as not simply a matter of discussing the benefits of military service, but as a matter of actually signing someone up to serve in the armed forces. Currently, recruits must be 18 to enlist in the military - 17 with parental permission - although contact with recruiters may begin at any age. Activists take notice Win or lose, for Meserve, the election demonstrated that activists can be more effective by reaching out to mainstream voters instead of putting all their resources into rallies or symbolic resolutions - a message that is spreading among activists from Berkeley to back east. \"Activists around the country are certainly looking at this and saying, 'Hmmm, maybe we can do something like that here,' \" said Sam Diener, editor of Peacework Magazine in Cambridge, Mass. Enforcement of the laws is on hold for now, pending the court hearing. Recruiters are still operating in their small offices behind the Big 5 Sporting Goods in Eureka. Recruitment there also takes in Arcata. And young people who wish to serve are still signing on the dotted line. \"My grandpa was in the Army. I just kind of want to get out of Humboldt County and try something new,\" said Mary Bellach, a 17-year-old from Fortuna who is going through the enlistment process. Her sister, Heather Bellach, will go to Air Force boot camp next month. \"Personally, I think it's up to the kids. It's what they're going to do for the rest of their lives.\" No matter what the outcome of the legal battle, residents of Humboldt County seem to want to retain a sense of community. Charles McCann, a lifelong Arcata resident who opposed the measure, recalled in 2007 when his nephew, Peter Schmidt, came home to Arcata as the county's first - and so far only - combat casualty in Iraq. It seemed like the whole town turned out for the funeral, McCann said. So long as that spirit remains, he said, he isn't tempted to wish away all the hippies and students and rebels and turn Arcata back into the conservative logging town of his youth. \"I think we'd lose something. The broad range of members of society, I don't find that threatening,\" he said. \"That's what changes society.\" In Travel: Funky, friendly, and forever Arcata, a great, forest-shrouded place to visit. G6 The Arcata Youth Protection Act This text is an abridged version of the Arcata law passed in November 2008. Eureka passed an identical measure. No person who is employed by or an agent of the United States government shall, within the City of Arcata, in the execution of his or her job duties, recruit, initiate contact with for the purpose of recruiting, or promote the future enlistment of any person under the age of eighteen into any branch of the United States Armed Forces. Nothing in this Ordinance shall prevent any person from voluntarily visiting a military recruitment office or specifically initiating a request to meet with a recruiter. Nothing in this Ordinance shall prevent individuals who are not employed by or agents of the U.S. government from encouraging people under the age of eighteen to join the military. Any military recruiter who violates this Ordinance, as well as his or her commanding officer, shall be held responsible for said violation. Both shall be deemed guilty of an infraction and shall be subject to the penalties stated in the Arcata Municipal Code. ''''http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2009/04/26/MNE6176LK9.DTL&nopu=1\"\"\" traitors..... enough said", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 14:35:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "world_king377"
    }, 
    {
        "content": "pull all federal funding from them,california at it again", 
        "intTime": 20090426, 
        "postID": 2, 
        "quote": "", 
        "reply": "pull all federal funding from them,california at it again", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 15:39:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "ss_287"
    }, 
    {
        "content": "Hype....Seems that they are just simply trying to protect them from exposure that their psychies are not ready for, ie indoctrination, as in former communist/nazi youth organizations...It would not seem that they are in any way anti-military. I say young people are exposed too early, to many things that can hinder the proper development and understanding of many things in adult life.", 
        "intTime": 20090426, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hype....Seems that they are just simply trying to protect them from exposure that their psychies are not ready for, ie indoctrination, as in former communist/nazi youth organizations...It would not seem that they are in any way anti-military. I say young people are exposed too early, to many things that can hinder the proper development and understanding of many things in adult life.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 15:52:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "quote: Originally posted by Tower_Flower: Hype....Seems that they are just simply trying to protect them from exposure that their psychies are not ready for, ie indoctrination, as in former communist/nazi youth organizations...It would not seem that they are in any way anti-military. I say young people are exposed too early, to many things that can hinder the proper development and understanding of many things in adult life. These young people are prodded to make decesions as to what career goals, college, education, or what they would persue in life after school. The military is just one option available to them and should be presented to them as other options are. many schools invite police, military, and others for presentations this should be no different.", 
        "intTime": 20090426, 
        "postID": 4, 
        "quote": "Originally posted by Tower_Flower: Hype....Seems that they are just simply trying to protect them from exposure that their psychies are not ready for, ie indoctrination, as in former communist/nazi youth organizations...It would not seem that they are in any way anti-military. I say young people are exposed too early, to many things that can hinder the proper development and understanding of many things in adult life.", 
        "reply": " These young people are prodded to make decesions as to what career goals, college, education, or what they would persue in life after school. The military is just one option available to them and should be presented to them as other options are. many schools invite police, military, and others for presentations this should be no different.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:00:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "ss_287"
    }, 
    {
        "content": "Yes, as in \"Career Day\", but they are refering to actively recruiting them before they are of age, is what I got from that.", 
        "intTime": 20090426, 
        "postID": 5, 
        "quote": "", 
        "reply": "Yes, as in \"Career Day\", but they are refering to actively recruiting them before they are of age, is what I got from that.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:11:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "quote: Originally posted by Tower_Flower: Hype....Seems that they are just simply trying to protect them from exposure that their psychies are not ready for, ie indoctrination, as in former communist/nazi youth organizations...It would not seem that they are in any way anti-military. I say young people are exposed too early, to many things that can hinder the proper development and understanding of many things in adult life. Are you seriously comparing the US Military to the Hitler Jugend and the Pioneer Movement of the Communists???", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "Originally posted by Tower_Flower: Hype....Seems that they are just simply trying to protect them from exposure that their psychies are not ready for, ie indoctrination, as in former communist/nazi youth organizations...It would not seem that they are in any way anti-military. I say young people are exposed too early, to many things that can hinder the proper development and understanding of many things in adult life.", 
        "reply": " Are you seriously comparing the US Military to the Hitler Jugend and the Pioneer Movement of the Communists???", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:11:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "No, but that type of active recruiting of the youth before they are of age is what I am getting out of their ordinance.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "", 
        "reply": "No, but that type of active recruiting of the youth before they are of age is what I am getting out of their ordinance.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:14:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "Everyone here does know that a 17 year old can enlist with their parents permission? As pointed out above, any and all Fereral funding, assistance, etc. should cut off completely.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "", 
        "reply": "Everyone here does know that a 17 year old can enlist with their parents permission? As pointed out above, any and all Fereral funding, assistance, etc. should cut off completely.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:22:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "shuman14"
    }, 
    {
        "content": "Since one cant join before 17 without a Parent or Legal Guardian signing off on it, it's academic really. No 16 year old is getting in, Believe me I tried when I was 16, Recruiter wouldnt touch me with a 10 foot pole until I met the minimum age. This has little to do with recruiting and more to do with left wing hatred for this Country and our Military. Hippies who dont realize the 60's ended 39 years ago & are holding on to their image of relevance. Yet while being the largest Marijuana growing area of the USA, part of the Emerald Triangle\" with Mendicino & Trinity counties.", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "", 
        "reply": "Since one cant join before 17 without a Parent or Legal Guardian signing off on it, it's academic really. No 16 year old is getting in, Believe me I tried when I was 16, Recruiter wouldnt touch me with a 10 foot pole until I met the minimum age. This has little to do with recruiting and more to do with left wing hatred for this Country and our Military. Hippies who dont realize the 60's ended 39 years ago & are holding on to their image of relevance. Yet while being the largest Marijuana growing area of the USA, part of the Emerald Triangle\" with Mendicino & Trinity counties.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:26:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Shuman.. Yes, I specifically knew that, but here again it is still the parent who has the \"say so\" until they are \"of age\", and if they feel the child is matured to that point of joining the military then so be it...that is what I feel this county is saying. Coming from a logging community environment, I know that they are pro-military, and give the highest respect to military personel, so if they are doing this, I am sure there is more to the story than what meets the eye...don't know, didn't come from that part of the country..just my opinion.", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "", 
        "reply": "Shuman.. Yes, I specifically knew that, but here again it is still the parent who has the \"say so\" until they are \"of age\", and if they feel the child is matured to that point of joining the military then so be it...that is what I feel this county is saying. Coming from a logging community environment, I know that they are pro-military, and give the highest respect to military personel, so if they are doing this, I am sure there is more to the story than what meets the eye...don't know, didn't come from that part of the country..just my opinion.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:33:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Since one cant join before 17 without a Parent or Legal Guardian signing off on it, it's academic really. No 16 year old is getting in, Believe me I tried when I was 16, Recruiter wouldnt touch me with a 10 foot pole until I met the minimum age. This has little to do with recruiting and more to do with left wing hatred for this Country and our Military. Hippies who dont realize the 60's ended 39 years ago & are holding on to their image of relevance. Yet while being the largest Marijuana growing area of the USA, part of the Emerald Triangle\" with Mendicino & Trinity counties. Ooohkay, didn't know that piece of info concerning that area.....guess taking away their funding wouldn't effect them much", 
        "intTime": 20090426, 
        "postID": 11, 
        "quote": "Originally posted by LineDoggie: Since one cant join before 17 without a Parent or Legal Guardian signing off on it, it's academic really. No 16 year old is getting in, Believe me I tried when I was 16, Recruiter wouldnt touch me with a 10 foot pole until I met the minimum age. This has little to do with recruiting and more to do with left wing hatred for this Country and our Military. Hippies who dont realize the 60's ended 39 years ago & are holding on to their image of relevance. Yet while being the largest Marijuana growing area of the USA, part of the Emerald Triangle\" with Mendicino & Trinity counties.", 
        "reply": " Ooohkay, didn't know that piece of info concerning that area.....guess taking away their funding wouldn't effect them much", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:37:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "The federal Government can take action if they so desire. If they don't then Humboldt County should continue doing what they are doing. This is American after all.", 
        "intTime": 20090426, 
        "postID": 12, 
        "quote": "", 
        "reply": "The federal Government can take action if they so desire. If they don't then Humboldt County should continue doing what they are doing. This is American after all.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:42:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Duster6"
    }, 
    {
        "content": "Phew.....", 
        "intTime": 20090426, 
        "postID": 13, 
        "quote": "", 
        "reply": "Phew.....", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 16:53:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "Sounds like a round-up for FEMA Camp #17 for civil disobedience..taser them 1st to put them in-line.", 
        "intTime": 20090426, 
        "postID": 14, 
        "quote": "", 
        "reply": "Sounds like a round-up for FEMA Camp #17 for civil disobedience..taser them 1st to put them in-line.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 17:38:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Typical ruination of a good town by the pot growing hippies that destroy decient towns when they move in!", 
        "intTime": 20090426, 
        "postID": 15, 
        "quote": "", 
        "reply": "Typical ruination of a good town by the pot growing hippies that destroy decient towns when they move in!", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-26 17:54:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "EAG154"
    }, 
    {
        "content": "Sounds like Humbodlt-Hippie County just needs some Napalm and some pesticide. Probably some Pilots at Travis AFB that need some flight time...", 
        "intTime": 20090427, 
        "postID": 16, 
        "quote": "", 
        "reply": "Sounds like Humbodlt-Hippie County just needs some Napalm and some pesticide. Probably some Pilots at Travis AFB that need some flight time...", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-27 00:21:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "swremwin"
    }, 
    {
        "content": "I say make Humbolt a Combined Services Urban Warefare Training Site.", 
        "intTime": 20090427, 
        "postID": 17, 
        "quote": "", 
        "reply": "I say make Humbolt a Combined Services Urban Warefare Training Site.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-27 06:16:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "SSW, it'd be cheaper to just nuke'em, we have not tested any for quite some time, zero in on the guy with the sandals,peace sign tatoo and tie-dye and vaporize the place. I like the idea of pulling all federal funding too, if we can't nuke'em. Peace sign = the footprint of the American chicken.", 
        "intTime": 20090427, 
        "postID": 18, 
        "quote": "", 
        "reply": "SSW, it'd be cheaper to just nuke'em, we have not tested any for quite some time, zero in on the guy with the sandals,peace sign tatoo and tie-dye and vaporize the place. I like the idea of pulling all federal funding too, if we can't nuke'em. Peace sign = the footprint of the American chicken.", 
        "threadID": "672198221_7040048122001", 
        "time": "2009-04-27 11:57:00", 
        "title": "Humboldt County cities restrict military", 
        "userID": "BAGodbehere"
    }
]