[
    {
        "content": "\"http://online.wsj.com/article/SB124208505896608647.html\" quote: Senate leaders are considering new federal taxes on soda and other sugary drinks to help pay for an overhaul of the nation's health-care system. The taxes would pay for only a fraction of the cost to expand health-insurance coverage to all Americans and would face strong opposition from the beverage industry. They also could spark a backlash from consumers who would have to pay several cents more for a soft drink. On Tuesday, the Senate Finance Committee is set to hear proposals from about a dozen experts about how to pay for the comprehensive health-care overhaul that President Barack Obama wants to enact this year. Early estimates put the cost of the plan at around $1.2 trillion. The administration has so far only earmarked funds for about half of that amount. The Center for Science in the Public Interest, a Washington-based watchdog group that pressures food companies to make healthier products, plans to propose a federal excise tax on soda, certain fruit drinks, energy drinks, sports drinks and ready-to-drink teas. It would not include most diet beverages. Excise taxes are levied on goods and manufacturers typically pass them on to consumers. Senior staff members for some Democratic senators at the center of the effort to craft health-care legislation are weighing the idea behind closed doors, Senate aides said. The more we \"ask\" the government to help us the more we allow them to take control over our lives. I would rather work two jobs to pay for my health care than allow the government to tell me what I can and can not do by taxing things to the point where they can no longer be enjoyed.", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "Senate leaders are considering new federal taxes on soda and other sugary drinks to help pay for an overhaul of the nation's health-care system. The taxes would pay for only a fraction of the cost to expand health-insurance coverage to all Americans and would face strong opposition from the beverage industry. They also could spark a backlash from consumers who would have to pay several cents more for a soft drink. On Tuesday, the Senate Finance Committee is set to hear proposals from about a dozen experts about how to pay for the comprehensive health-care overhaul that President Barack Obama wants to enact this year. Early estimates put the cost of the plan at around $1.2 trillion. The administration has so far only earmarked funds for about half of that amount. The Center for Science in the Public Interest, a Washington-based watchdog group that pressures food companies to make healthier products, plans to propose a federal excise tax on soda, certain fruit drinks, energy drinks, sports drinks and ready-to-drink teas. It would not include most diet beverages. Excise taxes are levied on goods and manufacturers typically pass them on to consumers. Senior staff members for some Democratic senators at the center of the effort to craft health-care legislation are weighing the idea behind closed doors, Senate aides said.", 
        "reply": "\"http://online.wsj.com/article/SB124208505896608647.html\"  The more we \"ask\" the government to help us the more we allow them to take control over our lives. I would rather work two jobs to pay for my health care than allow the government to tell me what I can and can not do by taxing things to the point where they can no longer be enjoyed.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 07:01:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "stec74"
    }, 
    {
        "content": "Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 07:32:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "L0A1"
    }, 
    {
        "content": "Fits in the overall scheme; get rid of those things that someone else deems not good for you through taxation under the guise of \"it is for health care\". And when that does not generate enough money, and it probably will not, something will get taxed. there is a difference between promoting healthy lifestyles and dictating it. Maybe if people didn't sue over playground incidents and games at recess kids would actually PLAY and run off that excess energy and calories. But no, we have to have big brother look out for us all the while charging for the privilage while little Johnny and Becky sit on their duffs playing video games. Geez, thanks", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "Fits in the overall scheme; get rid of those things that someone else deems not good for you through taxation under the guise of \"it is for health care\". And when that does not generate enough money, and it probably will not, something will get taxed. there is a difference between promoting healthy lifestyles and dictating it. Maybe if people didn't sue over playground incidents and games at recess kids would actually PLAY and run off that excess energy and calories. But no, we have to have big brother look out for us all the while charging for the privilage while little Johnny and Becky sit on their duffs playing video games. Geez, thanks", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 07:58:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "sw614"
    }, 
    {
        "content": "Great, then when the soda companies start to go bankrupt we can bail them out. Since nobody will be buy soda anymore where will they go next to get the money for the healthcare overhaul?", 
        "intTime": 20090513, 
        "postID": 4, 
        "quote": "", 
        "reply": "Great, then when the soda companies start to go bankrupt we can bail them out. Since nobody will be buy soda anymore where will they go next to get the money for the healthcare overhaul?", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:02:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Just like the last guy that said “No new taxes”.", 
        "intTime": 20090513, 
        "postID": 5, 
        "quote": "Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure.", 
        "reply": " Just like the last guy that said “No new taxes”.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:04:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Just like the last guy that said “No new taxes”. Exactly", 
        "intTime": 20090513, 
        "postID": 6, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Just like the last guy that said “No new taxes”.", 
        "reply": " Exactly", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:08:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "athos20"
    }, 
    {
        "content": "It will be funny when the mafia starts providing soda that “fell of a truck”.", 
        "intTime": 20090513, 
        "postID": 7, 
        "quote": "", 
        "reply": "It will be funny when the mafia starts providing soda that “fell of a truck”.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:15:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "xnavycg"
    }, 
    {
        "content": "People will try to smuggle it through the borders. Or make it in their basements.", 
        "intTime": 20090513, 
        "postID": 8, 
        "quote": "", 
        "reply": "People will try to smuggle it through the borders. Or make it in their basements.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:17:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "athos20"
    }, 
    {
        "content": "Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "intTime": 20090513, 
        "postID": 9, 
        "quote": "", 
        "reply": "Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:28:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works?", 
        "intTime": 20090513, 
        "postID": 10, 
        "quote": "Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "reply": " Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works?", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:37:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "What a shining example of change you can believe in. As the government nickel and dimes us to death I'd like to point out wtf is people actually thinking about when they elect these hacks into government.", 
        "intTime": 20090513, 
        "postID": 11, 
        "quote": "", 
        "reply": "What a shining example of change you can believe in. As the government nickel and dimes us to death I'd like to point out wtf is people actually thinking about when they elect these hacks into government.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:40:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "NickBrand"
    }, 
    {
        "content": "Hi Ol Doc That is a good point you made about the smoking tax going to the area it offends. But wouldn't you have to open that up to include all types of smoke related issues? It is not only the addict that suffers from smoking issues, second hand smoking was a huge issue too. I think people should have the right to smoke if they want, but I should have the right to not be around it. So, you wont like this , but I am happy that people can't smoke in public places. That is not to say I want all places non smoking. If a place allowed smoking, I just would know not to go to there. Or if a plane allowed smoking, I would know to pick the non smoking flight etc", 
        "intTime": 20090513, 
        "postID": 12, 
        "quote": "", 
        "reply": "Hi Ol Doc That is a good point you made about the smoking tax going to the area it offends. But wouldn't you have to open that up to include all types of smoke related issues? It is not only the addict that suffers from smoking issues, second hand smoking was a huge issue too. I think people should have the right to smoke if they want, but I should have the right to not be around it. So, you wont like this , but I am happy that people can't smoke in public places. That is not to say I want all places non smoking. If a place allowed smoking, I just would know not to go to there. Or if a plane allowed smoking, I would know to pick the non smoking flight etc", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:50:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works? That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. Alcohol is next. Beer tax and liquor tax is the next agenda. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 13, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works?", 
        "reply": " That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. Alcohol is next. Beer tax and liquor tax is the next agenda. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:52:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. What ever happened to making personal choices and sacrifices due to needs, wants, and personal responsibility? My six year old daughter does not drink soda. She does not eat candy. Her idea of dessert is one oreo cookie. My wife and I taught her these habits, not some hack politician. When I became overweight, I dieted and exercised my way back into good health. I run five days a week to allow me the opportunity to eat what I want, when I want. I am currently training for a marathon and I drink soda to keep weight on. Should I be penalized for drinking soda because I am exercising too much? Once we \"accept\" encroachment on our rights due to increased taxation it will continue to grow. First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end.", 
        "intTime": 20090513, 
        "postID": 14, 
        "quote": "Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "reply": " What ever happened to making personal choices and sacrifices due to needs, wants, and personal responsibility? My six year old daughter does not drink soda. She does not eat candy. Her idea of dessert is one oreo cookie. My wife and I taught her these habits, not some hack politician. When I became overweight, I dieted and exercised my way back into good health. I run five days a week to allow me the opportunity to eat what I want, when I want. I am currently training for a marathon and I drink soda to keep weight on. Should I be penalized for drinking soda because I am exercising too much? Once we \"accept\" encroachment on our rights due to increased taxation it will continue to grow. First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:59:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "stec74"
    }, 
    {
        "content": "Unfortunatley, it will not end. Congrats on your lifestyle change stec! And way to take control of your family and give your child the tools for a healthy life.", 
        "intTime": 20090513, 
        "postID": 15, 
        "quote": "", 
        "reply": "Unfortunatley, it will not end. Congrats on your lifestyle change stec! And way to take control of your family and give your child the tools for a healthy life.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:18:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "usa_girl"
    }, 
    {
        "content": "stec74; quote: First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end. Alcohol is not taxed near what cigarettes are, the tax went up some 154% in March. And it wasn't just cigarettes, it was all tobacco products. And I guess since many people are actually quitting, they aren't going to raise the capital for Universal Health care as they expected...", 
        "intTime": 20090513, 
        "postID": 16, 
        "quote": "First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end.", 
        "reply": "stec74;  Alcohol is not taxed near what cigarettes are, the tax went up some 154% in March. And it wasn't just cigarettes, it was all tobacco products. And I guess since many people are actually quitting, they aren't going to raise the capital for Universal Health care as they expected...", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:32:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "3678131"
    }, 
    {
        "content": "L0A1; quote: That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. As long as folks who do not struggle with their weight, or any other issues like this..continue to push for these taxes.. Hey I'm not overweight, so yeah tax these things, so that people will want to eat healthy. I don't smoke, so this is a good idea..because hey, I don't want to pay for their medical care.. I don't drink, but hey some people who drink get liver disease which raises the cost of health care so yeah, raise taxes on alcohol. Now, we have thousands of people who have quit smoking, drinking and eating junk food, now there's not enough money coming in to pay for universal health care..now what can we tax?? Everyone is eating healthy foods lets raise the taxes on That!!!", 
        "intTime": 20090513, 
        "postID": 17, 
        "quote": "That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop.", 
        "reply": "L0A1;  As long as folks who do not struggle with their weight, or any other issues like this..continue to push for these taxes.. Hey I'm not overweight, so yeah tax these things, so that people will want to eat healthy. I don't smoke, so this is a good idea..because hey, I don't want to pay for their medical care.. I don't drink, but hey some people who drink get liver disease which raises the cost of health care so yeah, raise taxes on alcohol. Now, we have thousands of people who have quit smoking, drinking and eating junk food, now there's not enough money coming in to pay for universal health care..now what can we tax?? Everyone is eating healthy foods lets raise the taxes on That!!!", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:43:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by L0A1: That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. Realistically…when we die. That’s when taxes will end (at least for us individually). The point is not “End Taxes”. That can’t happen unless you’re willing to end road construction and repair, bridge repair, fire fighting services, law enforcement services, disaster relief, public education, national defense and a whole lot of other “commons”. The point is to guard against regressive taxes that target those who can least afford them.", 
        "intTime": 20090513, 
        "postID": 18, 
        "quote": "Originally posted by L0A1: That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop.", 
        "reply": " Realistically…when we die. That’s when taxes will end (at least for us individually). The point is not “End Taxes”. That can’t happen unless you’re willing to end road construction and repair, bridge repair, fire fighting services, law enforcement services, disaster relief, public education, national defense and a whole lot of other “commons”. The point is to guard against regressive taxes that target those who can least afford them.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:57:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "All there is left to say is contact YOUR elected officials and let them know how you feel, and if they continue on this path work to remove them from office when they come up for re-election, maybe even run against them if need be.", 
        "intTime": 20090513, 
        "postID": 19, 
        "quote": "", 
        "reply": "All there is left to say is contact YOUR elected officials and let them know how you feel, and if they continue on this path work to remove them from office when they come up for re-election, maybe even run against them if need be.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 11:03:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "3678131"
    }, 
    {
        "content": "It won't pass.", 
        "intTime": 20090513, 
        "postID": 20, 
        "quote": "", 
        "reply": "It won't pass.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 11:11:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"http://online.wsj.com/article/SB124208505896608647.html\" quote: Senate leaders are considering new federal taxes on soda and other sugary drinks to help pay for an overhaul of the nation's health-care system. The taxes would pay for only a fraction of the cost to expand health-insurance coverage to all Americans and would face strong opposition from the beverage industry. They also could spark a backlash from consumers who would have to pay several cents more for a soft drink. On Tuesday, the Senate Finance Committee is set to hear proposals from about a dozen experts about how to pay for the comprehensive health-care overhaul that President Barack Obama wants to enact this year. Early estimates put the cost of the plan at around $1.2 trillion. The administration has so far only earmarked funds for about half of that amount. The Center for Science in the Public Interest, a Washington-based watchdog group that pressures food companies to make healthier products, plans to propose a federal excise tax on soda, certain fruit drinks, energy drinks, sports drinks and ready-to-drink teas. It would not include most diet beverages. Excise taxes are levied on goods and manufacturers typically pass them on to consumers. Senior staff members for some Democratic senators at the center of the effort to craft health-care legislation are weighing the idea behind closed doors, Senate aides said. The more we \"ask\" the government to help us the more we allow them to take control over our lives. I would rather work two jobs to pay for my health care than allow the government to tell me what I can and can not do by taxing things to the point where they can no longer be enjoyed.", 
        "intTime": 20090513, 
        "postID": 21, 
        "quote": "Senate leaders are considering new federal taxes on soda and other sugary drinks to help pay for an overhaul of the nation's health-care system. The taxes would pay for only a fraction of the cost to expand health-insurance coverage to all Americans and would face strong opposition from the beverage industry. They also could spark a backlash from consumers who would have to pay several cents more for a soft drink. On Tuesday, the Senate Finance Committee is set to hear proposals from about a dozen experts about how to pay for the comprehensive health-care overhaul that President Barack Obama wants to enact this year. Early estimates put the cost of the plan at around $1.2 trillion. The administration has so far only earmarked funds for about half of that amount. The Center for Science in the Public Interest, a Washington-based watchdog group that pressures food companies to make healthier products, plans to propose a federal excise tax on soda, certain fruit drinks, energy drinks, sports drinks and ready-to-drink teas. It would not include most diet beverages. Excise taxes are levied on goods and manufacturers typically pass them on to consumers. Senior staff members for some Democratic senators at the center of the effort to craft health-care legislation are weighing the idea behind closed doors, Senate aides said.", 
        "reply": "\"http://online.wsj.com/article/SB124208505896608647.html\"  The more we \"ask\" the government to help us the more we allow them to take control over our lives. I would rather work two jobs to pay for my health care than allow the government to tell me what I can and can not do by taxing things to the point where they can no longer be enjoyed.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 07:01:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "stec74"
    }, 
    {
        "content": "Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 22, 
        "quote": "", 
        "reply": "Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 07:32:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "L0A1"
    }, 
    {
        "content": "Fits in the overall scheme; get rid of those things that someone else deems not good for you through taxation under the guise of \"it is for health care\". And when that does not generate enough money, and it probably will not, something will get taxed. there is a difference between promoting healthy lifestyles and dictating it. Maybe if people didn't sue over playground incidents and games at recess kids would actually PLAY and run off that excess energy and calories. But no, we have to have big brother look out for us all the while charging for the privilage while little Johnny and Becky sit on their duffs playing video games. Geez, thanks", 
        "intTime": 20090513, 
        "postID": 23, 
        "quote": "", 
        "reply": "Fits in the overall scheme; get rid of those things that someone else deems not good for you through taxation under the guise of \"it is for health care\". And when that does not generate enough money, and it probably will not, something will get taxed. there is a difference between promoting healthy lifestyles and dictating it. Maybe if people didn't sue over playground incidents and games at recess kids would actually PLAY and run off that excess energy and calories. But no, we have to have big brother look out for us all the while charging for the privilage while little Johnny and Becky sit on their duffs playing video games. Geez, thanks", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 07:58:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "sw614"
    }, 
    {
        "content": "Great, then when the soda companies start to go bankrupt we can bail them out. Since nobody will be buy soda anymore where will they go next to get the money for the healthcare overhaul?", 
        "intTime": 20090513, 
        "postID": 24, 
        "quote": "", 
        "reply": "Great, then when the soda companies start to go bankrupt we can bail them out. Since nobody will be buy soda anymore where will they go next to get the money for the healthcare overhaul?", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:02:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Just like the last guy that said “No new taxes”.", 
        "intTime": 20090513, 
        "postID": 25, 
        "quote": "Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure.", 
        "reply": " Just like the last guy that said “No new taxes”.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:04:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "xnavycg"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Just like the last guy that said “No new taxes”. Exactly", 
        "intTime": 20090513, 
        "postID": 26, 
        "quote": "Originally posted by xnavycg: quote: Originally posted by L0A1: Yep, actually they are trying to blanket taxes on ANYTHING with surgar in it. Love the Demotax tactics. Obama breaks another promise. \"Not one single american will see higher taxes that make under $250,000.00 Another lie. Keep them comming, this will end being a 1 term president for sure. Just like the last guy that said “No new taxes”.", 
        "reply": " Exactly", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:08:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "athos20"
    }, 
    {
        "content": "It will be funny when the mafia starts providing soda that “fell of a truck”.", 
        "intTime": 20090513, 
        "postID": 27, 
        "quote": "", 
        "reply": "It will be funny when the mafia starts providing soda that “fell of a truck”.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:15:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "xnavycg"
    }, 
    {
        "content": "People will try to smuggle it through the borders. Or make it in their basements.", 
        "intTime": 20090513, 
        "postID": 28, 
        "quote": "", 
        "reply": "People will try to smuggle it through the borders. Or make it in their basements.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:17:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "athos20"
    }, 
    {
        "content": "Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "intTime": 20090513, 
        "postID": 29, 
        "quote": "", 
        "reply": "Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:28:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works?", 
        "intTime": 20090513, 
        "postID": 30, 
        "quote": "Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "reply": " Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works?", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:37:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "What a shining example of change you can believe in. As the government nickel and dimes us to death I'd like to point out wtf is people actually thinking about when they elect these hacks into government.", 
        "intTime": 20090513, 
        "postID": 31, 
        "quote": "", 
        "reply": "What a shining example of change you can believe in. As the government nickel and dimes us to death I'd like to point out wtf is people actually thinking about when they elect these hacks into government.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:40:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "NickBrand"
    }, 
    {
        "content": "Hi Ol Doc That is a good point you made about the smoking tax going to the area it offends. But wouldn't you have to open that up to include all types of smoke related issues? It is not only the addict that suffers from smoking issues, second hand smoking was a huge issue too. I think people should have the right to smoke if they want, but I should have the right to not be around it. So, you wont like this , but I am happy that people can't smoke in public places. That is not to say I want all places non smoking. If a place allowed smoking, I just would know not to go to there. Or if a plane allowed smoking, I would know to pick the non smoking flight etc", 
        "intTime": 20090513, 
        "postID": 32, 
        "quote": "", 
        "reply": "Hi Ol Doc That is a good point you made about the smoking tax going to the area it offends. But wouldn't you have to open that up to include all types of smoke related issues? It is not only the addict that suffers from smoking issues, second hand smoking was a huge issue too. I think people should have the right to smoke if they want, but I should have the right to not be around it. So, you wont like this , but I am happy that people can't smoke in public places. That is not to say I want all places non smoking. If a place allowed smoking, I just would know not to go to there. Or if a plane allowed smoking, I would know to pick the non smoking flight etc", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:50:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works? That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. Alcohol is next. Beer tax and liquor tax is the next agenda. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 33, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. Yes the cigarette tax is working, at least in Oregon. That doesn't mean I like it. It is a regressive tax targeted specifically at addicts, such as myself. If the money went specifically for lung cancer research and treatment there might be a justification but it doesn't. That being said, it seems to have had a significant impact on the number of smokers in this state. It's kind of like torture, is it ok if it works?", 
        "reply": " That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. Alcohol is next. Beer tax and liquor tax is the next agenda. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:52:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought. What ever happened to making personal choices and sacrifices due to needs, wants, and personal responsibility? My six year old daughter does not drink soda. She does not eat candy. Her idea of dessert is one oreo cookie. My wife and I taught her these habits, not some hack politician. When I became overweight, I dieted and exercised my way back into good health. I run five days a week to allow me the opportunity to eat what I want, when I want. I am currently training for a marathon and I drink soda to keep weight on. Should I be penalized for drinking soda because I am exercising too much? Once we \"accept\" encroachment on our rights due to increased taxation it will continue to grow. First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end.", 
        "intTime": 20090513, 
        "postID": 34, 
        "quote": "Originally posted by usa_girl: Didn't they do the same thing with smoking? We do have a problem with being over weight in this country that is for sure. It is the children I worry about. It is a shame that people have to eat the fast food and processed food because it is cheaper. I think everyone that has room should grow a garden as a family project and get back to basics. I am working on mine now. But if the government puts a tax on sugar drinks then they will have to go after the fast food industry. I don't want government running my life that is for sure. The question is, did making smoking so expensive help some people to stop? Will it stop people from drinking pop or eating fast food? In Europe they were trying to get people to stop using the plastic bags at the store, they could have just fined the store for not selling paper, but instead, they just made the cutomer pay more for the plastic to encourage people to start using the cloth shopping bags. That theory seems to work a little. I know lots of people that said they stopped smoking because it was just too expensive. And I saw most of the people shopping at the market in England using the cloth bags. Just a thought.", 
        "reply": " What ever happened to making personal choices and sacrifices due to needs, wants, and personal responsibility? My six year old daughter does not drink soda. She does not eat candy. Her idea of dessert is one oreo cookie. My wife and I taught her these habits, not some hack politician. When I became overweight, I dieted and exercised my way back into good health. I run five days a week to allow me the opportunity to eat what I want, when I want. I am currently training for a marathon and I drink soda to keep weight on. Should I be penalized for drinking soda because I am exercising too much? Once we \"accept\" encroachment on our rights due to increased taxation it will continue to grow. First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 08:59:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "stec74"
    }, 
    {
        "content": "Unfortunatley, it will not end. Congrats on your lifestyle change stec! And way to take control of your family and give your child the tools for a healthy life.", 
        "intTime": 20090513, 
        "postID": 35, 
        "quote": "", 
        "reply": "Unfortunatley, it will not end. Congrats on your lifestyle change stec! And way to take control of your family and give your child the tools for a healthy life.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:18:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "usa_girl"
    }, 
    {
        "content": "stec74; quote: First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end. Alcohol is not taxed near what cigarettes are, the tax went up some 154% in March. And it wasn't just cigarettes, it was all tobacco products. And I guess since many people are actually quitting, they aren't going to raise the capital for Universal Health care as they expected...", 
        "intTime": 20090513, 
        "postID": 36, 
        "quote": "First it was cigarettes and alcohol. Now sugary drinks are being proposed. Next it will be fast food and food with excessive amounts of sugar. Where will it end? The problem is that it probably won't end.", 
        "reply": "stec74;  Alcohol is not taxed near what cigarettes are, the tax went up some 154% in March. And it wasn't just cigarettes, it was all tobacco products. And I guess since many people are actually quitting, they aren't going to raise the capital for Universal Health care as they expected...", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:32:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "3678131"
    }, 
    {
        "content": "L0A1; quote: That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. As long as folks who do not struggle with their weight, or any other issues like this..continue to push for these taxes.. Hey I'm not overweight, so yeah tax these things, so that people will want to eat healthy. I don't smoke, so this is a good idea..because hey, I don't want to pay for their medical care.. I don't drink, but hey some people who drink get liver disease which raises the cost of health care so yeah, raise taxes on alcohol. Now, we have thousands of people who have quit smoking, drinking and eating junk food, now there's not enough money coming in to pay for universal health care..now what can we tax?? Everyone is eating healthy foods lets raise the taxes on That!!!", 
        "intTime": 20090513, 
        "postID": 37, 
        "quote": "That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop.", 
        "reply": "L0A1;  As long as folks who do not struggle with their weight, or any other issues like this..continue to push for these taxes.. Hey I'm not overweight, so yeah tax these things, so that people will want to eat healthy. I don't smoke, so this is a good idea..because hey, I don't want to pay for their medical care.. I don't drink, but hey some people who drink get liver disease which raises the cost of health care so yeah, raise taxes on alcohol. Now, we have thousands of people who have quit smoking, drinking and eating junk food, now there's not enough money coming in to pay for universal health care..now what can we tax?? Everyone is eating healthy foods lets raise the taxes on That!!!", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:43:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by L0A1: That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop. Realistically…when we die. That’s when taxes will end (at least for us individually). The point is not “End Taxes”. That can’t happen unless you’re willing to end road construction and repair, bridge repair, fire fighting services, law enforcement services, disaster relief, public education, national defense and a whole lot of other “commons”. The point is to guard against regressive taxes that target those who can least afford them.", 
        "intTime": 20090513, 
        "postID": 38, 
        "quote": "Originally posted by L0A1: That's part of my point Doc. Once folks such as myself quit smoking because of the tax increase, they will need to get their money elsewhere for their healthcare funding. WHen will it stop.", 
        "reply": " Realistically…when we die. That’s when taxes will end (at least for us individually). The point is not “End Taxes”. That can’t happen unless you’re willing to end road construction and repair, bridge repair, fire fighting services, law enforcement services, disaster relief, public education, national defense and a whole lot of other “commons”. The point is to guard against regressive taxes that target those who can least afford them.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 09:57:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "All there is left to say is contact YOUR elected officials and let them know how you feel, and if they continue on this path work to remove them from office when they come up for re-election, maybe even run against them if need be.", 
        "intTime": 20090513, 
        "postID": 39, 
        "quote": "", 
        "reply": "All there is left to say is contact YOUR elected officials and let them know how you feel, and if they continue on this path work to remove them from office when they come up for re-election, maybe even run against them if need be.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 11:03:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "3678131"
    }, 
    {
        "content": "It won't pass.", 
        "intTime": 20090513, 
        "postID": 40, 
        "quote": "", 
        "reply": "It won't pass.", 
        "threadID": "672198221_3760091322001", 
        "time": "2009-05-13 11:11:00", 
        "title": "Soda Tax Weighed to Pay for Health Care", 
        "userID": "mrmixitup"
    }
]