[
    {
        "content": "\"\"http://www.google.com/hostednews/ap/article/ALeqM5gepueqQ9a2V5zxXES7DoGnVhSFHwD96REJ1G0\"\" quote: Officials: Afghanistan Taliban leader was at Gitmo By PAMELA HESS – 3 hours ago WASHINGTON (AP) — The Taliban's new top operations officer in southern Afghanistan had been a prisoner at the Guantanamo Bay detention center, the latest example of a freed detainee who took a militant leadership role and a potential complication for the Obama administration's efforts to close the prison. U.S. authorities handed over the detainee to the Afghan government, which in turn released him, according to Pentagon and CIA officials. Abdullah Ghulam Rasoul, formerly Guantanamo prisoner No. 008, was among 13 Afghan prisoners released to the Afghan government in December 2007. Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. The officials, who spoke anonymously because they are not authorized to release the information, said Rasoul has joined a growing faction of former Guantanamo prisoners who have rejoined militant groups and taken action against U.S. interests. Pentagon officials have said that as many as 60 former detainees have resurfaced on foreign battlefields. Pentagon and intelligence officials said Rasoul has emerged as a key militant figure in southern Afghanistan, where violence has been spiking in the last year. Thousands of U.S. troops are preparing to deploy there to fight resurgent Taliban forces. One intelligence official told the Associated Press that Rasoul's stated mission is to counter the U.S. troop surge. Although the militant detainees who have resurfaced were released under the Bush administration, the revelation underscores the Obama administration's dilemma in moving to close the detention camp at Guantanamo and figuring out what to do with the nearly 250 prisoners who remain there. In one of his first acts in office, President Barack Obama signed an executive order to close the jail next year. The order also convened a task force that will determine how to handle remaining detainees, who could be transferred to other U.S. detention facilities for trial, transferred to foreign nations for legal proceedings or freed. More than 800 prisoners have been imprisoned at Guantanamo; only a handful have been charged. About 520 Guantanamo detainees have been released from custody or transferred to prisons elsewhere in the world. A Pentagon tally of the detainees released show that 122 were transferred from Guantanamo in 2007, more than any other year. The Pentagon's preferred option is to hand them over to their home governments for imprisonment. But the Defense Intelligence Agency's growing list of former prisoners that have rejoined the fight shows that, in some cases, that system does not work. According to the Pentagon, at least 18 former Guantanamo detainees have \"returned to the fight\" and 43 others are suspected of resuming terrorist activities. The Pentagon has declined to provide a complete list of the former prisoners they suspect are now on the battlefield. According to case documents assembled by the U.S. military for a 2005 review of Rasoul's combatant status at Guantanamo, the Afghan was captured in 2001 in Konduz. Armed with a gun and sitting in the car of an alleged Taliban leader, Rasoul insisted to American authorities he was forced to carry the gun by the Taliban. Rasoul told the tribunal in 2005 that in fact he had surrendered with other Taliban members to the Northern Alliance in Konduz on Dec. 12, 2001. The Northern Alliance was involved in a protracted civil war with the Taliban, and was allied with U.S. forces in the October 2001 invasion. Rasoul told the tribunal that he and others were then handed over to the Americans for bounties. According to the U.S. documents, Rasoul was conscripted into the Taliban in 1995, and was seriously wounded in a bombing in 1997. He returned to the Taliban in Kandahar in southern Afghanistan in 1999. Rasoul, who hailed from Helmand province in southern Afghanistan_ a Taliban stronghold_ never attended a Taliban or al-Qaida training camp. A key piece of evidence against him was that he was captured with two Casio watches similar to those used in al-Qaida bombings. He said he was holding the watches for a Taliban member who lacked pockets. He told the tribunal that he intended to return to a peaceful life in Afghanistan. \"I want to go back home and join my family and work in my land and help my family,\" he said, according to a U.S. military transcript of the hearing. National Intelligence Director Dennis Blair said Tuesday that at least two Saudi detainees also turned up recently as members of al-Qaida in Yemen after they were released from Guantanamo. The Saudis had been handed over by the U.S. to Saudi Arabia, where they were supposedly rehabilitated as part of a Saudi program to reform extremists. The Bush administration's decision to transfer militants to Saudi Arabia for rehabilitation \"doesn't inspire confidence,\" Blair said. But he told the House Intelligence Committee last month that the prison must be closed because of the damage it has done to America's reputation. It is too powerful a negative symbol to remain open, he said. The jail at the U.S. base in Cuba, created by the Bush administration in 2002, has been criticized worldwide for allegations of abuse of prisoners and their legal status. To me this will never be old news. Each time this occurs is another potential deadly issue for us/our troops/our allies. I feel the same anger when a sex predator is released and commits the crime again.", 
        "intTime": 20090310, 
        "postID": 1, 
        "quote": "Officials: Afghanistan Taliban leader was at Gitmo By PAMELA HESS – 3 hours ago WASHINGTON (AP) — The Taliban's new top operations officer in southern Afghanistan had been a prisoner at the Guantanamo Bay detention center, the latest example of a freed detainee who took a militant leadership role and a potential complication for the Obama administration's efforts to close the prison. U.S. authorities handed over the detainee to the Afghan government, which in turn released him, according to Pentagon and CIA officials. Abdullah Ghulam Rasoul, formerly Guantanamo prisoner No. 008, was among 13 Afghan prisoners released to the Afghan government in December 2007. Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. The officials, who spoke anonymously because they are not authorized to release the information, said Rasoul has joined a growing faction of former Guantanamo prisoners who have rejoined militant groups and taken action against U.S. interests. Pentagon officials have said that as many as 60 former detainees have resurfaced on foreign battlefields. Pentagon and intelligence officials said Rasoul has emerged as a key militant figure in southern Afghanistan, where violence has been spiking in the last year. Thousands of U.S. troops are preparing to deploy there to fight resurgent Taliban forces. One intelligence official told the Associated Press that Rasoul's stated mission is to counter the U.S. troop surge. Although the militant detainees who have resurfaced were released under the Bush administration, the revelation underscores the Obama administration's dilemma in moving to close the detention camp at Guantanamo and figuring out what to do with the nearly 250 prisoners who remain there. In one of his first acts in office, President Barack Obama signed an executive order to close the jail next year. The order also convened a task force that will determine how to handle remaining detainees, who could be transferred to other U.S. detention facilities for trial, transferred to foreign nations for legal proceedings or freed. More than 800 prisoners have been imprisoned at Guantanamo; only a handful have been charged. About 520 Guantanamo detainees have been released from custody or transferred to prisons elsewhere in the world. A Pentagon tally of the detainees released show that 122 were transferred from Guantanamo in 2007, more than any other year. The Pentagon's preferred option is to hand them over to their home governments for imprisonment. But the Defense Intelligence Agency's growing list of former prisoners that have rejoined the fight shows that, in some cases, that system does not work. According to the Pentagon, at least 18 former Guantanamo detainees have \"returned to the fight\" and 43 others are suspected of resuming terrorist activities. The Pentagon has declined to provide a complete list of the former prisoners they suspect are now on the battlefield. According to case documents assembled by the U.S. military for a 2005 review of Rasoul's combatant status at Guantanamo, the Afghan was captured in 2001 in Konduz. Armed with a gun and sitting in the car of an alleged Taliban leader, Rasoul insisted to American authorities he was forced to carry the gun by the Taliban. Rasoul told the tribunal in 2005 that in fact he had surrendered with other Taliban members to the Northern Alliance in Konduz on Dec. 12, 2001. The Northern Alliance was involved in a protracted civil war with the Taliban, and was allied with U.S. forces in the October 2001 invasion. Rasoul told the tribunal that he and others were then handed over to the Americans for bounties. According to the U.S. documents, Rasoul was conscripted into the Taliban in 1995, and was seriously wounded in a bombing in 1997. He returned to the Taliban in Kandahar in southern Afghanistan in 1999. Rasoul, who hailed from Helmand province in southern Afghanistan_ a Taliban stronghold_ never attended a Taliban or al-Qaida training camp. A key piece of evidence against him was that he was captured with two Casio watches similar to those used in al-Qaida bombings. He said he was holding the watches for a Taliban member who lacked pockets. He told the tribunal that he intended to return to a peaceful life in Afghanistan. \"I want to go back home and join my family and work in my land and help my family,\" he said, according to a U.S. military transcript of the hearing. National Intelligence Director Dennis Blair said Tuesday that at least two Saudi detainees also turned up recently as members of al-Qaida in Yemen after they were released from Guantanamo. The Saudis had been handed over by the U.S. to Saudi Arabia, where they were supposedly rehabilitated as part of a Saudi program to reform extremists. The Bush administration's decision to transfer militants to Saudi Arabia for rehabilitation \"doesn't inspire confidence,\" Blair said. But he told the House Intelligence Committee last month that the prison must be closed because of the damage it has done to America's reputation. It is too powerful a negative symbol to remain open, he said. The jail at the U.S. base in Cuba, created by the Bush administration in 2002, has been criticized worldwide for allegations of abuse of prisoners and their legal status.", 
        "reply": "\"\"http://www.google.com/hostednews/ap/article/ALeqM5gepueqQ9a2V5zxXES7DoGnVhSFHwD96REJ1G0\"\"  To me this will never be old news. Each time this occurs is another potential deadly issue for us/our troops/our allies. I feel the same anger when a sex predator is released and commits the crime again.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-10 19:15:00", 
        "title": "This is going to become common place.", 
        "userID": "ACR26"
    }, 
    {
        "content": "You think the Taliban are going to trust him as anything more than a suicide bomber? Not while there are prisoners in Gitmo, Bagram and the other CIA 'detention facilities'.", 
        "intTime": 20090310, 
        "postID": 2, 
        "quote": "", 
        "reply": "You think the Taliban are going to trust him as anything more than a suicide bomber? Not while there are prisoners in Gitmo, Bagram and the other CIA 'detention facilities'.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-10 19:33:00", 
        "title": "This is going to become common place.", 
        "userID": "popsiq"
    }, 
    {
        "content": "I figure if they didn't he would have his head handed to him upon sight literally and figuratively.", 
        "intTime": 20090310, 
        "postID": 3, 
        "quote": "", 
        "reply": "I figure if they didn't he would have his head handed to him upon sight literally and figuratively.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-10 19:35:00", 
        "title": "This is going to become common place.", 
        "userID": "ACR26"
    }, 
    {
        "content": "No doubt about it, the releasing of Gitmo Battlefield Detainees by President Bush was a DUMB Thing to do! They \"caved-in\" to Liberal Pressure. Then along comes Obama and he Orders Gitmo Detention Facilities Closed. He spins it that this will \"Make America Safer!\" - It has the direct opposite effect!\" - Our enemies will view this closure as a win for their side! - It will aid the Enemies Recruiting and embo;den their propangda! - It's a DUMB decision and it signals America's \"surrender Intentions\" regarding the War on Terrorism! \"\" Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. \"\" If today, he is recaptured; what does America do with Zakir? It's a Dumb decision by a Dumb Administration! Now because; I've used the description \"Dumb\" a couple of times; I expect Liberals will be hitting the \"Yellow Triangle\" - to alert the Moderators. Have Fun!! If I'm removed from this \"Haven\" of Liberal Bloggers; then I'm Happy! President Bush was a \"ten-fold\" better president than Obama; albeit, he did make some errors of judgement! My Opinion! From A Proud Vietnam Veteran", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "", 
        "reply": "No doubt about it, the releasing of Gitmo Battlefield Detainees by President Bush was a DUMB Thing to do! They \"caved-in\" to Liberal Pressure. Then along comes Obama and he Orders Gitmo Detention Facilities Closed. He spins it that this will \"Make America Safer!\" - It has the direct opposite effect!\" - Our enemies will view this closure as a win for their side! - It will aid the Enemies Recruiting and embo;den their propangda! - It's a DUMB decision and it signals America's \"surrender Intentions\" regarding the War on Terrorism! \"\" Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. \"\" If today, he is recaptured; what does America do with Zakir? It's a Dumb decision by a Dumb Administration! Now because; I've used the description \"Dumb\" a couple of times; I expect Liberals will be hitting the \"Yellow Triangle\" - to alert the Moderators. Have Fun!! If I'm removed from this \"Haven\" of Liberal Bloggers; then I'm Happy! President Bush was a \"ten-fold\" better president than Obama; albeit, he did make some errors of judgement! My Opinion! From A Proud Vietnam Veteran", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 05:04:00", 
        "title": "This is going to become common place.", 
        "userID": "WesLemmon"
    }, 
    {
        "content": "Its all Obama's fault.", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "Its all Obama's fault.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 05:22:00", 
        "title": "This is going to become common place.", 
        "userID": "Duster6"
    }, 
    {
        "content": "If caught again? Who knows what they will do with them? I guess we will hear about it when that happens, the media spin for both sides will stop the rotation of the planet, there will be false outrage and real outrage, our buddies/family members overseas will keep on doing their job with grit and determination.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "", 
        "reply": "If caught again? Who knows what they will do with them? I guess we will hear about it when that happens, the media spin for both sides will stop the rotation of the planet, there will be false outrage and real outrage, our buddies/family members overseas will keep on doing their job with grit and determination.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 05:49:00", 
        "title": "This is going to become common place.", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by WesLemmon: No doubt about it, the releasing of Gitmo Battlefield Detainees by President Bush was a DUMB Thing to do! They \"caved-in\" to Liberal Pressure. Then along comes Obama and he Orders Gitmo Detention Facilities Closed. He spins it that this will \"Make America Safer!\" - It has the direct opposite effect!\" - Our enemies will view this closure as a win for their side! - It will aid the Enemies Recruiting and embo;den their propangda! - It's a DUMB decision and it signals America's \"surrender Intentions\" regarding the War on Terrorism! \"\" Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. \"\" If today, he is recaptured; what does America do with Zakir? It's a Dumb decision by a Dumb Administration! Now because; I've used the description \"Dumb\" a couple of times; I expect Liberals will be hitting the \"Yellow Triangle\" - to alert the Moderators. Have Fun!! If I'm removed from this \"Haven\" of Liberal Bloggers; then I'm Happy! President Bush was a \"ten-fold\" better president than Obama; albeit, he did make some errors of judgement! My Opinion! From A Proud Vietnam Veteran LOL The individual or group involved in deciding who should be released and who should be retained at GTMO got an awful lot wrong. As bad as they were, however - I'd like to think they weren't playing eenie-meenie-minie-mo. So, I won't blame \"liberal pressure\" or even Bush. It was bad decision-making, probably due to incompetence, at the point of contact. Things look a lot simpler when you don't try to spin them, Wes...!", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by WesLemmon: No doubt about it, the releasing of Gitmo Battlefield Detainees by President Bush was a DUMB Thing to do! They \"caved-in\" to Liberal Pressure. Then along comes Obama and he Orders Gitmo Detention Facilities Closed. He spins it that this will \"Make America Safer!\" - It has the direct opposite effect!\" - Our enemies will view this closure as a win for their side! - It will aid the Enemies Recruiting and embo;den their propangda! - It's a DUMB decision and it signals America's \"surrender Intentions\" regarding the War on Terrorism! \"\" Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. \"\" If today, he is recaptured; what does America do with Zakir? It's a Dumb decision by a Dumb Administration! Now because; I've used the description \"Dumb\" a couple of times; I expect Liberals will be hitting the \"Yellow Triangle\" - to alert the Moderators. Have Fun!! If I'm removed from this \"Haven\" of Liberal Bloggers; then I'm Happy! President Bush was a \"ten-fold\" better president than Obama; albeit, he did make some errors of judgement! My Opinion! From A Proud Vietnam Veteran", 
        "reply": " LOL The individual or group involved in deciding who should be released and who should be retained at GTMO got an awful lot wrong. As bad as they were, however - I'd like to think they weren't playing eenie-meenie-minie-mo. So, I won't blame \"liberal pressure\" or even Bush. It was bad decision-making, probably due to incompetence, at the point of contact. Things look a lot simpler when you don't try to spin them, Wes...!", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 09:32:00", 
        "title": "This is going to become common place.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Does, \"I TOLD YOU SO!\", apply here?... Respectfully, SUNLINER81", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "", 
        "reply": "Does, \"I TOLD YOU SO!\", apply here?... Respectfully, SUNLINER81", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 10:23:00", 
        "title": "This is going to become common place.", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I hope we put a chip in his backside so we can plant some guided rounds right on target.", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "", 
        "reply": "I hope we put a chip in his backside so we can plant some guided rounds right on target.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 10:48:00", 
        "title": "This is going to become common place.", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by WesLemmon: Then along comes Obama and he Orders Gitmo Detention Facilities Closed. He spins it that this will \"Make America Safer!\" - It has the direct opposite effect!\" Now let it be said, I do not like Obama and I believe he is dangerous to this country but I do attempt to be fair and balanced... I've heard said that his reasone for the comment above is that the Taliban is using Gitmo as a recruiting tool... therefore if it no longer exist it cannot be used as such, thereby making us safer in that regard... short term danger (the release) long term safty (no longer recruiting tool) in one way that does make sense. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by WesLemmon: Then along comes Obama and he Orders Gitmo Detention Facilities Closed. He spins it that this will \"Make America Safer!\" - It has the direct opposite effect!\"", 
        "reply": " Now let it be said, I do not like Obama and I believe he is dangerous to this country but I do attempt to be fair and balanced... I've heard said that his reasone for the comment above is that the Taliban is using Gitmo as a recruiting tool... therefore if it no longer exist it cannot be used as such, thereby making us safer in that regard... short term danger (the release) long term safty (no longer recruiting tool) in one way that does make sense. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 10:56:00", 
        "title": "This is going to become common place.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by ACR26: \"\"http://www.google.com/hostednews/ap/article/ALeqM5gepueqQ9a2V5zxXES7DoGnVhSFHwD96REJ1G0\"\" quote: Officials: Afghanistan Taliban leader was at Gitmo By PAMELA HESS – 3 hours ago WASHINGTON (AP) — The Taliban's new top operations officer in southern Afghanistan had been a prisoner at the Guantanamo Bay detention center, the latest example of a freed detainee who took a militant leadership role and a potential complication for the Obama administration's efforts to close the prison. U.S. authorities handed over the detainee to the Afghan government, which in turn released him, according to Pentagon and CIA officials. Abdullah Ghulam Rasoul, formerly Guantanamo prisoner No. 008, was among 13 Afghan prisoners released to the Afghan government in December 2007. Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. The officials, who spoke anonymously because they are not authorized to release the information, said Rasoul has joined a growing faction of former Guantanamo prisoners who have rejoined militant groups and taken action against U.S. interests. Pentagon officials have said that as many as 60 former detainees have resurfaced on foreign battlefields. Pentagon and intelligence officials said Rasoul has emerged as a key militant figure in southern Afghanistan, where violence has been spiking in the last year. Thousands of U.S. troops are preparing to deploy there to fight resurgent Taliban forces. One intelligence official told the Associated Press that Rasoul's stated mission is to counter the U.S. troop surge. Although the militant detainees who have resurfaced were released under the Bush administration, the revelation underscores the Obama administration's dilemma in moving to close the detention camp at Guantanamo and figuring out what to do with the nearly 250 prisoners who remain there. In one of his first acts in office, President Barack Obama signed an executive order to close the jail next year. The order also convened a task force that will determine how to handle remaining detainees, who could be transferred to other U.S. detention facilities for trial, transferred to foreign nations for legal proceedings or freed. More than 800 prisoners have been imprisoned at Guantanamo; only a handful have been charged. About 520 Guantanamo detainees have been released from custody or transferred to prisons elsewhere in the world. A Pentagon tally of the detainees released show that 122 were transferred from Guantanamo in 2007, more than any other year. The Pentagon's preferred option is to hand them over to their home governments for imprisonment. But the Defense Intelligence Agency's growing list of former prisoners that have rejoined the fight shows that, in some cases, that system does not work. According to the Pentagon, at least 18 former Guantanamo detainees have \"returned to the fight\" and 43 others are suspected of resuming terrorist activities. The Pentagon has declined to provide a complete list of the former prisoners they suspect are now on the battlefield. According to case documents assembled by the U.S. military for a 2005 review of Rasoul's combatant status at Guantanamo, the Afghan was captured in 2001 in Konduz. Armed with a gun and sitting in the car of an alleged Taliban leader, Rasoul insisted to American authorities he was forced to carry the gun by the Taliban. Rasoul told the tribunal in 2005 that in fact he had surrendered with other Taliban members to the Northern Alliance in Konduz on Dec. 12, 2001. The Northern Alliance was involved in a protracted civil war with the Taliban, and was allied with U.S. forces in the October 2001 invasion. Rasoul told the tribunal that he and others were then handed over to the Americans for bounties. According to the U.S. documents, Rasoul was conscripted into the Taliban in 1995, and was seriously wounded in a bombing in 1997. He returned to the Taliban in Kandahar in southern Afghanistan in 1999. Rasoul, who hailed from Helmand province in southern Afghanistan_ a Taliban stronghold_ never attended a Taliban or al-Qaida training camp. A key piece of evidence against him was that he was captured with two Casio watches similar to those used in al-Qaida bombings. He said he was holding the watches for a Taliban member who lacked pockets. He told the tribunal that he intended to return to a peaceful life in Afghanistan. \"I want to go back home and join my family and work in my land and help my family,\" he said, according to a U.S. military transcript of the hearing. National Intelligence Director Dennis Blair said Tuesday that at least two Saudi detainees also turned up recently as members of al-Qaida in Yemen after they were released from Guantanamo. The Saudis had been handed over by the U.S. to Saudi Arabia, where they were supposedly rehabilitated as part of a Saudi program to reform extremists. The Bush administration's decision to transfer militants to Saudi Arabia for rehabilitation \"doesn't inspire confidence,\" Blair said. But he told the House Intelligence Committee last month that the prison must be closed because of the damage it has done to America's reputation. It is too powerful a negative symbol to remain open, he said. The jail at the U.S. base in Cuba, created by the Bush administration in 2002, has been criticized worldwide for allegations of abuse of prisoners and their legal status. To me this will never be old news. Each time this occurs is another potential deadly issue for us/our troops/our allies. I feel the same anger when a sex predator is released and commits the crime again. This story is about the \"tame\" fundamentalists,\" and the dope dealing warlords whom we put into power in Afghanistan. As I've said on a number of threads, either of the above groups will betray us in a heartbeat. If we are serious about winning in Afghanistan we have to figure out a way to get rid of these so called friends, and switch our backing to the secular forces - Which is to say those people who have a REAL incentive to get rid of the Taliban. Dave", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "Originally posted by ACR26: \"\"http://www.google.com/hostednews/ap/article/ALeqM5gepueqQ9a2V5zxXES7DoGnVhSFHwD96REJ1G0\"\" quote: Officials: Afghanistan Taliban leader was at Gitmo By PAMELA HESS – 3 hours ago WASHINGTON (AP) — The Taliban's new top operations officer in southern Afghanistan had been a prisoner at the Guantanamo Bay detention center, the latest example of a freed detainee who took a militant leadership role and a potential complication for the Obama administration's efforts to close the prison. U.S. authorities handed over the detainee to the Afghan government, which in turn released him, according to Pentagon and CIA officials. Abdullah Ghulam Rasoul, formerly Guantanamo prisoner No. 008, was among 13 Afghan prisoners released to the Afghan government in December 2007. Rasoul is now known as Mullah Abdullah Zakir, a nom de guerre that Pentagon and intelligence officials say is used by a Taliban leader who is in charge of operations against U.S. and Afghan forces in southern Afghanistan. The officials, who spoke anonymously because they are not authorized to release the information, said Rasoul has joined a growing faction of former Guantanamo prisoners who have rejoined militant groups and taken action against U.S. interests. Pentagon officials have said that as many as 60 former detainees have resurfaced on foreign battlefields. Pentagon and intelligence officials said Rasoul has emerged as a key militant figure in southern Afghanistan, where violence has been spiking in the last year. Thousands of U.S. troops are preparing to deploy there to fight resurgent Taliban forces. One intelligence official told the Associated Press that Rasoul's stated mission is to counter the U.S. troop surge. Although the militant detainees who have resurfaced were released under the Bush administration, the revelation underscores the Obama administration's dilemma in moving to close the detention camp at Guantanamo and figuring out what to do with the nearly 250 prisoners who remain there. In one of his first acts in office, President Barack Obama signed an executive order to close the jail next year. The order also convened a task force that will determine how to handle remaining detainees, who could be transferred to other U.S. detention facilities for trial, transferred to foreign nations for legal proceedings or freed. More than 800 prisoners have been imprisoned at Guantanamo; only a handful have been charged. About 520 Guantanamo detainees have been released from custody or transferred to prisons elsewhere in the world. A Pentagon tally of the detainees released show that 122 were transferred from Guantanamo in 2007, more than any other year. The Pentagon's preferred option is to hand them over to their home governments for imprisonment. But the Defense Intelligence Agency's growing list of former prisoners that have rejoined the fight shows that, in some cases, that system does not work. According to the Pentagon, at least 18 former Guantanamo detainees have \"returned to the fight\" and 43 others are suspected of resuming terrorist activities. The Pentagon has declined to provide a complete list of the former prisoners they suspect are now on the battlefield. According to case documents assembled by the U.S. military for a 2005 review of Rasoul's combatant status at Guantanamo, the Afghan was captured in 2001 in Konduz. Armed with a gun and sitting in the car of an alleged Taliban leader, Rasoul insisted to American authorities he was forced to carry the gun by the Taliban. Rasoul told the tribunal in 2005 that in fact he had surrendered with other Taliban members to the Northern Alliance in Konduz on Dec. 12, 2001. The Northern Alliance was involved in a protracted civil war with the Taliban, and was allied with U.S. forces in the October 2001 invasion. Rasoul told the tribunal that he and others were then handed over to the Americans for bounties. According to the U.S. documents, Rasoul was conscripted into the Taliban in 1995, and was seriously wounded in a bombing in 1997. He returned to the Taliban in Kandahar in southern Afghanistan in 1999. Rasoul, who hailed from Helmand province in southern Afghanistan_ a Taliban stronghold_ never attended a Taliban or al-Qaida training camp. A key piece of evidence against him was that he was captured with two Casio watches similar to those used in al-Qaida bombings. He said he was holding the watches for a Taliban member who lacked pockets. He told the tribunal that he intended to return to a peaceful life in Afghanistan. \"I want to go back home and join my family and work in my land and help my family,\" he said, according to a U.S. military transcript of the hearing. National Intelligence Director Dennis Blair said Tuesday that at least two Saudi detainees also turned up recently as members of al-Qaida in Yemen after they were released from Guantanamo. The Saudis had been handed over by the U.S. to Saudi Arabia, where they were supposedly rehabilitated as part of a Saudi program to reform extremists. The Bush administration's decision to transfer militants to Saudi Arabia for rehabilitation \"doesn't inspire confidence,\" Blair said. But he told the House Intelligence Committee last month that the prison must be closed because of the damage it has done to America's reputation. It is too powerful a negative symbol to remain open, he said. The jail at the U.S. base in Cuba, created by the Bush administration in 2002, has been criticized worldwide for allegations of abuse of prisoners and their legal status. To me this will never be old news. Each time this occurs is another potential deadly issue for us/our troops/our allies. I feel the same anger when a sex predator is released and commits the crime again.", 
        "reply": " This story is about the \"tame\" fundamentalists,\" and the dope dealing warlords whom we put into power in Afghanistan. As I've said on a number of threads, either of the above groups will betray us in a heartbeat. If we are serious about winning in Afghanistan we have to figure out a way to get rid of these so called friends, and switch our backing to the secular forces - Which is to say those people who have a REAL incentive to get rid of the Taliban. Dave", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 13:45:00", 
        "title": "This is going to become common place.", 
        "userID": "Grachus"
    }, 
    {
        "content": "Ashame he was not placed on trial and executed. He wouldn't even be an issue now had that happened 6 years ago.", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "Ashame he was not placed on trial and executed. He wouldn't even be an issue now had that happened 6 years ago.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 14:08:00", 
        "title": "This is going to become common place.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Have to agree with the title. It's become too common. The slogans and recruiters I'm sorry to say are right here in the good USA, some in the Senate, some in the House, mostly lawyers chasing court orders. This from the Daily Kos: \"At the heart of a looming legal showdown at Bagram is the same fundamental question asked in the Guantánamo litigation: Are detainees in a US military prison overseas entitled to any legal rights\"? Arguements are, we are an occupier of the country, the prisoner are war criminals, indict or allow them their freedom. Page dos \"But there is an additional twist. After the Supreme Court's 2004 decision, the Bush administration stopped sending detainees to Guantánamo and instead routed them to Bagram, where they were held and interrogated without judicial scrutiny. Until now\". Running shy of live bodies in Guatanomo the emphasis has change to another foreign country. Coming attractions: \"While about 245 people are currently in GITMO, more than 600 are being held at Bagram. Most of those prisoners, apparently, were captured \"during battles in Afghanistan.\" The current dispute is over four prisoners captured outside of Afghanistan and taken to Bagram: The U.S. District Court held a hearing in early January on four separate challenges filed on behalf of four detainees taken to Bagram from outside Afghanistan. At the hearing, Bush administration lawyers argued that Bagram detainees were different from those held at Guantanamo, and could pose a security threat if released\". And the Obama Administration has, so far, sided with Bush. Taliban and AQ doesn't have to recruit, we seem to be doing it for them.", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "", 
        "reply": "Have to agree with the title. It's become too common. The slogans and recruiters I'm sorry to say are right here in the good USA, some in the Senate, some in the House, mostly lawyers chasing court orders. This from the Daily Kos: \"At the heart of a looming legal showdown at Bagram is the same fundamental question asked in the Guantánamo litigation: Are detainees in a US military prison overseas entitled to any legal rights\"? Arguements are, we are an occupier of the country, the prisoner are war criminals, indict or allow them their freedom. Page dos \"But there is an additional twist. After the Supreme Court's 2004 decision, the Bush administration stopped sending detainees to Guantánamo and instead routed them to Bagram, where they were held and interrogated without judicial scrutiny. Until now\". Running shy of live bodies in Guatanomo the emphasis has change to another foreign country. Coming attractions: \"While about 245 people are currently in GITMO, more than 600 are being held at Bagram. Most of those prisoners, apparently, were captured \"during battles in Afghanistan.\" The current dispute is over four prisoners captured outside of Afghanistan and taken to Bagram: The U.S. District Court held a hearing in early January on four separate challenges filed on behalf of four detainees taken to Bagram from outside Afghanistan. At the hearing, Bush administration lawyers argued that Bagram detainees were different from those held at Guantanamo, and could pose a security threat if released\". And the Obama Administration has, so far, sided with Bush. Taliban and AQ doesn't have to recruit, we seem to be doing it for them.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-11 14:09:00", 
        "title": "This is going to become common place.", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": ">http://news.bbc.co.uk/2/hi/americas/7935376.stm One to watch. This accused terrorist gets his day in an American court.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "", 
        "reply": ">http://news.bbc.co.uk/2/hi/americas/7935376.stm One to watch. This accused terrorist gets his day in an American court.", 
        "threadID": "672198221_4350094712001", 
        "time": "2009-03-12 12:45:00", 
        "title": "This is going to become common place.", 
        "userID": "popsiq"
    }
]