[
    {
        "content": "In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\"", 
        "intTime": 20090308, 
        "postID": 1, 
        "quote": "", 
        "reply": "In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\"", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 06:58:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\" All the rage on \"Coast to Coast\", watch out George Noory... Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\"", 
        "reply": " All the rage on \"Coast to Coast\", watch out George Noory... Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 07:14:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "The film should be released in 2013.", 
        "intTime": 20090308, 
        "postID": 3, 
        "quote": "", 
        "reply": "The film should be released in 2013.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 07:21:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "intTime": 20090308, 
        "postID": 4, 
        "quote": "", 
        "reply": "Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 07:24:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 5, 
        "quote": "Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "reply": " I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:20:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81 But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave", 
        "intTime": 20090308, 
        "postID": 6, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81", 
        "reply": " But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:39:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right!", 
        "intTime": 20090308, 
        "postID": 7, 
        "quote": "Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "reply": " Someone in Atlantis may have gotten it right!", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:40:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 8, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right!", 
        "reply": " I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:45:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do...", 
        "intTime": 20090308, 
        "postID": 9, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81", 
        "reply": " Only the prediction of pending doom may have been right. A lot of good it would do...", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:51:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do... Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 10, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do...", 
        "reply": " Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:53:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do... Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81 Think I'll go fishing on that day. More peaceful. No politics. No TV or radio. And a good appreciation of what God has given us.", 
        "intTime": 20090308, 
        "postID": 11, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do... Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81", 
        "reply": " Think I'll go fishing on that day. More peaceful. No politics. No TV or radio. And a good appreciation of what God has given us.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:59:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Yea, just like the Y2K crap,,, the worlds gonna crash. The Earth doesn't even know we're on it yet, otherwise it would shake like a wet dog. I believe what Goerge Carlin said, \" In the end, Mother Earth will shake us off like a bad case of fleas\" This 2012 stuff is a bunch of malarkey.", 
        "intTime": 20090308, 
        "postID": 12, 
        "quote": "", 
        "reply": "Yea, just like the Y2K crap,,, the worlds gonna crash. The Earth doesn't even know we're on it yet, otherwise it would shake like a wet dog. I believe what Goerge Carlin said, \" In the end, Mother Earth will shake us off like a bad case of fleas\" This 2012 stuff is a bunch of malarkey.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 11:17:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Yea, just like the Y2K crap,,, the worlds gonna crash. The Y2K scam generated 300+ Billion dollars in one year. How many people bought the y2k fix software? The government invested in that useless crap too, as well as many businesses. If only for them it lasted longer.......but wait, the now have something with longjevity.....it is the man made climate change scam. Get your carbon credits while you can.", 
        "intTime": 20090308, 
        "postID": 13, 
        "quote": "Originally posted by BAGodbehere: Yea, just like the Y2K crap,,, the worlds gonna crash.", 
        "reply": " The Y2K scam generated 300+ Billion dollars in one year. How many people bought the y2k fix software? The government invested in that useless crap too, as well as many businesses. If only for them it lasted longer.......but wait, the now have something with longjevity.....it is the man made climate change scam. Get your carbon credits while you can.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 13:02:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81 But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave It is the date that the Mayan calader ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago.", 
        "intTime": 20090308, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81 But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave", 
        "reply": " It is the date that the Mayan calader ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 13:20:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090308, 
        "postID": 15, 
        "quote": "Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago.", 
        "reply": " the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 14:13:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: The film should be released in 2013. LMAO good one.", 
        "intTime": 20090308, 
        "postID": 16, 
        "quote": "Originally posted by Philhelm: The film should be released in 2013.", 
        "reply": " LMAO good one.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 15:30:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I love C2C mainly for the Space-Science topics. But there are some good topics as well. They had an Hells Angels ATF implant agent on a week ago...interesting stuff. I don't care for the UFO, ghost and all that shows. Wish I had been a listener when Art was around, but never heard of it up till a couple years ago. BTW, Art made the Radio Hall Of Fame for Pioneering new ground in talk radio. Incidently, right beside some of your alls great master Leader .. Rush.. Art Bell The Man Who Invented Night Time Alternate Talk Radio", 
        "intTime": 20090308, 
        "postID": 17, 
        "quote": "", 
        "reply": "I love C2C mainly for the Space-Science topics. But there are some good topics as well. They had an Hells Angels ATF implant agent on a week ago...interesting stuff. I don't care for the UFO, ghost and all that shows. Wish I had been a listener when Art was around, but never heard of it up till a couple years ago. BTW, Art made the Radio Hall Of Fame for Pioneering new ground in talk radio. Incidently, right beside some of your alls great master Leader .. Rush.. Art Bell The Man Who Invented Night Time Alternate Talk Radio", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 15:36:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them.", 
        "intTime": 20090308, 
        "postID": 18, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them.", 
        "reply": "", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 16:56:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "---- HEY-- Whaaa...?? The check-out date for Motel 8 is Dec. 21, 2012 ?? - No FREAKIN WAY !! I get my MORTGAGE paid off the DAY \"BEFORE\" the BIG Lalapazooza ??? GREAT - just Freakin GREAT ! - That does it ! Where the he11 is my lucky \"wife-beater\" shirt ? - U.B.", 
        "intTime": 20090308, 
        "postID": 19, 
        "quote": "", 
        "reply": "---- HEY-- Whaaa...?? The check-out date for Motel 8 is Dec. 21, 2012 ?? - No FREAKIN WAY !! I get my MORTGAGE paid off the DAY \"BEFORE\" the BIG Lalapazooza ??? GREAT - just Freakin GREAT ! - That does it ! Where the he11 is my lucky \"wife-beater\" shirt ? - U.B.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 17:47:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: quote: Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them. THAT must be where I got the idea... and for a while there I was thinking I was abducted and had some residual memory flashbacks. Now I have to find out another reason why my butt hurts also..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090308, 
        "postID": 20, 
        "quote": "Originally posted by LuckySoFar: quote: Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them.", 
        "reply": " THAT must be where I got the idea... and for a while there I was thinking I was abducted and had some residual memory flashbacks. Now I have to find out another reason why my butt hurts also..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 18:00:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\"", 
        "intTime": 20090308, 
        "postID": 21, 
        "quote": "", 
        "reply": "In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\"", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 06:58:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\" All the rage on \"Coast to Coast\", watch out George Noory... Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 22, 
        "quote": "Originally posted by crackerjacks61: In the past this was just conspiracy theory. Now it has made head lines news. So thought I would post the link here. \"http://www.cnn.com/2009/TECH/science/01/27/2012.maya.calendar.theories/index.html\"", 
        "reply": " All the rage on \"Coast to Coast\", watch out George Noory... Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 07:14:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "The film should be released in 2013.", 
        "intTime": 20090308, 
        "postID": 23, 
        "quote": "", 
        "reply": "The film should be released in 2013.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 07:21:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "intTime": 20090308, 
        "postID": 24, 
        "quote": "", 
        "reply": "Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 07:24:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 25, 
        "quote": "Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "reply": " I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:20:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81 But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave", 
        "intTime": 20090308, 
        "postID": 26, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81", 
        "reply": " But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:39:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right!", 
        "intTime": 20090308, 
        "postID": 27, 
        "quote": "Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong.", 
        "reply": " Someone in Atlantis may have gotten it right!", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:40:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 28, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right!", 
        "reply": " I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:45:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do...", 
        "intTime": 20090308, 
        "postID": 29, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81", 
        "reply": " Only the prediction of pending doom may have been right. A lot of good it would do...", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:51:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do... Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 30, 
        "quote": "Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do...", 
        "reply": " Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:53:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do... Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81 Think I'll go fishing on that day. More peaceful. No politics. No TV or radio. And a good appreciation of what God has given us.", 
        "intTime": 20090308, 
        "postID": 31, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by SUNLINER81: quote: Originally posted by catahoulagill: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. Someone in Atlantis may have gotten it right! I don't know, the bumbazzes are on the bottom of the ocean someplace, after they let their continent sink, how smart could they be?... LOL Respectfully, SUNLINER81 Only the prediction of pending doom may have been right. A lot of good it would do... Well, on the day that it is predicted to happen, December 21, 2012, think I will lay down and take a nap and if I wake up, they were wrong and if I don't, OH WELL!... LOL Respectfully, SUNLINER81", 
        "reply": " Think I'll go fishing on that day. More peaceful. No politics. No TV or radio. And a good appreciation of what God has given us.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 10:59:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "Yea, just like the Y2K crap,,, the worlds gonna crash. The Earth doesn't even know we're on it yet, otherwise it would shake like a wet dog. I believe what Goerge Carlin said, \" In the end, Mother Earth will shake us off like a bad case of fleas\" This 2012 stuff is a bunch of malarkey.", 
        "intTime": 20090308, 
        "postID": 32, 
        "quote": "", 
        "reply": "Yea, just like the Y2K crap,,, the worlds gonna crash. The Earth doesn't even know we're on it yet, otherwise it would shake like a wet dog. I believe what Goerge Carlin said, \" In the end, Mother Earth will shake us off like a bad case of fleas\" This 2012 stuff is a bunch of malarkey.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 11:17:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Yea, just like the Y2K crap,,, the worlds gonna crash. The Y2K scam generated 300+ Billion dollars in one year. How many people bought the y2k fix software? The government invested in that useless crap too, as well as many businesses. If only for them it lasted longer.......but wait, the now have something with longjevity.....it is the man made climate change scam. Get your carbon credits while you can.", 
        "intTime": 20090308, 
        "postID": 33, 
        "quote": "Originally posted by BAGodbehere: Yea, just like the Y2K crap,,, the worlds gonna crash.", 
        "reply": " The Y2K scam generated 300+ Billion dollars in one year. How many people bought the y2k fix software? The government invested in that useless crap too, as well as many businesses. If only for them it lasted longer.......but wait, the now have something with longjevity.....it is the man made climate change scam. Get your carbon credits while you can.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 13:02:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81 But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave It is the date that the Mayan calader ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago.", 
        "intTime": 20090308, 
        "postID": 34, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by foxred03: Coast to Coast got really boring after Art left. They rarely talk about ghosts, satanic posession, or aliens anymore. I do remember \"Y2K\" being a gigantic topic back then, dozens of \"experts\" were lining up to talk about how the world was about to end. If history has proven one thing, it's that the \"end is near\" types are ALWAYS wrong. I remember a Mad magazine cartoon from when I was a kid, showed this bearded guy wearing a sandwich board that said, \"THE END IS NEAR\", so he rounds a turn and steps off the curb and gets nailed by a bus, yup, for him, the \"END WAS NEAR\"... LOL Respectfully, SUNLINER81 But I don't see this mentioned in my beloved copy of Nostradamus? How can it be true? Dave", 
        "reply": " It is the date that the Mayan calader ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 13:20:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090308, 
        "postID": 35, 
        "quote": "Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago.", 
        "reply": " the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 14:13:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Philhelm: The film should be released in 2013. LMAO good one.", 
        "intTime": 20090308, 
        "postID": 36, 
        "quote": "Originally posted by Philhelm: The film should be released in 2013.", 
        "reply": " LMAO good one.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 15:30:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I love C2C mainly for the Space-Science topics. But there are some good topics as well. They had an Hells Angels ATF implant agent on a week ago...interesting stuff. I don't care for the UFO, ghost and all that shows. Wish I had been a listener when Art was around, but never heard of it up till a couple years ago. BTW, Art made the Radio Hall Of Fame for Pioneering new ground in talk radio. Incidently, right beside some of your alls great master Leader .. Rush.. Art Bell The Man Who Invented Night Time Alternate Talk Radio", 
        "intTime": 20090308, 
        "postID": 37, 
        "quote": "", 
        "reply": "I love C2C mainly for the Space-Science topics. But there are some good topics as well. They had an Hells Angels ATF implant agent on a week ago...interesting stuff. I don't care for the UFO, ghost and all that shows. Wish I had been a listener when Art was around, but never heard of it up till a couple years ago. BTW, Art made the Radio Hall Of Fame for Pioneering new ground in talk radio. Incidently, right beside some of your alls great master Leader .. Rush.. Art Bell The Man Who Invented Night Time Alternate Talk Radio", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 15:36:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them.", 
        "intTime": 20090308, 
        "postID": 38, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them.", 
        "reply": "", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 16:56:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "---- HEY-- Whaaa...?? The check-out date for Motel 8 is Dec. 21, 2012 ?? - No FREAKIN WAY !! I get my MORTGAGE paid off the DAY \"BEFORE\" the BIG Lalapazooza ??? GREAT - just Freakin GREAT ! - That does it ! Where the he11 is my lucky \"wife-beater\" shirt ? - U.B.", 
        "intTime": 20090308, 
        "postID": 39, 
        "quote": "", 
        "reply": "---- HEY-- Whaaa...?? The check-out date for Motel 8 is Dec. 21, 2012 ?? - No FREAKIN WAY !! I get my MORTGAGE paid off the DAY \"BEFORE\" the BIG Lalapazooza ??? GREAT - just Freakin GREAT ! - That does it ! Where the he11 is my lucky \"wife-beater\" shirt ? - U.B.", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 17:47:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "LuckySoFar"
    }, 
    {
        "content": "quote: Originally posted by LuckySoFar: quote: Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them. THAT must be where I got the idea... and for a while there I was thinking I was abducted and had some residual memory flashbacks. Now I have to find out another reason why my butt hurts also..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090308, 
        "postID": 40, 
        "quote": "Originally posted by LuckySoFar: quote: Originally posted by m551sheridan: quote: Originally posted by thorin001: It is the date that the Mayan calendar ends. There is nothing suggesting that everything ends or that there is some catastrophy, it is just the last date on that calendar. Who knows if it would have been updated if they hadn't been wiped out centuries ago. ---- Hey -- That sounds like the old Donovan tune from the Hippie days - \"Hail Atlantis\". - But you got to love Gilda Radner - \"Its always something\". the ancient Mayans were schooled by a few Alantians who, when there own civilization was in peril, scattered to the four winds. Survivors instructed the indigenous peoples but as they died out so did the knowledge they tried to share and the native peoples could no longer duplicate or understand what the ancients tried to teach them.", 
        "reply": " THAT must be where I got the idea... and for a while there I was thinking I was abducted and had some residual memory flashbacks. Now I have to find out another reason why my butt hurts also..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8190042712001", 
        "time": "2009-03-08 18:00:00", 
        "title": "Apocalypse in 2012? Date spawns theories, film", 
        "userID": "m551sheridan"
    }
]