[
    {
        "content": "Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "", 
        "reply": "Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-06 23:08:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "He'll do it just to appease the lesbians.", 
        "intTime": 20090507, 
        "postID": 2, 
        "quote": "", 
        "reply": "He'll do it just to appease the lesbians.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:07:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Maybe he will appoint them both.....sounds like fun to watch Already past the future", 
        "intTime": 20090507, 
        "postID": 3, 
        "quote": "", 
        "reply": "Maybe he will appoint them both.....sounds like fun to watch Already past the future", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:14:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman. I think that would be a safe bet", 
        "intTime": 20090507, 
        "postID": 4, 
        "quote": "Originally posted by IHAWKER: Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "reply": " I think that would be a safe bet", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:24:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "intTime": 20090507, 
        "postID": 5, 
        "quote": "Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch", 
        "reply": " Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:14:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "intTime": 20090507, 
        "postID": 6, 
        "quote": "", 
        "reply": "No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:26:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 6486143: M aybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor. Chief, I'm a ***** trapped in a man's body Already past the future", 
        "intTime": 20090507, 
        "postID": 7, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 6486143: M aybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "reply": " Chief, I'm a ***** trapped in a man's body Already past the future", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:32:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6486143"
    }, 
    {
        "content": "Mabey he'll appoint Ann Coulter!", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "", 
        "reply": "Mabey he'll appoint Ann Coulter!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:39:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag.", 
        "intTime": 20090507, 
        "postID": 9, 
        "quote": "Originally posted by EAG154: Mabey he'll appoint Ann Coulter!", 
        "reply": " I thought the bet was it would be a woman - that's a bloke in drag.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:43:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "intTime": 20090507, 
        "postID": 10, 
        "quote": "Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "reply": " Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:51:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Her sexuality is irrelevant, but I would like to see more women on the Supreme Court. Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don Let me rephrase that, as long as they are the best qualified.", 
        "intTime": 20090507, 
        "postID": 11, 
        "quote": "Originally posted by SeaWitch1220: Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "reply": " Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don Let me rephrase that, as long as they are the best qualified.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:53:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch Only if they're lipstick lesbians, no flannels please!", 
        "intTime": 20090507, 
        "postID": 12, 
        "quote": "Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch", 
        "reply": " Only if they're lipstick lesbians, no flannels please!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:54:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag. Shame the devil & tell the truth, if she came up to you & wanted some Britannia you'd oblige!!", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag.", 
        "reply": " Shame the devil & tell the truth, if she came up to you & wanted some Britannia you'd oblige!!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:57:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "intTime": 20090507, 
        "postID": 14, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don", 
        "reply": " I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:57:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court. Qualifications supercede gender. Remember what happened to Bill C. when it was only a woman he wanted for AG.", 
        "intTime": 20090507, 
        "postID": 15, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "reply": " Qualifications supercede gender. Remember what happened to Bill C. when it was only a woman he wanted for AG.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:59:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court. Well, if she is qualifid and that is the focus of the vetting process and confirmation hearings - by all means go for it. If it turns into a one-issue show, then move on. I would also hope that the net is cast wide looking for best qualified regardless of sexual orientation, gender, race, etc.", 
        "intTime": 20090507, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "reply": " Well, if she is qualifid and that is the focus of the vetting process and confirmation hearings - by all means go for it. If it turns into a one-issue show, then move on. I would also hope that the net is cast wide looking for best qualified regardless of sexual orientation, gender, race, etc.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:03:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "sw614"
    }, 
    {
        "content": "It is becoming increasingly clear every day that President Obama will choose an extreme, left-wing activist judge who will twist and bend, and streth the already torn constitution to suit their agendas. If the Gays think they are being denied rights then put it up for a vote, chances are they will loose and will continue to loose. The next best thing is to do it the old fashion way: Fraud.", 
        "intTime": 20090507, 
        "postID": 17, 
        "quote": "", 
        "reply": "It is becoming increasingly clear every day that President Obama will choose an extreme, left-wing activist judge who will twist and bend, and streth the already torn constitution to suit their agendas. If the Gays think they are being denied rights then put it up for a vote, chances are they will loose and will continue to loose. The next best thing is to do it the old fashion way: Fraud.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:52:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "reply": " No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:59:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "intTime": 20090507, 
        "postID": 19, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "reply": " Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 09:23:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\" The Supreme Court is not a trial court. Qualifications for being a Judge mean nothing as far as the SCOTUS goes. Constitutional Law should be the primary qualification. But this thread is just speculation. As was said on another thread, better wait and see and THEN condemn... Dave", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "Originally posted by stec74: quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "reply": " The Supreme Court is not a trial court. Qualifications for being a Judge mean nothing as far as the SCOTUS goes. Constitutional Law should be the primary qualification. But this thread is just speculation. As was said on another thread, better wait and see and THEN condemn... Dave", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 09:30:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Grachus"
    }, 
    {
        "content": "Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "intTime": 20090506, 
        "postID": 21, 
        "quote": "", 
        "reply": "Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-06 23:08:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "He'll do it just to appease the lesbians.", 
        "intTime": 20090507, 
        "postID": 22, 
        "quote": "", 
        "reply": "He'll do it just to appease the lesbians.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:07:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Maybe he will appoint them both.....sounds like fun to watch Already past the future", 
        "intTime": 20090507, 
        "postID": 23, 
        "quote": "", 
        "reply": "Maybe he will appoint them both.....sounds like fun to watch Already past the future", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:14:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman. I think that would be a safe bet", 
        "intTime": 20090507, 
        "postID": 24, 
        "quote": "Originally posted by IHAWKER: Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "reply": " I think that would be a safe bet", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:24:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "intTime": 20090507, 
        "postID": 25, 
        "quote": "Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch", 
        "reply": " Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:14:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "intTime": 20090507, 
        "postID": 26, 
        "quote": "", 
        "reply": "No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:26:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 6486143: M aybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor. Chief, I'm a ***** trapped in a man's body Already past the future", 
        "intTime": 20090507, 
        "postID": 27, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 6486143: M aybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "reply": " Chief, I'm a ***** trapped in a man's body Already past the future", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:32:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6486143"
    }, 
    {
        "content": "Mabey he'll appoint Ann Coulter!", 
        "intTime": 20090507, 
        "postID": 28, 
        "quote": "", 
        "reply": "Mabey he'll appoint Ann Coulter!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:39:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag.", 
        "intTime": 20090507, 
        "postID": 29, 
        "quote": "Originally posted by EAG154: Mabey he'll appoint Ann Coulter!", 
        "reply": " I thought the bet was it would be a woman - that's a bloke in drag.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:43:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "intTime": 20090507, 
        "postID": 30, 
        "quote": "Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "reply": " Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:51:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Her sexuality is irrelevant, but I would like to see more women on the Supreme Court. Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don Let me rephrase that, as long as they are the best qualified.", 
        "intTime": 20090507, 
        "postID": 31, 
        "quote": "Originally posted by SeaWitch1220: Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "reply": " Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don Let me rephrase that, as long as they are the best qualified.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:53:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch Only if they're lipstick lesbians, no flannels please!", 
        "intTime": 20090507, 
        "postID": 32, 
        "quote": "Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch", 
        "reply": " Only if they're lipstick lesbians, no flannels please!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:54:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag. Shame the devil & tell the truth, if she came up to you & wanted some Britannia you'd oblige!!", 
        "intTime": 20090507, 
        "postID": 33, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag.", 
        "reply": " Shame the devil & tell the truth, if she came up to you & wanted some Britannia you'd oblige!!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:57:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "intTime": 20090507, 
        "postID": 34, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don", 
        "reply": " I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:57:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court. Qualifications supercede gender. Remember what happened to Bill C. when it was only a woman he wanted for AG.", 
        "intTime": 20090507, 
        "postID": 35, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "reply": " Qualifications supercede gender. Remember what happened to Bill C. when it was only a woman he wanted for AG.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:59:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court. Well, if she is qualifid and that is the focus of the vetting process and confirmation hearings - by all means go for it. If it turns into a one-issue show, then move on. I would also hope that the net is cast wide looking for best qualified regardless of sexual orientation, gender, race, etc.", 
        "intTime": 20090507, 
        "postID": 36, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "reply": " Well, if she is qualifid and that is the focus of the vetting process and confirmation hearings - by all means go for it. If it turns into a one-issue show, then move on. I would also hope that the net is cast wide looking for best qualified regardless of sexual orientation, gender, race, etc.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:03:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "sw614"
    }, 
    {
        "content": "It is becoming increasingly clear every day that President Obama will choose an extreme, left-wing activist judge who will twist and bend, and streth the already torn constitution to suit their agendas. If the Gays think they are being denied rights then put it up for a vote, chances are they will loose and will continue to loose. The next best thing is to do it the old fashion way: Fraud.", 
        "intTime": 20090507, 
        "postID": 37, 
        "quote": "", 
        "reply": "It is becoming increasingly clear every day that President Obama will choose an extreme, left-wing activist judge who will twist and bend, and streth the already torn constitution to suit their agendas. If the Gays think they are being denied rights then put it up for a vote, chances are they will loose and will continue to loose. The next best thing is to do it the old fashion way: Fraud.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:52:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "intTime": 20090507, 
        "postID": 38, 
        "quote": "Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "reply": " No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:59:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "intTime": 20090507, 
        "postID": 39, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "reply": " Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 09:23:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\" The Supreme Court is not a trial court. Qualifications for being a Judge mean nothing as far as the SCOTUS goes. Constitutional Law should be the primary qualification. But this thread is just speculation. As was said on another thread, better wait and see and THEN condemn... Dave", 
        "intTime": 20090507, 
        "postID": 40, 
        "quote": "Originally posted by stec74: quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "reply": " The Supreme Court is not a trial court. Qualifications for being a Judge mean nothing as far as the SCOTUS goes. Constitutional Law should be the primary qualification. But this thread is just speculation. As was said on another thread, better wait and see and THEN condemn... Dave", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 09:30:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Grachus"
    }, 
    {
        "content": "Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "intTime": 20090506, 
        "postID": 41, 
        "quote": "", 
        "reply": "Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-06 23:08:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "He'll do it just to appease the lesbians.", 
        "intTime": 20090507, 
        "postID": 42, 
        "quote": "", 
        "reply": "He'll do it just to appease the lesbians.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:07:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Maybe he will appoint them both.....sounds like fun to watch Already past the future", 
        "intTime": 20090507, 
        "postID": 43, 
        "quote": "", 
        "reply": "Maybe he will appoint them both.....sounds like fun to watch Already past the future", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:14:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman. I think that would be a safe bet", 
        "intTime": 20090507, 
        "postID": 44, 
        "quote": "Originally posted by IHAWKER: Two Out Lesbians Considered for Supreme Court Pam Karlan a Stanford University law professor, is one of two out lesbians rumored to be on Obama's list to replace Supreme Court Justice David Souter, who is due to retire this spring. Kathleen Sullivan the out former dean of Stanford Law School, has also been frequently mentioned as a possible replacement for Souter. >>>http://www.advocate.com/news_detail_ektid82801.asp It may not be one of these two but I feel very confident that President Obama will appoint a woman.", 
        "reply": " I think that would be a safe bet", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 05:24:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "intTime": 20090507, 
        "postID": 45, 
        "quote": "Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch", 
        "reply": " Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:14:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "intTime": 20090507, 
        "postID": 46, 
        "quote": "", 
        "reply": "No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:26:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 6486143: M aybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor. Chief, I'm a ***** trapped in a man's body Already past the future", 
        "intTime": 20090507, 
        "postID": 47, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 6486143: M aybe he will appoint them both.....sounds like fun to watch Snipe, this is why you ARE the only man for me I like Sullivan or Sotomayor.", 
        "reply": " Chief, I'm a ***** trapped in a man's body Already past the future", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:32:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "6486143"
    }, 
    {
        "content": "Mabey he'll appoint Ann Coulter!", 
        "intTime": 20090507, 
        "postID": 48, 
        "quote": "", 
        "reply": "Mabey he'll appoint Ann Coulter!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:39:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag.", 
        "intTime": 20090507, 
        "postID": 49, 
        "quote": "Originally posted by EAG154: Mabey he'll appoint Ann Coulter!", 
        "reply": " I thought the bet was it would be a woman - that's a bloke in drag.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:43:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "intTime": 20090507, 
        "postID": 50, 
        "quote": "Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "reply": " Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:51:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: Her sexuality is irrelevant, but I would like to see more women on the Supreme Court. Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don Let me rephrase that, as long as they are the best qualified.", 
        "intTime": 20090507, 
        "postID": 51, 
        "quote": "Originally posted by SeaWitch1220: Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "reply": " Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don Let me rephrase that, as long as they are the best qualified.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:53:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch Only if they're lipstick lesbians, no flannels please!", 
        "intTime": 20090507, 
        "postID": 52, 
        "quote": "Originally posted by 6486143: Maybe he will appoint them both.....sounds like fun to watch", 
        "reply": " Only if they're lipstick lesbians, no flannels please!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:54:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag. Shame the devil & tell the truth, if she came up to you & wanted some Britannia you'd oblige!!", 
        "intTime": 20090507, 
        "postID": 53, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by EAG154: Mabey he'll appoint Ann Coulter! I thought the bet was it would be a woman - that's a bloke in drag.", 
        "reply": " Shame the devil & tell the truth, if she came up to you & wanted some Britannia you'd oblige!!", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:57:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "intTime": 20090507, 
        "postID": 54, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don", 
        "reply": " I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:57:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court. Qualifications supercede gender. Remember what happened to Bill C. when it was only a woman he wanted for AG.", 
        "intTime": 20090507, 
        "postID": 55, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by 21yrsUSCGUSCS: Male, female, White, Black, Hispanic, Irish Plaid....I don't really give a hoot as long as they are highly qualified. Don I want a highly qualified woman on the court, but women do make up over 50% of this country and are woefully underrepresented in its highest court.", 
        "reply": " Qualifications supercede gender. Remember what happened to Bill C. when it was only a woman he wanted for AG.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 06:59:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court. Well, if she is qualifid and that is the focus of the vetting process and confirmation hearings - by all means go for it. If it turns into a one-issue show, then move on. I would also hope that the net is cast wide looking for best qualified regardless of sexual orientation, gender, race, etc.", 
        "intTime": 20090507, 
        "postID": 56, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. Kathleen Sullivan is immensely qualified for the job. She is the author of the leading casebook in constitutional law. She has been a professor at Harvard and a Dean at Stanford. She has argued before the U.S. Supreme Court and many appeals courts. Her sexuality is irrelevant, but I would like to see more women on the Supreme Court.", 
        "reply": " Well, if she is qualifid and that is the focus of the vetting process and confirmation hearings - by all means go for it. If it turns into a one-issue show, then move on. I would also hope that the net is cast wide looking for best qualified regardless of sexual orientation, gender, race, etc.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:03:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "sw614"
    }, 
    {
        "content": "It is becoming increasingly clear every day that President Obama will choose an extreme, left-wing activist judge who will twist and bend, and streth the already torn constitution to suit their agendas. If the Gays think they are being denied rights then put it up for a vote, chances are they will loose and will continue to loose. The next best thing is to do it the old fashion way: Fraud.", 
        "intTime": 20090507, 
        "postID": 57, 
        "quote": "", 
        "reply": "It is becoming increasingly clear every day that President Obama will choose an extreme, left-wing activist judge who will twist and bend, and streth the already torn constitution to suit their agendas. If the Gays think they are being denied rights then put it up for a vote, chances are they will loose and will continue to loose. The next best thing is to do it the old fashion way: Fraud.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:52:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "intTime": 20090507, 
        "postID": 58, 
        "quote": "Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom.", 
        "reply": " No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 08:59:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "intTime": 20090507, 
        "postID": 59, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person.", 
        "reply": " Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 09:23:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\" The Supreme Court is not a trial court. Qualifications for being a Judge mean nothing as far as the SCOTUS goes. Constitutional Law should be the primary qualification. But this thread is just speculation. As was said on another thread, better wait and see and THEN condemn... Dave", 
        "intTime": 20090507, 
        "postID": 60, 
        "quote": "Originally posted by stec74: quote: Originally posted by Whirled_Peas: quote: Originally posted by stec74: No mention of any other qualifications except sexual preference for either candidate. Glad to see that in order to be appointed to the highest court in the nation, all you need is the correct sexual organs and to be open about what takes place in your bedroom. No mention? \"Pam Karlan a Stanford University law professor... Kathleen Sullivan the out former dean of Stanford Law School...\" I would say that being a law professor or a dean of a law school would be at LEAST a \"mention\" of their qualifications. I'm sure a very quick online search will turn up the rest of their qualifications. They're both highly experienced lawyers with strong academic backgrounds. Their sexual orientation is irrelevant, but it is interesting to see that \"out\" lesbians are not being automatically excluded from the list of candidates. I'm sure the previous administration wouldn't have even considered a gay person. Listing their current job is not the same as listing qualifications. Qualifications to be a Supreme Court Justice would hopefully include something like the number of years spent as a sitting judge or maybe a listing of some of the important trials they oversaw. \"Those who can, do. Those who can't, teach\"", 
        "reply": " The Supreme Court is not a trial court. Qualifications for being a Judge mean nothing as far as the SCOTUS goes. Constitutional Law should be the primary qualification. But this thread is just speculation. As was said on another thread, better wait and see and THEN condemn... Dave", 
        "threadID": "672198221_4840007222001", 
        "time": "2009-05-07 09:30:00", 
        "title": "Two Out Lesbians Considered for Supreme Court", 
        "userID": "Grachus"
    }
]