[
    {
        "content": "\"A senior Vatican cleric has defended the excommunication of the mother and doctors of a nine-year-old girl who had an abortion in Brazil after being raped. Cardinal Giovanni Battista Re, head of the Catholic church's Congregation for Bishops, told the daily La Stampa on Saturday that the twins the girl had been carrying had a right to live. \"It is a sad case but the real problem is that the twins conceived were two innocent persons, who had the right to live and could not be eliminated,\" he said. Re, who also heads the Pontifical Commission for Latin America, added: \"Life must always be protected, the attack on the Brazilian church is unjustified.\" The row was triggered by the termination on Wednesday of twin foetuses carried by a nine-year-old allegedly raped by her stepfather in the Brazilian state of Pernambuco. The regional archbishop, Jose Cardoso Sobrinho, pronounced excommunication for the mother for authorising the operation and doctors who carried it out for fear that the slim girl would not survive carrying the foetuses to term. \"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said. He also said the accused stepfather would not be expelled from the church. Although the man allegedly committed \"a heinous crime ... the abortion - the elimination of an innocent life - was more serious\". Battista Re agreed, saying: \"Excommunication for those who carried out the abortion is just\" as a pregnancy termination always meant ending an innocent life. The case has sparked fierce debate in Brazil, where abortion is illegal except in cases of rape or if the woman's health is in danger. On Friday, President Luiz Ignacio Lula da Silva hit out at Sobrinho's decision, saying: \"As a Christian and a Catholic, I deeply regret that a bishop of the Catholic church has such a conservative attitude.\" \"The doctors did what had to be done: save the life of a girl of nine years old,\" he said, adding that \"in this case, the medical profession was more right than the church.\" One of the doctors involved in the abortion, Rivaldo Albuquerque, told Globo television that he would keep going to mass, regardless of the archbishop's order. \"The people want a church full of forgiveness, love and mercy,\" he said. Health Minister Jose Gomes Temporao also slammed the archbishop. \"Two things strike me: the assault on the girl and the position of this bishop, which is truly lamentable,\" he said. The girl, who was not identified because she is a minor, was last week found to be four months' pregnant after being taken to hospital suffering stomach pains. Officials said she told them she had suffered sexual abuse by her stepfather since the age of six. Police said the 23-year-old stepfather also allegedly sexually abused the girl's physically handicapped 14-year-old sister. He was arrested a week ago and is being kept in protective custody. If convicted, he faces up to 15 years in prison. The website of the news group Globo reported that another girl, aged 11, had been found to be seven months pregnant following alleged sexual abuse at the hands of her adoptive father. The girl has said she does not intend to seek an abortion, according to reports.\" ++http://au.news.yahoo.com/a/-/world/5375029/vatican-defends-brazil-excommunication/",
        "intTime": 20090308,
        "postID": 1,
        "quote": "",
        "reply": "\"A senior Vatican cleric has defended the excommunication of the mother and doctors of a nine-year-old girl who had an abortion in Brazil after being raped. Cardinal Giovanni Battista Re, head of the Catholic church's Congregation for Bishops, told the daily La Stampa on Saturday that the twins the girl had been carrying had a right to live. \"It is a sad case but the real problem is that the twins conceived were two innocent persons, who had the right to live and could not be eliminated,\" he said. Re, who also heads the Pontifical Commission for Latin America, added: \"Life must always be protected, the attack on the Brazilian church is unjustified.\" The row was triggered by the termination on Wednesday of twin foetuses carried by a nine-year-old allegedly raped by her stepfather in the Brazilian state of Pernambuco. The regional archbishop, Jose Cardoso Sobrinho, pronounced excommunication for the mother for authorising the operation and doctors who carried it out for fear that the slim girl would not survive carrying the foetuses to term. \"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said. He also said the accused stepfather would not be expelled from the church. Although the man allegedly committed \"a heinous crime ... the abortion - the elimination of an innocent life - was more serious\". Battista Re agreed, saying: \"Excommunication for those who carried out the abortion is just\" as a pregnancy termination always meant ending an innocent life. The case has sparked fierce debate in Brazil, where abortion is illegal except in cases of rape or if the woman's health is in danger. On Friday, President Luiz Ignacio Lula da Silva hit out at Sobrinho's decision, saying: \"As a Christian and a Catholic, I deeply regret that a bishop of the Catholic church has such a conservative attitude.\" \"The doctors did what had to be done: save the life of a girl of nine years old,\" he said, adding that \"in this case, the medical profession was more right than the church.\" One of the doctors involved in the abortion, Rivaldo Albuquerque, told Globo television that he would keep going to mass, regardless of the archbishop's order. \"The people want a church full of forgiveness, love and mercy,\" he said. Health Minister Jose Gomes Temporao also slammed the archbishop. \"Two things strike me: the assault on the girl and the position of this bishop, which is truly lamentable,\" he said. The girl, who was not identified because she is a minor, was last week found to be four months' pregnant after being taken to hospital suffering stomach pains. Officials said she told them she had suffered sexual abuse by her stepfather since the age of six. Police said the 23-year-old stepfather also allegedly sexually abused the girl's physically handicapped 14-year-old sister. He was arrested a week ago and is being kept in protective custody. If convicted, he faces up to 15 years in prison. The website of the news group Globo reported that another girl, aged 11, had been found to be seven months pregnant following alleged sexual abuse at the hands of her adoptive father. The girl has said she does not intend to seek an abortion, according to reports.\" ++http://au.news.yahoo.com/a/-/world/5375029/vatican-defends-brazil-excommunication/",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-08 08:41:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "foxred03"
    },
    {
        "content": "I notice that they are not excommunicating the rapist.",
        "intTime": 20090308,
        "postID": 2,
        "quote": "",
        "reply": "I notice that they are not excommunicating the rapist.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-08 11:00:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "thorin001"
    },
    {
        "content": "quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. This message has been edited. Last edited by: popsiq, Mon 09 March 2009 07:51 AM",
        "intTime": 20090309,
        "postID": 3,
        "quote": "Originally posted by thorin001: I notice that they are not excommunicating the rapist.",
        "reply": " Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. This message has been edited. Last edited by: popsiq, Mon 09 March 2009 07:51 AM",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 07:30:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists.",
        "intTime": 20090309,
        "postID": 4,
        "quote": "Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God.",
        "reply": " No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 11:21:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "thorin001"
    },
    {
        "content": "I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "intTime": 20090309,
        "postID": 5,
        "quote": "",
        "reply": "I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 12:16:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "foxred03"
    },
    {
        "content": "I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope!",
        "intTime": 20090309,
        "postID": 6,
        "quote": "",
        "reply": "I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope!",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 12:26:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Knele"
    },
    {
        "content": "quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter.",
        "intTime": 20090309,
        "postID": 7,
        "quote": "Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "reply": " Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 17:57:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "thorin001"
    },
    {
        "content": "Let see. Isn't there another thread stating that Christians are on the decline. I wonder why. If the Church is so adamant of a child having twins why aren't out in front looking out for all three children. Will the church take care of all the needs. No nine year old is changing diapers and breast feeding. The stepdad needs his balls cut off, excommunication might be the greatest of all heavenly punishments , but castration for human that boils in all of us will satisfy this protestant.",
        "intTime": 20090309,
        "postID": 8,
        "quote": "",
        "reply": "Let see. Isn't there another thread stating that Christians are on the decline. I wonder why. If the Church is so adamant of a child having twins why aren't out in front looking out for all three children. Will the church take care of all the needs. No nine year old is changing diapers and breast feeding. The stepdad needs his balls cut off, excommunication might be the greatest of all heavenly punishments , but castration for human that boils in all of us will satisfy this protestant.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 18:55:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter. And religious politicians in civvy gear don't bother you? Since most Catholics, political or otherwise, don't wear clericals, this is 'something' against 'Catholics', particularly priests, ain't it? Face it, the only thing 'wrong' with Catholics, to most open-minded Americans, is their 'unnatural' affiliation with priests - a carry-over from the grand old 'Ulster scotch heritage'.",
        "intTime": 20090310,
        "postID": 9,
        "quote": "Originally posted by thorin001: quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter.",
        "reply": " And religious politicians in civvy gear don't bother you? Since most Catholics, political or otherwise, don't wear clericals, this is 'something' against 'Catholics', particularly priests, ain't it? Face it, the only thing 'wrong' with Catholics, to most open-minded Americans, is their 'unnatural' affiliation with priests - a carry-over from the grand old 'Ulster scotch heritage'.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 06:57:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists. If you'll do some research you'll find that an excommunicant is expected to maintain their relationship with the church. If only to make reconciliation and be forgiven. But if you don't believe in this 'jiggery-pokery' it doesn't matter much, does it? People get told to 'go to hell' every day, and other than possibly hurt feelings, it doesn't matter much who says it. Now if you do take this seriously you have to apply the rules to the way you live. It's not the Church's idea, Jesus said that. Rape and abortion are both non-life-giving, ergo sinful, acts. Two wrongs, either sacred or profane, still don't make a right. This message has been edited. Last edited by: popsiq, Tue 10 March 2009 07:31 AM",
        "intTime": 20090310,
        "postID": 10,
        "quote": "Originally posted by thorin001: quote: Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists.",
        "reply": " If you'll do some research you'll find that an excommunicant is expected to maintain their relationship with the church. If only to make reconciliation and be forgiven. But if you don't believe in this 'jiggery-pokery' it doesn't matter much, does it? People get told to 'go to hell' every day, and other than possibly hurt feelings, it doesn't matter much who says it. Now if you do take this seriously you have to apply the rules to the way you live. It's not the Church's idea, Jesus said that. Rape and abortion are both non-life-giving, ergo sinful, acts. Two wrongs, either sacred or profane, still don't make a right. This message has been edited. Last edited by: popsiq, Tue 10 March 2009 07:31 AM",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 07:15:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Eight years of Catholic education and you think the \"rapist off the hook\"? You must have been absent the day they talked about conscience and sin. But you obviously heard the discussions of moral relativism. It's entirely possible the 'rapist' had a diminished mental capacity or was the victim of social or religious ignorance. Some parts of Brazil are far from civilized and could be described as brutal. In either of those instances there is nothing to excommunicate, if no communication existed.",
        "intTime": 20090310,
        "postID": 11,
        "quote": "Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "reply": " Eight years of Catholic education and you think the \"rapist off the hook\"? You must have been absent the day they talked about conscience and sin. But you obviously heard the discussions of moral relativism. It's entirely possible the 'rapist' had a diminished mental capacity or was the victim of social or religious ignorance. Some parts of Brazil are far from civilized and could be described as brutal. In either of those instances there is nothing to excommunicate, if no communication existed.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 07:36:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "Wow. The mother and doctors of the girl who was raped were excommunicated even though they, \"...carried it out for fear that the slim girl would not survive carrying the foetuses to term...\" Not forgetting that this girl was 9 YEARS OLD! Not only was she in serious medical danger, she was a tiny child. And now the rapist is somehow the victim here? That is some pretty convoluted logic.",
        "intTime": 20090310,
        "postID": 12,
        "quote": "",
        "reply": "Wow. The mother and doctors of the girl who was raped were excommunicated even though they, \"...carried it out for fear that the slim girl would not survive carrying the foetuses to term...\" Not forgetting that this girl was 9 YEARS OLD! Not only was she in serious medical danger, she was a tiny child. And now the rapist is somehow the victim here? That is some pretty convoluted logic.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 08:32:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. The article does not mention specifically what the beliefs of the Catholic Church are in this matter. Thats the critical part that is missing. Although, I do not disagree with you.",
        "intTime": 20090310,
        "postID": 13,
        "quote": "Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "reply": " The article does not mention specifically what the beliefs of the Catholic Church are in this matter. Thats the critical part that is missing. Although, I do not disagree with you.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 08:43:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "ErichG2"
    },
    {
        "content": "quote: \"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said. That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick.",
        "intTime": 20090310,
        "postID": 14,
        "quote": "\"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said.",
        "reply": " That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 08:44:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Whirled_Peas"
    },
    {
        "content": "quote: Originally posted by Whirled_Peas: That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick. What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith.",
        "intTime": 20090310,
        "postID": 15,
        "quote": "Originally posted by Whirled_Peas: That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick.",
        "reply": " What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 10:10:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "ErichG2"
    },
    {
        "content": "quote: Originally posted by ErichG2: What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith. You're really, really reaching here. I'm making an observation about religious extremism turned into law, and comparing it to how one part of the Catholic Church (in Brazil) excommunicated a girl and a cleric (not the pope) in the Vatican supported that move. This has everything to do with issues of extremism and overbearing control, using this case of abortion as an example. And I wasn't talking about homosexuality here. The condemnation of gays by some churches is nothing compared to the real threat of religious extremism putting human beings at risk by holding \"God's judgment\" over their heads. I was raised Catholic. I was even one of those \"good Catholic girls\" who actually did what the nuns told me to do! I went to church every week, attended Bible studies, read the Bible on my own, sang and played the piano for the choir, and studied church history. I went to a Catholic college. I visited the Vatican and brought home Rosary beads that had been blessed by the Pope as a gift for my grandmother. In other words... I think I have a fair understanding of the Church. Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church. In fact, it's an insignificant reason, compared to the others. So, to get back on track, this is about extreme interpretations of religious laws/opinions, and the damage those extreme interpretations can cause. If the religious leaders of Brazil had their way, this 9-year old girl would still be pregnant, and possibly facing a painful death via an impossible pregnancy and delivery. Religious leaders that take any \"divine decree\" to an extreme are dangerous, and this is no different.",
        "intTime": 20090310,
        "postID": 16,
        "quote": "Originally posted by ErichG2: What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith.",
        "reply": " You're really, really reaching here. I'm making an observation about religious extremism turned into law, and comparing it to how one part of the Catholic Church (in Brazil) excommunicated a girl and a cleric (not the pope) in the Vatican supported that move. This has everything to do with issues of extremism and overbearing control, using this case of abortion as an example. And I wasn't talking about homosexuality here. The condemnation of gays by some churches is nothing compared to the real threat of religious extremism putting human beings at risk by holding \"God's judgment\" over their heads. I was raised Catholic. I was even one of those \"good Catholic girls\" who actually did what the nuns told me to do! I went to church every week, attended Bible studies, read the Bible on my own, sang and played the piano for the choir, and studied church history. I went to a Catholic college. I visited the Vatican and brought home Rosary beads that had been blessed by the Pope as a gift for my grandmother. In other words... I think I have a fair understanding of the Church. Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church. In fact, it's an insignificant reason, compared to the others. So, to get back on track, this is about extreme interpretations of religious laws/opinions, and the damage those extreme interpretations can cause. If the religious leaders of Brazil had their way, this 9-year old girl would still be pregnant, and possibly facing a painful death via an impossible pregnancy and delivery. Religious leaders that take any \"divine decree\" to an extreme are dangerous, and this is no different.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 11:44:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Whirled_Peas"
    },
    {
        "content": "quote: Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope! Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81",
        "intTime": 20090310,
        "postID": 17,
        "quote": "Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope!",
        "reply": " Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 12:09:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "SUNLINER81"
    },
    {
        "content": "the vatican can excommunicate them, but the LORD will do what he sees fit. Man can just exile her. i am fairly sure that they two of them walk with the mantle of Christ firmly pressed around them.",
        "intTime": 20090310,
        "postID": 18,
        "quote": "",
        "reply": "the vatican can excommunicate them, but the LORD will do what he sees fit. Man can just exile her. i am fairly sure that they two of them walk with the mantle of Christ firmly pressed around them.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 13:42:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by Whirled_Peas: Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church. You and Seawitch both I noticed. There are differences between dislike, opposition to and outright hatred of. I have to say that you can't accuse others of being a bigot if your posts portray a bigotry. I really could care less about whats stated about the Catholic Church. It just seems inconsistent to me in one thread you are saying this and that against people you consider to be bigoted.......then I read your posts on the Catholic Church and Wow!. What a turnabout, it's as if you never wrote what you posted before.",
        "intTime": 20090310,
        "postID": 19,
        "quote": "Originally posted by Whirled_Peas: Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church.",
        "reply": " You and Seawitch both I noticed. There are differences between dislike, opposition to and outright hatred of. I have to say that you can't accuse others of being a bigot if your posts portray a bigotry. I really could care less about whats stated about the Catholic Church. It just seems inconsistent to me in one thread you are saying this and that against people you consider to be bigoted.......then I read your posts on the Catholic Church and Wow!. What a turnabout, it's as if you never wrote what you posted before.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 13:48:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "ErichG2"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope! Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81 As far as YOU are concerned, I am speaking for the ENTIRE Brazilian Nation! And yes, it pays great, just not how much you think.",
        "intTime": 20090310,
        "postID": 20,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope! Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81",
        "reply": " As far as YOU are concerned, I am speaking for the ENTIRE Brazilian Nation! And yes, it pays great, just not how much you think.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 14:01:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Knele"
    },
    {
        "content": "\"A senior Vatican cleric has defended the excommunication of the mother and doctors of a nine-year-old girl who had an abortion in Brazil after being raped. Cardinal Giovanni Battista Re, head of the Catholic church's Congregation for Bishops, told the daily La Stampa on Saturday that the twins the girl had been carrying had a right to live. \"It is a sad case but the real problem is that the twins conceived were two innocent persons, who had the right to live and could not be eliminated,\" he said. Re, who also heads the Pontifical Commission for Latin America, added: \"Life must always be protected, the attack on the Brazilian church is unjustified.\" The row was triggered by the termination on Wednesday of twin foetuses carried by a nine-year-old allegedly raped by her stepfather in the Brazilian state of Pernambuco. The regional archbishop, Jose Cardoso Sobrinho, pronounced excommunication for the mother for authorising the operation and doctors who carried it out for fear that the slim girl would not survive carrying the foetuses to term. \"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said. He also said the accused stepfather would not be expelled from the church. Although the man allegedly committed \"a heinous crime ... the abortion - the elimination of an innocent life - was more serious\". Battista Re agreed, saying: \"Excommunication for those who carried out the abortion is just\" as a pregnancy termination always meant ending an innocent life. The case has sparked fierce debate in Brazil, where abortion is illegal except in cases of rape or if the woman's health is in danger. On Friday, President Luiz Ignacio Lula da Silva hit out at Sobrinho's decision, saying: \"As a Christian and a Catholic, I deeply regret that a bishop of the Catholic church has such a conservative attitude.\" \"The doctors did what had to be done: save the life of a girl of nine years old,\" he said, adding that \"in this case, the medical profession was more right than the church.\" One of the doctors involved in the abortion, Rivaldo Albuquerque, told Globo television that he would keep going to mass, regardless of the archbishop's order. \"The people want a church full of forgiveness, love and mercy,\" he said. Health Minister Jose Gomes Temporao also slammed the archbishop. \"Two things strike me: the assault on the girl and the position of this bishop, which is truly lamentable,\" he said. The girl, who was not identified because she is a minor, was last week found to be four months' pregnant after being taken to hospital suffering stomach pains. Officials said she told them she had suffered sexual abuse by her stepfather since the age of six. Police said the 23-year-old stepfather also allegedly sexually abused the girl's physically handicapped 14-year-old sister. He was arrested a week ago and is being kept in protective custody. If convicted, he faces up to 15 years in prison. The website of the news group Globo reported that another girl, aged 11, had been found to be seven months pregnant following alleged sexual abuse at the hands of her adoptive father. The girl has said she does not intend to seek an abortion, according to reports.\" ++http://au.news.yahoo.com/a/-/world/5375029/vatican-defends-brazil-excommunication/",
        "intTime": 20090308,
        "postID": 21,
        "quote": "",
        "reply": "\"A senior Vatican cleric has defended the excommunication of the mother and doctors of a nine-year-old girl who had an abortion in Brazil after being raped. Cardinal Giovanni Battista Re, head of the Catholic church's Congregation for Bishops, told the daily La Stampa on Saturday that the twins the girl had been carrying had a right to live. \"It is a sad case but the real problem is that the twins conceived were two innocent persons, who had the right to live and could not be eliminated,\" he said. Re, who also heads the Pontifical Commission for Latin America, added: \"Life must always be protected, the attack on the Brazilian church is unjustified.\" The row was triggered by the termination on Wednesday of twin foetuses carried by a nine-year-old allegedly raped by her stepfather in the Brazilian state of Pernambuco. The regional archbishop, Jose Cardoso Sobrinho, pronounced excommunication for the mother for authorising the operation and doctors who carried it out for fear that the slim girl would not survive carrying the foetuses to term. \"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said. He also said the accused stepfather would not be expelled from the church. Although the man allegedly committed \"a heinous crime ... the abortion - the elimination of an innocent life - was more serious\". Battista Re agreed, saying: \"Excommunication for those who carried out the abortion is just\" as a pregnancy termination always meant ending an innocent life. The case has sparked fierce debate in Brazil, where abortion is illegal except in cases of rape or if the woman's health is in danger. On Friday, President Luiz Ignacio Lula da Silva hit out at Sobrinho's decision, saying: \"As a Christian and a Catholic, I deeply regret that a bishop of the Catholic church has such a conservative attitude.\" \"The doctors did what had to be done: save the life of a girl of nine years old,\" he said, adding that \"in this case, the medical profession was more right than the church.\" One of the doctors involved in the abortion, Rivaldo Albuquerque, told Globo television that he would keep going to mass, regardless of the archbishop's order. \"The people want a church full of forgiveness, love and mercy,\" he said. Health Minister Jose Gomes Temporao also slammed the archbishop. \"Two things strike me: the assault on the girl and the position of this bishop, which is truly lamentable,\" he said. The girl, who was not identified because she is a minor, was last week found to be four months' pregnant after being taken to hospital suffering stomach pains. Officials said she told them she had suffered sexual abuse by her stepfather since the age of six. Police said the 23-year-old stepfather also allegedly sexually abused the girl's physically handicapped 14-year-old sister. He was arrested a week ago and is being kept in protective custody. If convicted, he faces up to 15 years in prison. The website of the news group Globo reported that another girl, aged 11, had been found to be seven months pregnant following alleged sexual abuse at the hands of her adoptive father. The girl has said she does not intend to seek an abortion, according to reports.\" ++http://au.news.yahoo.com/a/-/world/5375029/vatican-defends-brazil-excommunication/",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-08 08:41:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "foxred03"
    },
    {
        "content": "I notice that they are not excommunicating the rapist.",
        "intTime": 20090308,
        "postID": 22,
        "quote": "",
        "reply": "I notice that they are not excommunicating the rapist.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-08 11:00:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "thorin001"
    },
    {
        "content": "quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. This message has been edited. Last edited by: popsiq, Mon 09 March 2009 07:51 AM",
        "intTime": 20090309,
        "postID": 23,
        "quote": "Originally posted by thorin001: I notice that they are not excommunicating the rapist.",
        "reply": " Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. This message has been edited. Last edited by: popsiq, Mon 09 March 2009 07:51 AM",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 07:30:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists.",
        "intTime": 20090309,
        "postID": 24,
        "quote": "Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God.",
        "reply": " No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 11:21:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "thorin001"
    },
    {
        "content": "I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "intTime": 20090309,
        "postID": 25,
        "quote": "",
        "reply": "I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 12:16:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "foxred03"
    },
    {
        "content": "I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope!",
        "intTime": 20090309,
        "postID": 26,
        "quote": "",
        "reply": "I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope!",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 12:26:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Knele"
    },
    {
        "content": "quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter.",
        "intTime": 20090309,
        "postID": 27,
        "quote": "Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "reply": " Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 17:57:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "thorin001"
    },
    {
        "content": "Let see. Isn't there another thread stating that Christians are on the decline. I wonder why. If the Church is so adamant of a child having twins why aren't out in front looking out for all three children. Will the church take care of all the needs. No nine year old is changing diapers and breast feeding. The stepdad needs his balls cut off, excommunication might be the greatest of all heavenly punishments , but castration for human that boils in all of us will satisfy this protestant.",
        "intTime": 20090309,
        "postID": 28,
        "quote": "",
        "reply": "Let see. Isn't there another thread stating that Christians are on the decline. I wonder why. If the Church is so adamant of a child having twins why aren't out in front looking out for all three children. Will the church take care of all the needs. No nine year old is changing diapers and breast feeding. The stepdad needs his balls cut off, excommunication might be the greatest of all heavenly punishments , but castration for human that boils in all of us will satisfy this protestant.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-09 18:55:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter. And religious politicians in civvy gear don't bother you? Since most Catholics, political or otherwise, don't wear clericals, this is 'something' against 'Catholics', particularly priests, ain't it? Face it, the only thing 'wrong' with Catholics, to most open-minded Americans, is their 'unnatural' affiliation with priests - a carry-over from the grand old 'Ulster scotch heritage'.",
        "intTime": 20090310,
        "postID": 29,
        "quote": "Originally posted by thorin001: quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Don't get me wrong, I have nothing against Catholics as a group. Their politicians in religious garb are a different matter.",
        "reply": " And religious politicians in civvy gear don't bother you? Since most Catholics, political or otherwise, don't wear clericals, this is 'something' against 'Catholics', particularly priests, ain't it? Face it, the only thing 'wrong' with Catholics, to most open-minded Americans, is their 'unnatural' affiliation with priests - a carry-over from the grand old 'Ulster scotch heritage'.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 06:57:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists. If you'll do some research you'll find that an excommunicant is expected to maintain their relationship with the church. If only to make reconciliation and be forgiven. But if you don't believe in this 'jiggery-pokery' it doesn't matter much, does it? People get told to 'go to hell' every day, and other than possibly hurt feelings, it doesn't matter much who says it. Now if you do take this seriously you have to apply the rules to the way you live. It's not the Church's idea, Jesus said that. Rape and abortion are both non-life-giving, ergo sinful, acts. Two wrongs, either sacred or profane, still don't make a right. This message has been edited. Last edited by: popsiq, Tue 10 March 2009 07:31 AM",
        "intTime": 20090310,
        "postID": 30,
        "quote": "Originally posted by thorin001: quote: Originally posted by popsiq: quote: Originally posted by thorin001: I notice that they are not excommunicating the rapist. Why? He is excommunicated, he did that himself. He's in a state of sin. He has removed himself, by his actions, from the Body of Christ, outside which there is no salvation. He might be irredeemable - Christ having spoken of only two 'hopeless' sins - abusing children being one of them. Perhaps if he makes a sincere confession and does his penance, he could be 'good with God' and with the Church, although he might have a jail sentence to serve, personal hurt to atone and public opprobrium to face. The girl's mother has some mending to do as well. She may have been 'asleep at one important switch' and reacted by making a more grievous error. The doctors were just 'doing their job' which in this situation, again perhaps, may not have been the 'right' one - compounding one evil with another - even though it percieved as a 'public good'. All excommunicants can make a sincere confession of error, do a penance and be 'communicants' again. Excommunication is a warning, not a final damnation - that lies with God. No, excommunication is the formal removal from the church and closing of the path of salvation. The church has said that the doctors are beyond salvation but the rapist is still worth keeping. Not too surprising given this organization's past history with child rapists.",
        "reply": " If you'll do some research you'll find that an excommunicant is expected to maintain their relationship with the church. If only to make reconciliation and be forgiven. But if you don't believe in this 'jiggery-pokery' it doesn't matter much, does it? People get told to 'go to hell' every day, and other than possibly hurt feelings, it doesn't matter much who says it. Now if you do take this seriously you have to apply the rules to the way you live. It's not the Church's idea, Jesus said that. Rape and abortion are both non-life-giving, ergo sinful, acts. Two wrongs, either sacred or profane, still don't make a right. This message has been edited. Last edited by: popsiq, Tue 10 March 2009 07:31 AM",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 07:15:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. Eight years of Catholic education and you think the \"rapist off the hook\"? You must have been absent the day they talked about conscience and sin. But you obviously heard the discussions of moral relativism. It's entirely possible the 'rapist' had a diminished mental capacity or was the victim of social or religious ignorance. Some parts of Brazil are far from civilized and could be described as brutal. In either of those instances there is nothing to excommunicate, if no communication existed.",
        "intTime": 20090310,
        "postID": 31,
        "quote": "Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "reply": " Eight years of Catholic education and you think the \"rapist off the hook\"? You must have been absent the day they talked about conscience and sin. But you obviously heard the discussions of moral relativism. It's entirely possible the 'rapist' had a diminished mental capacity or was the victim of social or religious ignorance. Some parts of Brazil are far from civilized and could be described as brutal. In either of those instances there is nothing to excommunicate, if no communication existed.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 07:36:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "popsiq"
    },
    {
        "content": "Wow. The mother and doctors of the girl who was raped were excommunicated even though they, \"...carried it out for fear that the slim girl would not survive carrying the foetuses to term...\" Not forgetting that this girl was 9 YEARS OLD! Not only was she in serious medical danger, she was a tiny child. And now the rapist is somehow the victim here? That is some pretty convoluted logic.",
        "intTime": 20090310,
        "postID": 32,
        "quote": "",
        "reply": "Wow. The mother and doctors of the girl who was raped were excommunicated even though they, \"...carried it out for fear that the slim girl would not survive carrying the foetuses to term...\" Not forgetting that this girl was 9 YEARS OLD! Not only was she in serious medical danger, she was a tiny child. And now the rapist is somehow the victim here? That is some pretty convoluted logic.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 08:32:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook. The article does not mention specifically what the beliefs of the Catholic Church are in this matter. Thats the critical part that is missing. Although, I do not disagree with you.",
        "intTime": 20090310,
        "postID": 33,
        "quote": "Originally posted by foxred03: I'm surprised this topic hasn't generated more controversy. I wouldn't go so far as thorin here, having gone to Catholic school for 8 years I have great respect for the religion; but I do agree that it is unbelievably wrong to excommunicate those in question. Not to mention letting the rapist off the hook.",
        "reply": " The article does not mention specifically what the beliefs of the Catholic Church are in this matter. Thats the critical part that is missing. Although, I do not disagree with you.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 08:43:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "ErichG2"
    },
    {
        "content": "quote: \"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said. That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick.",
        "intTime": 20090310,
        "postID": 34,
        "quote": "\"God's law is above any human law. So when a human law ... is contrary to God's law, this human law has no value,\" Cardoso had said.",
        "reply": " That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 08:44:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Whirled_Peas"
    },
    {
        "content": "quote: Originally posted by Whirled_Peas: That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick. What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith.",
        "intTime": 20090310,
        "postID": 35,
        "quote": "Originally posted by Whirled_Peas: That's the exact sort of mentality they use in the application of Shari'a law in Iran and Saudi Arabia. In Saudi Arabia, a 75-year old woman was sentenced to 40 lashes with a whip because she \"mingled\" with men who were not her relatives. One of the men, she nursed when he was a baby. \"http://www.cnn.com/2009/WORLD/meast/03/09/saudi.arabia.lashes/index.html And back in 2007, a 19-year-old gang-rape victim in the Saudi city of Qatif was sentenced to 200 lashes and six months in prison for meeting with an unrelated male. The seven rapists, who abducted the woman and man, received sentences ranging from 10 months to five years in prison. That's \"God's law\" too, right? What about the Salem Witch Trials? Putting people to death for the \"suspicion\" of witchcraft? What about the Biblical stance that unruly children should be stoned to death? Seriously, if people can't recognize the danger of falling to religious law to govern our society, we're in trouble. A strict fundamentalist interpretation of the Bible, just like the Qur'an, can become violent, hateful, and deadly. The church excommunicated a 9-year old girl who was raped. The girl was at serious risk of death if she'd carried those twins to term. The insanity of all this... it should make rational people feel sick.",
        "reply": " What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 10:10:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "ErichG2"
    },
    {
        "content": "quote: Originally posted by ErichG2: What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith. You're really, really reaching here. I'm making an observation about religious extremism turned into law, and comparing it to how one part of the Catholic Church (in Brazil) excommunicated a girl and a cleric (not the pope) in the Vatican supported that move. This has everything to do with issues of extremism and overbearing control, using this case of abortion as an example. And I wasn't talking about homosexuality here. The condemnation of gays by some churches is nothing compared to the real threat of religious extremism putting human beings at risk by holding \"God's judgment\" over their heads. I was raised Catholic. I was even one of those \"good Catholic girls\" who actually did what the nuns told me to do! I went to church every week, attended Bible studies, read the Bible on my own, sang and played the piano for the choir, and studied church history. I went to a Catholic college. I visited the Vatican and brought home Rosary beads that had been blessed by the Pope as a gift for my grandmother. In other words... I think I have a fair understanding of the Church. Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church. In fact, it's an insignificant reason, compared to the others. So, to get back on track, this is about extreme interpretations of religious laws/opinions, and the damage those extreme interpretations can cause. If the religious leaders of Brazil had their way, this 9-year old girl would still be pregnant, and possibly facing a painful death via an impossible pregnancy and delivery. Religious leaders that take any \"divine decree\" to an extreme are dangerous, and this is no different.",
        "intTime": 20090310,
        "postID": 36,
        "quote": "Originally posted by ErichG2: What is the Church's official position of abortion when the Mother's life is at risk? How does that conflict with the news article? Also, lets be fair about your position here. Your against all religion that condemns Homosexuality......so in your case this has nothing to do with abortion or matters of faith.",
        "reply": " You're really, really reaching here. I'm making an observation about religious extremism turned into law, and comparing it to how one part of the Catholic Church (in Brazil) excommunicated a girl and a cleric (not the pope) in the Vatican supported that move. This has everything to do with issues of extremism and overbearing control, using this case of abortion as an example. And I wasn't talking about homosexuality here. The condemnation of gays by some churches is nothing compared to the real threat of religious extremism putting human beings at risk by holding \"God's judgment\" over their heads. I was raised Catholic. I was even one of those \"good Catholic girls\" who actually did what the nuns told me to do! I went to church every week, attended Bible studies, read the Bible on my own, sang and played the piano for the choir, and studied church history. I went to a Catholic college. I visited the Vatican and brought home Rosary beads that had been blessed by the Pope as a gift for my grandmother. In other words... I think I have a fair understanding of the Church. Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church. In fact, it's an insignificant reason, compared to the others. So, to get back on track, this is about extreme interpretations of religious laws/opinions, and the damage those extreme interpretations can cause. If the religious leaders of Brazil had their way, this 9-year old girl would still be pregnant, and possibly facing a painful death via an impossible pregnancy and delivery. Religious leaders that take any \"divine decree\" to an extreme are dangerous, and this is no different.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 11:44:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Whirled_Peas"
    },
    {
        "content": "quote: Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope! Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81",
        "intTime": 20090310,
        "postID": 37,
        "quote": "Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope!",
        "reply": " Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 12:09:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "SUNLINER81"
    },
    {
        "content": "the vatican can excommunicate them, but the LORD will do what he sees fit. Man can just exile her. i am fairly sure that they two of them walk with the mantle of Christ firmly pressed around them.",
        "intTime": 20090310,
        "postID": 38,
        "quote": "",
        "reply": "the vatican can excommunicate them, but the LORD will do what he sees fit. Man can just exile her. i am fairly sure that they two of them walk with the mantle of Christ firmly pressed around them.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 13:42:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by Whirled_Peas: Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church. You and Seawitch both I noticed. There are differences between dislike, opposition to and outright hatred of. I have to say that you can't accuse others of being a bigot if your posts portray a bigotry. I really could care less about whats stated about the Catholic Church. It just seems inconsistent to me in one thread you are saying this and that against people you consider to be bigoted.......then I read your posts on the Catholic Church and Wow!. What a turnabout, it's as if you never wrote what you posted before.",
        "intTime": 20090310,
        "postID": 39,
        "quote": "Originally posted by Whirled_Peas: Their opinion on gays is only a TINY FRACTION of the reason I now dislike the Catholic Church.",
        "reply": " You and Seawitch both I noticed. There are differences between dislike, opposition to and outright hatred of. I have to say that you can't accuse others of being a bigot if your posts portray a bigotry. I really could care less about whats stated about the Catholic Church. It just seems inconsistent to me in one thread you are saying this and that against people you consider to be bigoted.......then I read your posts on the Catholic Church and Wow!. What a turnabout, it's as if you never wrote what you posted before.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 13:48:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "ErichG2"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope! Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81 As far as YOU are concerned, I am speaking for the ENTIRE Brazilian Nation! And yes, it pays great, just not how much you think.",
        "intTime": 20090310,
        "postID": 40,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Knele: I can tell you that most Brazilians; although deeply religious; couldn’t care less for Vatican & Pope! Wow!... You have been authorized to speak for the entire Brazilian nation!... Gee, does it pay as well as one might think?... LOL Respectfully, SUNLINER81",
        "reply": " As far as YOU are concerned, I am speaking for the ENTIRE Brazilian Nation! And yes, it pays great, just not how much you think.",
        "threadID": "672198221_9750052712001",
        "time": "2009-03-10 14:01:00",
        "title": "Vatican defends Brazil excommunication",
        "userID": "Knele"
    }
]