[
    {
        "content": "Simple. The Stock Market is bouncing back. Sorry for all you that wanted it to happen. Maybe next time. \"http://online.wsj.com/article/SB123676922949993593.html\"", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "Simple. The Stock Market is bouncing back. Sorry for all you that wanted it to happen. Maybe next time. \"http://online.wsj.com/article/SB123676922949993593.html\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 14:56:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The stock market rose FOUR points and you're celebrating? ;-) Actually the stock market WANTS to rise. It could be argued that it rises only when Obama is NOT saying he'll spend money. When good (non-government) news comes out.. such as Ford independently cutting costs without a bailout.. the market rises. However, then Fannie Mae says \"oops.. we need 30 billion more dollars!) and.... whoops there it goes again! It is almost a direct correlation between government spending announcements and stock market drops. The reasoning is simple... the investors (and business owners) don't want more spending (debt) and they don't like surprises (such as .. surprise.. another gov't program!) So, the market reacts badly to these. However, the basics are there for at least stock market equilibrium if not a rise. The fundamentals are still sound. Just look at the month-long period between Bush and Obama when no one was announcing huge expenditures? Stock market leveled off around 8-8.5k for weeks. Then the new stimulus bills came and <droop!> If they'd leave the damn thing alone it'd be alright. Yet every announcement is prefaced with DOOM AND GLOOM! This scares people and while is good for pushing unpopular programs on frightened people (universal health care anyone? More money for foodstamps?)... it's NOT good for promoting the economy. What we need now is confidence... since THAT is what our monetary system is based on. It's not based on money per se... it's based on FAITH in our system. Throwing money at the problem and deficit spending got us INTO this mess. More won't get us out of it... \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "The stock market rose FOUR points and you're celebrating? ;-) Actually the stock market WANTS to rise. It could be argued that it rises only when Obama is NOT saying he'll spend money. When good (non-government) news comes out.. such as Ford independently cutting costs without a bailout.. the market rises. However, then Fannie Mae says \"oops.. we need 30 billion more dollars!) and.... whoops there it goes again! It is almost a direct correlation between government spending announcements and stock market drops. The reasoning is simple... the investors (and business owners) don't want more spending (debt) and they don't like surprises (such as .. surprise.. another gov't program!) So, the market reacts badly to these. However, the basics are there for at least stock market equilibrium if not a rise. The fundamentals are still sound. Just look at the month-long period between Bush and Obama when no one was announcing huge expenditures? Stock market leveled off around 8-8.5k for weeks. Then the new stimulus bills came and <droop!> If they'd leave the damn thing alone it'd be alright. Yet every announcement is prefaced with DOOM AND GLOOM! This scares people and while is good for pushing unpopular programs on frightened people (universal health care anyone? More money for foodstamps?)... it's NOT good for promoting the economy. What we need now is confidence... since THAT is what our monetary system is based on. It's not based on money per se... it's based on FAITH in our system. Throwing money at the problem and deficit spending got us INTO this mess. More won't get us out of it... \"Common sense isn't.\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:27:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "Since he was elected the Stock Market has lost over 2,500 Points, on His Watch. It closed up 3.91 points today Break out the Champagne, huh? ALL GLORY TO THE HYPNOTOAD!", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "", 
        "reply": "Since he was elected the Stock Market has lost over 2,500 Points, on His Watch. It closed up 3.91 points today Break out the Champagne, huh? ALL GLORY TO THE HYPNOTOAD!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:30:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "", 
        "reply": "Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:48:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "", 
        "reply": "The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. \"The World's Finest\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:21:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned.", 
        "reply": " So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:26:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave And Obama is doing everything he can to stop the blood-letting...yeah, right. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "reply": " And Obama is doing everything he can to stop the blood-letting...yeah, right. \"The World's Finest\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:31:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned.", 
        "reply": " and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:40:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "reply": " your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:47:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "reply": " i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:54:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! Heh, he, he... Naah, as you know Mr. Bush was never the President anyway. It's all Clintons fault. Mr. Clinton was a very generous man and let George stay in the White House rent free while Mr. Bush looked to sell his Crawford Ranch. How could anyone possibly blame Mr. Bush? Dave", 
        "intTime": 20090311, 
        "postID": 11, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "reply": " Heh, he, he... Naah, as you know Mr. Bush was never the President anyway. It's all Clintons fault. Mr. Clinton was a very generous man and let George stay in the White House rent free while Mr. Bush looked to sell his Crawford Ranch. How could anyone possibly blame Mr. Bush? Dave", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:54:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Good thing I didn't gamble my money away in the stock markets or some phoney retirement account. I may do the stock markets now, certainly should be a win for me at this point. That's how it is suppose to work. But those that did gamble will get thier money back, since our government is printing money and tossing it out to the banks. Oh and if anyone that made bad decisions on home loans, you'll be ok too, Uncle Same to the rescue. Sounds like the ones that hate Bush's and Obama's actions should be writting and thanking them for the bailout of retirement \"losses\" Money they never had to begin with. I should (well I have been) the one ticked off.", 
        "intTime": 20090311, 
        "postID": 12, 
        "quote": "", 
        "reply": "Good thing I didn't gamble my money away in the stock markets or some phoney retirement account. I may do the stock markets now, certainly should be a win for me at this point. That's how it is suppose to work. But those that did gamble will get thier money back, since our government is printing money and tossing it out to the banks. Oh and if anyone that made bad decisions on home loans, you'll be ok too, Uncle Same to the rescue. Sounds like the ones that hate Bush's and Obama's actions should be writting and thanking them for the bailout of retirement \"losses\" Money they never had to begin with. I should (well I have been) the one ticked off.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:55:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite. Up less than 4 points after losing over 2,500 points since his watch started. What kind of Maniac thinks thats Good News? It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "intTime": 20090311, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "reply": " Up less than 4 points after losing over 2,500 points since his watch started. What kind of Maniac thinks thats Good News? It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:34:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "prices are going up unemployment is going up hell my cigarettes cost $3 more a carton this week then last week... This message has been edited. Last edited by: outlaws93, Wed 11 March 2009 07:26 PM", 
        "intTime": 20090311, 
        "postID": 14, 
        "quote": "", 
        "reply": "prices are going up unemployment is going up hell my cigarettes cost $3 more a carton this week then last week... This message has been edited. Last edited by: outlaws93, Wed 11 March 2009 07:26 PM", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:38:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week... ya it's amazing what rose colored glasses do for some people!", 
        "intTime": 20090311, 
        "postID": 15, 
        "quote": "Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week...", 
        "reply": " ya it's amazing what rose colored glasses do for some people!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:44:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "EAG154"
    }, 
    {
        "content": "Just a little word of caution. Don't ever look at daily gains or losses when getting a feel for the environment. It is usually best to look at weekly trends (usually, monthly trends), as this gives a better overall picture. Sure, 300 points in a day is significant. But, if the trend is down for the week, then that 300 points means nothing. I've been investing for as long as I have been working. I have lost hundreds over the course of hours or less and have gained hundreds over the same period. But, that means nothing. I look at the total percentage over the course of a month. I usually shoot for 5%. It doesn't always happen, but it does more often than not. If I let a $10,000 loss in a day get me down, then I will not have my head about me. That is when I will cease to become an investor and start to become a speculator, or worse, a gambler. Tell me what the Dow, S&P, NASDAQ and Whilshire are at 1600 Friday. Then maybe we can have something. Now, stocks can be looked at daily. But, that is totally different than composites.", 
        "intTime": 20090311, 
        "postID": 16, 
        "quote": "", 
        "reply": "Just a little word of caution. Don't ever look at daily gains or losses when getting a feel for the environment. It is usually best to look at weekly trends (usually, monthly trends), as this gives a better overall picture. Sure, 300 points in a day is significant. But, if the trend is down for the week, then that 300 points means nothing. I've been investing for as long as I have been working. I have lost hundreds over the course of hours or less and have gained hundreds over the same period. But, that means nothing. I look at the total percentage over the course of a month. I usually shoot for 5%. It doesn't always happen, but it does more often than not. If I let a $10,000 loss in a day get me down, then I will not have my head about me. That is when I will cease to become an investor and start to become a speculator, or worse, a gambler. Tell me what the Dow, S&P, NASDAQ and Whilshire are at 1600 Friday. Then maybe we can have something. Now, stocks can be looked at daily. But, that is totally different than composites.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:47:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter That has got to be one of the best lines I have ever read. Holy crap was that funny. Can I use it at work tommorrow?", 
        "intTime": 20090311, 
        "postID": 17, 
        "quote": "It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "reply": " That has got to be one of the best lines I have ever read. Holy crap was that funny. Can I use it at work tommorrow?", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:50:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich. what in the hell are you talking about??", 
        "intTime": 20090311, 
        "postID": 18, 
        "quote": "Originally posted by Elesso: quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "reply": " what in the hell are you talking about??", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:51:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As I recall the stock market TANKED after 9-11 (caused in part by Clinton's ineptitude in pursuing terrorists.) The stock market only GOT to 14,000 under Bush. So... that would make him the best president in HISTORY by that measure? I could also point out that a commission set out to investigate real estate overvaluation and overspeculation was told by... dun dun dun Barney Frank among (most vocally among others) that the market wasn't HOT ENOUGH and that more risks should be taken to encourage more people to buy into it. Notice that the stock market did GOOD for weeks there (hovered around 8,000-8,500 consistently) when no government intervention was taking place. Then, once the Stimulus bill and TARP 2 happened... it tanked again. Stop playing with it and it'll return on its own.... \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 19, 
        "quote": "", 
        "reply": "As I recall the stock market TANKED after 9-11 (caused in part by Clinton's ineptitude in pursuing terrorists.) The stock market only GOT to 14,000 under Bush. So... that would make him the best president in HISTORY by that measure? I could also point out that a commission set out to investigate real estate overvaluation and overspeculation was told by... dun dun dun Barney Frank among (most vocally among others) that the market wasn't HOT ENOUGH and that more risks should be taken to encourage more people to buy into it. Notice that the stock market did GOOD for weeks there (hovered around 8,000-8,500 consistently) when no government intervention was taking place. Then, once the Stimulus bill and TARP 2 happened... it tanked again. Stop playing with it and it'll return on its own.... \"Common sense isn't.\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:58:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week... you smoke and you have no health care? Obama is for you!", 
        "intTime": 20090311, 
        "postID": 20, 
        "quote": "Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week...", 
        "reply": " you smoke and you have no health care? Obama is for you!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 19:02:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Simple. The Stock Market is bouncing back. Sorry for all you that wanted it to happen. Maybe next time. \"http://online.wsj.com/article/SB123676922949993593.html\"", 
        "intTime": 20090311, 
        "postID": 21, 
        "quote": "", 
        "reply": "Simple. The Stock Market is bouncing back. Sorry for all you that wanted it to happen. Maybe next time. \"http://online.wsj.com/article/SB123676922949993593.html\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 14:56:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The stock market rose FOUR points and you're celebrating? ;-) Actually the stock market WANTS to rise. It could be argued that it rises only when Obama is NOT saying he'll spend money. When good (non-government) news comes out.. such as Ford independently cutting costs without a bailout.. the market rises. However, then Fannie Mae says \"oops.. we need 30 billion more dollars!) and.... whoops there it goes again! It is almost a direct correlation between government spending announcements and stock market drops. The reasoning is simple... the investors (and business owners) don't want more spending (debt) and they don't like surprises (such as .. surprise.. another gov't program!) So, the market reacts badly to these. However, the basics are there for at least stock market equilibrium if not a rise. The fundamentals are still sound. Just look at the month-long period between Bush and Obama when no one was announcing huge expenditures? Stock market leveled off around 8-8.5k for weeks. Then the new stimulus bills came and <droop!> If they'd leave the damn thing alone it'd be alright. Yet every announcement is prefaced with DOOM AND GLOOM! This scares people and while is good for pushing unpopular programs on frightened people (universal health care anyone? More money for foodstamps?)... it's NOT good for promoting the economy. What we need now is confidence... since THAT is what our monetary system is based on. It's not based on money per se... it's based on FAITH in our system. Throwing money at the problem and deficit spending got us INTO this mess. More won't get us out of it... \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 22, 
        "quote": "", 
        "reply": "The stock market rose FOUR points and you're celebrating? ;-) Actually the stock market WANTS to rise. It could be argued that it rises only when Obama is NOT saying he'll spend money. When good (non-government) news comes out.. such as Ford independently cutting costs without a bailout.. the market rises. However, then Fannie Mae says \"oops.. we need 30 billion more dollars!) and.... whoops there it goes again! It is almost a direct correlation between government spending announcements and stock market drops. The reasoning is simple... the investors (and business owners) don't want more spending (debt) and they don't like surprises (such as .. surprise.. another gov't program!) So, the market reacts badly to these. However, the basics are there for at least stock market equilibrium if not a rise. The fundamentals are still sound. Just look at the month-long period between Bush and Obama when no one was announcing huge expenditures? Stock market leveled off around 8-8.5k for weeks. Then the new stimulus bills came and <droop!> If they'd leave the damn thing alone it'd be alright. Yet every announcement is prefaced with DOOM AND GLOOM! This scares people and while is good for pushing unpopular programs on frightened people (universal health care anyone? More money for foodstamps?)... it's NOT good for promoting the economy. What we need now is confidence... since THAT is what our monetary system is based on. It's not based on money per se... it's based on FAITH in our system. Throwing money at the problem and deficit spending got us INTO this mess. More won't get us out of it... \"Common sense isn't.\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:27:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "Since he was elected the Stock Market has lost over 2,500 Points, on His Watch. It closed up 3.91 points today Break out the Champagne, huh? ALL GLORY TO THE HYPNOTOAD!", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "", 
        "reply": "Since he was elected the Stock Market has lost over 2,500 Points, on His Watch. It closed up 3.91 points today Break out the Champagne, huh? ALL GLORY TO THE HYPNOTOAD!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:30:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "", 
        "reply": "Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:48:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 25, 
        "quote": "", 
        "reply": "The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. \"The World's Finest\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:21:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "intTime": 20090311, 
        "postID": 26, 
        "quote": "Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned.", 
        "reply": " So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:26:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave And Obama is doing everything he can to stop the blood-letting...yeah, right. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 27, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "reply": " And Obama is doing everything he can to stop the blood-letting...yeah, right. \"The World's Finest\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:31:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "intTime": 20090311, 
        "postID": 28, 
        "quote": "Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned.", 
        "reply": " and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:40:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "reply": " your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:47:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "reply": " i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:54:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! Heh, he, he... Naah, as you know Mr. Bush was never the President anyway. It's all Clintons fault. Mr. Clinton was a very generous man and let George stay in the White House rent free while Mr. Bush looked to sell his Crawford Ranch. How could anyone possibly blame Mr. Bush? Dave", 
        "intTime": 20090311, 
        "postID": 31, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "reply": " Heh, he, he... Naah, as you know Mr. Bush was never the President anyway. It's all Clintons fault. Mr. Clinton was a very generous man and let George stay in the White House rent free while Mr. Bush looked to sell his Crawford Ranch. How could anyone possibly blame Mr. Bush? Dave", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:54:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Good thing I didn't gamble my money away in the stock markets or some phoney retirement account. I may do the stock markets now, certainly should be a win for me at this point. That's how it is suppose to work. But those that did gamble will get thier money back, since our government is printing money and tossing it out to the banks. Oh and if anyone that made bad decisions on home loans, you'll be ok too, Uncle Same to the rescue. Sounds like the ones that hate Bush's and Obama's actions should be writting and thanking them for the bailout of retirement \"losses\" Money they never had to begin with. I should (well I have been) the one ticked off.", 
        "intTime": 20090311, 
        "postID": 32, 
        "quote": "", 
        "reply": "Good thing I didn't gamble my money away in the stock markets or some phoney retirement account. I may do the stock markets now, certainly should be a win for me at this point. That's how it is suppose to work. But those that did gamble will get thier money back, since our government is printing money and tossing it out to the banks. Oh and if anyone that made bad decisions on home loans, you'll be ok too, Uncle Same to the rescue. Sounds like the ones that hate Bush's and Obama's actions should be writting and thanking them for the bailout of retirement \"losses\" Money they never had to begin with. I should (well I have been) the one ticked off.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:55:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite. Up less than 4 points after losing over 2,500 points since his watch started. What kind of Maniac thinks thats Good News? It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "intTime": 20090311, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "reply": " Up less than 4 points after losing over 2,500 points since his watch started. What kind of Maniac thinks thats Good News? It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:34:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "prices are going up unemployment is going up hell my cigarettes cost $3 more a carton this week then last week... This message has been edited. Last edited by: outlaws93, Wed 11 March 2009 07:26 PM", 
        "intTime": 20090311, 
        "postID": 34, 
        "quote": "", 
        "reply": "prices are going up unemployment is going up hell my cigarettes cost $3 more a carton this week then last week... This message has been edited. Last edited by: outlaws93, Wed 11 March 2009 07:26 PM", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:38:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week... ya it's amazing what rose colored glasses do for some people!", 
        "intTime": 20090311, 
        "postID": 35, 
        "quote": "Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week...", 
        "reply": " ya it's amazing what rose colored glasses do for some people!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:44:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "EAG154"
    }, 
    {
        "content": "Just a little word of caution. Don't ever look at daily gains or losses when getting a feel for the environment. It is usually best to look at weekly trends (usually, monthly trends), as this gives a better overall picture. Sure, 300 points in a day is significant. But, if the trend is down for the week, then that 300 points means nothing. I've been investing for as long as I have been working. I have lost hundreds over the course of hours or less and have gained hundreds over the same period. But, that means nothing. I look at the total percentage over the course of a month. I usually shoot for 5%. It doesn't always happen, but it does more often than not. If I let a $10,000 loss in a day get me down, then I will not have my head about me. That is when I will cease to become an investor and start to become a speculator, or worse, a gambler. Tell me what the Dow, S&P, NASDAQ and Whilshire are at 1600 Friday. Then maybe we can have something. Now, stocks can be looked at daily. But, that is totally different than composites.", 
        "intTime": 20090311, 
        "postID": 36, 
        "quote": "", 
        "reply": "Just a little word of caution. Don't ever look at daily gains or losses when getting a feel for the environment. It is usually best to look at weekly trends (usually, monthly trends), as this gives a better overall picture. Sure, 300 points in a day is significant. But, if the trend is down for the week, then that 300 points means nothing. I've been investing for as long as I have been working. I have lost hundreds over the course of hours or less and have gained hundreds over the same period. But, that means nothing. I look at the total percentage over the course of a month. I usually shoot for 5%. It doesn't always happen, but it does more often than not. If I let a $10,000 loss in a day get me down, then I will not have my head about me. That is when I will cease to become an investor and start to become a speculator, or worse, a gambler. Tell me what the Dow, S&P, NASDAQ and Whilshire are at 1600 Friday. Then maybe we can have something. Now, stocks can be looked at daily. But, that is totally different than composites.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:47:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter That has got to be one of the best lines I have ever read. Holy crap was that funny. Can I use it at work tommorrow?", 
        "intTime": 20090311, 
        "postID": 37, 
        "quote": "It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "reply": " That has got to be one of the best lines I have ever read. Holy crap was that funny. Can I use it at work tommorrow?", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:50:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich. what in the hell are you talking about??", 
        "intTime": 20090311, 
        "postID": 38, 
        "quote": "Originally posted by Elesso: quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "reply": " what in the hell are you talking about??", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:51:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As I recall the stock market TANKED after 9-11 (caused in part by Clinton's ineptitude in pursuing terrorists.) The stock market only GOT to 14,000 under Bush. So... that would make him the best president in HISTORY by that measure? I could also point out that a commission set out to investigate real estate overvaluation and overspeculation was told by... dun dun dun Barney Frank among (most vocally among others) that the market wasn't HOT ENOUGH and that more risks should be taken to encourage more people to buy into it. Notice that the stock market did GOOD for weeks there (hovered around 8,000-8,500 consistently) when no government intervention was taking place. Then, once the Stimulus bill and TARP 2 happened... it tanked again. Stop playing with it and it'll return on its own.... \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 39, 
        "quote": "", 
        "reply": "As I recall the stock market TANKED after 9-11 (caused in part by Clinton's ineptitude in pursuing terrorists.) The stock market only GOT to 14,000 under Bush. So... that would make him the best president in HISTORY by that measure? I could also point out that a commission set out to investigate real estate overvaluation and overspeculation was told by... dun dun dun Barney Frank among (most vocally among others) that the market wasn't HOT ENOUGH and that more risks should be taken to encourage more people to buy into it. Notice that the stock market did GOOD for weeks there (hovered around 8,000-8,500 consistently) when no government intervention was taking place. Then, once the Stimulus bill and TARP 2 happened... it tanked again. Stop playing with it and it'll return on its own.... \"Common sense isn't.\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:58:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week... you smoke and you have no health care? Obama is for you!", 
        "intTime": 20090311, 
        "postID": 40, 
        "quote": "Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week...", 
        "reply": " you smoke and you have no health care? Obama is for you!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 19:02:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Simple. The Stock Market is bouncing back. Sorry for all you that wanted it to happen. Maybe next time. \"http://online.wsj.com/article/SB123676922949993593.html\"", 
        "intTime": 20090311, 
        "postID": 41, 
        "quote": "", 
        "reply": "Simple. The Stock Market is bouncing back. Sorry for all you that wanted it to happen. Maybe next time. \"http://online.wsj.com/article/SB123676922949993593.html\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 14:56:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The stock market rose FOUR points and you're celebrating? ;-) Actually the stock market WANTS to rise. It could be argued that it rises only when Obama is NOT saying he'll spend money. When good (non-government) news comes out.. such as Ford independently cutting costs without a bailout.. the market rises. However, then Fannie Mae says \"oops.. we need 30 billion more dollars!) and.... whoops there it goes again! It is almost a direct correlation between government spending announcements and stock market drops. The reasoning is simple... the investors (and business owners) don't want more spending (debt) and they don't like surprises (such as .. surprise.. another gov't program!) So, the market reacts badly to these. However, the basics are there for at least stock market equilibrium if not a rise. The fundamentals are still sound. Just look at the month-long period between Bush and Obama when no one was announcing huge expenditures? Stock market leveled off around 8-8.5k for weeks. Then the new stimulus bills came and <droop!> If they'd leave the damn thing alone it'd be alright. Yet every announcement is prefaced with DOOM AND GLOOM! This scares people and while is good for pushing unpopular programs on frightened people (universal health care anyone? More money for foodstamps?)... it's NOT good for promoting the economy. What we need now is confidence... since THAT is what our monetary system is based on. It's not based on money per se... it's based on FAITH in our system. Throwing money at the problem and deficit spending got us INTO this mess. More won't get us out of it... \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 42, 
        "quote": "", 
        "reply": "The stock market rose FOUR points and you're celebrating? ;-) Actually the stock market WANTS to rise. It could be argued that it rises only when Obama is NOT saying he'll spend money. When good (non-government) news comes out.. such as Ford independently cutting costs without a bailout.. the market rises. However, then Fannie Mae says \"oops.. we need 30 billion more dollars!) and.... whoops there it goes again! It is almost a direct correlation between government spending announcements and stock market drops. The reasoning is simple... the investors (and business owners) don't want more spending (debt) and they don't like surprises (such as .. surprise.. another gov't program!) So, the market reacts badly to these. However, the basics are there for at least stock market equilibrium if not a rise. The fundamentals are still sound. Just look at the month-long period between Bush and Obama when no one was announcing huge expenditures? Stock market leveled off around 8-8.5k for weeks. Then the new stimulus bills came and <droop!> If they'd leave the damn thing alone it'd be alright. Yet every announcement is prefaced with DOOM AND GLOOM! This scares people and while is good for pushing unpopular programs on frightened people (universal health care anyone? More money for foodstamps?)... it's NOT good for promoting the economy. What we need now is confidence... since THAT is what our monetary system is based on. It's not based on money per se... it's based on FAITH in our system. Throwing money at the problem and deficit spending got us INTO this mess. More won't get us out of it... \"Common sense isn't.\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:27:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "Since he was elected the Stock Market has lost over 2,500 Points, on His Watch. It closed up 3.91 points today Break out the Champagne, huh? ALL GLORY TO THE HYPNOTOAD!", 
        "intTime": 20090311, 
        "postID": 43, 
        "quote": "", 
        "reply": "Since he was elected the Stock Market has lost over 2,500 Points, on His Watch. It closed up 3.91 points today Break out the Champagne, huh? ALL GLORY TO THE HYPNOTOAD!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:30:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "intTime": 20090311, 
        "postID": 44, 
        "quote": "", 
        "reply": "Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 15:48:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 45, 
        "quote": "", 
        "reply": "The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. \"The World's Finest\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:21:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "intTime": 20090311, 
        "postID": 46, 
        "quote": "Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned.", 
        "reply": " So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:26:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave And Obama is doing everything he can to stop the blood-letting...yeah, right. \"The World's Finest\"", 
        "intTime": 20090311, 
        "postID": 47, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. So you're blaming the Democrats because they had the nerve to run someone for President? Would have done better with Hillary? If the market is the way we judge who's at fault, Mr. Bush wins hands down. The market went from 14000 to under 9000 under his leadership. And once the market tanks like this, it's a lot harder to stop the stampede. Dave", 
        "reply": " And Obama is doing everything he can to stop the blood-letting...yeah, right. \"The World's Finest\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:31:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "intTime": 20090311, 
        "postID": 48, 
        "quote": "Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned.", 
        "reply": " and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:40:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "intTime": 20090311, 
        "postID": 49, 
        "quote": "Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy?", 
        "reply": " your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:47:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "intTime": 20090311, 
        "postID": 50, 
        "quote": "Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "reply": " i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:54:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! Heh, he, he... Naah, as you know Mr. Bush was never the President anyway. It's all Clintons fault. Mr. Clinton was a very generous man and let George stay in the White House rent free while Mr. Bush looked to sell his Crawford Ranch. How could anyone possibly blame Mr. Bush? Dave", 
        "intTime": 20090311, 
        "postID": 51, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Elesso: quote: Originally posted by Kegler300: The Stock Market's lost $3 trillion since he was nominated; I've lost close to $40,000 in my investments. He's been destructive as far as I'm concerned. and that jackass Bush had nothing to do with it, right? his wasteful spending and porkbarrel legislation? his wasted war in iraq? his no bid contracts with Chenney's people? that had nothing to do with the collapse of our economy? your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled!", 
        "reply": " Heh, he, he... Naah, as you know Mr. Bush was never the President anyway. It's all Clintons fault. Mr. Clinton was a very generous man and let George stay in the White House rent free while Mr. Bush looked to sell his Crawford Ranch. How could anyone possibly blame Mr. Bush? Dave", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:54:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Good thing I didn't gamble my money away in the stock markets or some phoney retirement account. I may do the stock markets now, certainly should be a win for me at this point. That's how it is suppose to work. But those that did gamble will get thier money back, since our government is printing money and tossing it out to the banks. Oh and if anyone that made bad decisions on home loans, you'll be ok too, Uncle Same to the rescue. Sounds like the ones that hate Bush's and Obama's actions should be writting and thanking them for the bailout of retirement \"losses\" Money they never had to begin with. I should (well I have been) the one ticked off.", 
        "intTime": 20090311, 
        "postID": 52, 
        "quote": "", 
        "reply": "Good thing I didn't gamble my money away in the stock markets or some phoney retirement account. I may do the stock markets now, certainly should be a win for me at this point. That's how it is suppose to work. But those that did gamble will get thier money back, since our government is printing money and tossing it out to the banks. Oh and if anyone that made bad decisions on home loans, you'll be ok too, Uncle Same to the rescue. Sounds like the ones that hate Bush's and Obama's actions should be writting and thanking them for the bailout of retirement \"losses\" Money they never had to begin with. I should (well I have been) the one ticked off.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 16:55:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite. Up less than 4 points after losing over 2,500 points since his watch started. What kind of Maniac thinks thats Good News? It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "intTime": 20090311, 
        "postID": 53, 
        "quote": "Originally posted by crackerjacks61: Sounds good and you just re-enforced the fact that Obama has not destroyed the economy which was my entire point of this post. In response to a post headline that said the opposite.", 
        "reply": " Up less than 4 points after losing over 2,500 points since his watch started. What kind of Maniac thinks thats Good News? It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:34:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "prices are going up unemployment is going up hell my cigarettes cost $3 more a carton this week then last week... This message has been edited. Last edited by: outlaws93, Wed 11 March 2009 07:26 PM", 
        "intTime": 20090311, 
        "postID": 54, 
        "quote": "", 
        "reply": "prices are going up unemployment is going up hell my cigarettes cost $3 more a carton this week then last week... This message has been edited. Last edited by: outlaws93, Wed 11 March 2009 07:26 PM", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:38:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week... ya it's amazing what rose colored glasses do for some people!", 
        "intTime": 20090311, 
        "postID": 55, 
        "quote": "Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week...", 
        "reply": " ya it's amazing what rose colored glasses do for some people!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:44:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "EAG154"
    }, 
    {
        "content": "Just a little word of caution. Don't ever look at daily gains or losses when getting a feel for the environment. It is usually best to look at weekly trends (usually, monthly trends), as this gives a better overall picture. Sure, 300 points in a day is significant. But, if the trend is down for the week, then that 300 points means nothing. I've been investing for as long as I have been working. I have lost hundreds over the course of hours or less and have gained hundreds over the same period. But, that means nothing. I look at the total percentage over the course of a month. I usually shoot for 5%. It doesn't always happen, but it does more often than not. If I let a $10,000 loss in a day get me down, then I will not have my head about me. That is when I will cease to become an investor and start to become a speculator, or worse, a gambler. Tell me what the Dow, S&P, NASDAQ and Whilshire are at 1600 Friday. Then maybe we can have something. Now, stocks can be looked at daily. But, that is totally different than composites.", 
        "intTime": 20090311, 
        "postID": 56, 
        "quote": "", 
        "reply": "Just a little word of caution. Don't ever look at daily gains or losses when getting a feel for the environment. It is usually best to look at weekly trends (usually, monthly trends), as this gives a better overall picture. Sure, 300 points in a day is significant. But, if the trend is down for the week, then that 300 points means nothing. I've been investing for as long as I have been working. I have lost hundreds over the course of hours or less and have gained hundreds over the same period. But, that means nothing. I look at the total percentage over the course of a month. I usually shoot for 5%. It doesn't always happen, but it does more often than not. If I let a $10,000 loss in a day get me down, then I will not have my head about me. That is when I will cease to become an investor and start to become a speculator, or worse, a gambler. Tell me what the Dow, S&P, NASDAQ and Whilshire are at 1600 Friday. Then maybe we can have something. Now, stocks can be looked at daily. But, that is totally different than composites.", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:47:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter That has got to be one of the best lines I have ever read. Holy crap was that funny. Can I use it at work tommorrow?", 
        "intTime": 20090311, 
        "postID": 57, 
        "quote": "It's like falling down 25 stories off a Bldg and bouncing back up to the 3rd Floor. the first impact killed you, but at least your not lying in the gutter", 
        "reply": " That has got to be one of the best lines I have ever read. Holy crap was that funny. Can I use it at work tommorrow?", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:50:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich. what in the hell are you talking about??", 
        "intTime": 20090311, 
        "postID": 58, 
        "quote": "Originally posted by Elesso: quote: Originally posted by EAG154: your exactly right Bush had nothing to do with it! It was pure fear of what Obama might do if elected, and his trillions dillars give aways have seen that fear fulfilled! i hate to break this to you, but MOST of the people who are running scared of Obama, are people who have been getting away with murder since Reagan was prez. they got away with crap with reagan, Bushb sr, Clinton, AND gw Bush... now, they know the reckonning is here and they are pulling their money and selling as fast as their little grubby hands can go... it is not the poor ruining the economy, it is the filthy rich.", 
        "reply": " what in the hell are you talking about??", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:51:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As I recall the stock market TANKED after 9-11 (caused in part by Clinton's ineptitude in pursuing terrorists.) The stock market only GOT to 14,000 under Bush. So... that would make him the best president in HISTORY by that measure? I could also point out that a commission set out to investigate real estate overvaluation and overspeculation was told by... dun dun dun Barney Frank among (most vocally among others) that the market wasn't HOT ENOUGH and that more risks should be taken to encourage more people to buy into it. Notice that the stock market did GOOD for weeks there (hovered around 8,000-8,500 consistently) when no government intervention was taking place. Then, once the Stimulus bill and TARP 2 happened... it tanked again. Stop playing with it and it'll return on its own.... \"Common sense isn't.\"", 
        "intTime": 20090311, 
        "postID": 59, 
        "quote": "", 
        "reply": "As I recall the stock market TANKED after 9-11 (caused in part by Clinton's ineptitude in pursuing terrorists.) The stock market only GOT to 14,000 under Bush. So... that would make him the best president in HISTORY by that measure? I could also point out that a commission set out to investigate real estate overvaluation and overspeculation was told by... dun dun dun Barney Frank among (most vocally among others) that the market wasn't HOT ENOUGH and that more risks should be taken to encourage more people to buy into it. Notice that the stock market did GOOD for weeks there (hovered around 8,000-8,500 consistently) when no government intervention was taking place. Then, once the Stimulus bill and TARP 2 happened... it tanked again. Stop playing with it and it'll return on its own.... \"Common sense isn't.\"", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 18:58:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "Gladewalker"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week... you smoke and you have no health care? Obama is for you!", 
        "intTime": 20090311, 
        "postID": 60, 
        "quote": "Originally posted by outlaws93: prices are going up unemployment is going up hell my cigarettes cost $3 more this week then last week...", 
        "reply": " you smoke and you have no health care? Obama is for you!", 
        "threadID": "672198221_6320085712001", 
        "time": "2009-03-11 19:02:00", 
        "title": "Proof That Obama Has Not \"Destroyed\" The Economy", 
        "userID": "crackerjacks61"
    }
]