[
    {
        "content": ">http://news.bbc.co.uk/2/hi/africa/7992286.stm Time for a updated remake of Beau Geste? A 'deranged' member of the FFL posted to eastern Chad as part of an international refugee protection force was captured by Chadian gendarmes to-day after he fled the shooting of 2 fellow legionnaires. He also shot a member of the Togolese AF and a Chadian farmer. He fled on a stolen horse, heading for Sudan but was captured exhausted and hungry at a water hole en route. What triggered the 'fit of madness' is not known, as according to enlistment records, he wasn't crazy when he joined the Legion. This message has been edited. Last edited by: popsiq, Mon 13 April 2009 04:16 AM", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "", 
        "reply": ">http://news.bbc.co.uk/2/hi/africa/7992286.stm Time for a updated remake of Beau Geste? A 'deranged' member of the FFL posted to eastern Chad as part of an international refugee protection force was captured by Chadian gendarmes to-day after he fled the shooting of 2 fellow legionnaires. He also shot a member of the Togolese AF and a Chadian farmer. He fled on a stolen horse, heading for Sudan but was captured exhausted and hungry at a water hole en route. What triggered the 'fit of madness' is not known, as according to enlistment records, he wasn't crazy when he joined the Legion. This message has been edited. Last edited by: popsiq, Mon 13 April 2009 04:16 AM", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 03:42:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "popsiq"
    }, 
    {
        "content": "Meanwhile with the Russians in Chechnya ...>http://news.bbc.co.uk/2/hi/europe/7996517.stm Same sort of derangement in Chechnya where a Russian soldier 'went ballistic' killing his squad leader and two comrades, before trying to kill himself. This message has been edited. Last edited by: popsiq, Mon 13 April 2009 04:18 AM", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "Meanwhile with the Russians in Chechnya ...>http://news.bbc.co.uk/2/hi/europe/7996517.stm Same sort of derangement in Chechnya where a Russian soldier 'went ballistic' killing his squad leader and two comrades, before trying to kill himself. This message has been edited. Last edited by: popsiq, Mon 13 April 2009 04:18 AM", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 03:49:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "popsiq"
    }, 
    {
        "content": "Not all that surprised by either - bullying is so rife in the Russian army that I'm surprised the NCOs feel safe letting their soldiers have live ammo.", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "", 
        "reply": "Not all that surprised by either - bullying is so rife in the Russian army that I'm surprised the NCOs feel safe letting their soldiers have live ammo.", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 11:04:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I think they need some sensitivity and diversity trng.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "", 
        "reply": "I think they need some sensitivity and diversity trng.", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 11:19:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: I think they need some sensitivity and diversity trng. I dunno whether they deserve that much punishment but Russian NCOs get away with doing things to conscripts that no British or American NCOs would have a century ago. They have an annual wastage of dead and maimed conscripts (war casualties not included) in the thousands. That sort of environment cannot be conducive to the good mental health of soldiers can it?", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "Originally posted by GunnyRet03: I think they need some sensitivity and diversity trng.", 
        "reply": " I dunno whether they deserve that much punishment but Russian NCOs get away with doing things to conscripts that no British or American NCOs would have a century ago. They have an annual wastage of dead and maimed conscripts (war casualties not included) in the thousands. That sort of environment cannot be conducive to the good mental health of soldiers can it?", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 14:09:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by GunnyRet03: I think they need some sensitivity and diversity trng. I dunno whether they deserve that much punishment but Russian NCOs get away with doing things to conscripts that no British or American NCOs would have a century ago. They have an annual wastage of dead and maimed conscripts (war casualties not included) in the thousands. That sort of environment cannot be conducive to the good mental health of soldiers can it? My question is, why do the troops put up with it?... I realize they don't have the military justice system of the British or the American forces but, to have a \"wastage\" of troops permissible per year?!... Somebody needs to pitch a few grenades into some berthing areas or drop a round or two short... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by GunnyRet03: I think they need some sensitivity and diversity trng. I dunno whether they deserve that much punishment but Russian NCOs get away with doing things to conscripts that no British or American NCOs would have a century ago. They have an annual wastage of dead and maimed conscripts (war casualties not included) in the thousands. That sort of environment cannot be conducive to the good mental health of soldiers can it?", 
        "reply": " My question is, why do the troops put up with it?... I realize they don't have the military justice system of the British or the American forces but, to have a \"wastage\" of troops permissible per year?!... Somebody needs to pitch a few grenades into some berthing areas or drop a round or two short... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 14:31:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I think that the incident mentioned in the initial post is probably just the tip of the iceberg as far as what I believe you lot used to call \"fragging\" goes in Russia. BBC Newsnight did a series of reports on the modernisation of the Russian forces and one of the reasons mentioned for the move towards professional \"contractnik\" soldiers was that discipline in action had been poor in recent conflicts.", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "", 
        "reply": "I think that the incident mentioned in the initial post is probably just the tip of the iceberg as far as what I believe you lot used to call \"fragging\" goes in Russia. BBC Newsnight did a series of reports on the modernisation of the Russian forces and one of the reasons mentioned for the move towards professional \"contractnik\" soldiers was that discipline in action had been poor in recent conflicts.", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-13 17:10:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Not all that surprised by either - bullying is so rife in the Russian army that I'm surprised the NCOs feel safe letting their soldiers have live ammo. I suppose the case below wasn't 'bullying'? Just a case of misunderstood constructive criticism? It is all about optics and delivery, I guess, but it's not funny. http://www.military.com/news/article/gi-on-trial-for-ki...=1186032310810&wh=wh", 
        "intTime": 20090414, 
        "postID": 8, 
        "quote": "Originally posted by Bladensburg: Not all that surprised by either - bullying is so rife in the Russian army that I'm surprised the NCOs feel safe letting their soldiers have live ammo.", 
        "reply": " I suppose the case below wasn't 'bullying'? Just a case of misunderstood constructive criticism? It is all about optics and delivery, I guess, but it's not funny. http://www.military.com/news/article/gi-on-trial-for-ki...=1186032310810&wh=wh", 
        "threadID": "672198221_3100085022001", 
        "time": "2009-04-14 05:43:00", 
        "title": "\"Deranged\" Legionnaire Captured in Chad", 
        "userID": "popsiq"
    }
]