[
    {
        "content": "Great job! This is what a combat leader does. You've been tried and you are proven in my eyes!", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "", 
        "reply": "Great job! This is what a combat leader does. You've been tried and you are proven in my eyes!", 
        "threadID": "672198221_3310068412001", 
        "time": "2009-03-05 06:05:00", 
        "title": "Cool Under Fire", 
        "userID": "3864430"
    }, 
    {
        "content": "quote: Originally posted by antietam1958: He was doing what he was traied to do, take over the your leader is down and out, the mission come first. Good job. that is one thing about the military they train all their people to take over when the need arises. That reminds me of the scene from the Mel Gibson movie, \"We Were Soldiers\" when he told his men during training that he wanted them all to know what the man above them in rank and below them in rank does so they can fill in should one of them go down. Art immitating life. Good job Sgt. Waugh! Don", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "Originally posted by antietam1958: He was doing what he was traied to do, take over the your leader is down and out, the mission come first. Good job. that is one thing about the military they train all their people to take over when the need arises.", 
        "reply": " That reminds me of the scene from the Mel Gibson movie, \"We Were Soldiers\" when he told his men during training that he wanted them all to know what the man above them in rank and below them in rank does so they can fill in should one of them go down. Art immitating life. Good job Sgt. Waugh! Don", 
        "threadID": "672198221_3310068412001", 
        "time": "2009-03-05 06:29:00", 
        "title": "Cool Under Fire", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "NOTHING SHORT OF GREAT , GOD BLESS AND KEEP YOU AND ALL YOUR MEN", 
        "intTime": 20090305, 
        "postID": 8, 
        "quote": "", 
        "reply": "NOTHING SHORT OF GREAT , GOD BLESS AND KEEP YOU AND ALL YOUR MEN", 
        "threadID": "672198221_3310068412001", 
        "time": "2009-03-05 13:37:00", 
        "title": "Cool Under Fire", 
        "userID": "hstrayhorn"
    }
]