[
    {
        "content": "ACORN to Play Role in 2010 Census The U.S. Census is supposed to be free of politics, but one group with a history of voter fraud, ACORN, is participating in next year's count, raising concerns about the politicization of the decennial survey. The Association of Community Organizations for Reform Now signed on as a national partner with the U.S. Census Bureau in February 2009 to assist with the recruitment of the 1.4 million temporary workers needed to go door-to-door to count every person in the United States -- currently believed to be more than 306 million people. \"http://www.foxnews.com/politics/2009/03/17/lawmakers-concerned-role-acorn-census/\" This is just another step by the Obama administration to take over the Census: President Obama said in his inaugural address that he planned to \"restore science to its rightful place\" in government. That's a worthy goal. But statisticians at the Commerce Department didn't think it would mean having the director of next year's Census report directly to the White House rather than to the Commerce secretary, as is customary. \"There's only one reason to have that high level of White House involvement,\" a career professional at the Census Bureau tells me. \"And it's called politics, not science.\" \"http://online.wsj.com/article/SB123423384887066377.html\" The U.S. Census is being transfered to the White House instead of the Commerce Department where it has long resided. The Obama administration is politicizing what has very traditionally been a nonpartisan / non-political government undertaking. Do Democrats here or anywhere really support this move? Do you not realize this is opening the door to pandoras box? Democrats won't be in power forever and when they lose it, do they think Republicans won't \"return the favor\" in spades? I believe this is gross abuse of power and I wouldn't support it no matter who was doing it.", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "ACORN to Play Role in 2010 Census The U.S. Census is supposed to be free of politics, but one group with a history of voter fraud, ACORN, is participating in next year's count, raising concerns about the politicization of the decennial survey. The Association of Community Organizations for Reform Now signed on as a national partner with the U.S. Census Bureau in February 2009 to assist with the recruitment of the 1.4 million temporary workers needed to go door-to-door to count every person in the United States -- currently believed to be more than 306 million people. \"http://www.foxnews.com/politics/2009/03/17/lawmakers-concerned-role-acorn-census/\" This is just another step by the Obama administration to take over the Census: President Obama said in his inaugural address that he planned to \"restore science to its rightful place\" in government. That's a worthy goal. But statisticians at the Commerce Department didn't think it would mean having the director of next year's Census report directly to the White House rather than to the Commerce secretary, as is customary. \"There's only one reason to have that high level of White House involvement,\" a career professional at the Census Bureau tells me. \"And it's called politics, not science.\" \"http://online.wsj.com/article/SB123423384887066377.html\" The U.S. Census is being transfered to the White House instead of the Commerce Department where it has long resided. The Obama administration is politicizing what has very traditionally been a nonpartisan / non-political government undertaking. Do Democrats here or anywhere really support this move? Do you not realize this is opening the door to pandoras box? Democrats won't be in power forever and when they lose it, do they think Republicans won't \"return the favor\" in spades? I believe this is gross abuse of power and I wouldn't support it no matter who was doing it.", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 06:30:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Osedax"
    }, 
    {
        "content": "", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 06:40:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Knele"
    }, 
    {
        "content": "Knele, just because you are to ignorant to understand the importance of the Census doesn't mean you should spam threads with stupid pictures.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "Knele, just because you are to ignorant to understand the importance of the Census doesn't mean you should spam threads with stupid pictures.", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 07:54:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Osedax: Knele, just because you are to ignorant to understand the importance of the Census doesn't mean you should spam threads with stupid pictures. Refer to my previous post!", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "Originally posted by Osedax: Knele, just because you are to ignorant to understand the importance of the Census doesn't mean you should spam threads with stupid pictures.", 
        "reply": " Refer to my previous post!", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 08:01:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Knele"
    }, 
    {
        "content": "It has been reported that ACORN will be one of over 200 organizations involved with the census. Hopefully the organization will manage its staff better for the census than it did for the last election.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "It has been reported that ACORN will be one of over 200 organizations involved with the census. Hopefully the organization will manage its staff better for the census than it did for the last election.", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 08:46:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "From my understanding, if you get the paperwork for the census, you are required by law to fill it out and return it.. http: //caselaw.lp.findlaw.com/data/constitution/article01/08.html http://2010.census.gov/2010census/about_2010_census/007625.html quote: It’s required by law. – The information you provide is combined with responses provided by your neighbors and other households across the country, to provide summary statistical data that are used by various local, state and federal agencies. I love this response.. http: //www.dailypaul.com/node/50362 quote: Article I, Section 2 of the US Constitution gives Congress the right to ENUMERATE the number of citizens in order to apportion members of congress: \"The actual Enumeration shall be made within three years after the first meeting of the Congress of the United States, and within every subsequent term of ten years, in such manner as they shall by law direct.\" Enumerate means \"to count, or determine the number of\". Congress can COUNT the number of citizens- but it can't demand to know what race we are, how much we earn, how many big screen TVs we own, or how many times we ********** each day. So when I get the census forms, I fill out the first question (the one asking how many people live at my home), then paste a copy of Article 1, Section 2 of the Constitution right below that, along with a statement that I have fulfilled my duty as a citizen by helping them enumerate, and I'm not required to answer any more questions. I love that--I will have to do that next year..", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "It’s required by law. – The information you provide is combined with responses provided by your neighbors and other households across the country, to provide summary statistical data that are used by various local, state and federal agencies.", 
        "reply": "From my understanding, if you get the paperwork for the census, you are required by law to fill it out and return it.. http: //caselaw.lp.findlaw.com/data/constitution/article01/08.html http://2010.census.gov/2010census/about_2010_census/007625.html  I love this response.. http: //www.dailypaul.com/node/50362 quote: Article I, Section 2 of the US Constitution gives Congress the right to ENUMERATE the number of citizens in order to apportion members of congress: \"The actual Enumeration shall be made within three years after the first meeting of the Congress of the United States, and within every subsequent term of ten years, in such manner as they shall by law direct.\" Enumerate means \"to count, or determine the number of\". Congress can COUNT the number of citizens- but it can't demand to know what race we are, how much we earn, how many big screen TVs we own, or how many times we ********** each day. So when I get the census forms, I fill out the first question (the one asking how many people live at my home), then paste a copy of Article 1, Section 2 of the Constitution right below that, along with a statement that I have fulfilled my duty as a citizen by helping them enumerate, and I'm not required to answer any more questions. I love that--I will have to do that next year..", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 10:01:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: It has been reported that ACORN will be one of over 200 organizations involved with the census. Hopefully the organization will manage its staff better for the census than it did for the last election. Just like it managed it's staff when it came to voter registration? They very well know the importance of the Census and what inflating numbers means both in terms of money received by the community and district boundries. Again, why is the White House taking control of the Census? These issues combined reek of politicing and numbers fudging.", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "Originally posted by adminnco1: It has been reported that ACORN will be one of over 200 organizations involved with the census. Hopefully the organization will manage its staff better for the census than it did for the last election.", 
        "reply": " Just like it managed it's staff when it came to voter registration? They very well know the importance of the Census and what inflating numbers means both in terms of money received by the community and district boundries. Again, why is the White House taking control of the Census? These issues combined reek of politicing and numbers fudging.", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 10:10:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Osedax: quote: Originally posted by adminnco1: It has been reported that ACORN will be one of over 200 organizations involved with the census. Hopefully the organization will manage its staff better for the census than it did for the last election. Just like it managed it's staff when it came to voter registration? They very well know the importance of the Census and what inflating numbers means both in terms of money received by the community and district boundries. Again, why is the White House taking control of the Census? These issues combined reek of politicing and numbers fudging. Another scam......by this Adm.", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "Originally posted by Osedax: quote: Originally posted by adminnco1: It has been reported that ACORN will be one of over 200 organizations involved with the census. Hopefully the organization will manage its staff better for the census than it did for the last election. Just like it managed it's staff when it came to voter registration? They very well know the importance of the Census and what inflating numbers means both in terms of money received by the community and district boundries. Again, why is the White House taking control of the Census? These issues combined reek of politicing and numbers fudging.", 
        "reply": " Another scam......by this Adm.", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 12:54:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I don't see anything wrong with it. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "", 
        "reply": "I don't see anything wrong with it. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 13:26:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Knele: And what would you have posted if it was a Republican Administration with right leaning critters doing what is suppose to be a non-political census???", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "Originally posted by Knele:", 
        "reply": " And what would you have posted if it was a Republican Administration with right leaning critters doing what is suppose to be a non-political census???", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 13:30:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "67NOV"
    }, 
    {
        "content": "Again the \"tolerant\" \"inclusive\" liberal left at work again. Isn't \"change\" great?", 
        "intTime": 20090318, 
        "postID": 11, 
        "quote": "", 
        "reply": "Again the \"tolerant\" \"inclusive\" liberal left at work again. Isn't \"change\" great?", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 14:41:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Osedax: Knele, just because you are to ignorant to understand the importance of the Census doesn't mean you should spam threads with stupid pictures. Not one member of ACORN has ever been indicted for voter fraud, and MOST of their hired workers indicted for voter fraud were indicted because ACORN turned them in. The census is not voter registration. Republicans are not going to \"lose votes\" because a census worker was a left winger - Nor will Democrats lose votes because a worker is right wing. Dave", 
        "intTime": 20090318, 
        "postID": 12, 
        "quote": "Originally posted by Osedax: Knele, just because you are to ignorant to understand the importance of the Census doesn't mean you should spam threads with stupid pictures.", 
        "reply": " Not one member of ACORN has ever been indicted for voter fraud, and MOST of their hired workers indicted for voter fraud were indicted because ACORN turned them in. The census is not voter registration. Republicans are not going to \"lose votes\" because a census worker was a left winger - Nor will Democrats lose votes because a worker is right wing. Dave", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 16:00:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Grachus"
    }, 
    {
        "content": "Does the term Gerrymandering mean anything to you?", 
        "intTime": 20090318, 
        "postID": 13, 
        "quote": "", 
        "reply": "Does the term Gerrymandering mean anything to you?", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 16:02:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: Does the term Gerrymandering mean anything to you? It sure does, but it has little to do with outright population counts. Take a look at some of the gerrymanded districts and tell me that population - that is to say \"Numbers\" played a part. Democratic Liberals AND Conservative Republicans BOTH cooperated in creating more districts in which the majority of people were Black and Latino. The liberals went along because there WOULD be more Blacks and Latino's in Congress. The Conservatives went along because there would be less liberal voters in the surrounding districts. Take a look at the maps and you'll see what I mean. The actual result was an increase in BOTH Black and Latino members of Congress AND an increase in Conservative Republican members of Congress. Dave", 
        "intTime": 20090318, 
        "postID": 14, 
        "quote": "Originally posted by shuman14: Does the term Gerrymandering mean anything to you?", 
        "reply": " It sure does, but it has little to do with outright population counts. Take a look at some of the gerrymanded districts and tell me that population - that is to say \"Numbers\" played a part. Democratic Liberals AND Conservative Republicans BOTH cooperated in creating more districts in which the majority of people were Black and Latino. The liberals went along because there WOULD be more Blacks and Latino's in Congress. The Conservatives went along because there would be less liberal voters in the surrounding districts. Take a look at the maps and you'll see what I mean. The actual result was an increase in BOTH Black and Latino members of Congress AND an increase in Conservative Republican members of Congress. Dave", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 16:50:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by shuman14: Again the \"tolerant\" \"inclusive\" liberal left at work again. Isn't \"change\" great? Already past the future", 
        "intTime": 20090318, 
        "postID": 15, 
        "quote": "Originally posted by shuman14: Again the \"tolerant\" \"inclusive\" liberal left at work again. Isn't \"change\" great?", 
        "reply": " Already past the future", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 16:52:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I don't see anything wrong with it. Somehow--- in a land, far, far, far away. I'm sure you don't. After all, your just what they are looking for.", 
        "intTime": 20090318, 
        "postID": 16, 
        "quote": "Originally posted by jack_flats: I don't see anything wrong with it.", 
        "reply": " Somehow--- in a land, far, far, far away. I'm sure you don't. After all, your just what they are looking for.", 
        "threadID": "672198221_3570081812001", 
        "time": "2009-03-18 17:07:00", 
        "title": "U.S. Census - Do Democrats really think this is ok?", 
        "userID": "JustanotherGI"
    }
]