[
    {
        "content": "March 16, 2009 FOR IMMEDIATE RELEASE Contact: Dan Choi, (West Point Class of ‘03) Communications Director and Spokesperson dan.choi@knightsout.org Phone number: (714) 654-0828 WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet. “Knights Out,” an association of Lesbian, Gay, Bisexual and Transgender (LGBT) West Point Alumni and their supporters emerged from anonymity today to support thousands of LGBT Soldiers currently serving in the armed forces, and to educate the current military leadership on the importance of accepting and honoring the sacrifices and selfless service of their LGBT soldiers and officers. As congress approaches the decision to allow LGBT military personnel to serve openly, the group is prepared to serve as a critical support and advocacy group for the full acceptance of gay service members, particularly at West Point. By publicly outing themselves, the 37 members of Knights Out ended once and for all the anonymity that has obscured from full view their service to the nation as West Point graduates. Knights Out seeks to reduce the stigma associated with sexual diversity by providing an open forum for discussion between out LGBT West Point graduates and their fellow alumni. Knights Out is well-positioned to help West Point maintain its status as the world’s premier leadership institution by swiftly and effectively adapting to the end of the “Don’t Ask, Don’t Tell” policy, which Knights Out believes is both imminent and inevitable. Colonel (Retired) Stewart Bornhoft, West Point class of 1969 and Vietnam combat veteran, welcomed the formation of Knights Out: “All West Pointers, regardless of their own sexual orientation, will soon be charged with leading soldiers who freely acknowledge their diverse orientations. Just as we set the example for the successful integration of the races and genders, we will have that same responsibility when our nation joins the family of 26 other militaries that have implemented the freedom to serve openly. When open service is enacted, the words of the Cadet Prayer - ‘…never to be content with a half truth when the whole truth can be won’ – will once again be our guidepost.” On the 207th anniversary of the founding of West Point, it is fitting that Knights Out brings over 275 combined years of Active Duty service of their LGBT members to assist West Point and the AOG. The organization takes its name after West Point’s mascot, the Black Knight, a selfless warrior whose identity must be hidden but emerges to save the day nonetheless. Knights Out is led by a board of LGBT West Point graduates and their supporters. The group includes combat veterans and leaders in their local communities. All are also members of the Service Academy Gay and Lesbian Alumni (SAGALA) network, with over 340 members, a number which includes some Active Duty combat commanders currently in Iraq and Afghanistan. SAGALA protects member identities because of the current discriminatory policy. Under the \"Don't Ask, Don't Tell\" law, gay and lesbian service members are allowed to serve in the United States armed forces, but are not permitted to tell coworkers their sexual orientation, living a secret life in exchange for the opportunity to serve. Because West Point cadets live by the Honor Code, that they “will not lie, cheat or steal, nor tolerate those who do,” LGBT cadets and graduates are frequently forced to compromise their integrity. This policy undermines the Army Values of Honor, Integrity, and Respect, resulting in the premature resignation of many talented service members and West Point graduates.", 
        "intTime": 20090315, 
        "postID": 1, 
        "quote": "", 
        "reply": "March 16, 2009 FOR IMMEDIATE RELEASE Contact: Dan Choi, (West Point Class of ‘03) Communications Director and Spokesperson dan.choi@knightsout.org Phone number: (714) 654-0828 WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet. “Knights Out,” an association of Lesbian, Gay, Bisexual and Transgender (LGBT) West Point Alumni and their supporters emerged from anonymity today to support thousands of LGBT Soldiers currently serving in the armed forces, and to educate the current military leadership on the importance of accepting and honoring the sacrifices and selfless service of their LGBT soldiers and officers. As congress approaches the decision to allow LGBT military personnel to serve openly, the group is prepared to serve as a critical support and advocacy group for the full acceptance of gay service members, particularly at West Point. By publicly outing themselves, the 37 members of Knights Out ended once and for all the anonymity that has obscured from full view their service to the nation as West Point graduates. Knights Out seeks to reduce the stigma associated with sexual diversity by providing an open forum for discussion between out LGBT West Point graduates and their fellow alumni. Knights Out is well-positioned to help West Point maintain its status as the world’s premier leadership institution by swiftly and effectively adapting to the end of the “Don’t Ask, Don’t Tell” policy, which Knights Out believes is both imminent and inevitable. Colonel (Retired) Stewart Bornhoft, West Point class of 1969 and Vietnam combat veteran, welcomed the formation of Knights Out: “All West Pointers, regardless of their own sexual orientation, will soon be charged with leading soldiers who freely acknowledge their diverse orientations. Just as we set the example for the successful integration of the races and genders, we will have that same responsibility when our nation joins the family of 26 other militaries that have implemented the freedom to serve openly. When open service is enacted, the words of the Cadet Prayer - ‘…never to be content with a half truth when the whole truth can be won’ – will once again be our guidepost.” On the 207th anniversary of the founding of West Point, it is fitting that Knights Out brings over 275 combined years of Active Duty service of their LGBT members to assist West Point and the AOG. The organization takes its name after West Point’s mascot, the Black Knight, a selfless warrior whose identity must be hidden but emerges to save the day nonetheless. Knights Out is led by a board of LGBT West Point graduates and their supporters. The group includes combat veterans and leaders in their local communities. All are also members of the Service Academy Gay and Lesbian Alumni (SAGALA) network, with over 340 members, a number which includes some Active Duty combat commanders currently in Iraq and Afghanistan. SAGALA protects member identities because of the current discriminatory policy. Under the \"Don't Ask, Don't Tell\" law, gay and lesbian service members are allowed to serve in the United States armed forces, but are not permitted to tell coworkers their sexual orientation, living a secret life in exchange for the opportunity to serve. Because West Point cadets live by the Honor Code, that they “will not lie, cheat or steal, nor tolerate those who do,” LGBT cadets and graduates are frequently forced to compromise their integrity. This policy undermines the Army Values of Honor, Integrity, and Respect, resulting in the premature resignation of many talented service members and West Point graduates.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 13:23:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "reducetension"
    }, 
    {
        "content": "quote: Originally posted by reducetension: Edited WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet. Its about time.", 
        "intTime": 20090315, 
        "postID": 2, 
        "quote": "Originally posted by reducetension: Edited WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER Organizers offer partnership with the nation’s oldest military academy as the end to “Don’t Ask, Don’t Tell” quickly approaches. WEST POINT, NY – A courageous group of America’s best and brightest are once again answering their call to duty, honor, and country: by coming out of the closet.", 
        "reply": " Its about time.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 13:28:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Maybe but they just sealed thier military career as DOA.", 
        "intTime": 20090315, 
        "postID": 3, 
        "quote": "", 
        "reply": "Maybe but they just sealed thier military career as DOA.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 13:34:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Looks like there will be a massive thinning of the ranks once the names are made public. Either they immediately resign their commissions, or face the consequences of their actions...", 
        "intTime": 20090315, 
        "postID": 4, 
        "quote": "", 
        "reply": "Looks like there will be a massive thinning of the ranks once the names are made public. Either they immediately resign their commissions, or face the consequences of their actions...", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 13:49:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "Hoffy1951"
    }, 
    {
        "content": "I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs.", 
        "intTime": 20090315, 
        "postID": 5, 
        "quote": "", 
        "reply": "I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 15:52:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Breaking laws and regulations..Mutany...in the military don't fly in most cases. They are toast.", 
        "intTime": 20090315, 
        "postID": 6, 
        "quote": "", 
        "reply": "Breaking laws and regulations..Mutany...in the military don't fly in most cases. They are toast.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 17:16:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Because West Point cadets live by the Honor Code, that they “will not lie, cheat or steal, nor tolerate those who do,” LGBT cadets and graduates are frequently forced to compromise their integrity. Integrity cannot be compromised.", 
        "intTime": 20090315, 
        "postID": 7, 
        "quote": "Because West Point cadets live by the Honor Code, that they “will not lie, cheat or steal, nor tolerate those who do,” LGBT cadets and graduates are frequently forced to compromise their integrity.", 
        "reply": " Integrity cannot be compromised.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 20:39:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "RBruce"
    }, 
    {
        "content": "Looks like the spam just hit the fan!... Respectfully, SUNLINER81", 
        "intTime": 20090315, 
        "postID": 8, 
        "quote": "", 
        "reply": "Looks like the spam just hit the fan!... Respectfully, SUNLINER81", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-15 21:02:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs. They have to know the likely outcome. Brave or not about this matter depends on how much they loved serving as leaders of soldiers. But some might be in that category. Just like it can require a good deal of courage to speak out against homosexuality in some circles, if one's moral convictions demand confronting what one thinks is immoral, when the practitioners insist in public that policies must be created and enforced that publicly demean, degrade, and compromise historical attitudes that long human experience has found to generally be quite sound and appropriate.", 
        "intTime": 20090316, 
        "postID": 9, 
        "quote": "Originally posted by Cider33_Alpha: I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs.", 
        "reply": " They have to know the likely outcome. Brave or not about this matter depends on how much they loved serving as leaders of soldiers. But some might be in that category. Just like it can require a good deal of courage to speak out against homosexuality in some circles, if one's moral convictions demand confronting what one thinks is immoral, when the practitioners insist in public that policies must be created and enforced that publicly demean, degrade, and compromise historical attitudes that long human experience has found to generally be quite sound and appropriate.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-16 19:08:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by Cider33_Alpha: I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs. They have to know the likely outcome. Brave or not about this matter depends on how much they loved serving as leaders of soldiers. But some might be in that category. Just like it can require a good deal of courage to speak out against homosexuality in some circles, if one's moral convictions demand confronting what one thinks is immoral, when the practitioners insist in public that policies must be created and enforced that publicly demean, degrade, and compromise historical attitudes that long human experience has found to generally be quite sound and appropriate. The military has gotten over any number of \"historical attitudes that long human experience has found to generally be quite sound and appropriate\"... the flogging (beating) of military personnel is one of them, and that in the Army not until after WW-I and the maritime services sometime later. And the whole \"historical\" significance of segregating blacks from whites, which was adamantly defended during WW-II (see declassified USN document G.B. No. 421 Serial No. 201, date January 16, 1942... the same arguments are used to \"segregate\" gays from service today!) That only ended after an Executive Order in 1948... an order resisted by politicians in Truman's own party and military leaders alike, all quoting \"historical\" and \"moral\" reasons. All kinds of \"historic\" and \"traditional\" rationals have been vacated due to their obvious hindrance of sevice and prejudices of those who defend them... even on moral grounds. This DA/DT is yet another one, restricting the discipline and patriotic gays from serving freely and honestly. It's the next one that has to go. What purpose does it serve to degrade and humiliate them with threats of kicking them out if someone finds out or restricting their service in any manner beyond what is expected of a service member..... integrity on the job is far more important than sexual orientation. There is no serious \"historical\" reasons to demean and degrade these capable and willing citizens from serving and defending the Constitution like anyone else who is eligible. As far as morals go. If you are basing it on \"traditional\" Judaic/Christian morals, which is more immoral? Adultery between consent heterosexuals in the military or being a homosexual? If we had to stop immoral people from being in the military, we have to get rid of a large percentage of those who disregard \"traditional historical\" morality. I spent too many years in Army Family Advocacy to believe homosexuals are a greater 'immoral' threat than out-of-control heterosexuals. It is not an argument that merits any weight as it is laced with hypocrisy.", 
        "intTime": 20090316, 
        "postID": 10, 
        "quote": "Originally posted by RRR52: quote: Originally posted by Cider33_Alpha: I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs. They have to know the likely outcome. Brave or not about this matter depends on how much they loved serving as leaders of soldiers. But some might be in that category. Just like it can require a good deal of courage to speak out against homosexuality in some circles, if one's moral convictions demand confronting what one thinks is immoral, when the practitioners insist in public that policies must be created and enforced that publicly demean, degrade, and compromise historical attitudes that long human experience has found to generally be quite sound and appropriate.", 
        "reply": " The military has gotten over any number of \"historical attitudes that long human experience has found to generally be quite sound and appropriate\"... the flogging (beating) of military personnel is one of them, and that in the Army not until after WW-I and the maritime services sometime later. And the whole \"historical\" significance of segregating blacks from whites, which was adamantly defended during WW-II (see declassified USN document G.B. No. 421 Serial No. 201, date January 16, 1942... the same arguments are used to \"segregate\" gays from service today!) That only ended after an Executive Order in 1948... an order resisted by politicians in Truman's own party and military leaders alike, all quoting \"historical\" and \"moral\" reasons. All kinds of \"historic\" and \"traditional\" rationals have been vacated due to their obvious hindrance of sevice and prejudices of those who defend them... even on moral grounds. This DA/DT is yet another one, restricting the discipline and patriotic gays from serving freely and honestly. It's the next one that has to go. What purpose does it serve to degrade and humiliate them with threats of kicking them out if someone finds out or restricting their service in any manner beyond what is expected of a service member..... integrity on the job is far more important than sexual orientation. There is no serious \"historical\" reasons to demean and degrade these capable and willing citizens from serving and defending the Constitution like anyone else who is eligible. As far as morals go. If you are basing it on \"traditional\" Judaic/Christian morals, which is more immoral? Adultery between consent heterosexuals in the military or being a homosexual? If we had to stop immoral people from being in the military, we have to get rid of a large percentage of those who disregard \"traditional historical\" morality. I spent too many years in Army Family Advocacy to believe homosexuals are a greater 'immoral' threat than out-of-control heterosexuals. It is not an argument that merits any weight as it is laced with hypocrisy.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-16 20:31:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "reducetension"
    }, 
    {
        "content": "As it appears in the Army Times ... West Point grads form gay support group Thirty-eight graduates of the U.S. Military Academy at West Point, N.Y., came out of the closet Monday with an offer to help their alma mater educate future Army leaders on the need to accept and honor the sacrifices of lesbian, gay, bisexual and transgender troops. “Knights Out” wants to serve as a connection between gay troops and Army administrators, particularly at West Point, to provide an “open forum” for communication between gay West Point graduates and their fellow alumni and to serve in an advisory role for West Point leaders in the eventuality — which the group believes is both “imminent and inevitable” — that the law and policy collectively known as “don’t ask, don’t tell” are repealed by Congress. “We’re publicly announcing our sexuality, our orientation,” said 1st Lt. Dan Choi, a National Guardsman with the 1st Bn., 69th Infantry, based in Manhattan. “It’s just one part of who we are in saying that we are standing to be counted.” Choi said the group has contacted West Point leadership and gotten “a very warm response.” An academy spokesman couldn’t confirm that assertion, noting that today was the first day of West Point’s spring break and that the campus was nearly empty. Full article at > The Army Times ++http://www.armytimes.com/news/2009/03/military_westpoint_knightsout_031609w/", 
        "intTime": 20090317, 
        "postID": 11, 
        "quote": "", 
        "reply": "As it appears in the Army Times ... West Point grads form gay support group Thirty-eight graduates of the U.S. Military Academy at West Point, N.Y., came out of the closet Monday with an offer to help their alma mater educate future Army leaders on the need to accept and honor the sacrifices of lesbian, gay, bisexual and transgender troops. “Knights Out” wants to serve as a connection between gay troops and Army administrators, particularly at West Point, to provide an “open forum” for communication between gay West Point graduates and their fellow alumni and to serve in an advisory role for West Point leaders in the eventuality — which the group believes is both “imminent and inevitable” — that the law and policy collectively known as “don’t ask, don’t tell” are repealed by Congress. “We’re publicly announcing our sexuality, our orientation,” said 1st Lt. Dan Choi, a National Guardsman with the 1st Bn., 69th Infantry, based in Manhattan. “It’s just one part of who we are in saying that we are standing to be counted.” Choi said the group has contacted West Point leadership and gotten “a very warm response.” An academy spokesman couldn’t confirm that assertion, noting that today was the first day of West Point’s spring break and that the campus was nearly empty. Full article at > The Army Times ++http://www.armytimes.com/news/2009/03/military_westpoint_knightsout_031609w/", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-17 09:20:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Spring break? Since when do the Academies get a spring break? Jeez, how they've let the standards slide ... Anyway ... Excellent post, reducetension. The \"it's always been this way\" argument is just too tired a dog to hunt anymore, toothless and arthritic old beast that it is.", 
        "intTime": 20090317, 
        "postID": 12, 
        "quote": "", 
        "reply": "Spring break? Since when do the Academies get a spring break? Jeez, how they've let the standards slide ... Anyway ... Excellent post, reducetension. The \"it's always been this way\" argument is just too tired a dog to hunt anymore, toothless and arthritic old beast that it is.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-17 12:29:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Excellent post, reducetension. The \"it's always been this way\" argument is just too tired a dog to hunt anymore, toothless and arthritic old beast that it is. Not when such perverted behavior is rationalized as a matter of \"equal rights.\" Let people grab all the booty they want, any way they want it--no different from adulterers and child molestors. Yes, those antiquated old, arthritic views of morality and decency mean nothing. People of today are oh-so much smarter and knowledgeable, sho' 'nuff. You want to proclaim the merits of perversion? Hey, have at it; this is America, not an islamic nation, so you won't be beheaded or stoned. But never expect that such contemptible behavior will be publicly accepted when those guilty of it drag their filth into the public arena claiming its acceptability or nobility, when others of us understand the underlying psychological insecurities that lead to such behavior.", 
        "intTime": 20090320, 
        "postID": 13, 
        "quote": "Originally posted by Cider33_Alpha: Excellent post, reducetension. The \"it's always been this way\" argument is just too tired a dog to hunt anymore, toothless and arthritic old beast that it is.", 
        "reply": " Not when such perverted behavior is rationalized as a matter of \"equal rights.\" Let people grab all the booty they want, any way they want it--no different from adulterers and child molestors. Yes, those antiquated old, arthritic views of morality and decency mean nothing. People of today are oh-so much smarter and knowledgeable, sho' 'nuff. You want to proclaim the merits of perversion? Hey, have at it; this is America, not an islamic nation, so you won't be beheaded or stoned. But never expect that such contemptible behavior will be publicly accepted when those guilty of it drag their filth into the public arena claiming its acceptability or nobility, when others of us understand the underlying psychological insecurities that lead to such behavior.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-20 18:29:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "RRR52"
    }, 
    {
        "content": "Who said anything about \"public\"? What people do in the privacy of their own bedrooms is just that - private, not subject to the snoopy eyes of neighbors, self-righteous religious zealots or a nanny state. Academy grads I know - West Point or other - who are gay are not exactly leading the Gay Pride Parade. Public display of affection is not their thing. Privacy is. They just want to serve in the military without regard to their sexual preference - as people serve without regard to their religion, gender, ethnicity or race. You can like or dislike, approve or disapprove of whatever you please. Just don't foist your beliefs on me. How YOU define \"perversion\" may or may not be how I define it, and that definition misses the point entirely - as do you.", 
        "intTime": 20090321, 
        "postID": 14, 
        "quote": "", 
        "reply": "Who said anything about \"public\"? What people do in the privacy of their own bedrooms is just that - private, not subject to the snoopy eyes of neighbors, self-righteous religious zealots or a nanny state. Academy grads I know - West Point or other - who are gay are not exactly leading the Gay Pride Parade. Public display of affection is not their thing. Privacy is. They just want to serve in the military without regard to their sexual preference - as people serve without regard to their religion, gender, ethnicity or race. You can like or dislike, approve or disapprove of whatever you please. Just don't foist your beliefs on me. How YOU define \"perversion\" may or may not be how I define it, and that definition misses the point entirely - as do you.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-21 03:45:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by reducetension: quote: Originally posted by RRR52: quote: Originally posted by Cider33_Alpha: I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs. They have to know the likely outcome. Brave or not about this matter depends on how much they loved serving as leaders of soldiers. But some might be in that category. Just like it can require a good deal of courage to speak out against homosexuality in some circles, if one's moral convictions demand confronting what one thinks is immoral, when the practitioners insist in public that policies must be created and enforced that publicly demean, degrade, and compromise historical attitudes that long human experience has found to generally be quite sound and appropriate. The military has gotten over any number of \"historical attitudes that long human experience has found to generally be quite sound and appropriate\"... the flogging (beating) of military personnel is one of them, and that in the Army not until after WW-I and the maritime services sometime later. In reality flogging was abolished in the Navy in 1850 Army in August 1861. Of course by our standards punishment remained draconian, but flogging was not one of the options.", 
        "intTime": 20090321, 
        "postID": 15, 
        "quote": "Originally posted by reducetension: quote: Originally posted by RRR52: quote: Originally posted by Cider33_Alpha: I would imagine that those who are still active duty have thought long and hard about just that, Hoffy. That's what makes this a rather brave stand to take - in my mind anyway. That's whether or not you happen to agree with their views on open military service for LGBTs. They have to know the likely outcome. Brave or not about this matter depends on how much they loved serving as leaders of soldiers. But some might be in that category. Just like it can require a good deal of courage to speak out against homosexuality in some circles, if one's moral convictions demand confronting what one thinks is immoral, when the practitioners insist in public that policies must be created and enforced that publicly demean, degrade, and compromise historical attitudes that long human experience has found to generally be quite sound and appropriate. The military has gotten over any number of \"historical attitudes that long human experience has found to generally be quite sound and appropriate\"... the flogging (beating) of military personnel is one of them, and that in the Army not until after WW-I and the maritime services sometime later.", 
        "reply": " In reality flogging was abolished in the Navy in 1850 Army in August 1861. Of course by our standards punishment remained draconian, but flogging was not one of the options.", 
        "threadID": "672198221_6230049712001", 
        "time": "2009-03-21 04:24:00", 
        "title": "WEST POINT LGBT ALUMNI GROUP OFFERS SUPPORT TO ALMA MATER", 
        "userID": "adminnco1"
    }
]