[
    {
        "content": "Gordon Brown will represent the UK at the memorial events in Normandy on June 6 to mark the 65th anniversary of the landings that helped defeat Hitler’s ­Germany. But no member of the Royal Family will be present because they have still not received a formal invitation, said Buckingham Palace. \"http://www.msnbc.msn.com/id/30982819/\"", 
        "intTime": 20090531, 
        "postID": 1, 
        "quote": "", 
        "reply": "Gordon Brown will represent the UK at the memorial events in Normandy on June 6 to mark the 65th anniversary of the landings that helped defeat Hitler’s ­Germany. But no member of the Royal Family will be present because they have still not received a formal invitation, said Buckingham Palace. \"http://www.msnbc.msn.com/id/30982819/\"", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 15:50:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[ The french seem to forget that the allies liberated them from german occupation and many a british solder lost their life on d-day at normandy and the following days of liberation. Nothing less than a public apology from the French top heads of state and presentment of their aknowledgement of british allies in the normandy invasion.", 
        "intTime": 20090531, 
        "postID": 2, 
        "quote": "", 
        "reply": "Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[ The french seem to forget that the allies liberated them from german occupation and many a british solder lost their life on d-day at normandy and the following days of liberation. Nothing less than a public apology from the French top heads of state and presentment of their aknowledgement of british allies in the normandy invasion.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:01:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090531, 
        "postID": 3, 
        "quote": "", 
        "reply": "Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:19:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "NSNN"
    }, 
    {
        "content": "The same subject is already being discussed at the ff. thread at the British and Commonwealth forums of military.com: \"Queen snubbed by France for D-Day/WW2 anniversary ceremonies\" thread of military.com", 
        "intTime": 20090531, 
        "postID": 4, 
        "quote": "", 
        "reply": "The same subject is already being discussed at the ff. thread at the British and Commonwealth forums of military.com: \"Queen snubbed by France for D-Day/WW2 anniversary ceremonies\" thread of military.com", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:23:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones.", 
        "intTime": 20090531, 
        "postID": 5, 
        "quote": "", 
        "reply": "It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:25:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones. All heads of state of those countries that poured on to the beaches of Normandy should have recieve a personal invitation from the French head of state", 
        "intTime": 20090531, 
        "postID": 6, 
        "quote": "Originally posted by Bladensburg: It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones.", 
        "reply": " All heads of state of those countries that poured on to the beaches of Normandy should have recieve a personal invitation from the French head of state", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:29:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms.", 
        "intTime": 20090531, 
        "postID": 7, 
        "quote": "Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”.", 
        "reply": " Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:30:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms. as I stated above those countries that provided allied invasion forces that liberated france during d-day invasion should have recieved a personal invitation from the Head of the French Government quote: Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[", 
        "intTime": 20090531, 
        "postID": 8, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms.", 
        "reply": " as I stated above those countries that provided allied invasion forces that liberated france during d-day invasion should have recieved a personal invitation from the Head of the French Government quote: Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 17:15:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky.", 
        "intTime": 20090531, 
        "postID": 9, 
        "quote": "", 
        "reply": "The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 17:31:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky. wtf? Already past the future", 
        "intTime": 20090531, 
        "postID": 10, 
        "quote": "Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky.", 
        "reply": " wtf? Already past the future", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 17:33:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "6486143"
    }, 
    {
        "content": "I'm sure if France still had a monarchy, their King would have sent the british Queen an invitation. Since they don't, a president sent a Prime Minister the invitation. That's proper protocol. I'd say, send Chuck over but he's still brewing because he's not King yet. If the queen or rather Buckingham Palace is so uptight about this snub, they should send Camilla over, that will fix them french!!!!.", 
        "intTime": 20090531, 
        "postID": 11, 
        "quote": "", 
        "reply": "I'm sure if France still had a monarchy, their King would have sent the british Queen an invitation. Since they don't, a president sent a Prime Minister the invitation. That's proper protocol. I'd say, send Chuck over but he's still brewing because he's not King yet. If the queen or rather Buckingham Palace is so uptight about this snub, they should send Camilla over, that will fix them french!!!!.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 18:14:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "You all seem to misunderstand. Head of state sends invitation (via Foreign office) to Head of State. If the Head of State declines, a representative of HM will attend (be they a member of the royal family, or a representative of HM Government). HM the Queen most certainly does NOT have her knickers in a twist over this, as usual maintaining a dignified silence. It is the press that rightly point out the way Brown and his ilk have hijacked this solemn commemoration of our glorius dead, for short term political expediency! God rot that mans soul!", 
        "intTime": 20090601, 
        "postID": 12, 
        "quote": "", 
        "reply": "You all seem to misunderstand. Head of state sends invitation (via Foreign office) to Head of State. If the Head of State declines, a representative of HM will attend (be they a member of the royal family, or a representative of HM Government). HM the Queen most certainly does NOT have her knickers in a twist over this, as usual maintaining a dignified silence. It is the press that rightly point out the way Brown and his ilk have hijacked this solemn commemoration of our glorius dead, for short term political expediency! God rot that mans soul!", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 02:03:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky. wtf? I'm having difficulty simplifying the concept further. For the purposes of this sort of thing the Queen is the United Kingdom. An invitation to the UK to attend something is an invitation to the Queen (because the whole bloody country can't very well go can it?) if the French president had wanted the Prime Minister alone to go he'd have sent the invitation to \"Her Majesty's Government\". In terms of non-political international events it's kings, queens, emperors and presidents who have the same status as Heads of State. The confusion here arises, I think, because some presidents (notably the French and the American) are also Heads of Government a separate job done by prime ministers and chancellors and the like in many countries.", 
        "intTime": 20090601, 
        "postID": 13, 
        "quote": "Originally posted by 6486143: quote: Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky. wtf?", 
        "reply": " I'm having difficulty simplifying the concept further. For the purposes of this sort of thing the Queen is the United Kingdom. An invitation to the UK to attend something is an invitation to the Queen (because the whole bloody country can't very well go can it?) if the French president had wanted the Prime Minister alone to go he'd have sent the invitation to \"Her Majesty's Government\". In terms of non-political international events it's kings, queens, emperors and presidents who have the same status as Heads of State. The confusion here arises, I think, because some presidents (notably the French and the American) are also Heads of Government a separate job done by prime ministers and chancellors and the like in many countries.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 02:40:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "This would be like Nancy Pelosi attending instead of the President.", 
        "intTime": 20090601, 
        "postID": 14, 
        "quote": "", 
        "reply": "This would be like Nancy Pelosi attending instead of the President.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 02:50:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "redcoat72"
    }, 
    {
        "content": "How ironic: the White House is now the one trying to secure a D-Day anniversary ceremony invite for Her Majesty. ++http://ca.news.yahoo.com/s/afp/090601/usa/us_france_military_dday_anniversary_queen quote: White House working on D-Day invite for Queen 33 minutes ago WASHINGTON (AFP) - The White House said Monday it was working with organizers of next weekend's D-Day 65th anniversary commemorations to secure an invitation for Queen Elizabeth II. (...) The comments may revive debate about the looming absence of the queen, who served in uniform during World War II, from the commemoration ceremonies, following last week reports of an Anglo-France rift over the ceremony. France said last week that Queen Elizabeth would be welcome to attend the event, featuring Obama, French President Nicholas Sarkozy, British Prime Minister Gordon Brown and Canadian Prime Minister Stephen Harper. But the queen did not specifically receive an invitation from the French government, even though she was present for the 60th anniversary event in 2004, amid claims in the British press that she was annoyed at being excluded. Paris said an invitation had been extended to the British government and it was up to Prime Minister Gordon Brown to decide who would attend. \"The Queen of England, as British head of state, is naturally welcome,\" said French government spokesman Luc Chatel. (...) Earlier on Monday, Brown said he would be happy to arrange for the queen to attend the commemorations. (...) A Buckingham Palace spokeswoman however made it clear Monday that the queen would not be attending the events in France marking D-Day, and stressed she was not upset about the situation. (...) \"We would like to reiterate that we have never expressed any sense of anger or frustration at all, and are content with all the arrangements that are planned.\" (...)", 
        "intTime": 20090601, 
        "postID": 15, 
        "quote": "White House working on D-Day invite for Queen 33 minutes ago WASHINGTON (AFP) - The White House said Monday it was working with organizers of next weekend's D-Day 65th anniversary commemorations to secure an invitation for Queen Elizabeth II. (...) The comments may revive debate about the looming absence of the queen, who served in uniform during World War II, from the commemoration ceremonies, following last week reports of an Anglo-France rift over the ceremony. France said last week that Queen Elizabeth would be welcome to attend the event, featuring Obama, French President Nicholas Sarkozy, British Prime Minister Gordon Brown and Canadian Prime Minister Stephen Harper. But the queen did not specifically receive an invitation from the French government, even though she was present for the 60th anniversary event in 2004, amid claims in the British press that she was annoyed at being excluded. Paris said an invitation had been extended to the British government and it was up to Prime Minister Gordon Brown to decide who would attend. \"The Queen of England, as British head of state, is naturally welcome,\" said French government spokesman Luc Chatel. (...) Earlier on Monday, Brown said he would be happy to arrange for the queen to attend the commemorations. (...) A Buckingham Palace spokeswoman however made it clear Monday that the queen would not be attending the events in France marking D-Day, and stressed she was not upset about the situation. (...) \"We would like to reiterate that we have never expressed any sense of anger or frustration at all, and are content with all the arrangements that are planned.\" (...)", 
        "reply": "How ironic: the White House is now the one trying to secure a D-Day anniversary ceremony invite for Her Majesty. ++http://ca.news.yahoo.com/s/afp/090601/usa/us_france_military_dday_anniversary_queen ", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 15:35:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "To be honest I have a problem with the idea of there having to be a special invitation for HM, and I suspect she would too. It would set a precedent that sets the prime minister above his sovereign which is frankly unacceptable. Any sort of interference by the White House would only compound the problem, HM is not some little old lady who needs help from the head septic out of sympathy, that would be a constitutional nightmare. This is an internal British issue and to my mind the only way it can be solved satisfactorily is for Brown to apologise to HM profusely and allow her to take his place or for HM to ask someone else to form a government and dissolve Parliament (which needs doing anyway after the expenses scandals) in preparation for a general election. Prime ministers cannot be allowed to get away with what is close to lese majeste like this or one day we'll find we can't get shot of one of the buggers.", 
        "intTime": 20090601, 
        "postID": 16, 
        "quote": "", 
        "reply": "To be honest I have a problem with the idea of there having to be a special invitation for HM, and I suspect she would too. It would set a precedent that sets the prime minister above his sovereign which is frankly unacceptable. Any sort of interference by the White House would only compound the problem, HM is not some little old lady who needs help from the head septic out of sympathy, that would be a constitutional nightmare. This is an internal British issue and to my mind the only way it can be solved satisfactorily is for Brown to apologise to HM profusely and allow her to take his place or for HM to ask someone else to form a government and dissolve Parliament (which needs doing anyway after the expenses scandals) in preparation for a general election. Prime ministers cannot be allowed to get away with what is close to lese majeste like this or one day we'll find we can't get shot of one of the buggers.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 16:16:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "So, is the commemoration still on? Or has all this discussion turned it into a complete ballox?", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "", 
        "reply": "So, is the commemoration still on? Or has all this discussion turned it into a complete ballox?", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 19:47:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Gordon Brown will represent the UK at the memorial events in Normandy on June 6 to mark the 65th anniversary of the landings that helped defeat Hitler’s ­Germany. But no member of the Royal Family will be present because they have still not received a formal invitation, said Buckingham Palace. \"http://www.msnbc.msn.com/id/30982819/\"", 
        "intTime": 20090531, 
        "postID": 21, 
        "quote": "", 
        "reply": "Gordon Brown will represent the UK at the memorial events in Normandy on June 6 to mark the 65th anniversary of the landings that helped defeat Hitler’s ­Germany. But no member of the Royal Family will be present because they have still not received a formal invitation, said Buckingham Palace. \"http://www.msnbc.msn.com/id/30982819/\"", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 15:50:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[ The french seem to forget that the allies liberated them from german occupation and many a british solder lost their life on d-day at normandy and the following days of liberation. Nothing less than a public apology from the French top heads of state and presentment of their aknowledgement of british allies in the normandy invasion.", 
        "intTime": 20090531, 
        "postID": 22, 
        "quote": "", 
        "reply": "Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[ The french seem to forget that the allies liberated them from german occupation and many a british solder lost their life on d-day at normandy and the following days of liberation. Nothing less than a public apology from the French top heads of state and presentment of their aknowledgement of british allies in the normandy invasion.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:01:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090531, 
        "postID": 23, 
        "quote": "", 
        "reply": "Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:19:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "NSNN"
    }, 
    {
        "content": "The same subject is already being discussed at the ff. thread at the British and Commonwealth forums of military.com: \"Queen snubbed by France for D-Day/WW2 anniversary ceremonies\" thread of military.com", 
        "intTime": 20090531, 
        "postID": 24, 
        "quote": "", 
        "reply": "The same subject is already being discussed at the ff. thread at the British and Commonwealth forums of military.com: \"Queen snubbed by France for D-Day/WW2 anniversary ceremonies\" thread of military.com", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:23:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones.", 
        "intTime": 20090531, 
        "postID": 25, 
        "quote": "", 
        "reply": "It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:25:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones. All heads of state of those countries that poured on to the beaches of Normandy should have recieve a personal invitation from the French head of state", 
        "intTime": 20090531, 
        "postID": 26, 
        "quote": "Originally posted by Bladensburg: It's not the French that are to blame for this (before anyone goes off on a Francophobic rant), it's HM Government. According to protocol the French contact the Foreign and Commonwealth Office who contact the Prime Minister who passes things on to the palace in his role as first Minister of the Crown. The French would initially ask who wanted to attend and then issue formal invitations accordingly. It would seem that Gordon Brown (never a fan of things military and even less of a fan of Her Majesty [HM]) had decided for himself that nobody would be going officially from Britain (possibly in order to save cash) but then decided fairly late on that he wanted to be seen rubbing shoulders with the sainted Obama. However either as an oversight or deliberately to prevent HM and PtG from stealing the limelight (after all a Head of State takes precedence over a mere prime minister) Brown never passed the French initial invitation on to the palace. Since it came to light that the Queen wasn't sending a representative or going herself (she and PtG are in their eighties after all) the government have been spinning and trying to blame the French (the sort of thing enthusiastically taken up by our more pathetically xenophobic papers*) to cover the fact that it was the British not the French governments who were at fault. *Mind you the Crapauds didn't help matters by announcing that the commemoration was to be of a primarily Franco-American event), which is a bit Hollywood History of them when you consider that there were more British and Commonwealth forces involved than American ones.", 
        "reply": " All heads of state of those countries that poured on to the beaches of Normandy should have recieve a personal invitation from the French head of state", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:29:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms.", 
        "intTime": 20090531, 
        "postID": 27, 
        "quote": "Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”.", 
        "reply": " Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 16:30:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms. as I stated above those countries that provided allied invasion forces that liberated france during d-day invasion should have recieved a personal invitation from the Head of the French Government quote: Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[", 
        "intTime": 20090531, 
        "postID": 28, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by NSNN: Of course the British received an invitation! What got their panties in a twist is that no (separate) invitation was sent to the Royal Family, as apparently is the protocol! What’s more astonishing is their pompous belief that anyone other than the commonwealth needs to follow the royal “protocol”. Diplomatic protocol would be the same for any country where the Head of State and Head of Government are not the same, not just Britain and the Commonwealth Realms.", 
        "reply": " as I stated above those countries that provided allied invasion forces that liberated france during d-day invasion should have recieved a personal invitation from the Head of the French Government quote: Allied land forces that saw combat in Normandy on June 6 came from Canada, the Free French Forces, the United Kingdom, and the United States. In the weeks following the invasion, Polish forces also participated, as well as contingents from Belgium, Czechoslovakia, Greece, and the Netherlands.[8] Most of the above countries also provided air and naval support, as did the Royal Australian Air Force,[1] the Royal New Zealand Air Force, and the Royal Norwegian Navy.[", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 17:15:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "ss_287"
    }, 
    {
        "content": "The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky.", 
        "intTime": 20090531, 
        "postID": 29, 
        "quote": "", 
        "reply": "The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 17:31:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky. wtf? Already past the future", 
        "intTime": 20090531, 
        "postID": 30, 
        "quote": "Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky.", 
        "reply": " wtf? Already past the future", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 17:33:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "6486143"
    }, 
    {
        "content": "I'm sure if France still had a monarchy, their King would have sent the british Queen an invitation. Since they don't, a president sent a Prime Minister the invitation. That's proper protocol. I'd say, send Chuck over but he's still brewing because he's not King yet. If the queen or rather Buckingham Palace is so uptight about this snub, they should send Camilla over, that will fix them french!!!!.", 
        "intTime": 20090531, 
        "postID": 31, 
        "quote": "", 
        "reply": "I'm sure if France still had a monarchy, their King would have sent the british Queen an invitation. Since they don't, a president sent a Prime Minister the invitation. That's proper protocol. I'd say, send Chuck over but he's still brewing because he's not King yet. If the queen or rather Buckingham Palace is so uptight about this snub, they should send Camilla over, that will fix them french!!!!.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-05-31 18:14:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "You all seem to misunderstand. Head of state sends invitation (via Foreign office) to Head of State. If the Head of State declines, a representative of HM will attend (be they a member of the royal family, or a representative of HM Government). HM the Queen most certainly does NOT have her knickers in a twist over this, as usual maintaining a dignified silence. It is the press that rightly point out the way Brown and his ilk have hijacked this solemn commemoration of our glorius dead, for short term political expediency! God rot that mans soul!", 
        "intTime": 20090601, 
        "postID": 32, 
        "quote": "", 
        "reply": "You all seem to misunderstand. Head of state sends invitation (via Foreign office) to Head of State. If the Head of State declines, a representative of HM will attend (be they a member of the royal family, or a representative of HM Government). HM the Queen most certainly does NOT have her knickers in a twist over this, as usual maintaining a dignified silence. It is the press that rightly point out the way Brown and his ilk have hijacked this solemn commemoration of our glorius dead, for short term political expediency! God rot that mans soul!", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 02:03:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky. wtf? I'm having difficulty simplifying the concept further. For the purposes of this sort of thing the Queen is the United Kingdom. An invitation to the UK to attend something is an invitation to the Queen (because the whole bloody country can't very well go can it?) if the French president had wanted the Prime Minister alone to go he'd have sent the invitation to \"Her Majesty's Government\". In terms of non-political international events it's kings, queens, emperors and presidents who have the same status as Heads of State. The confusion here arises, I think, because some presidents (notably the French and the American) are also Heads of Government a separate job done by prime ministers and chancellors and the like in many countries.", 
        "intTime": 20090601, 
        "postID": 33, 
        "quote": "Originally posted by 6486143: quote: Originally posted by Bladensburg: The French say they invited \"the United Kingdom\" (not the British Government or anything else) just as they always have before. They understand - as apparently our own Prime Minister does not - that that means the Sovereign as the personification of the State. If you invite Germany or Ireland or Italy Or India or Israel to something you're effectively inviting the (non executive) president as the personification of that country. They may choose to send (or by internal national protocol automatically deputise) someone else but it's the Head of State who is invited. If anyone needs a special separate invitation it's the Prime Minister, who is technically merely a flunky. wtf?", 
        "reply": " I'm having difficulty simplifying the concept further. For the purposes of this sort of thing the Queen is the United Kingdom. An invitation to the UK to attend something is an invitation to the Queen (because the whole bloody country can't very well go can it?) if the French president had wanted the Prime Minister alone to go he'd have sent the invitation to \"Her Majesty's Government\". In terms of non-political international events it's kings, queens, emperors and presidents who have the same status as Heads of State. The confusion here arises, I think, because some presidents (notably the French and the American) are also Heads of Government a separate job done by prime ministers and chancellors and the like in many countries.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 02:40:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "This would be like Nancy Pelosi attending instead of the President.", 
        "intTime": 20090601, 
        "postID": 34, 
        "quote": "", 
        "reply": "This would be like Nancy Pelosi attending instead of the President.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 02:50:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "redcoat72"
    }, 
    {
        "content": "How ironic: the White House is now the one trying to secure a D-Day anniversary ceremony invite for Her Majesty. ++http://ca.news.yahoo.com/s/afp/090601/usa/us_france_military_dday_anniversary_queen quote: White House working on D-Day invite for Queen 33 minutes ago WASHINGTON (AFP) - The White House said Monday it was working with organizers of next weekend's D-Day 65th anniversary commemorations to secure an invitation for Queen Elizabeth II. (...) The comments may revive debate about the looming absence of the queen, who served in uniform during World War II, from the commemoration ceremonies, following last week reports of an Anglo-France rift over the ceremony. France said last week that Queen Elizabeth would be welcome to attend the event, featuring Obama, French President Nicholas Sarkozy, British Prime Minister Gordon Brown and Canadian Prime Minister Stephen Harper. But the queen did not specifically receive an invitation from the French government, even though she was present for the 60th anniversary event in 2004, amid claims in the British press that she was annoyed at being excluded. Paris said an invitation had been extended to the British government and it was up to Prime Minister Gordon Brown to decide who would attend. \"The Queen of England, as British head of state, is naturally welcome,\" said French government spokesman Luc Chatel. (...) Earlier on Monday, Brown said he would be happy to arrange for the queen to attend the commemorations. (...) A Buckingham Palace spokeswoman however made it clear Monday that the queen would not be attending the events in France marking D-Day, and stressed she was not upset about the situation. (...) \"We would like to reiterate that we have never expressed any sense of anger or frustration at all, and are content with all the arrangements that are planned.\" (...)", 
        "intTime": 20090601, 
        "postID": 35, 
        "quote": "White House working on D-Day invite for Queen 33 minutes ago WASHINGTON (AFP) - The White House said Monday it was working with organizers of next weekend's D-Day 65th anniversary commemorations to secure an invitation for Queen Elizabeth II. (...) The comments may revive debate about the looming absence of the queen, who served in uniform during World War II, from the commemoration ceremonies, following last week reports of an Anglo-France rift over the ceremony. France said last week that Queen Elizabeth would be welcome to attend the event, featuring Obama, French President Nicholas Sarkozy, British Prime Minister Gordon Brown and Canadian Prime Minister Stephen Harper. But the queen did not specifically receive an invitation from the French government, even though she was present for the 60th anniversary event in 2004, amid claims in the British press that she was annoyed at being excluded. Paris said an invitation had been extended to the British government and it was up to Prime Minister Gordon Brown to decide who would attend. \"The Queen of England, as British head of state, is naturally welcome,\" said French government spokesman Luc Chatel. (...) Earlier on Monday, Brown said he would be happy to arrange for the queen to attend the commemorations. (...) A Buckingham Palace spokeswoman however made it clear Monday that the queen would not be attending the events in France marking D-Day, and stressed she was not upset about the situation. (...) \"We would like to reiterate that we have never expressed any sense of anger or frustration at all, and are content with all the arrangements that are planned.\" (...)", 
        "reply": "How ironic: the White House is now the one trying to secure a D-Day anniversary ceremony invite for Her Majesty. ++http://ca.news.yahoo.com/s/afp/090601/usa/us_france_military_dday_anniversary_queen ", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 15:35:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "To be honest I have a problem with the idea of there having to be a special invitation for HM, and I suspect she would too. It would set a precedent that sets the prime minister above his sovereign which is frankly unacceptable. Any sort of interference by the White House would only compound the problem, HM is not some little old lady who needs help from the head septic out of sympathy, that would be a constitutional nightmare. This is an internal British issue and to my mind the only way it can be solved satisfactorily is for Brown to apologise to HM profusely and allow her to take his place or for HM to ask someone else to form a government and dissolve Parliament (which needs doing anyway after the expenses scandals) in preparation for a general election. Prime ministers cannot be allowed to get away with what is close to lese majeste like this or one day we'll find we can't get shot of one of the buggers.", 
        "intTime": 20090601, 
        "postID": 36, 
        "quote": "", 
        "reply": "To be honest I have a problem with the idea of there having to be a special invitation for HM, and I suspect she would too. It would set a precedent that sets the prime minister above his sovereign which is frankly unacceptable. Any sort of interference by the White House would only compound the problem, HM is not some little old lady who needs help from the head septic out of sympathy, that would be a constitutional nightmare. This is an internal British issue and to my mind the only way it can be solved satisfactorily is for Brown to apologise to HM profusely and allow her to take his place or for HM to ask someone else to form a government and dissolve Parliament (which needs doing anyway after the expenses scandals) in preparation for a general election. Prime ministers cannot be allowed to get away with what is close to lese majeste like this or one day we'll find we can't get shot of one of the buggers.", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 16:16:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "So, is the commemoration still on? Or has all this discussion turned it into a complete ballox?", 
        "intTime": 20090601, 
        "postID": 37, 
        "quote": "", 
        "reply": "So, is the commemoration still on? Or has all this discussion turned it into a complete ballox?", 
        "threadID": "672198221_1320057422001", 
        "time": "2009-06-01 19:47:00", 
        "title": "The French snub of the British for d-day rememberance", 
        "userID": "AliBubba"
    }
]