[
    {
        "content": "\"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity This message has been edited. Last edited by: crackerjacks61, Fri 24 April 2009 04:41 PM", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity This message has been edited. Last edited by: crackerjacks61, Fri 24 April 2009 04:41 PM", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:10:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes.", 
        "intTime": 20090424, 
        "postID": 2, 
        "quote": "http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html", 
        "reply": " Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:33:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes. I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers!", 
        "intTime": 20090424, 
        "postID": 3, 
        "quote": "Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes.", 
        "reply": " I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers!", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:43:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "intTime": 20090424, 
        "postID": 4, 
        "quote": "", 
        "reply": "I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:59:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. I doubt if he felt a thing... Dave", 
        "intTime": 20090424, 
        "postID": 5, 
        "quote": "Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "reply": " I doubt if he felt a thing... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:22:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists.", 
        "intTime": 20090424, 
        "postID": 6, 
        "quote": "", 
        "reply": "is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:22:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists. He was resisting arrest, or were you to hung up on his woody to notice? Dave", 
        "intTime": 20090424, 
        "postID": 7, 
        "quote": "Originally posted by FlankerFlyer: is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists.", 
        "reply": " He was resisting arrest, or were you to hung up on his woody to notice? Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:32:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification.", 
        "intTime": 20090424, 
        "postID": 8, 
        "quote": "He was resisting arrest, or were you to hung up on his woody to notice?", 
        "reply": " what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:50:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave", 
        "intTime": 20090424, 
        "postID": 9, 
        "quote": "Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification.", 
        "reply": " I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 18:04:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "Win some, and lose some. Wrong time, wrong place to get into a power struggle with an idiot over what his breech of uniform code. They're lucky that crowd weren't Brits. I'll bet those three cops needed a couple of stiff drinks to get over that and there's not much 'professional' about that. What's the matter with just walk away?", 
        "intTime": 20090424, 
        "postID": 10, 
        "quote": "", 
        "reply": "Win some, and lose some. Wrong time, wrong place to get into a power struggle with an idiot over what his breech of uniform code. They're lucky that crowd weren't Brits. I'll bet those three cops needed a couple of stiff drinks to get over that and there's not much 'professional' about that. What's the matter with just walk away?", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 22:05:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "popsiq"
    }, 
    {
        "content": "I think he was a victim of the notorious \"shrinkage\". He almost has an inny instead of an outy.", 
        "intTime": 20090424, 
        "postID": 11, 
        "quote": "", 
        "reply": "I think he was a victim of the notorious \"shrinkage\". He almost has an inny instead of an outy.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 23:20:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave You'd risk termination of your aclu membership?", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave", 
        "reply": " You'd risk termination of your aclu membership?", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 04:07:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes. I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers! Lol agreed. I've noticed lately that I have been agreeing with you on most of the newest news out. Though you haven't noticed, I have . Easy to pick on the police when they can't do anything about it. I wish they could have just turned around and started tazering everyone for being disrespectful. Especially the idiot screaming \"freedom of speech\".", 
        "intTime": 20090425, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes. I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers!", 
        "reply": " Lol agreed. I've noticed lately that I have been agreeing with you on most of the newest news out. Though you haven't noticed, I have . Easy to pick on the police when they can't do anything about it. I wish they could have just turned around and started tazering everyone for being disrespectful. Especially the idiot screaming \"freedom of speech\".", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 05:07:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grimbo"
    }, 
    {
        "content": "That was funny, I needed a good laugh!", 
        "intTime": 20090425, 
        "postID": 14, 
        "quote": "", 
        "reply": "That was funny, I needed a good laugh!", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 05:46:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: That was funny, I needed a good laugh! Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding.", 
        "intTime": 20090425, 
        "postID": 15, 
        "quote": "Originally posted by PhoenixDark: That was funny, I needed a good laugh!", 
        "reply": " Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 06:13:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave You'd risk termination of your aclu membership? I don't think you get the issues let alone the question. No American should risk his life to capture one of these guys. Fine, they surrender, the surrender is done in such a way, that we know he doesn't have a bomb strapped to his azz - I don't have a problem with taking them prisoner and treating them as the criminals they are. Ted Bundy wasn't tortured, he wasn't tortured, not BECAUSE of his civil rights, but because of OUR CIVIL RIGHTS - Our humanity. Capturing one of these terrorists in not worth a scratch on your hand. By all means, blow him away if he doesn't give up in a timely manner. And my ACLU membership is not in jeapordy by stating any of the above... Dave", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave You'd risk termination of your aclu membership?", 
        "reply": " I don't think you get the issues let alone the question. No American should risk his life to capture one of these guys. Fine, they surrender, the surrender is done in such a way, that we know he doesn't have a bomb strapped to his azz - I don't have a problem with taking them prisoner and treating them as the criminals they are. Ted Bundy wasn't tortured, he wasn't tortured, not BECAUSE of his civil rights, but because of OUR CIVIL RIGHTS - Our humanity. Capturing one of these terrorists in not worth a scratch on your hand. By all means, blow him away if he doesn't give up in a timely manner. And my ACLU membership is not in jeapordy by stating any of the above... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 08:50:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Originally posted by PhoenixDark: That was funny, I needed a good laugh! Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding. Oh, I think you admire the guy... Dave", 
        "intTime": 20090425, 
        "postID": 17, 
        "quote": "Originally posted by FlankerFlyer: quote: Originally posted by PhoenixDark: That was funny, I needed a good laugh! Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding.", 
        "reply": " Oh, I think you admire the guy... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 08:58:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity Now that chit was funny!! Almost as amusing as \"Don't tase me, bro!!\" These officers went out of their way to give this imbecile every chance in the world to comply with the law. He refused utterly and never stopped resisting the officers. Using a taser was the only option he left the officers with.", 
        "intTime": 20090425, 
        "postID": 18, 
        "quote": "Originally posted by crackerjacks61: \"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity", 
        "reply": " Now that chit was funny!! Almost as amusing as \"Don't tase me, bro!!\" These officers went out of their way to give this imbecile every chance in the world to comply with the law. He refused utterly and never stopped resisting the officers. Using a taser was the only option he left the officers with.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 11:45:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****.", 
        "intTime": 20090425, 
        "postID": 19, 
        "quote": "Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "reply": " Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 12:48:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****. Yes he was and I agree with you 100% I can handle that type of law enforcement. Lucky they didn't sick the Police dog On him OMG!!netstat -a OUCH!!", 
        "intTime": 20090425, 
        "postID": 20, 
        "quote": "Originally posted by foxred03: quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****.", 
        "reply": " Yes he was and I agree with you 100% I can handle that type of law enforcement. Lucky they didn't sick the Police dog On him OMG!!netstat -a OUCH!!", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity This message has been edited. Last edited by: crackerjacks61, Fri 24 April 2009 04:41 PM", 
        "intTime": 20090424, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity This message has been edited. Last edited by: crackerjacks61, Fri 24 April 2009 04:41 PM", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:10:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes.", 
        "intTime": 20090424, 
        "postID": 22, 
        "quote": "http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html", 
        "reply": " Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:33:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes. I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers!", 
        "intTime": 20090424, 
        "postID": 23, 
        "quote": "Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes.", 
        "reply": " I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers!", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:43:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "intTime": 20090424, 
        "postID": 24, 
        "quote": "", 
        "reply": "I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 16:59:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. I doubt if he felt a thing... Dave", 
        "intTime": 20090424, 
        "postID": 25, 
        "quote": "Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "reply": " I doubt if he felt a thing... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:22:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists.", 
        "intTime": 20090424, 
        "postID": 26, 
        "quote": "", 
        "reply": "is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:22:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists. He was resisting arrest, or were you to hung up on his woody to notice? Dave", 
        "intTime": 20090424, 
        "postID": 27, 
        "quote": "Originally posted by FlankerFlyer: is he the winner of world's smallest ***** or what? This guy deserved every volt he got but Im puzzled at how this is not torture.....oh, thats right, my bad, its only torture if they are terrorists.", 
        "reply": " He was resisting arrest, or were you to hung up on his woody to notice? Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:32:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification.", 
        "intTime": 20090424, 
        "postID": 28, 
        "quote": "He was resisting arrest, or were you to hung up on his woody to notice?", 
        "reply": " what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 17:50:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave", 
        "intTime": 20090424, 
        "postID": 29, 
        "quote": "Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification.", 
        "reply": " I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 18:04:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "Win some, and lose some. Wrong time, wrong place to get into a power struggle with an idiot over what his breech of uniform code. They're lucky that crowd weren't Brits. I'll bet those three cops needed a couple of stiff drinks to get over that and there's not much 'professional' about that. What's the matter with just walk away?", 
        "intTime": 20090424, 
        "postID": 30, 
        "quote": "", 
        "reply": "Win some, and lose some. Wrong time, wrong place to get into a power struggle with an idiot over what his breech of uniform code. They're lucky that crowd weren't Brits. I'll bet those three cops needed a couple of stiff drinks to get over that and there's not much 'professional' about that. What's the matter with just walk away?", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 22:05:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "popsiq"
    }, 
    {
        "content": "I think he was a victim of the notorious \"shrinkage\". He almost has an inny instead of an outy.", 
        "intTime": 20090424, 
        "postID": 31, 
        "quote": "", 
        "reply": "I think he was a victim of the notorious \"shrinkage\". He almost has an inny instead of an outy.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-24 23:20:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave You'd risk termination of your aclu membership?", 
        "intTime": 20090425, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave", 
        "reply": " You'd risk termination of your aclu membership?", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 04:07:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes. I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers! Lol agreed. I've noticed lately that I have been agreeing with you on most of the newest news out. Though you haven't noticed, I have . Easy to pick on the police when they can't do anything about it. I wish they could have just turned around and started tazering everyone for being disrespectful. Especially the idiot screaming \"freedom of speech\".", 
        "intTime": 20090425, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by sgt_posty: quote: http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html Should have been tazed for wearing the pink hair band. Thanks CJ for pointing us to a video of a turtle with its head pulled back. How cold was it there? I need to go scrub my eyes. I know that guy made an azz of himself. That's the kinda \"lib\" that I consider real libs did you hear the crowd screaming? \"The Whole Worlds Watching\" LMAO loosers!", 
        "reply": " Lol agreed. I've noticed lately that I have been agreeing with you on most of the newest news out. Though you haven't noticed, I have . Easy to pick on the police when they can't do anything about it. I wish they could have just turned around and started tazering everyone for being disrespectful. Especially the idiot screaming \"freedom of speech\".", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 05:07:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grimbo"
    }, 
    {
        "content": "That was funny, I needed a good laugh!", 
        "intTime": 20090425, 
        "postID": 34, 
        "quote": "", 
        "reply": "That was funny, I needed a good laugh!", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 05:46:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: That was funny, I needed a good laugh! Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding.", 
        "intTime": 20090425, 
        "postID": 35, 
        "quote": "Originally posted by PhoenixDark: That was funny, I needed a good laugh!", 
        "reply": " Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 06:13:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave You'd risk termination of your aclu membership? I don't think you get the issues let alone the question. No American should risk his life to capture one of these guys. Fine, they surrender, the surrender is done in such a way, that we know he doesn't have a bomb strapped to his azz - I don't have a problem with taking them prisoner and treating them as the criminals they are. Ted Bundy wasn't tortured, he wasn't tortured, not BECAUSE of his civil rights, but because of OUR CIVIL RIGHTS - Our humanity. Capturing one of these terrorists in not worth a scratch on your hand. By all means, blow him away if he doesn't give up in a timely manner. And my ACLU membership is not in jeapordy by stating any of the above... Dave", 
        "intTime": 20090425, 
        "postID": 36, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: He was resisting arrest, or were you to hung up on his woody to notice? what woody dave? so as long as the terrorists resist capture we can tazer them for information? thanks for the clarification. I don't know about you, but if a terrorist resists arrest, I recomend blowing holes in them with an M16... Dave You'd risk termination of your aclu membership?", 
        "reply": " I don't think you get the issues let alone the question. No American should risk his life to capture one of these guys. Fine, they surrender, the surrender is done in such a way, that we know he doesn't have a bomb strapped to his azz - I don't have a problem with taking them prisoner and treating them as the criminals they are. Ted Bundy wasn't tortured, he wasn't tortured, not BECAUSE of his civil rights, but because of OUR CIVIL RIGHTS - Our humanity. Capturing one of these terrorists in not worth a scratch on your hand. By all means, blow him away if he doesn't give up in a timely manner. And my ACLU membership is not in jeapordy by stating any of the above... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 08:50:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Originally posted by PhoenixDark: That was funny, I needed a good laugh! Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding. Oh, I think you admire the guy... Dave", 
        "intTime": 20090425, 
        "postID": 37, 
        "quote": "Originally posted by FlankerFlyer: quote: Originally posted by PhoenixDark: That was funny, I needed a good laugh! Indeed, I wonder if this guy realizes that the chance to EVER have a physical relationship with a female or a male(unless he is a submissive \"bottom\"LOL) has been totally shattered. flabby, Out of shape, flat azz, no ding ding, and no brains. Then again, his portrayal of of the perfect liberal is outstanding.", 
        "reply": " Oh, I think you admire the guy... Dave", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 08:58:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity Now that chit was funny!! Almost as amusing as \"Don't tase me, bro!!\" These officers went out of their way to give this imbecile every chance in the world to comply with the law. He refused utterly and never stopped resisting the officers. Using a taser was the only option he left the officers with.", 
        "intTime": 20090425, 
        "postID": 38, 
        "quote": "Originally posted by crackerjacks61: \"http://www.huffingtonpost.com/2009/04/23/naked-wizard-tazered-at-c_n_190502.html\" ...this guy did deserve this. He had MANY chances. Thanks for remaining PROFESSIONAL Officers. You handled everything \"well done\". Full Nudity", 
        "reply": " Now that chit was funny!! Almost as amusing as \"Don't tase me, bro!!\" These officers went out of their way to give this imbecile every chance in the world to comply with the law. He refused utterly and never stopped resisting the officers. Using a taser was the only option he left the officers with.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 11:45:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****.", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too.", 
        "reply": " Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****.", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 12:48:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****. Yes he was and I agree with you 100% I can handle that type of law enforcement. Lucky they didn't sick the Police dog On him OMG!!netstat -a OUCH!!", 
        "intTime": 20090425, 
        "postID": 40, 
        "quote": "Originally posted by foxred03: quote: Originally posted by sgt_posty: I liked the girl near the end just screaming at the officers. I would like her parents address, I'm showing up in the same drunken condition and state of dress as the wizard for Thanksgiving dinner. I wonder if it will be OK then too. Agreed, in these tazer videos there are always outraged young people screaming at the cops to \"stoooop he's not doing anything wrong\". This guy was given every opportunity to stop being a jackass and was clearly high as ****.", 
        "reply": " Yes he was and I agree with you 100% I can handle that type of law enforcement. Lucky they didn't sick the Police dog On him OMG!!netstat -a OUCH!!", 
        "threadID": "672198221_5760086122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "A Tasering I Actually Agree With", 
        "userID": "crackerjacks61"
    }
]