[
    {
        "content": "RE: http://www.military.com/forums/0,15240,189936,00.html", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/forums/0,15240,189936,00.html", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 06:58:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "2571722"
    }, 
    {
        "content": "We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6.", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 07:00:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "2571722"
    }, 
    {
        "content": "quote: Originally posted by 2571722: We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6. You've posted a link, Your link says nothing to confirm this last statement. Your link does however say: quote: They also warned that harsh techniques cast into doubt the reliability of the information gleaned during the interrogation. \"A subject in extreme pain may provide an answer, any answer or many answers in order to get the pain to stop,\" the training officials said in their memo. The attachment also discussed the fact that using extreme physical and psychological coercion - with the word extreme underlined to differentiate from the methods used in survival training - would constitute torture. If ths method was so effective, then just why did they waterboard this one guy 83 times a month? Is it because they didn't believe what he told them? Did they believe the results from #83, as opposed to #1? And can you tell me Osama bin Laden is? Supposedly back around then we were supposed to momentarily get him. Could it be that the answers they got were, well, \"unreliable?\" But I tell you this, work, doesn't work, it's not for Americans to use. We hang people for using torture, and we hang them for good reason. Dave", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "Originally posted by 2571722: We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6.", 
        "reply": " You've posted a link, Your link says nothing to confirm this last statement. Your link does however say: quote: They also warned that harsh techniques cast into doubt the reliability of the information gleaned during the interrogation. \"A subject in extreme pain may provide an answer, any answer or many answers in order to get the pain to stop,\" the training officials said in their memo. The attachment also discussed the fact that using extreme physical and psychological coercion - with the word extreme underlined to differentiate from the methods used in survival training - would constitute torture. If ths method was so effective, then just why did they waterboard this one guy 83 times a month? Is it because they didn't believe what he told them? Did they believe the results from #83, as opposed to #1? And can you tell me Osama bin Laden is? Supposedly back around then we were supposed to momentarily get him. Could it be that the answers they got were, well, \"unreliable?\" But I tell you this, work, doesn't work, it's not for Americans to use. We hang people for using torture, and we hang them for good reason. Dave", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 07:35:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by 2571722: We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6. Already past the future", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "Originally posted by 2571722: We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6.", 
        "reply": " Already past the future", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 07:44:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "6486143"
    }, 
    {
        "content": "OK it's time to stop the finger pointing and hand wringing on the left, it only makes us look stupid.", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "", 
        "reply": "OK it's time to stop the finger pointing and hand wringing on the left, it only makes us look stupid.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 08:00:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "Airman716"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by 2571722: We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6. Dick Cheney says that torture worked to get actionable intelligence. Cheney has as much credibility as President Clinton, as far as the truth goes. Both are liars. ““FOR seven years I have remained silent about the false claims magnifying the effectiveness of the so-called enhanced interrogation techniques like waterboarding.” “There was no actionable intelligence gained from using enhanced interrogation techniques on Abu Zubaydah that wasn’t, or couldn’t have been, gained from regular tactics. In addition, I saw that using these alternative methods on other terrorists backfired on more than a few occasions — all of which are still classified. The short sightedness behind the use of these techniques ignored the unreliability of the methods, the nature of the threat, the mentality and modus operandi of the terrorists, and due process. Defenders of these techniques have claimed that they got Abu Zubaydah to give up information leading to the capture of Ramzi bin al-Shibh, a top aide to Khalid Shaikh Mohammed, and Mr. Padilla. This is false. The information that led to Mr. Shibh’s capture came primarily from a different terrorist operative who was interviewed using traditional methods. As for Mr. Padilla, the dates just don’t add up: the harsh techniques were approved in the memo of August 2002, Mr. Padilla had been arrested that May.” li Soufan was an F.B.I. supervisory special agent from 1997 to 2005. This is an op-ed from a military interrogator: “I should have felt triumphant when I returned from Iraq in August 2006. Instead, I was worried and exhausted. My team of interrogators had successfully hunted down one of the most notorious mass murderers of our generation, Abu Musab al-Zarqawi, the leader of al-Qaeda in Iraq and the mastermind of the campaign of suicide bombings that had helped plunge Iraq into civil war. But instead of celebrating our success, my mind was consumed with the unfinished business of our mission: fixing the deeply flawed, ineffective and un-American way the U.S. military conducts interrogations in Iraq. I'm still alarmed about that today. I'm not some ivory-tower type; I served for 14 years in the U.S. Air Force, began my career as a Special Operations pilot flying helicopters, saw combat in Bosnia and Kosovo, became an Air Force counterintelligence agent, then volunteered to go to Iraq to work as a senior interrogator. What I saw in Iraq still rattles me -- both because it betrays our traditions and because it just doesn't work.“ Matthew Alexander led an interrogations team assigned to a Special Operations task force in Iraq in 2006. He is the author of \"How to Break a Terrorist: The U.S.", 
        "intTime": 20090428, 
        "postID": 6, 
        "quote": "Originally posted by 6486143: quote: Originally posted by 2571722: We water-boarded all of three AQ's and they gave up the second tier of AQ. Obama needs to get his head out of his 6.", 
        "reply": " Dick Cheney says that torture worked to get actionable intelligence. Cheney has as much credibility as President Clinton, as far as the truth goes. Both are liars. ““FOR seven years I have remained silent about the false claims magnifying the effectiveness of the so-called enhanced interrogation techniques like waterboarding.” “There was no actionable intelligence gained from using enhanced interrogation techniques on Abu Zubaydah that wasn’t, or couldn’t have been, gained from regular tactics. In addition, I saw that using these alternative methods on other terrorists backfired on more than a few occasions — all of which are still classified. The short sightedness behind the use of these techniques ignored the unreliability of the methods, the nature of the threat, the mentality and modus operandi of the terrorists, and due process. Defenders of these techniques have claimed that they got Abu Zubaydah to give up information leading to the capture of Ramzi bin al-Shibh, a top aide to Khalid Shaikh Mohammed, and Mr. Padilla. This is false. The information that led to Mr. Shibh’s capture came primarily from a different terrorist operative who was interviewed using traditional methods. As for Mr. Padilla, the dates just don’t add up: the harsh techniques were approved in the memo of August 2002, Mr. Padilla had been arrested that May.” li Soufan was an F.B.I. supervisory special agent from 1997 to 2005. This is an op-ed from a military interrogator: “I should have felt triumphant when I returned from Iraq in August 2006. Instead, I was worried and exhausted. My team of interrogators had successfully hunted down one of the most notorious mass murderers of our generation, Abu Musab al-Zarqawi, the leader of al-Qaeda in Iraq and the mastermind of the campaign of suicide bombings that had helped plunge Iraq into civil war. But instead of celebrating our success, my mind was consumed with the unfinished business of our mission: fixing the deeply flawed, ineffective and un-American way the U.S. military conducts interrogations in Iraq. I'm still alarmed about that today. I'm not some ivory-tower type; I served for 14 years in the U.S. Air Force, began my career as a Special Operations pilot flying helicopters, saw combat in Bosnia and Kosovo, became an Air Force counterintelligence agent, then volunteered to go to Iraq to work as a senior interrogator. What I saw in Iraq still rattles me -- both because it betrays our traditions and because it just doesn't work.“ Matthew Alexander led an interrogations team assigned to a Special Operations task force in Iraq in 2006. He is the author of \"How to Break a Terrorist: The U.S.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 08:18:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "xerello"
    }, 
    {
        "content": "We first took an oath to defend the constitution of the United States - not an oath to break the law. Then we were taught that the Uniform Code of Military Justice and the Geneva Convention forbid torture. That oath taken is an affirmation that lives forever. Breaking it is not an option. The law will prevail, reguardless of all the spin.", 
        "intTime": 20090428, 
        "postID": 7, 
        "quote": "", 
        "reply": "We first took an oath to defend the constitution of the United States - not an oath to break the law. Then we were taught that the Uniform Code of Military Justice and the Geneva Convention forbid torture. That oath taken is an affirmation that lives forever. Breaking it is not an option. The law will prevail, reguardless of all the spin.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 08:27:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "markswf"
    }, 
    {
        "content": "quote: Originally posted by markswf: We first took an oath to defend the constitution of the United States - not an oath to break the law. Then we were taught that the Uniform Code of Military Justice and the Geneva Convention forbid torture. That oath taken is an affirmation that lives forever. Breaking it is not an option. The law will prevail, reguardless of all the spin. How very true. What MOST of these Torture supporters FAIL to realize is no, AQ or Ali Bamboo may not fall under the constitution. BUT ALL AMERICANS DO and can not break that constition.", 
        "intTime": 20090428, 
        "postID": 8, 
        "quote": "Originally posted by markswf: We first took an oath to defend the constitution of the United States - not an oath to break the law. Then we were taught that the Uniform Code of Military Justice and the Geneva Convention forbid torture. That oath taken is an affirmation that lives forever. Breaking it is not an option. The law will prevail, reguardless of all the spin.", 
        "reply": " How very true. What MOST of these Torture supporters FAIL to realize is no, AQ or Ali Bamboo may not fall under the constitution. BUT ALL AMERICANS DO and can not break that constition.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-28 14:58:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This isn't torture...for crying out loud...c'mon people, these mindless slaves of islam and dying of thirst in the desert, why, we are just providing them with an advanced american watering technique. If you want to toture them, rub pork lard all over them.", 
        "intTime": 20090429, 
        "postID": 9, 
        "quote": "", 
        "reply": "This isn't torture...for crying out loud...c'mon people, these mindless slaves of islam and dying of thirst in the desert, why, we are just providing them with an advanced american watering technique. If you want to toture them, rub pork lard all over them.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-29 05:37:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "SpaceHauk"
    }, 
    {
        "content": "quote: Originally posted by SpaceHauk: This isn't torture...for crying out loud...c'mon people, these mindless slaves of islam and dying of thirst in the desert, why, we are just providing them with an advanced american watering technique. If you want to toture them, rub pork lard all over them. Already past the future", 
        "intTime": 20090429, 
        "postID": 10, 
        "quote": "Originally posted by SpaceHauk: This isn't torture...for crying out loud...c'mon people, these mindless slaves of islam and dying of thirst in the desert, why, we are just providing them with an advanced american watering technique. If you want to toture them, rub pork lard all over them.", 
        "reply": " Already past the future", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-29 12:07:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "6486143"
    }, 
    {
        "content": "Right or wrong it is not for the dems to bring this out to comfert our enemys. As the subject was brought up in 2002 and all knoew what was coming it a crime that the dems can sit and lie about it all. It shows you what we have in washington. What we did to get info from these creeps is so tame as to what any of our people had to go through when in their hands is no way near. If you want to be goody goody with them then pull everyone home and start kissing their butts. Maybe the dems will be happy then. Mostly Obama.", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "", 
        "reply": "Right or wrong it is not for the dems to bring this out to comfert our enemys. As the subject was brought up in 2002 and all knoew what was coming it a crime that the dems can sit and lie about it all. It shows you what we have in washington. What we did to get info from these creeps is so tame as to what any of our people had to go through when in their hands is no way near. If you want to be goody goody with them then pull everyone home and start kissing their butts. Maybe the dems will be happy then. Mostly Obama.", 
        "threadID": "672198221_8060059122001", 
        "time": "2009-04-30 07:33:00", 
        "title": "Inside Accounts of Interrogation Approval Differ", 
        "userID": "vetbill"
    }
]