[
    {
        "content": "From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "intTime": 20090302,
        "postID": 1,
        "quote": "",
        "reply": "From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 11:10:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\" Checked Free Republic and they are already ticked off at Steele take a look at tis choice quote: \"http://www.freerepublic.com/focus/bloggers/2196657/posts?q=1&;page=1\" quote: Steele really disappointed me in his comments. I wonder if he is revealing his deep hidden allegiance to obuma’s skin in the game loyalty of race????? Rush’s comments were clear, consise and to the point. Rush said what the Repubs are too, scared to say \"the truth.\" In summation, steele is just \"another got skin in da game rino brother.\" I suspect by the end of the week Steele will be genuflecting at the alter of Rushbo with a huge mea culpa. Update: Steele may be in HUGE trouble cause Rush when asked about Steele's attack said this: \"http://www.politico.com/news/stories/0309/19498.html\" quote: I’ll handle it on the radio Daddy just pulled out the belt and he's heading to the wood shed! Update: \"http://theplumline.whorunsgov.com/rush-limbaughs-rant-attacking-rnc-chair-michael-steele/\" And Daddy whipped him but Good!!!!!: quote: Yes, said Michael Steele, the chairman of the Republican National Committee, I’m incendiary, and yes, it’s ugly. Michael Steele, you are head of the RNC. You are not head of the Republican Party. Tens of millions of conservatives and Republicans have nothing to do with the RNC and right now they want nothing to do with it, and when you call them, asking them for money, they hang up on you. I hope that changes. I hope the RNC will get its act together… It seems to me that it’s Michael Steele who is off to a shaky start…. Now, Mr. Steele, if it is your position as the chairman of the Republican National Committee that you want a left wing Democrat president and a left wing Democrat Congress to succeed in advancing their agenda, if it’s your position that you want President Obama and Speaker Pelosi and Senate leader Harry Reid to succeed with their massive spending and taxing and nationalization plans, I think you have some explaining to do. Why are you running the Republican Party? Why do you claim you lead the Republican Party when you seem obsessed with seeing to it that President Obama succeeds? I frankly am stunned that the chairman of the Republican National Committee endorses such an agenda… Ouch! And thats not the worst of it cause you know his listeners are just gonna pile on...Steeel best get on that phone and called Daddy RIGHT NOW and apologize. This is Rush's party now! Your just..just....the lawn jockey in front of the GOP's house that Rush owns. (By the way if he was white I say the same thing. My point is whoever is head of the RNC is just a figure head. Rush rules) This message has been edited. Last edited by: spanner69, Mon 02 March 2009 01:43 PM",
        "intTime": 20090302,
        "postID": 2,
        "quote": "Originally posted by mcgreer: From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "reply": " Checked Free Republic and they are already ticked off at Steele take a look at tis choice quote: \"http://www.freerepublic.com/focus/bloggers/2196657/posts?q=1&;page=1\" quote: Steele really disappointed me in his comments. I wonder if he is revealing his deep hidden allegiance to obuma’s skin in the game loyalty of race????? Rush’s comments were clear, consise and to the point. Rush said what the Repubs are too, scared to say \"the truth.\" In summation, steele is just \"another got skin in da game rino brother.\" I suspect by the end of the week Steele will be genuflecting at the alter of Rushbo with a huge mea culpa. Update: Steele may be in HUGE trouble cause Rush when asked about Steele's attack said this: \"http://www.politico.com/news/stories/0309/19498.html\" quote: I’ll handle it on the radio Daddy just pulled out the belt and he's heading to the wood shed! Update: \"http://theplumline.whorunsgov.com/rush-limbaughs-rant-attacking-rnc-chair-michael-steele/\" And Daddy whipped him but Good!!!!!: quote: Yes, said Michael Steele, the chairman of the Republican National Committee, I’m incendiary, and yes, it’s ugly. Michael Steele, you are head of the RNC. You are not head of the Republican Party. Tens of millions of conservatives and Republicans have nothing to do with the RNC and right now they want nothing to do with it, and when you call them, asking them for money, they hang up on you. I hope that changes. I hope the RNC will get its act together… It seems to me that it’s Michael Steele who is off to a shaky start…. Now, Mr. Steele, if it is your position as the chairman of the Republican National Committee that you want a left wing Democrat president and a left wing Democrat Congress to succeed in advancing their agenda, if it’s your position that you want President Obama and Speaker Pelosi and Senate leader Harry Reid to succeed with their massive spending and taxing and nationalization plans, I think you have some explaining to do. Why are you running the Republican Party? Why do you claim you lead the Republican Party when you seem obsessed with seeing to it that President Obama succeeds? I frankly am stunned that the chairman of the Republican National Committee endorses such an agenda… Ouch! And thats not the worst of it cause you know his listeners are just gonna pile on...Steeel best get on that phone and called Daddy RIGHT NOW and apologize. This is Rush's party now! Your just..just....the lawn jockey in front of the GOP's house that Rush owns. (By the way if he was white I say the same thing. My point is whoever is head of the RNC is just a figure head. Rush rules) This message has been edited. Last edited by: spanner69, Mon 02 March 2009 01:43 PM",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:40:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "Or hanged in effigy somewhere...! LOL",
        "intTime": 20090302,
        "postID": 3,
        "quote": "",
        "reply": "Or hanged in effigy somewhere...! LOL",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:41:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "intTime": 20090302,
        "postID": 4,
        "quote": "Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL",
        "reply": " Shortest tenure as GOP chair in history maybe?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:50:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "But is not Limbaugh's brand of unthinking, knee-jerk conservatism one of the things that put \"floating voters\" off the Republicans in your last election?",
        "intTime": 20090302,
        "postID": 5,
        "quote": "",
        "reply": "But is not Limbaugh's brand of unthinking, knee-jerk conservatism one of the things that put \"floating voters\" off the Republicans in your last election?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 14:22:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "Bladensburg"
    },
    {
        "content": "Well well well, say it aint so Joe. I may like this new RNC afterall, maybe he is differnet, we'll see I'm not holding my breath though. Getting ready for round two too vote Dem as soon as you guys start pushing a Rep product that is just another politician. Mit Romney and Sarah Palin are a couple of thems, you guys want to back someone good that will really change this nation put in Mike Huckabee or Ron Paul or simular. Other than that, it's dem all the way for me. Just a friendly heads up",
        "intTime": 20090302,
        "postID": 6,
        "quote": "",
        "reply": "Well well well, say it aint so Joe. I may like this new RNC afterall, maybe he is differnet, we'll see I'm not holding my breath though. Getting ready for round two too vote Dem as soon as you guys start pushing a Rep product that is just another politician. Mit Romney and Sarah Palin are a couple of thems, you guys want to back someone good that will really change this nation put in Mike Huckabee or Ron Paul or simular. Other than that, it's dem all the way for me. Just a friendly heads up",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 14:37:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "crackerjacks61"
    },
    {
        "content": "Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "intTime": 20090302,
        "postID": 7,
        "quote": "s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary.",
        "reply": "Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is  According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:25:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "quote: Originally posted by spanner69: Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party. COMMENT: If genuine Republicans and conservatives actually kowtow to Limbaugh and regard him as their political \"spiritual leader,\" then the Party will collectively be the most smugly entertained but politically out-of-power group for the foreseeable future.",
        "intTime": 20090302,
        "postID": 8,
        "quote": "Originally posted by spanner69: Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "reply": " COMMENT: If genuine Republicans and conservatives actually kowtow to Limbaugh and regard him as their political \"spiritual leader,\" then the Party will collectively be the most smugly entertained but politically out-of-power group for the foreseeable future.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:40:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "intTime": 20090302,
        "postID": 9,
        "quote": "",
        "reply": "I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:48:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "intTime": 20090302,
        "postID": 10,
        "quote": "",
        "reply": "And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:52:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "intTime": 20090302,
        "postID": 11,
        "quote": "Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "reply": " COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:00:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "quote: Originally posted by stosh301: I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph.. Keith is a libturd lackey!",
        "intTime": 20090302,
        "postID": 12,
        "quote": "Originally posted by stosh301: I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "reply": " Keith is a libturd lackey!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:01:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "intTime": 20090302,
        "postID": 13,
        "quote": "Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "reply": " Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:07:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "The latest on Limbaugh: \"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"",
        "intTime": 20090302,
        "postID": 14,
        "quote": "",
        "reply": "The latest on Limbaugh: \"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:10:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\" COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "intTime": 20090302,
        "postID": 15,
        "quote": "Originally posted by mcgreer: quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "reply": " COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:18:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "intTime": 20090302,
        "postID": 16,
        "quote": "Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "reply": " No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:28:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here! Got a hot date down at the Jigger...So gotta Go!!!",
        "intTime": 20090302,
        "postID": 17,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "reply": " Got a hot date down at the Jigger...So gotta Go!!!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:28:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes. I never seen Limbaugh's birth cert but I have seen the president's was posted on his site. Also fact Check.org checked it and the Hawaii paper posted his birth annoucement back in 63 when he was born. So i'm not quite sure what your insinuating that since Rush never posted his Birth cert he may not actually be an American born citizen. Possible but only the most dense idiot would doubt Limbaugh like the President are native born americans. I mean only a compelete and utter fool would doubt Limbaugh and Obama are not US born citizens.",
        "intTime": 20090302,
        "postID": 18,
        "quote": "Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "reply": " I never seen Limbaugh's birth cert but I have seen the president's was posted on his site. Also fact Check.org checked it and the Hawaii paper posted his birth annoucement back in 63 when he was born. So i'm not quite sure what your insinuating that since Rush never posted his Birth cert he may not actually be an American born citizen. Possible but only the most dense idiot would doubt Limbaugh like the President are native born americans. I mean only a compelete and utter fool would doubt Limbaugh and Obama are not US born citizens.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:45:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? This quote from one of your links is hysterically funny when you consider Limbaughs primary message to his followers... quote: “I hope the RNC chairman will realize he’s not a talking head pundit, that he is supposed to be working on the grassroots and rebuilding it and maybe doing something about our open primary system and fixing it so that Democrats don’t nominate our candidates,” Limbaugh said, his voice rising. This from the guy who told all his ditto heads to vote for Hillary? Did it on every one of his shows. Man, his hypocrisy knows no limits. Dave",
        "intTime": 20090302,
        "postID": 19,
        "quote": "Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "reply": " This quote from one of your links is hysterically funny when you consider Limbaughs primary message to his followers... quote: “I hope the RNC chairman will realize he’s not a talking head pundit, that he is supposed to be working on the grassroots and rebuilding it and maybe doing something about our open primary system and fixing it so that Democrats don’t nominate our candidates,” Limbaugh said, his voice rising. This from the guy who told all his ditto heads to vote for Hillary? Did it on every one of his shows. Man, his hypocrisy knows no limits. Dave",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 17:03:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes. LOL Surely you don't think that Limbaugh enjoys the support of all conservatives...? He probably doesn't even have the majority.",
        "intTime": 20090302,
        "postID": 20,
        "quote": "Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "reply": " LOL Surely you don't think that Limbaugh enjoys the support of all conservatives...? He probably doesn't even have the majority.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 17:13:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "intTime": 20090302,
        "postID": 21,
        "quote": "",
        "reply": "From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 11:10:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\" Checked Free Republic and they are already ticked off at Steele take a look at tis choice quote: \"http://www.freerepublic.com/focus/bloggers/2196657/posts?q=1&;page=1\" quote: Steele really disappointed me in his comments. I wonder if he is revealing his deep hidden allegiance to obuma’s skin in the game loyalty of race????? Rush’s comments were clear, consise and to the point. Rush said what the Repubs are too, scared to say \"the truth.\" In summation, steele is just \"another got skin in da game rino brother.\" I suspect by the end of the week Steele will be genuflecting at the alter of Rushbo with a huge mea culpa. Update: Steele may be in HUGE trouble cause Rush when asked about Steele's attack said this: \"http://www.politico.com/news/stories/0309/19498.html\" quote: I’ll handle it on the radio Daddy just pulled out the belt and he's heading to the wood shed! Update: \"http://theplumline.whorunsgov.com/rush-limbaughs-rant-attacking-rnc-chair-michael-steele/\" And Daddy whipped him but Good!!!!!: quote: Yes, said Michael Steele, the chairman of the Republican National Committee, I’m incendiary, and yes, it’s ugly. Michael Steele, you are head of the RNC. You are not head of the Republican Party. Tens of millions of conservatives and Republicans have nothing to do with the RNC and right now they want nothing to do with it, and when you call them, asking them for money, they hang up on you. I hope that changes. I hope the RNC will get its act together… It seems to me that it’s Michael Steele who is off to a shaky start…. Now, Mr. Steele, if it is your position as the chairman of the Republican National Committee that you want a left wing Democrat president and a left wing Democrat Congress to succeed in advancing their agenda, if it’s your position that you want President Obama and Speaker Pelosi and Senate leader Harry Reid to succeed with their massive spending and taxing and nationalization plans, I think you have some explaining to do. Why are you running the Republican Party? Why do you claim you lead the Republican Party when you seem obsessed with seeing to it that President Obama succeeds? I frankly am stunned that the chairman of the Republican National Committee endorses such an agenda… Ouch! And thats not the worst of it cause you know his listeners are just gonna pile on...Steeel best get on that phone and called Daddy RIGHT NOW and apologize. This is Rush's party now! Your just..just....the lawn jockey in front of the GOP's house that Rush owns. (By the way if he was white I say the same thing. My point is whoever is head of the RNC is just a figure head. Rush rules) This message has been edited. Last edited by: spanner69, Mon 02 March 2009 01:43 PM",
        "intTime": 20090302,
        "postID": 22,
        "quote": "Originally posted by mcgreer: From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "reply": " Checked Free Republic and they are already ticked off at Steele take a look at tis choice quote: \"http://www.freerepublic.com/focus/bloggers/2196657/posts?q=1&;page=1\" quote: Steele really disappointed me in his comments. I wonder if he is revealing his deep hidden allegiance to obuma’s skin in the game loyalty of race????? Rush’s comments were clear, consise and to the point. Rush said what the Repubs are too, scared to say \"the truth.\" In summation, steele is just \"another got skin in da game rino brother.\" I suspect by the end of the week Steele will be genuflecting at the alter of Rushbo with a huge mea culpa. Update: Steele may be in HUGE trouble cause Rush when asked about Steele's attack said this: \"http://www.politico.com/news/stories/0309/19498.html\" quote: I’ll handle it on the radio Daddy just pulled out the belt and he's heading to the wood shed! Update: \"http://theplumline.whorunsgov.com/rush-limbaughs-rant-attacking-rnc-chair-michael-steele/\" And Daddy whipped him but Good!!!!!: quote: Yes, said Michael Steele, the chairman of the Republican National Committee, I’m incendiary, and yes, it’s ugly. Michael Steele, you are head of the RNC. You are not head of the Republican Party. Tens of millions of conservatives and Republicans have nothing to do with the RNC and right now they want nothing to do with it, and when you call them, asking them for money, they hang up on you. I hope that changes. I hope the RNC will get its act together… It seems to me that it’s Michael Steele who is off to a shaky start…. Now, Mr. Steele, if it is your position as the chairman of the Republican National Committee that you want a left wing Democrat president and a left wing Democrat Congress to succeed in advancing their agenda, if it’s your position that you want President Obama and Speaker Pelosi and Senate leader Harry Reid to succeed with their massive spending and taxing and nationalization plans, I think you have some explaining to do. Why are you running the Republican Party? Why do you claim you lead the Republican Party when you seem obsessed with seeing to it that President Obama succeeds? I frankly am stunned that the chairman of the Republican National Committee endorses such an agenda… Ouch! And thats not the worst of it cause you know his listeners are just gonna pile on...Steeel best get on that phone and called Daddy RIGHT NOW and apologize. This is Rush's party now! Your just..just....the lawn jockey in front of the GOP's house that Rush owns. (By the way if he was white I say the same thing. My point is whoever is head of the RNC is just a figure head. Rush rules) This message has been edited. Last edited by: spanner69, Mon 02 March 2009 01:43 PM",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:40:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "Or hanged in effigy somewhere...! LOL",
        "intTime": 20090302,
        "postID": 23,
        "quote": "",
        "reply": "Or hanged in effigy somewhere...! LOL",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:41:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "intTime": 20090302,
        "postID": 24,
        "quote": "Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL",
        "reply": " Shortest tenure as GOP chair in history maybe?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:50:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "But is not Limbaugh's brand of unthinking, knee-jerk conservatism one of the things that put \"floating voters\" off the Republicans in your last election?",
        "intTime": 20090302,
        "postID": 25,
        "quote": "",
        "reply": "But is not Limbaugh's brand of unthinking, knee-jerk conservatism one of the things that put \"floating voters\" off the Republicans in your last election?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 14:22:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "Bladensburg"
    },
    {
        "content": "Well well well, say it aint so Joe. I may like this new RNC afterall, maybe he is differnet, we'll see I'm not holding my breath though. Getting ready for round two too vote Dem as soon as you guys start pushing a Rep product that is just another politician. Mit Romney and Sarah Palin are a couple of thems, you guys want to back someone good that will really change this nation put in Mike Huckabee or Ron Paul or simular. Other than that, it's dem all the way for me. Just a friendly heads up",
        "intTime": 20090302,
        "postID": 26,
        "quote": "",
        "reply": "Well well well, say it aint so Joe. I may like this new RNC afterall, maybe he is differnet, we'll see I'm not holding my breath though. Getting ready for round two too vote Dem as soon as you guys start pushing a Rep product that is just another politician. Mit Romney and Sarah Palin are a couple of thems, you guys want to back someone good that will really change this nation put in Mike Huckabee or Ron Paul or simular. Other than that, it's dem all the way for me. Just a friendly heads up",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 14:37:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "crackerjacks61"
    },
    {
        "content": "Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "intTime": 20090302,
        "postID": 27,
        "quote": "s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary.",
        "reply": "Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is  According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:25:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "quote: Originally posted by spanner69: Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party. COMMENT: If genuine Republicans and conservatives actually kowtow to Limbaugh and regard him as their political \"spiritual leader,\" then the Party will collectively be the most smugly entertained but politically out-of-power group for the foreseeable future.",
        "intTime": 20090302,
        "postID": 28,
        "quote": "Originally posted by spanner69: Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "reply": " COMMENT: If genuine Republicans and conservatives actually kowtow to Limbaugh and regard him as their political \"spiritual leader,\" then the Party will collectively be the most smugly entertained but politically out-of-power group for the foreseeable future.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:40:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "intTime": 20090302,
        "postID": 29,
        "quote": "",
        "reply": "I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:48:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "intTime": 20090302,
        "postID": 30,
        "quote": "",
        "reply": "And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:52:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "intTime": 20090302,
        "postID": 31,
        "quote": "Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "reply": " COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:00:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "quote: Originally posted by stosh301: I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph.. Keith is a libturd lackey!",
        "intTime": 20090302,
        "postID": 32,
        "quote": "Originally posted by stosh301: I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "reply": " Keith is a libturd lackey!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:01:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "intTime": 20090302,
        "postID": 33,
        "quote": "Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "reply": " Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:07:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "The latest on Limbaugh: \"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"",
        "intTime": 20090302,
        "postID": 34,
        "quote": "",
        "reply": "The latest on Limbaugh: \"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:10:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\" COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "intTime": 20090302,
        "postID": 35,
        "quote": "Originally posted by mcgreer: quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "reply": " COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:18:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "intTime": 20090302,
        "postID": 36,
        "quote": "Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "reply": " No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:28:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here! Got a hot date down at the Jigger...So gotta Go!!!",
        "intTime": 20090302,
        "postID": 37,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "reply": " Got a hot date down at the Jigger...So gotta Go!!!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:28:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes. I never seen Limbaugh's birth cert but I have seen the president's was posted on his site. Also fact Check.org checked it and the Hawaii paper posted his birth annoucement back in 63 when he was born. So i'm not quite sure what your insinuating that since Rush never posted his Birth cert he may not actually be an American born citizen. Possible but only the most dense idiot would doubt Limbaugh like the President are native born americans. I mean only a compelete and utter fool would doubt Limbaugh and Obama are not US born citizens.",
        "intTime": 20090302,
        "postID": 38,
        "quote": "Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "reply": " I never seen Limbaugh's birth cert but I have seen the president's was posted on his site. Also fact Check.org checked it and the Hawaii paper posted his birth annoucement back in 63 when he was born. So i'm not quite sure what your insinuating that since Rush never posted his Birth cert he may not actually be an American born citizen. Possible but only the most dense idiot would doubt Limbaugh like the President are native born americans. I mean only a compelete and utter fool would doubt Limbaugh and Obama are not US born citizens.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:45:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? This quote from one of your links is hysterically funny when you consider Limbaughs primary message to his followers... quote: “I hope the RNC chairman will realize he’s not a talking head pundit, that he is supposed to be working on the grassroots and rebuilding it and maybe doing something about our open primary system and fixing it so that Democrats don’t nominate our candidates,” Limbaugh said, his voice rising. This from the guy who told all his ditto heads to vote for Hillary? Did it on every one of his shows. Man, his hypocrisy knows no limits. Dave",
        "intTime": 20090302,
        "postID": 39,
        "quote": "Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "reply": " This quote from one of your links is hysterically funny when you consider Limbaughs primary message to his followers... quote: “I hope the RNC chairman will realize he’s not a talking head pundit, that he is supposed to be working on the grassroots and rebuilding it and maybe doing something about our open primary system and fixing it so that Democrats don’t nominate our candidates,” Limbaugh said, his voice rising. This from the guy who told all his ditto heads to vote for Hillary? Did it on every one of his shows. Man, his hypocrisy knows no limits. Dave",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 17:03:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes. LOL Surely you don't think that Limbaugh enjoys the support of all conservatives...? He probably doesn't even have the majority.",
        "intTime": 20090302,
        "postID": 40,
        "quote": "Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "reply": " LOL Surely you don't think that Limbaugh enjoys the support of all conservatives...? He probably doesn't even have the majority.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 17:13:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "intTime": 20090302,
        "postID": 41,
        "quote": "",
        "reply": "From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 11:10:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\" Checked Free Republic and they are already ticked off at Steele take a look at tis choice quote: \"http://www.freerepublic.com/focus/bloggers/2196657/posts?q=1&;page=1\" quote: Steele really disappointed me in his comments. I wonder if he is revealing his deep hidden allegiance to obuma’s skin in the game loyalty of race????? Rush’s comments were clear, consise and to the point. Rush said what the Repubs are too, scared to say \"the truth.\" In summation, steele is just \"another got skin in da game rino brother.\" I suspect by the end of the week Steele will be genuflecting at the alter of Rushbo with a huge mea culpa. Update: Steele may be in HUGE trouble cause Rush when asked about Steele's attack said this: \"http://www.politico.com/news/stories/0309/19498.html\" quote: I’ll handle it on the radio Daddy just pulled out the belt and he's heading to the wood shed! Update: \"http://theplumline.whorunsgov.com/rush-limbaughs-rant-attacking-rnc-chair-michael-steele/\" And Daddy whipped him but Good!!!!!: quote: Yes, said Michael Steele, the chairman of the Republican National Committee, I’m incendiary, and yes, it’s ugly. Michael Steele, you are head of the RNC. You are not head of the Republican Party. Tens of millions of conservatives and Republicans have nothing to do with the RNC and right now they want nothing to do with it, and when you call them, asking them for money, they hang up on you. I hope that changes. I hope the RNC will get its act together… It seems to me that it’s Michael Steele who is off to a shaky start…. Now, Mr. Steele, if it is your position as the chairman of the Republican National Committee that you want a left wing Democrat president and a left wing Democrat Congress to succeed in advancing their agenda, if it’s your position that you want President Obama and Speaker Pelosi and Senate leader Harry Reid to succeed with their massive spending and taxing and nationalization plans, I think you have some explaining to do. Why are you running the Republican Party? Why do you claim you lead the Republican Party when you seem obsessed with seeing to it that President Obama succeeds? I frankly am stunned that the chairman of the Republican National Committee endorses such an agenda… Ouch! And thats not the worst of it cause you know his listeners are just gonna pile on...Steeel best get on that phone and called Daddy RIGHT NOW and apologize. This is Rush's party now! Your just..just....the lawn jockey in front of the GOP's house that Rush owns. (By the way if he was white I say the same thing. My point is whoever is head of the RNC is just a figure head. Rush rules) This message has been edited. Last edited by: spanner69, Mon 02 March 2009 01:43 PM",
        "intTime": 20090302,
        "postID": 42,
        "quote": "Originally posted by mcgreer: From Politico: On the same night he was offering the keynote address to the Conservative Political Action Conference, Rush Limbaugh drew criticism from an unlikely source: Republican National Committee Chairman Michael Steele. In a little-noticed interview Saturday night, Steele dismissed Limbaugh as an “entertainer” whose show is “incendiary” and “ugly.” Steele’s criticism makes him the highest-ranking Republican to pick a fight with the popular and polarizing conservative talk show host. But the new RNC chairman’s extraordinary comments won’t sit well with the millions of conservative listeners Limbaugh draws each week, and Steele aides scrambled to limit the damage Monday morning by trying to change the subject... Limbaugh, asked to respond, said he’d save his counter-attack for his listeners. “I’ll handle it on the radio,” he wrote in an e-mail. In an interview on CNN with D.L. Hughley, Steele assured that he, not Limbaugh, was in charge of the party before saying that he wanted to put the right-wing talker “into context.” “Rush Limbaugh is an entertainer,” Steele said. “Rush Limbaugh, his whole thing is entertainment. Yes it’s incendiary, yes it’s ugly...” \"http://www.politico.com/news/stories/0309/19498.html\"",
        "reply": " Checked Free Republic and they are already ticked off at Steele take a look at tis choice quote: \"http://www.freerepublic.com/focus/bloggers/2196657/posts?q=1&;page=1\" quote: Steele really disappointed me in his comments. I wonder if he is revealing his deep hidden allegiance to obuma’s skin in the game loyalty of race????? Rush’s comments were clear, consise and to the point. Rush said what the Repubs are too, scared to say \"the truth.\" In summation, steele is just \"another got skin in da game rino brother.\" I suspect by the end of the week Steele will be genuflecting at the alter of Rushbo with a huge mea culpa. Update: Steele may be in HUGE trouble cause Rush when asked about Steele's attack said this: \"http://www.politico.com/news/stories/0309/19498.html\" quote: I’ll handle it on the radio Daddy just pulled out the belt and he's heading to the wood shed! Update: \"http://theplumline.whorunsgov.com/rush-limbaughs-rant-attacking-rnc-chair-michael-steele/\" And Daddy whipped him but Good!!!!!: quote: Yes, said Michael Steele, the chairman of the Republican National Committee, I’m incendiary, and yes, it’s ugly. Michael Steele, you are head of the RNC. You are not head of the Republican Party. Tens of millions of conservatives and Republicans have nothing to do with the RNC and right now they want nothing to do with it, and when you call them, asking them for money, they hang up on you. I hope that changes. I hope the RNC will get its act together… It seems to me that it’s Michael Steele who is off to a shaky start…. Now, Mr. Steele, if it is your position as the chairman of the Republican National Committee that you want a left wing Democrat president and a left wing Democrat Congress to succeed in advancing their agenda, if it’s your position that you want President Obama and Speaker Pelosi and Senate leader Harry Reid to succeed with their massive spending and taxing and nationalization plans, I think you have some explaining to do. Why are you running the Republican Party? Why do you claim you lead the Republican Party when you seem obsessed with seeing to it that President Obama succeeds? I frankly am stunned that the chairman of the Republican National Committee endorses such an agenda… Ouch! And thats not the worst of it cause you know his listeners are just gonna pile on...Steeel best get on that phone and called Daddy RIGHT NOW and apologize. This is Rush's party now! Your just..just....the lawn jockey in front of the GOP's house that Rush owns. (By the way if he was white I say the same thing. My point is whoever is head of the RNC is just a figure head. Rush rules) This message has been edited. Last edited by: spanner69, Mon 02 March 2009 01:43 PM",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:40:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "Or hanged in effigy somewhere...! LOL",
        "intTime": 20090302,
        "postID": 43,
        "quote": "",
        "reply": "Or hanged in effigy somewhere...! LOL",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:41:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "intTime": 20090302,
        "postID": 44,
        "quote": "Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL",
        "reply": " Shortest tenure as GOP chair in history maybe?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 12:50:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "But is not Limbaugh's brand of unthinking, knee-jerk conservatism one of the things that put \"floating voters\" off the Republicans in your last election?",
        "intTime": 20090302,
        "postID": 45,
        "quote": "",
        "reply": "But is not Limbaugh's brand of unthinking, knee-jerk conservatism one of the things that put \"floating voters\" off the Republicans in your last election?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 14:22:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "Bladensburg"
    },
    {
        "content": "Well well well, say it aint so Joe. I may like this new RNC afterall, maybe he is differnet, we'll see I'm not holding my breath though. Getting ready for round two too vote Dem as soon as you guys start pushing a Rep product that is just another politician. Mit Romney and Sarah Palin are a couple of thems, you guys want to back someone good that will really change this nation put in Mike Huckabee or Ron Paul or simular. Other than that, it's dem all the way for me. Just a friendly heads up",
        "intTime": 20090302,
        "postID": 46,
        "quote": "",
        "reply": "Well well well, say it aint so Joe. I may like this new RNC afterall, maybe he is differnet, we'll see I'm not holding my breath though. Getting ready for round two too vote Dem as soon as you guys start pushing a Rep product that is just another politician. Mit Romney and Sarah Palin are a couple of thems, you guys want to back someone good that will really change this nation put in Mike Huckabee or Ron Paul or simular. Other than that, it's dem all the way for me. Just a friendly heads up",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 14:37:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "crackerjacks61"
    },
    {
        "content": "Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "intTime": 20090302,
        "postID": 47,
        "quote": "s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary.",
        "reply": "Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is  According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:25:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "quote: Originally posted by spanner69: Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party. COMMENT: If genuine Republicans and conservatives actually kowtow to Limbaugh and regard him as their political \"spiritual leader,\" then the Party will collectively be the most smugly entertained but politically out-of-power group for the foreseeable future.",
        "intTime": 20090302,
        "postID": 48,
        "quote": "Originally posted by spanner69: Didnt take long for \"Chairman\" Steele to chnage his mind about Daddy Limbaugh according to Doug Heye a GOP strtegist who spoke with \"Chairman\" Steele. He's has now FOUND GOD and no longer feels Daddy Limbaugh is quote: s an entertainer. His whole thing is entertainment. Yes, it's ugly. Yes, it's incendiary. According to Faye, \"Chairman\" Steele now holds DADDY Limbaugh: quote: in great esteem, respects him as a conservative leader for the party and what he’s done. WOW!! Not even 24 hours before Steele had to get on his knees and kiss his Daddy's foot. I give Limbaugh credit he knows how to control a party.",
        "reply": " COMMENT: If genuine Republicans and conservatives actually kowtow to Limbaugh and regard him as their political \"spiritual leader,\" then the Party will collectively be the most smugly entertained but politically out-of-power group for the foreseeable future.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:40:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "intTime": 20090302,
        "postID": 49,
        "quote": "",
        "reply": "I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:48:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "intTime": 20090302,
        "postID": 50,
        "quote": "",
        "reply": "And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 15:52:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "intTime": 20090302,
        "postID": 51,
        "quote": "Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!!",
        "reply": " COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:00:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "quote: Originally posted by stosh301: I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph.. Keith is a libturd lackey!",
        "intTime": 20090302,
        "postID": 52,
        "quote": "Originally posted by stosh301: I just can't wait to hear what Keith Obergoofy has to say about it.. Wanna bet Rush makes Goofy's \"Worst Person in the World\" again to-nite?? I love Oberstumph..",
        "reply": " Keith is a libturd lackey!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:01:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "intTime": 20090302,
        "postID": 53,
        "quote": "Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "reply": " Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:07:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "The latest on Limbaugh: \"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"",
        "intTime": 20090302,
        "postID": 54,
        "quote": "",
        "reply": "The latest on Limbaugh: \"http://www.timepolls.com/hppolls/archive/poll_results_281.html\"",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:10:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\" COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "intTime": 20090302,
        "postID": 55,
        "quote": "Originally posted by mcgreer: quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? Probably. Once Limbaugh gets ahold of him, the Dittoheads will go nuts... \"one of us, one of us, one of us...\"",
        "reply": " COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:18:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "NOVAMarine"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "intTime": 20090302,
        "postID": 56,
        "quote": "Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled?",
        "reply": " No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:28:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here! Got a hot date down at the Jigger...So gotta Go!!!",
        "intTime": 20090302,
        "postID": 57,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by stosh301: And just what exactly is \"A genuine Republican and Conservative\"???? I can't wait!!! COMMENT: Wow ... two consecutive postings where you \"can't wait.\" You must be the most impatient guy on here!",
        "reply": " Got a hot date down at the Jigger...So gotta Go!!!",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:28:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "stosh301"
    },
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes. I never seen Limbaugh's birth cert but I have seen the president's was posted on his site. Also fact Check.org checked it and the Hawaii paper posted his birth annoucement back in 63 when he was born. So i'm not quite sure what your insinuating that since Rush never posted his Birth cert he may not actually be an American born citizen. Possible but only the most dense idiot would doubt Limbaugh like the President are native born americans. I mean only a compelete and utter fool would doubt Limbaugh and Obama are not US born citizens.",
        "intTime": 20090302,
        "postID": 58,
        "quote": "Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "reply": " I never seen Limbaugh's birth cert but I have seen the president's was posted on his site. Also fact Check.org checked it and the Hawaii paper posted his birth annoucement back in 63 when he was born. So i'm not quite sure what your insinuating that since Rush never posted his Birth cert he may not actually be an American born citizen. Possible but only the most dense idiot would doubt Limbaugh like the President are native born americans. I mean only a compelete and utter fool would doubt Limbaugh and Obama are not US born citizens.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 16:45:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "spanner69"
    },
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe? This quote from one of your links is hysterically funny when you consider Limbaughs primary message to his followers... quote: “I hope the RNC chairman will realize he’s not a talking head pundit, that he is supposed to be working on the grassroots and rebuilding it and maybe doing something about our open primary system and fixing it so that Democrats don’t nominate our candidates,” Limbaugh said, his voice rising. This from the guy who told all his ditto heads to vote for Hillary? Did it on every one of his shows. Man, his hypocrisy knows no limits. Dave",
        "intTime": 20090302,
        "postID": 59,
        "quote": "Originally posted by spanner69: quote: Originally posted by mcgreer: Or hanged in effigy somewhere...! LOL Shortest tenure as GOP chair in history maybe?",
        "reply": " This quote from one of your links is hysterically funny when you consider Limbaughs primary message to his followers... quote: “I hope the RNC chairman will realize he’s not a talking head pundit, that he is supposed to be working on the grassroots and rebuilding it and maybe doing something about our open primary system and fixing it so that Democrats don’t nominate our candidates,” Limbaugh said, his voice rising. This from the guy who told all his ditto heads to vote for Hillary? Did it on every one of his shows. Man, his hypocrisy knows no limits. Dave",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 17:03:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes. LOL Surely you don't think that Limbaugh enjoys the support of all conservatives...? He probably doesn't even have the majority.",
        "intTime": 20090302,
        "postID": 60,
        "quote": "Originally posted by RRR52: quote: Originally posted by NOVAMarine: COMMENT: The \"closet racist\" that he is, Limbaugh must be in a quandary in how to handle the political reality where both the president and the RNC leadership are black. What's next for him in facing this latest moral dilemma? Another marriage proposal? Perhaps another covert trip to the Dominican Republic to get his prescription re-filled? No conservative sees any \"moral dilemma\" or \"quandary\" here. So, what? Only those who choose to view a world where people are first demeaned into this or that arbitrary group and not seen as individuals will care much about the amount of melanin somebody happens to be born with. It's the ideas that really count--especially to Limbaugh. Anyone who does not see it that way will never understand him. . . or true conservatives, in general. At least Limbaugh doesn't cower from presenting his full and complete birth-related documentation, and he pays all of his taxes.",
        "reply": " LOL Surely you don't think that Limbaugh enjoys the support of all conservatives...? He probably doesn't even have the majority.",
        "threadID": "672198221_9790086612001",
        "time": "2009-03-02 17:13:00",
        "title": "RNC Chairman Disses Limbaugh",
        "userID": "mcgreer"
    }
]