[
    {
        "content": "Well well well, coming on FOX news as well. Maybe I need to listen to Shepard from now on. This will have the radical right wing screaming. \"http://thinkprogress.org/2009/02/27/smith-al-marri/\" \"Fox News’ Shep Smith: ‘This is America; you do not get to hold people for five years without’ charges. \" May I add. We are Americans. We not not hold anyone for 5 years without charging them. We live by and abide by our laws of humanity because they are OF US. Place them on trial and execute them if found guilty. Plotting future assaults could be a crime. Why is that such a hard thing for some to understand?", 
        "intTime": 20090301, 
        "postID": 1, 
        "quote": "", 
        "reply": "Well well well, coming on FOX news as well. Maybe I need to listen to Shepard from now on. This will have the radical right wing screaming. \"http://thinkprogress.org/2009/02/27/smith-al-marri/\" \"Fox News’ Shep Smith: ‘This is America; you do not get to hold people for five years without’ charges. \" May I add. We are Americans. We not not hold anyone for 5 years without charging them. We live by and abide by our laws of humanity because they are OF US. Place them on trial and execute them if found guilty. Plotting future assaults could be a crime. Why is that such a hard thing for some to understand?", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 06:08:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. \"The World's Finest\"", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "", 
        "reply": "Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. \"The World's Finest\"", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 06:37:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. That makes sense. Advocating trial and execution means he must be a liberal, because a conservative would advocate keeping them imprisoned indefinitely. After all, Trial and execution is what you do with terrorists who you think are just \"peaceful, loving, misunderstood human beings.\" This message has been edited. Last edited by: Esample1, Sun 01 March 2009 08:57 AM", 
        "intTime": 20090301, 
        "postID": 3, 
        "quote": "Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans.", 
        "reply": " That makes sense. Advocating trial and execution means he must be a liberal, because a conservative would advocate keeping them imprisoned indefinitely. After all, Trial and execution is what you do with terrorists who you think are just \"peaceful, loving, misunderstood human beings.\" This message has been edited. Last edited by: Esample1, Sun 01 March 2009 08:57 AM", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 08:13:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives...", 
        "intTime": 20090301, 
        "postID": 4, 
        "quote": "Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans.", 
        "reply": " actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives...", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 08:49:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. I assume by this that agreeing with Fundamental American values is anathma to Conservatives? Sorry, I disagree. Far more importantly, Conservatives like Bruce Fein, Paul Craig Roberts, Ron Paul are not \"Liberals.\" Even more than Liberals the above men, and many, many other Conservatives have always acted to protect the Constitution. No offense, but I find it kind of pathetic that you are saying that anyone who wants to uphold the Constitution and tradition is automatically a Liberal. Dave", 
        "intTime": 20090301, 
        "postID": 5, 
        "quote": "Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans.", 
        "reply": " I assume by this that agreeing with Fundamental American values is anathma to Conservatives? Sorry, I disagree. Far more importantly, Conservatives like Bruce Fein, Paul Craig Roberts, Ron Paul are not \"Liberals.\" Even more than Liberals the above men, and many, many other Conservatives have always acted to protect the Constitution. No offense, but I find it kind of pathetic that you are saying that anyone who wants to uphold the Constitution and tradition is automatically a Liberal. Dave", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 09:22:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "Grachus"
    }, 
    {
        "content": "I didn't know Shep is a southpaw. Can't say that I ever watched him but a neutral commentator would serve us best. Making statements that we do not hold people is far from fact. WWII in parts of Germany Japan, Philippines, and various other countrys the rule of law was not enacted right away. In fact in the Philippines during Americas occcupation we held massive amounts of people in concertration camps. Of course the famous Lincoln signature on arrest warrants and thousands being held without any rights, all the way back to John Adams and the Alien Sedition Act. FDR with Japanese spies in Hawaii, as well as thousands on the mainline, cousin Teddy (the Panama canal), Truman, (German sabotuers, Unions 1946) and literally hundreds of events and some of the most beloved Presidents we've seen. Habeas was not meant for a non-american, from a battlefield on the other side of the world, or those that create death and distruction heeped high on New York City streets. Now it's time for Geneva. Laws are made by those living a civilized world. Not those that are savage and takes advantage of the naive.", 
        "intTime": 20090301, 
        "postID": 6, 
        "quote": "", 
        "reply": "I didn't know Shep is a southpaw. Can't say that I ever watched him but a neutral commentator would serve us best. Making statements that we do not hold people is far from fact. WWII in parts of Germany Japan, Philippines, and various other countrys the rule of law was not enacted right away. In fact in the Philippines during Americas occcupation we held massive amounts of people in concertration camps. Of course the famous Lincoln signature on arrest warrants and thousands being held without any rights, all the way back to John Adams and the Alien Sedition Act. FDR with Japanese spies in Hawaii, as well as thousands on the mainline, cousin Teddy (the Panama canal), Truman, (German sabotuers, Unions 1946) and literally hundreds of events and some of the most beloved Presidents we've seen. Habeas was not meant for a non-american, from a battlefield on the other side of the world, or those that create death and distruction heeped high on New York City streets. Now it's time for Geneva. Laws are made by those living a civilized world. Not those that are savage and takes advantage of the naive.", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 09:31:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave", 
        "intTime": 20090301, 
        "postID": 7, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives...", 
        "reply": " I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 09:38:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave try watching him and his program.... he has said so a few times in the past....", 
        "intTime": 20090301, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave", 
        "reply": " try watching him and his program.... he has said so a few times in the past....", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 09:47:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "hell my mom was a life time democrat who just recently switch over to the gop because she is disgusted with what the dems have become..... and she is damn near 70years old.....", 
        "intTime": 20090301, 
        "postID": 9, 
        "quote": "", 
        "reply": "hell my mom was a life time democrat who just recently switch over to the gop because she is disgusted with what the dems have become..... and she is damn near 70years old.....", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 09:50:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Well well well, coming on FOX news as well. Maybe I need to listen to Shepard from now on. This will have the radical right wing screaming. \"http://thinkprogress.org/2009/02/27/smith-al-marri/\" \"Fox News’ Shep Smith: ‘This is America; you do not get to hold people for five years without’ charges. \" May I add. We are Americans. We not not hold anyone for 5 years without charging them. We live by and abide by our laws of humanity because they are OF US. Place them on trial and execute them if found guilty. Plotting future assaults could be a crime. Why is that such a hard thing for some to understand? We don't? Don", 
        "intTime": 20090301, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: Well well well, coming on FOX news as well. Maybe I need to listen to Shepard from now on. This will have the radical right wing screaming. \"http://thinkprogress.org/2009/02/27/smith-al-marri/\" \"Fox News’ Shep Smith: ‘This is America; you do not get to hold people for five years without’ charges. \" May I add. We are Americans. We not not hold anyone for 5 years without charging them. We live by and abide by our laws of humanity because they are OF US. Place them on trial and execute them if found guilty. Plotting future assaults could be a crime. Why is that such a hard thing for some to understand?", 
        "reply": " We don't? Don", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 09:57:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "them look like ww1 German pows...", 
        "intTime": 20090301, 
        "postID": 11, 
        "quote": "", 
        "reply": "them look like ww1 German pows...", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 10:13:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Another Fox News thread?", 
        "intTime": 20090301, 
        "postID": 12, 
        "quote": "", 
        "reply": "Another Fox News thread?", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 14:56:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "ErichG2"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave try watching him and his program.... he has said so a few times in the past.... I could say I am a Republican, but that doesn't make it so - it just makes the folks who fall for it stupid and gullible.", 
        "intTime": 20090301, 
        "postID": 13, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave try watching him and his program.... he has said so a few times in the past....", 
        "reply": " I could say I am a Republican, but that doesn't make it so - it just makes the folks who fall for it stupid and gullible.", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 15:05:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: Another Fox News thread? NBC and CBS and ABC and CNN and MSNBC and 50% of FOX are all totaly liberal and the libs screem because the they don't have 100%. Ya se liberals are not intrested in free speech unless it applies only to liberals! Thats why I periodically compare them to Hitler and the Gestapo!", 
        "intTime": 20090301, 
        "postID": 14, 
        "quote": "Originally posted by ErichG2: Another Fox News thread?", 
        "reply": " NBC and CBS and ABC and CNN and MSNBC and 50% of FOX are all totaly liberal and the libs screem because the they don't have 100%. Ya se liberals are not intrested in free speech unless it applies only to liberals! Thats why I periodically compare them to Hitler and the Gestapo!", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 15:59:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by ErichG2: Another Fox News thread? NBC and CBS and ABC and CNN and MSNBC and 50% of FOX are all totaly liberal and the libs screem because the they don't have 100%. Ya se liberals are not intrested in free speech unless it applies only to liberals! Thats why I periodically compare them to Hitler and the Gestapo! LOL...you obviously didn't bother to read the thread before going off on your rant.", 
        "intTime": 20090301, 
        "postID": 15, 
        "quote": "Originally posted by EAG154: quote: Originally posted by ErichG2: Another Fox News thread? NBC and CBS and ABC and CNN and MSNBC and 50% of FOX are all totaly liberal and the libs screem because the they don't have 100%. Ya se liberals are not intrested in free speech unless it applies only to liberals! Thats why I periodically compare them to Hitler and the Gestapo!", 
        "reply": " LOL...you obviously didn't bother to read the thread before going off on your rant.", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 16:14:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: try watching him and his program.... he has said so a few times in the past.... quote: Originally posted by PhoenixDark: I could say I am a Republican, but that doesn't make it so - it just makes the folks who fall for it stupid and gullible. I don't believe he said any such thing. Outlaw is expressing his \"wishes\" not the facts. Dave", 
        "intTime": 20090301, 
        "postID": 16, 
        "quote": "Originally posted by outlaws93: try watching him and his program.... he has said so a few times in the past....", 
        "reply": " quote: Originally posted by PhoenixDark: I could say I am a Republican, but that doesn't make it so - it just makes the folks who fall for it stupid and gullible. I don't believe he said any such thing. Outlaw is expressing his \"wishes\" not the facts. Dave", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 16:56:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by outlaws93: try watching him and his program.... he has said so a few times in the past.... quote: Originally posted by PhoenixDark: I could say I am a Republican, but that doesn't make it so - it just makes the folks who fall for it stupid and gullible. I don't believe he said any such thing. Outlaw is expressing his \"wishes\" not the facts. Dave so says the person who dosent even watch his show.,...", 
        "intTime": 20090301, 
        "postID": 17, 
        "quote": "Originally posted by Grachus: quote: Originally posted by outlaws93: try watching him and his program.... he has said so a few times in the past.... quote: Originally posted by PhoenixDark: I could say I am a Republican, but that doesn't make it so - it just makes the folks who fall for it stupid and gullible. I don't believe he said any such thing. Outlaw is expressing his \"wishes\" not the facts. Dave", 
        "reply": " so says the person who dosent even watch his show.,...", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 16:58:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by EAG154: quote: Originally posted by ErichG2: Another Fox News thread? NBC and CBS and ABC and CNN and MSNBC and 50% of FOX are all totaly liberal and the libs screem because the they don't have 100%. Ya se liberals are not intrested in free speech unless it applies only to liberals! Thats why I periodically compare them to Hitler and the Gestapo! LOL...you obviously didn't bother to read the thread before going off on your rant. I did and my post is not a rant TYVM", 
        "intTime": 20090301, 
        "postID": 18, 
        "quote": "Originally posted by esample1: quote: Originally posted by EAG154: quote: Originally posted by ErichG2: Another Fox News thread? NBC and CBS and ABC and CNN and MSNBC and 50% of FOX are all totaly liberal and the libs screem because the they don't have 100%. Ya se liberals are not intrested in free speech unless it applies only to liberals! Thats why I periodically compare them to Hitler and the Gestapo! LOL...you obviously didn't bother to read the thread before going off on your rant.", 
        "reply": " I did and my post is not a rant TYVM", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 16:59:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave try watching him and his program.... he has said so a few times in the past.... Yeah, and O'Reilly frequently claimed he was a registered independent and had never been a Republican. Then Al Franken published a copy of Bill's voter registration form in his 2003 book, Lies and the Lying Liars Who Tell Them that proved he's a liar. People can claim whatever they want. \"http://mediamatters.org/items/200510030001\"", 
        "intTime": 20090301, 
        "postID": 19, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Grachus: quote: Originally posted by outlaws93: quote: Originally posted by Kegler300: Shep must be a liberal is he's another America is wrong and terrorists are just peaceful, loving, misunderstood human beings. GTMO ain't America, so keep them there so they can't murder anymore Americans. actually shep is a democrat.... just apart of the lie that all who work at foxnews are gop conservatives... I assume you have proof of this? Or is it that he made the above newscast, which proves he's a Democrat? Dave try watching him and his program.... he has said so a few times in the past....", 
        "reply": " Yeah, and O'Reilly frequently claimed he was a registered independent and had never been a Republican. Then Al Franken published a copy of Bill's voter registration form in his 2003 book, Lies and the Lying Liars Who Tell Them that proved he's a liar. People can claim whatever they want. \"http://mediamatters.org/items/200510030001\"", 
        "threadID": "672198221_8320075612001", 
        "time": "2009-03-01 19:14:00", 
        "title": "Fox News  ‘This is America; you do not get to hold people for five years", 
        "userID": "BPCR45_90"
    }
]