[
    {
        "content": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:16:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "reply": " I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:41:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "reply": " Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:48:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave I agree, leave it alone.", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "reply": " I agree, leave it alone.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:49:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "reply": " LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:56:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "intTime": 20090407, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "reply": " You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:59:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats. Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\"", 
        "intTime": 20090407, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "reply": " The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats. Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\"", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 15:09:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? Gore won the popular vote but lost the election. He expected the opposite. Look, a State like Rhode Island gets two extra electoral votes. Let us say that neither candidate campaigns in Rhode Island (or Deleware, and why should they? Places has less than a million people) They are forced to campaign there and deal with the local particularities of these states. It's a Constitutional protection so that small areas such as Montana get some attention from National Candidates. Another so called reform is to partition electoral votes according to popular vote - This \"reform\" would do the same thing as the above. Look, I live in a Big State - They're going to come here and make specific promises - Some of which they will actually keep... If they didn't have to go to the small States they wouldn't have to make them ANY promises (which they may or may not keep). If a candidate is really popular and the country wants them, the electoral college is didly squat. Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "intTime": 20090407, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "reply": " Gore won the popular vote but lost the election. He expected the opposite. Look, a State like Rhode Island gets two extra electoral votes. Let us say that neither candidate campaigns in Rhode Island (or Deleware, and why should they? Places has less than a million people) They are forced to campaign there and deal with the local particularities of these states. It's a Constitutional protection so that small areas such as Montana get some attention from National Candidates. Another so called reform is to partition electoral votes according to popular vote - This \"reform\" would do the same thing as the above. Look, I live in a Big State - They're going to come here and make specific promises - Some of which they will actually keep... If they didn't have to go to the small States they wouldn't have to make them ANY promises (which they may or may not keep). If a candidate is really popular and the country wants them, the electoral college is didly squat. Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 18:04:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave As well as automatic (hasn't this been discussed before?) why not make it so that each \"seat\" is directly elected by its constituents rather than awarded en bloc by state? It would both make every seat important AND produce a more representative result while preventing the potential conflicts that a straight percentage vote would cause (one or two college votes is a clearer majority in a close election than 0.5% I'd have thought).", 
        "intTime": 20090408, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave", 
        "reply": " As well as automatic (hasn't this been discussed before?) why not make it so that each \"seat\" is directly elected by its constituents rather than awarded en bloc by state? It would both make every seat important AND produce a more representative result while preventing the potential conflicts that a straight percentage vote would cause (one or two college votes is a clearer majority in a close election than 0.5% I'd have thought).", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 04:47:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... And I am one of them. It is time for the Electoral College to go away. It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part.", 
        "intTime": 20090408, 
        "postID": 10, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "reply": " And I am one of them. It is time for the Electoral College to go away. It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 06:01:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "alzuk"
    }, 
    {
        "content": "quote: Originally posted by alzuk: It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part. It doesn't look that way if you consider examples in many of the various fora! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090408, 
        "postID": 11, 
        "quote": "Originally posted by alzuk: It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part.", 
        "reply": " It doesn't look that way if you consider examples in many of the various fora! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 06:43:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520)", 
        "intTime": 20090408, 
        "postID": 12, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "reply": " At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520)", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:39:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? 2000 when the electorial vote gave the election to the candidate that LOST the popular vote.", 
        "intTime": 20090408, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "reply": " 2000 when the electorial vote gave the election to the candidate that LOST the popular vote.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:40:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520) To take what STEC74 said \"The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats.\" Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\" So your attack on Repubs has no grounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 14, 
        "quote": "Originally posted by rayld2: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520)", 
        "reply": " To take what STEC74 said \"The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats.\" Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\" So your attack on Repubs has no grounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:43:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 15, 
        "quote": "", 
        "reply": "I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:44:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The reason for the Electoral College, (if you bother to read the Founders words) is the same as I posted. Small States would have never ratified the Constitution without it. For example, at that time the NEEDS of small States were often different then the needs of large states. HAS THAT CHANGED? So they made a compromise. Small States would get a \"TINY\" advantage. A few extra votes. So today, (As well as then) National votes were essentially decided by popular vote - BUT the politicians were forced to take the small states seriously. To my mind, this was and IS a very clever compromise. The only change I would make it to eliminate the actual \"Electors,\" since once in a while they change their vote. Dave", 
        "intTime": 20090408, 
        "postID": 16, 
        "quote": "", 
        "reply": "The reason for the Electoral College, (if you bother to read the Founders words) is the same as I posted. Small States would have never ratified the Constitution without it. For example, at that time the NEEDS of small States were often different then the needs of large states. HAS THAT CHANGED? So they made a compromise. Small States would get a \"TINY\" advantage. A few extra votes. So today, (As well as then) National votes were essentially decided by popular vote - BUT the politicians were forced to take the small states seriously. To my mind, this was and IS a very clever compromise. The only change I would make it to eliminate the actual \"Electors,\" since once in a while they change their vote. Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 08:50:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? Gore won the popular vote but lost the election. He expected the opposite. ... Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states.", 
        "intTime": 20090408, 
        "postID": 17, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? Gore won the popular vote but lost the election. He expected the opposite. ... Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "reply": " Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 12:33:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either. Actually, the electors do not have to follow the will of the people of their states'. They are free to vote their consciences.", 
        "intTime": 20090408, 
        "postID": 18, 
        "quote": "Originally posted by Anbar7: I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either.", 
        "reply": " Actually, the electors do not have to follow the will of the people of their states'. They are free to vote their consciences.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 12:38:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave quote: Originally posted by jwr6: Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states. I agree - absolutely! The more I study our Consitution, the more I appreciate the wisdom of the Founders. We are a \"Federal Republic.\" Dave", 
        "intTime": 20090408, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "reply": " quote: Originally posted by jwr6: Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states. I agree - absolutely! The more I study our Consitution, the more I appreciate the wisdom of the Founders. We are a \"Federal Republic.\" Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 12:45:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "intTime": 20090407, 
        "postID": 20, 
        "quote": "", 
        "reply": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:16:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "intTime": 20090407, 
        "postID": 21, 
        "quote": "Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "reply": " I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:41:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "intTime": 20090407, 
        "postID": 22, 
        "quote": "Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "reply": " Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:48:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave I agree, leave it alone.", 
        "intTime": 20090407, 
        "postID": 23, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "reply": " I agree, leave it alone.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:49:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave", 
        "intTime": 20090407, 
        "postID": 24, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "reply": " LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:56:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "intTime": 20090407, 
        "postID": 25, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave", 
        "reply": " You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 14:59:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats. Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\"", 
        "intTime": 20090407, 
        "postID": 26, 
        "quote": "Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants?", 
        "reply": " The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats. Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\"", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 15:09:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? Gore won the popular vote but lost the election. He expected the opposite. Look, a State like Rhode Island gets two extra electoral votes. Let us say that neither candidate campaigns in Rhode Island (or Deleware, and why should they? Places has less than a million people) They are forced to campaign there and deal with the local particularities of these states. It's a Constitutional protection so that small areas such as Montana get some attention from National Candidates. Another so called reform is to partition electoral votes according to popular vote - This \"reform\" would do the same thing as the above. Look, I live in a Big State - They're going to come here and make specific promises - Some of which they will actually keep... If they didn't have to go to the small States they wouldn't have to make them ANY promises (which they may or may not keep). If a candidate is really popular and the country wants them, the electoral college is didly squat. Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "intTime": 20090407, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "reply": " Gore won the popular vote but lost the election. He expected the opposite. Look, a State like Rhode Island gets two extra electoral votes. Let us say that neither candidate campaigns in Rhode Island (or Deleware, and why should they? Places has less than a million people) They are forced to campaign there and deal with the local particularities of these states. It's a Constitutional protection so that small areas such as Montana get some attention from National Candidates. Another so called reform is to partition electoral votes according to popular vote - This \"reform\" would do the same thing as the above. Look, I live in a Big State - They're going to come here and make specific promises - Some of which they will actually keep... If they didn't have to go to the small States they wouldn't have to make them ANY promises (which they may or may not keep). If a candidate is really popular and the country wants them, the electoral college is didly squat. Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-07 18:04:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave As well as automatic (hasn't this been discussed before?) why not make it so that each \"seat\" is directly elected by its constituents rather than awarded en bloc by state? It would both make every seat important AND produce a more representative result while preventing the potential conflicts that a straight percentage vote would cause (one or two college votes is a clearer majority in a close election than 0.5% I'd have thought).", 
        "intTime": 20090408, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... LOL! But that was AFTER they supported it. The Democrats actually expected to lose the popular vote and win in the college. I would make only one small change - I would make it automatic, and remover the actual \"electors.\" There have been cases where an elector voted against his candidate. It should be an automatic count. Dave", 
        "reply": " As well as automatic (hasn't this been discussed before?) why not make it so that each \"seat\" is directly elected by its constituents rather than awarded en bloc by state? It would both make every seat important AND produce a more representative result while preventing the potential conflicts that a straight percentage vote would cause (one or two college votes is a clearer majority in a close election than 0.5% I'd have thought).", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 04:47:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... And I am one of them. It is time for the Electoral College to go away. It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part.", 
        "intTime": 20090408, 
        "postID": 29, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "reply": " And I am one of them. It is time for the Electoral College to go away. It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 06:01:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "alzuk"
    }, 
    {
        "content": "quote: Originally posted by alzuk: It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part. It doesn't look that way if you consider examples in many of the various fora! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090408, 
        "postID": 30, 
        "quote": "Originally posted by alzuk: It was put in place at a time when the majority of Americans could not read or write. I think we may have solved that problem for the most part.", 
        "reply": " It doesn't look that way if you consider examples in many of the various fora! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 06:43:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520)", 
        "intTime": 20090408, 
        "postID": 31, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000......", 
        "reply": " At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520)", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:39:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? 2000 when the electorial vote gave the election to the candidate that LOST the popular vote.", 
        "intTime": 20090408, 
        "postID": 32, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything?", 
        "reply": " 2000 when the electorial vote gave the election to the candidate that LOST the popular vote.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:40:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520) To take what STEC74 said \"The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats.\" Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\" So your attack on Repubs has no grounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 33, 
        "quote": "Originally posted by rayld2: quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? Seems to me that a lot of democrats were calling for its demise in 2000...... At least the Demos had the excuse that Mr. Bush lost the popular vote the reason the Repubs seem to be attacking it is that it makes Mr. Obama's victory look bigger (electorial 365 to 173 out of 538, popular 69,297,997 to 59,597,520)", 
        "reply": " To take what STEC74 said \"The article and the website say that John R Koza is the Chairman of this nonprofit organization. He donated $128,000 to political campaigns last year. Would you like to guess what party he gave his money to? Democrats. All Democrats.\" Here's a link to check it out: \"http://www.campaignmoney.com/political/contributions/john-koza.asp?cycle=08\" So your attack on Repubs has no grounds. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:43:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090408, 
        "postID": 34, 
        "quote": "", 
        "reply": "I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 07:44:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The reason for the Electoral College, (if you bother to read the Founders words) is the same as I posted. Small States would have never ratified the Constitution without it. For example, at that time the NEEDS of small States were often different then the needs of large states. HAS THAT CHANGED? So they made a compromise. Small States would get a \"TINY\" advantage. A few extra votes. So today, (As well as then) National votes were essentially decided by popular vote - BUT the politicians were forced to take the small states seriously. To my mind, this was and IS a very clever compromise. The only change I would make it to eliminate the actual \"Electors,\" since once in a while they change their vote. Dave", 
        "intTime": 20090408, 
        "postID": 35, 
        "quote": "", 
        "reply": "The reason for the Electoral College, (if you bother to read the Founders words) is the same as I posted. Small States would have never ratified the Constitution without it. For example, at that time the NEEDS of small States were often different then the needs of large states. HAS THAT CHANGED? So they made a compromise. Small States would get a \"TINY\" advantage. A few extra votes. So today, (As well as then) National votes were essentially decided by popular vote - BUT the politicians were forced to take the small states seriously. To my mind, this was and IS a very clever compromise. The only change I would make it to eliminate the actual \"Electors,\" since once in a while they change their vote. Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 08:50:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? Gore won the popular vote but lost the election. He expected the opposite. ... Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states.", 
        "intTime": 20090408, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: \"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94186\" Might as well does not seem to serve a purpose any more. But doesn't this require a Constitutional change and not just want some Republican activist wants? I actually support the present form of the electoral college. Without it, people who live in small states would be completely ignored by National politicians. Some of the small states have specific problems, and by having a tiny bit more electoral clout, these needs are at least mentioned. Dave You mention the smaller states votes, they would still be counted in a popular vote just as they are now. When was the last time an electorial vote actually counted for anything? Gore won the popular vote but lost the election. He expected the opposite. ... Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "reply": " Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 12:33:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either. Actually, the electors do not have to follow the will of the people of their states'. They are free to vote their consciences.", 
        "intTime": 20090408, 
        "postID": 37, 
        "quote": "Originally posted by Anbar7: I agree there shouldn't be an electoral college, then everyone's vote would count not just the electorial college. Yes, they have to go off popular vote, but you may get more people to vote...and not just the dead ones that the Dems pull up either.", 
        "reply": " Actually, the electors do not have to follow the will of the people of their states'. They are free to vote their consciences.", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 12:38:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave quote: Originally posted by jwr6: Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states. I agree - absolutely! The more I study our Consitution, the more I appreciate the wisdom of the Founders. We are a \"Federal Republic.\" Dave", 
        "intTime": 20090408, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: Let me repeat my point. Montana has different NEEDS then my State. Are they concerned about subways? Big City crime? Who will listen to their problems if their vote is swallowed entire by the \"Popular vote?\" Dave", 
        "reply": " quote: Originally posted by jwr6: Same reason we have a House and a Senate, and they don't always agree. The House is there to give the individual a vote, the senate is there to give the state a vote. Point is, the electoral system and the Senate are required to maintain an actual union of large and small states. Without such a system, small states would be more likely to seek to leave the union completely. Getting rid of the electoral college (and the Senate) is a handy rallying cry for the \"one man, one vote\" crowd, but fact is, it is essential to maintaining a nation of states. I agree - absolutely! The more I study our Consitution, the more I appreciate the wisdom of the Founders. We are a \"Federal Republic.\" Dave", 
        "threadID": "672198221_8310001022001", 
        "time": "2009-04-08 12:45:00", 
        "title": "Activists celebrate blows to Electoral College", 
        "userID": "Grachus"
    }
]