[
    {
        "content": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "", 
        "reply": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:10:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:14:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:17:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\"", 
        "reply": " Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:19:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:22:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. No. No pachyderm running for office said that. Only braying jackasses.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " No. No pachyderm running for office said that. Only braying jackasses.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:36:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "intTime": 20090319, 
        "postID": 7, 
        "quote": "", 
        "reply": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "chgo38"
    }, 
    {
        "content": "She should resign.", 
        "intTime": 20090319, 
        "postID": 8, 
        "quote": "", 
        "reply": "She should resign.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:28:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "She's nucking futs! \"The World's Finest\"", 
        "intTime": 20090319, 
        "postID": 9, 
        "quote": "", 
        "reply": "She's nucking futs! \"The World's Finest\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:29:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "Kegler300"
    }, 
    {
        "content": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "intTime": 20090319, 
        "postID": 10, 
        "quote": "", 
        "reply": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "intTime": 20090319, 
        "postID": 11, 
        "quote": "", 
        "reply": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:38:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Took the words out of my mouth. quote: Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 12, 
        "quote": "Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "reply": "Took the words out of my mouth. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:04:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:11:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "carsleyt"
    }, 
    {
        "content": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "", 
        "reply": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:12:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. quote: Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 16:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "intTime": 20090319, 
        "postID": 16, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:46:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "intTime": 20090319, 
        "postID": 17, 
        "quote": "Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American.", 
        "reply": " Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:53:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090319, 
        "postID": 18, 
        "quote": "", 
        "reply": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 20:44:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 19, 
        "quote": "", 
        "reply": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 21:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work.", 
        "reply": " ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-20 03:26:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "6486143"
    }, 
    {
        "content": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "intTime": 20090318, 
        "postID": 21, 
        "quote": "", 
        "reply": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:10:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090318, 
        "postID": 22, 
        "quote": "", 
        "reply": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:14:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "", 
        "reply": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:17:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090318, 
        "postID": 24, 
        "quote": "EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\"", 
        "reply": " Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:19:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "intTime": 20090318, 
        "postID": 25, 
        "quote": "", 
        "reply": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:22:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. No. No pachyderm running for office said that. Only braying jackasses.", 
        "intTime": 20090318, 
        "postID": 26, 
        "quote": "Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " No. No pachyderm running for office said that. Only braying jackasses.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:36:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "intTime": 20090319, 
        "postID": 27, 
        "quote": "", 
        "reply": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "chgo38"
    }, 
    {
        "content": "She should resign.", 
        "intTime": 20090319, 
        "postID": 28, 
        "quote": "", 
        "reply": "She should resign.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:28:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "She's nucking futs! \"The World's Finest\"", 
        "intTime": 20090319, 
        "postID": 29, 
        "quote": "", 
        "reply": "She's nucking futs! \"The World's Finest\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:29:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "Kegler300"
    }, 
    {
        "content": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "intTime": 20090319, 
        "postID": 30, 
        "quote": "", 
        "reply": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "intTime": 20090319, 
        "postID": 31, 
        "quote": "", 
        "reply": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:38:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Took the words out of my mouth. quote: Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 32, 
        "quote": "Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "reply": "Took the words out of my mouth. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:04:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:11:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "carsleyt"
    }, 
    {
        "content": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "intTime": 20090319, 
        "postID": 34, 
        "quote": "", 
        "reply": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:12:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. quote: Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 35, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 16:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "intTime": 20090319, 
        "postID": 36, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:46:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "intTime": 20090319, 
        "postID": 37, 
        "quote": "Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American.", 
        "reply": " Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:53:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090319, 
        "postID": 38, 
        "quote": "", 
        "reply": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 20:44:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 39, 
        "quote": "", 
        "reply": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 21:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work.", 
        "reply": " ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-20 03:26:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "6486143"
    }, 
    {
        "content": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "intTime": 20090318, 
        "postID": 41, 
        "quote": "", 
        "reply": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:10:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090318, 
        "postID": 42, 
        "quote": "", 
        "reply": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:14:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "intTime": 20090318, 
        "postID": 43, 
        "quote": "", 
        "reply": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:17:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090318, 
        "postID": 44, 
        "quote": "EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\"", 
        "reply": " Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:19:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "intTime": 20090318, 
        "postID": 45, 
        "quote": "", 
        "reply": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:22:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. No. No pachyderm running for office said that. Only braying jackasses.", 
        "intTime": 20090318, 
        "postID": 46, 
        "quote": "Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " No. No pachyderm running for office said that. Only braying jackasses.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:36:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "intTime": 20090319, 
        "postID": 47, 
        "quote": "", 
        "reply": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "chgo38"
    }, 
    {
        "content": "She should resign.", 
        "intTime": 20090319, 
        "postID": 48, 
        "quote": "", 
        "reply": "She should resign.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:28:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "She's nucking futs! \"The World's Finest\"", 
        "intTime": 20090319, 
        "postID": 49, 
        "quote": "", 
        "reply": "She's nucking futs! \"The World's Finest\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:29:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "Kegler300"
    }, 
    {
        "content": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "intTime": 20090319, 
        "postID": 50, 
        "quote": "", 
        "reply": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "intTime": 20090319, 
        "postID": 51, 
        "quote": "", 
        "reply": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:38:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Took the words out of my mouth. quote: Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 52, 
        "quote": "Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "reply": "Took the words out of my mouth. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:04:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 53, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:11:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "carsleyt"
    }, 
    {
        "content": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "intTime": 20090319, 
        "postID": 54, 
        "quote": "", 
        "reply": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:12:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. quote: Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 55, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 16:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "intTime": 20090319, 
        "postID": 56, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:46:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "intTime": 20090319, 
        "postID": 57, 
        "quote": "Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American.", 
        "reply": " Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:53:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090319, 
        "postID": 58, 
        "quote": "", 
        "reply": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 20:44:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 59, 
        "quote": "", 
        "reply": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 21:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "intTime": 20090320, 
        "postID": 60, 
        "quote": "Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work.", 
        "reply": " ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-20 03:26:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "6486143"
    }, 
    {
        "content": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "intTime": 20090318, 
        "postID": 61, 
        "quote": "", 
        "reply": "Read and See advising legal and illegal aliens how the police are infringing on their rights. Didn't she swear to uphold the Constitution and the laws of the land? \"http://www.foxnews.com/politics/2009/03/18/pelosi-tells-illegal-immigrants-work-site-raids-american/ Pelosi Tells Illegal Immigrants That Work Site Raids are Un-American EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" The speaker, condemning raids by Immigration and Customs Enforcement agents, referred to the immigrants she was addressing as \"very, very patriotic.\" \"Who in this country would not want to change a policy of kicking in doors in the middle of the night and sending a parent away from their families?\" Pelosi told a mostly Hispanic gathering at St. Anthony's Church in San Francisco. Video: Click here to view the video of Pelosi speaking. \"It must be stopped....What value system is that? I think it's un-American. I think it's un-American.\" Pelosi said she was invited to the church by Rep. Luis Gutierrez, D-Ill., as part of his 17-city, cross-country tour called United Families, which he says is intended to put a human face on the immigration debate. \"We think that families are the cornerstone of our society and our nation, and an immigration system should preserve those families, not destroy them,\" Gutierrez told FOX News Capitol Hill Producer Chad Pergram on Tuesday. The congressman is collecting petitions that ask President Obama to \"stop the immigration raids and deportations that are tearing our marriages, families and children apart.\" He is expected to present those petitions when Hispanic members of Congress meet with the President Wednesday. Click here for more video from FOX News. On Saturday night, Pelosi joined Gutierrez before a cheering crowd at St. Anthony's chanting, \"Si se puede,\" or \"Yes we can.\" Referring to work site enforcement actions by ICE agents, Pelosi said, \"We have to have a change in policy and practice and again ... I can't say enough, the raids must end. The raids must end. \"You are special people. You're here on a Saturday night to take responsibility for our country's future. That makes you very, very patriotic.\" \"I was embarrassed by what she said,\" said Rick Oltman, with Californians for Population Stabilization, an anti-illegal immigrant group. \"Exhorting illegal aliens for taking responsibility for our country's future.... In fact, sitting there in the audience.... I really resented that comment.\" \"I think it was pandering to the crowd but also insulting to American citizens who consider themselves to be patriotic, who obey the rule of law,\" said Oltman, who shot a video of the rally.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:10:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090318, 
        "postID": 62, 
        "quote": "", 
        "reply": "I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:14:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "intTime": 20090318, 
        "postID": 63, 
        "quote": "", 
        "reply": "Good 'Ol Nancy!! Expect her to show the way of \"Yes, we can\" to the people. The good thing is, the Dem's are stuck with this cow, bad thing is , so are we. Until the people realize what a bunch of morons they've put in office ,(which isn't to far around the corner). Hell, we survived that azz hat Carter, we'll try with these anti'American folks that bullshi**ed there way into office.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:17:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090318, 
        "postID": 64, 
        "quote": "EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\"", 
        "reply": " Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:19:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "intTime": 20090318, 
        "postID": 65, 
        "quote": "", 
        "reply": "Lotsa Kool-Aid drinkers are slowly realizing how they were duped by this crowd of extremely ideological dingbats.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:22:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. No. No pachyderm running for office said that. Only braying jackasses.", 
        "intTime": 20090318, 
        "postID": 66, 
        "quote": "Originally posted by crackerjacks61: Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " No. No pachyderm running for office said that. Only braying jackasses.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-18 18:36:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "RRR52"
    }, 
    {
        "content": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "intTime": 20090319, 
        "postID": 67, 
        "quote": "", 
        "reply": "What did you expect she's from San Francisco HOME OF THE RADICAL LEFT", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "chgo38"
    }, 
    {
        "content": "She should resign.", 
        "intTime": 20090319, 
        "postID": 68, 
        "quote": "", 
        "reply": "She should resign.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:28:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "She's nucking futs! \"The World's Finest\"", 
        "intTime": 20090319, 
        "postID": 69, 
        "quote": "", 
        "reply": "She's nucking futs! \"The World's Finest\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:29:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "Kegler300"
    }, 
    {
        "content": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "intTime": 20090319, 
        "postID": 70, 
        "quote": "", 
        "reply": "She's a politician who only needs to keep one congressional district happy; if all it takes is an occasional America bashing rally from her perspective it is no doubt a very small price to pay.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "intTime": 20090319, 
        "postID": 71, 
        "quote": "", 
        "reply": "ILLEGAL IMMIGRATION IS ANTI-AMERICAN. She's a stupid fool", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 05:38:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Took the words out of my mouth. quote: Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 72, 
        "quote": "Originally posted by MSGCAVALRY: I think Pelosi is un-American! She should get on her broom and go fly to Mexico.", 
        "reply": "Took the words out of my mouth. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:04:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 73, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:11:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "carsleyt"
    }, 
    {
        "content": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "intTime": 20090319, 
        "postID": 74, 
        "quote": "", 
        "reply": "I'd be curious to see how many of those who voted for Pelosi will vote for her again if they lose their jobs to illegals? Don", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 07:12:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. quote: Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "intTime": 20090319, 
        "postID": 75, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Yep, and Richardson is Hispanic First, American Second. They all do this, it is called pandering. They are not following the Will of the People. Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": "She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. ", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 16:35:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M. I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "intTime": 20090319, 
        "postID": 76, 
        "quote": "Originally posted by crackerjacks61: quote: EXCLUSIVE: House Speaker Nancy Pelosi recently told a group of both legal and illegal immigrants and their families that enforcement of existing immigration laws, as currently practiced, is \"un-American.\" Didn't someone else say something to that effect a while back during the election in front of a crown of hispanics? I think his initials were J.M.", 
        "reply": " I don't no if you're on solid ground on this one or not. Me thinks J.M. was talking about illegals already in the country working, (almost three years ago)and if they should be granted amnesty, a twenty dollar suit and a Havana cigar. He lost some votes on that one.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:46:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American. Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "intTime": 20090319, 
        "postID": 77, 
        "quote": "Originally posted by fishnfanatic: She follows the will of the people. The digbats, weirdos, freaks, stoners, gays, and the California attitude. Quit picking on her, she really believes Immigration laws are un-American, she wants to have cheap servants as well as any other effluent (not a mis-spelling) American.", 
        "reply": " Effluent would seem a good way to describe her: Effluent is an outflowing of water from a natural body of water, or from a man-made structure. Effluent in the man-made sense is generally considered to be water pollution, such as the outflow from a sewage treatment facility or the wastewater discharge from industrial facilities. An effluent sump pump, for instance, pumps waste from toilets installed below a main sewage line. \"http://en.wikipedia.org/wiki/Effluent\"", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 18:53:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "adminnco1"
    }, 
    {
        "content": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090319, 
        "postID": 78, 
        "quote": "", 
        "reply": "The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 20:44:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "intTime": 20090319, 
        "postID": 79, 
        "quote": "", 
        "reply": "Like I said, she needs to get back on her broom and fly to Mexico.", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-19 21:08:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work. ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "intTime": 20090320, 
        "postID": 80, 
        "quote": "Originally posted by jack_flats: The Madame Speaker is as popular as ever in California, and even more so since Barack Obama became President (quite unlike any Republican in Congress). Thank God for patriotic Americans like Speaker Pelosi. Keep up the excellent work.", 
        "reply": " ....good dose of KoolAid....when it wears off you'll find she is not worth the makeup bill she turns in to look human ....and just one question....did you take lessons from leeky? Already past the future", 
        "threadID": "672198221_6510062812001", 
        "time": "2009-03-20 03:26:00", 
        "title": "Pelosi says Immigration laws are un-American", 
        "userID": "6486143"
    }
]