[
    {
        "content": "RE: http://www.military.com/news/article/navy-cancels-deplo...ue-to-swine-flu.html quote: Navy Cancels Deployment Due to Swine Flu May 06, 2009 Associated Press WASHINGTON - The Navy canceled the deployment of a San Diego-based ship and ordered its crew to be treated with anti-viral drugs after a crew member's illness was confirmed as swine flu. Navy spokesman Lt. Sean Robertson said Tuesday there also were about 50 suspected cases of the virus from crew members on board the USS Dubuque. He said the crew member with the virus and those suspected of being ill from it have completed treatment with the anti-viral drug Tamiflu and are recovering. Poll: Is the Navy overreacting to the Swine Flu threat? Robertson said the ship's deployment was canceled out of an \"abundance of caution.\" The ship was scheduled to leave June 1 on a humanitarian mission to the South Pacific for assistance on projects such as medical and construction operations. The Navy was exploring options to still meet its commitments, Robertson said. As a precaution, the other 370 crew members who were not showing symptoms of the virus began taking preventive treatment at the beginning of the month. Those showing symptoms and the crew member confirmed to be ill from the virus were recovering at home and in quarters provided by the Navy, he said. The USS Dubuque, an amphibious transport dock ship, is now being cleaned and disinfected at the naval base in San Diego. USS Dubuque. The US Navy said Tuesday a warship's crew member became ill with swine flu and 50 others showed symptoms, leading military officials to cancel a scheduled deployment to the South Pacific. (AFP/US NAVY/File/Gregory Badger)", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "Navy Cancels Deployment Due to Swine Flu May 06, 2009 Associated Press WASHINGTON - The Navy canceled the deployment of a San Diego-based ship and ordered its crew to be treated with anti-viral drugs after a crew member's illness was confirmed as swine flu. Navy spokesman Lt. Sean Robertson said Tuesday there also were about 50 suspected cases of the virus from crew members on board the USS Dubuque. He said the crew member with the virus and those suspected of being ill from it have completed treatment with the anti-viral drug Tamiflu and are recovering. Poll: Is the Navy overreacting to the Swine Flu threat? Robertson said the ship's deployment was canceled out of an \"abundance of caution.\" The ship was scheduled to leave June 1 on a humanitarian mission to the South Pacific for assistance on projects such as medical and construction operations. The Navy was exploring options to still meet its commitments, Robertson said. As a precaution, the other 370 crew members who were not showing symptoms of the virus began taking preventive treatment at the beginning of the month. Those showing symptoms and the crew member confirmed to be ill from the virus were recovering at home and in quarters provided by the Navy, he said. The USS Dubuque, an amphibious transport dock ship, is now being cleaned and disinfected at the naval base in San Diego.", 
        "reply": "RE: http://www.military.com/news/article/navy-cancels-deplo...ue-to-swine-flu.html  USS Dubuque. The US Navy said Tuesday a warship's crew member became ill with swine flu and 50 others showed symptoms, leading military officials to cancel a scheduled deployment to the South Pacific. (AFP/US NAVY/File/Gregory Badger)", 
        "threadID": "672198221_3280086222001", 
        "time": "2009-05-06 20:12:00", 
        "title": "USN cancels deployment due to swine flu on USS Dubuque", 
        "userID": "Canuck_Centaur"
    }
]