[
    {
        "content": "\"http://www.cbsnews.com/stories/2009/03/23/national/main4883748.shtml?tag=topHome;topStories\" Aunt Says 15-Year-Old Was Cuffed At Time; Cops Dispute, Say He Tried To Attack (CBS/AP) Bay City police say a 15-year-old has died after being Tasered by officers who were trying to break up a fight. CBS News affiliate WNEM-TV5 said police had identified the teen as Brett Elder. A police news release says officers answered a report of a fight about 3:40 a.m. Sunday. The statement says two males were arguing in an apartment, and one of them \"attempted to fight the officers.\" Police say police Tasered him, and his reaction led them to immediately call for emergency medical help. He was pronounced dead at Bay Regional Medical Center. \"He was flopping around and looked like a fish out of water,\" Elder’s aunt Cindy Hernden told WNEM. \"That’s the only way to explain it - his whole body was bent over.\" Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. Deputy Chief Thomas Pletzke told TV5 however that Elder was not handcuffed when the Taser was fired. Deputy Chief Thomas Pletzke said one officer had been put on administrative leave.", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.cbsnews.com/stories/2009/03/23/national/main4883748.shtml?tag=topHome;topStories\" Aunt Says 15-Year-Old Was Cuffed At Time; Cops Dispute, Say He Tried To Attack (CBS/AP) Bay City police say a 15-year-old has died after being Tasered by officers who were trying to break up a fight. CBS News affiliate WNEM-TV5 said police had identified the teen as Brett Elder. A police news release says officers answered a report of a fight about 3:40 a.m. Sunday. The statement says two males were arguing in an apartment, and one of them \"attempted to fight the officers.\" Police say police Tasered him, and his reaction led them to immediately call for emergency medical help. He was pronounced dead at Bay Regional Medical Center. \"He was flopping around and looked like a fish out of water,\" Elder’s aunt Cindy Hernden told WNEM. \"That’s the only way to explain it - his whole body was bent over.\" Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. Deputy Chief Thomas Pletzke told TV5 however that Elder was not handcuffed when the Taser was fired. Deputy Chief Thomas Pletzke said one officer had been put on administrative leave.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 15:53:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs.", 
        "reply": " I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:01:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed. I am not claiming that this is how it actually happened, but: he could have taken a swing, been subdued and cuffed, and then tazered. This is an example as to why no weapon system should be labled as \"non lethal\". They should be labled as less lethal because they can still kill. It may not happen very often, but officers should remember that tazers are not toys.", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: quote: Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed.", 
        "reply": " I am not claiming that this is how it actually happened, but: he could have taken a swing, been subdued and cuffed, and then tazered. This is an example as to why no weapon system should be labled as \"non lethal\". They should be labled as less lethal because they can still kill. It may not happen very often, but officers should remember that tazers are not toys.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:33:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit.", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "", 
        "reply": "I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:35:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: This is an example as to why no weapon system should be labled as \"non lethal\". Exactly my feelings from the day I realized how deadly they are! I would sue the makers of the tazers as well for false advertisment as \"non-lethal\"", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "This is an example as to why no weapon system should be labled as \"non lethal\".", 
        "reply": " Exactly my feelings from the day I realized how deadly they are! I would sue the makers of the tazers as well for false advertisment as \"non-lethal\"", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:37:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit. And to abuse the taser as well. I have seen a guy tasered for not moving fast enough out of the car. Turned out he was disabled and on crutches. The police didn't see it until they tasered him. I believe he settled out of court though. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit.", 
        "reply": " And to abuse the taser as well. I have seen a guy tasered for not moving fast enough out of the car. Turned out he was disabled and on crutches. The police didn't see it until they tasered him. I believe he settled out of court though. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:41:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "It won't be long before we find out what really killed this kid, because it wasn't a taser. Tasers DO NOT kill people. A taser and a combination of other things can kill a person (like drugs for example.) There are a few bad cops out there who will give the far vast majority of good cops a bad name for doing dumb shi*, like tasing someone for not moving fast enough, but don't judge the actions of the many by the poor choices of the few. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "", 
        "reply": "It won't be long before we find out what really killed this kid, because it wasn't a taser. Tasers DO NOT kill people. A taser and a combination of other things can kill a person (like drugs for example.) There are a few bad cops out there who will give the far vast majority of good cops a bad name for doing dumb shi*, like tasing someone for not moving fast enough, but don't judge the actions of the many by the poor choices of the few. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:00:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human (.03 will stop breathing, .1 could possibly kill you, 5 amps and you are toast). Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "", 
        "reply": "While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human (.03 will stop breathing, .1 could possibly kill you, 5 amps and you are toast). Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:32:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "reply": " It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:36:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. Placed just wrong, that is enough to stop the human heart. Likely, no. Possible, yes.", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "reply": " Placed just wrong, that is enough to stop the human heart. Likely, no. Possible, yes.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:39:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill. It takes much less than that to interrupt the heart's rhythm. Sometimes that is all it takes.", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill.", 
        "reply": " It takes much less than that to interrupt the heart's rhythm. Sometimes that is all it takes.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:40:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances. Not everyones' heart was made to take any amps just because most people could survive at what they refer to as a 'lethal dose'. That's like telling someone to drink a non-lethal dose of whatever and there should be no way it kills them. Non-sense.", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "", 
        "reply": "tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances. Not everyones' heart was made to take any amps just because most people could survive at what they refer to as a 'lethal dose'. That's like telling someone to drink a non-lethal dose of whatever and there should be no way it kills them. Non-sense.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:40:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances. Why not take guns an batons away too just because a couple of bad apples abuse them? Tazers are a very effective tool when properly used. People just need to realize that there can be serious consequences and so treat the tazer as a weapon and not a toy.", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances.", 
        "reply": " Why not take guns an batons away too just because a couple of bad apples abuse them? Tazers are a very effective tool when properly used. People just need to realize that there can be serious consequences and so treat the tazer as a weapon and not a toy.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:42:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking. But, during my time as a tech we were basically told this: .01 to feel it .1 and it'll hurt like a son of a gun 1.0 will kill ya Also, I believe the taser is classified as less-lethal.", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "", 
        "reply": "It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking. But, during my time as a tech we were basically told this: .01 to feel it .1 and it'll hurt like a son of a gun 1.0 will kill ya Also, I believe the taser is classified as less-lethal.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:43:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing.", 
        "intTime": 20090323, 
        "postID": 15, 
        "quote": "", 
        "reply": "Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:04:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing. Oh, I agree with you there. More and more seemed to be using it as a means of restraint rather then what they were taught in training. Seems that attitude with (not all) some of them is, taser them into submission, then handcuff them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 16, 
        "quote": "Originally posted by crackerjacks61: Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing.", 
        "reply": " Oh, I agree with you there. More and more seemed to be using it as a means of restraint rather then what they were taught in training. Seems that attitude with (not all) some of them is, taser them into submission, then handcuff them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:08:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "Well, I'd rather be tased than be beaten with a nightstick. That is for sure. Also, I believe most states classify a weapon as non-lethal or less-lethal if it \"minimizes fatalities\".", 
        "intTime": 20090323, 
        "postID": 17, 
        "quote": "", 
        "reply": "Well, I'd rather be tased than be beaten with a nightstick. That is for sure. Also, I believe most states classify a weapon as non-lethal or less-lethal if it \"minimizes fatalities\".", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:09:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking. There is a world of difference between can and will. Some people die from what is basically a scratch and others live with multiple gunshot wounds to the chest.", 
        "intTime": 20090323, 
        "postID": 18, 
        "quote": "Originally posted by 10tenths: It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking.", 
        "reply": " There is a world of difference between can and will. Some people die from what is basically a scratch and others live with multiple gunshot wounds to the chest.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:09:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "Well, with that reasoning a car can kill somebody, so can alcohol, so can aspartame, so can just about any prescription drug available, so can walking, so can sneezing, so can eating, etc. We live in a world of averages, man. Here is a study: --http://www.medicalnewstoday.com/articles/84955.php", 
        "intTime": 20090323, 
        "postID": 19, 
        "quote": "", 
        "reply": "Well, with that reasoning a car can kill somebody, so can alcohol, so can aspartame, so can just about any prescription drug available, so can walking, so can sneezing, so can eating, etc. We live in a world of averages, man. Here is a study: --http://www.medicalnewstoday.com/articles/84955.php", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:16:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "The police abusing their powers again. No doubt the moaning and wails of \"Its a dangerous job\" will come....If its a dangerous job quit, no one is making you do that profession, stop annoying me with your complaints...you volunteered, quit.", 
        "intTime": 20090323, 
        "postID": 20, 
        "quote": "", 
        "reply": "The police abusing their powers again. No doubt the moaning and wails of \"Its a dangerous job\" will come....If its a dangerous job quit, no one is making you do that profession, stop annoying me with your complaints...you volunteered, quit.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:33:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "\"http://www.cbsnews.com/stories/2009/03/23/national/main4883748.shtml?tag=topHome;topStories\" Aunt Says 15-Year-Old Was Cuffed At Time; Cops Dispute, Say He Tried To Attack (CBS/AP) Bay City police say a 15-year-old has died after being Tasered by officers who were trying to break up a fight. CBS News affiliate WNEM-TV5 said police had identified the teen as Brett Elder. A police news release says officers answered a report of a fight about 3:40 a.m. Sunday. The statement says two males were arguing in an apartment, and one of them \"attempted to fight the officers.\" Police say police Tasered him, and his reaction led them to immediately call for emergency medical help. He was pronounced dead at Bay Regional Medical Center. \"He was flopping around and looked like a fish out of water,\" Elder’s aunt Cindy Hernden told WNEM. \"That’s the only way to explain it - his whole body was bent over.\" Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. Deputy Chief Thomas Pletzke told TV5 however that Elder was not handcuffed when the Taser was fired. Deputy Chief Thomas Pletzke said one officer had been put on administrative leave.", 
        "intTime": 20090323, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.cbsnews.com/stories/2009/03/23/national/main4883748.shtml?tag=topHome;topStories\" Aunt Says 15-Year-Old Was Cuffed At Time; Cops Dispute, Say He Tried To Attack (CBS/AP) Bay City police say a 15-year-old has died after being Tasered by officers who were trying to break up a fight. CBS News affiliate WNEM-TV5 said police had identified the teen as Brett Elder. A police news release says officers answered a report of a fight about 3:40 a.m. Sunday. The statement says two males were arguing in an apartment, and one of them \"attempted to fight the officers.\" Police say police Tasered him, and his reaction led them to immediately call for emergency medical help. He was pronounced dead at Bay Regional Medical Center. \"He was flopping around and looked like a fish out of water,\" Elder’s aunt Cindy Hernden told WNEM. \"That’s the only way to explain it - his whole body was bent over.\" Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. Deputy Chief Thomas Pletzke told TV5 however that Elder was not handcuffed when the Taser was fired. Deputy Chief Thomas Pletzke said one officer had been put on administrative leave.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 15:53:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 22, 
        "quote": "Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs.", 
        "reply": " I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:01:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed. I am not claiming that this is how it actually happened, but: he could have taken a swing, been subdued and cuffed, and then tazered. This is an example as to why no weapon system should be labled as \"non lethal\". They should be labled as less lethal because they can still kill. It may not happen very often, but officers should remember that tazers are not toys.", 
        "intTime": 20090323, 
        "postID": 23, 
        "quote": "Originally posted by L0A1: quote: Hernden did admit to the TV station that Elder had attempted to punch of the officers, but said the officer's use of a Taser was excessive as her nephew was already in handcuffs. I am sorry for this womens loss, but she is talking out of both sides of her mouth (Lying.) How could her nephew try to punch an officer is he was handcuffed.", 
        "reply": " I am not claiming that this is how it actually happened, but: he could have taken a swing, been subdued and cuffed, and then tazered. This is an example as to why no weapon system should be labled as \"non lethal\". They should be labled as less lethal because they can still kill. It may not happen very often, but officers should remember that tazers are not toys.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:33:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit.", 
        "intTime": 20090323, 
        "postID": 24, 
        "quote": "", 
        "reply": "I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:35:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: This is an example as to why no weapon system should be labled as \"non lethal\". Exactly my feelings from the day I realized how deadly they are! I would sue the makers of the tazers as well for false advertisment as \"non-lethal\"", 
        "intTime": 20090323, 
        "postID": 25, 
        "quote": "This is an example as to why no weapon system should be labled as \"non lethal\".", 
        "reply": " Exactly my feelings from the day I realized how deadly they are! I would sue the makers of the tazers as well for false advertisment as \"non-lethal\"", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:37:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit. And to abuse the taser as well. I have seen a guy tasered for not moving fast enough out of the car. Turned out he was disabled and on crutches. The police didn't see it until they tasered him. I believe he settled out of court though. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 26, 
        "quote": "Originally posted by crackerjacks61: I have said it many many times on this board and I will continue to say it. Tasers should only be used as a form of lethal weapons. By giving cops tasers, they have given them a free ride to kill because that is exactly what they do. This is number 2 that we even know about, I bet there are hundreds more deaths from tasers out there that we do not even know about. Take them away or make them lethal use only...this is BS and I hope the family owns that town with a nice fat law suit.", 
        "reply": " And to abuse the taser as well. I have seen a guy tasered for not moving fast enough out of the car. Turned out he was disabled and on crutches. The police didn't see it until they tasered him. I believe he settled out of court though. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 16:41:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "It won't be long before we find out what really killed this kid, because it wasn't a taser. Tasers DO NOT kill people. A taser and a combination of other things can kill a person (like drugs for example.) There are a few bad cops out there who will give the far vast majority of good cops a bad name for doing dumb shi*, like tasing someone for not moving fast enough, but don't judge the actions of the many by the poor choices of the few. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090323, 
        "postID": 27, 
        "quote": "", 
        "reply": "It won't be long before we find out what really killed this kid, because it wasn't a taser. Tasers DO NOT kill people. A taser and a combination of other things can kill a person (like drugs for example.) There are a few bad cops out there who will give the far vast majority of good cops a bad name for doing dumb shi*, like tasing someone for not moving fast enough, but don't judge the actions of the many by the poor choices of the few. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:00:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human (.03 will stop breathing, .1 could possibly kill you, 5 amps and you are toast). Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "intTime": 20090323, 
        "postID": 28, 
        "quote": "", 
        "reply": "While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human (.03 will stop breathing, .1 could possibly kill you, 5 amps and you are toast). Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:32:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 29, 
        "quote": "Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "reply": " It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:36:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. Placed just wrong, that is enough to stop the human heart. Likely, no. Possible, yes.", 
        "intTime": 20090323, 
        "postID": 30, 
        "quote": "Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. Also, that 50,000 volts is only to passes barriers and airgaps. Once continuity with the body is established, the voltage immediately drops to 5,000 volts. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant.", 
        "reply": " Placed just wrong, that is enough to stop the human heart. Likely, no. Possible, yes.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:39:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill. It takes much less than that to interrupt the heart's rhythm. Sometimes that is all it takes.", 
        "intTime": 20090323, 
        "postID": 31, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 10tenths: While a Taser does put out roughly 50,000 volts, the Amperage is only .013. Which, in and of itself, is not enough to kill a human. I would be willing to bet that this kid was on one of a variety of drugs, including: meth, cocaine, LSD or PCP. Basically, anything that acts as a stimulant. It takes at least 1.5 amps to kill a smal person, normally 3 or more for an adult male. I don't think that people understand that volts and watts don't kill, its Ampers that kill.", 
        "reply": " It takes much less than that to interrupt the heart's rhythm. Sometimes that is all it takes.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:40:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances. Not everyones' heart was made to take any amps just because most people could survive at what they refer to as a 'lethal dose'. That's like telling someone to drink a non-lethal dose of whatever and there should be no way it kills them. Non-sense.", 
        "intTime": 20090323, 
        "postID": 32, 
        "quote": "", 
        "reply": "tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances. Not everyones' heart was made to take any amps just because most people could survive at what they refer to as a 'lethal dose'. That's like telling someone to drink a non-lethal dose of whatever and there should be no way it kills them. Non-sense.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:40:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances. Why not take guns an batons away too just because a couple of bad apples abuse them? Tazers are a very effective tool when properly used. People just need to realize that there can be serious consequences and so treat the tazer as a weapon and not a toy.", 
        "intTime": 20090323, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: tasers do cause death even if it's indirectly. They are too dangerious to use just as a \"non-lethal control tool\". ban them all or make them lethal, they are abused in way to many circumstances.", 
        "reply": " Why not take guns an batons away too just because a couple of bad apples abuse them? Tazers are a very effective tool when properly used. People just need to realize that there can be serious consequences and so treat the tazer as a weapon and not a toy.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:42:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking. But, during my time as a tech we were basically told this: .01 to feel it .1 and it'll hurt like a son of a gun 1.0 will kill ya Also, I believe the taser is classified as less-lethal.", 
        "intTime": 20090323, 
        "postID": 34, 
        "quote": "", 
        "reply": "It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking. But, during my time as a tech we were basically told this: .01 to feel it .1 and it'll hurt like a son of a gun 1.0 will kill ya Also, I believe the taser is classified as less-lethal.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 17:43:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing.", 
        "intTime": 20090323, 
        "postID": 35, 
        "quote": "", 
        "reply": "Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:04:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing. Oh, I agree with you there. More and more seemed to be using it as a means of restraint rather then what they were taught in training. Seems that attitude with (not all) some of them is, taser them into submission, then handcuff them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090323, 
        "postID": 36, 
        "quote": "Originally posted by crackerjacks61: Well I hipe you guys that support taser use never find your self in a position of getting pulled over for a speeding ticket and get tased for no reason..cause that's exactly what many of them are doing.", 
        "reply": " Oh, I agree with you there. More and more seemed to be using it as a means of restraint rather then what they were taught in training. Seems that attitude with (not all) some of them is, taser them into submission, then handcuff them. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:08:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "L0A1"
    }, 
    {
        "content": "Well, I'd rather be tased than be beaten with a nightstick. That is for sure. Also, I believe most states classify a weapon as non-lethal or less-lethal if it \"minimizes fatalities\".", 
        "intTime": 20090323, 
        "postID": 37, 
        "quote": "", 
        "reply": "Well, I'd rather be tased than be beaten with a nightstick. That is for sure. Also, I believe most states classify a weapon as non-lethal or less-lethal if it \"minimizes fatalities\".", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:09:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking. There is a world of difference between can and will. Some people die from what is basically a scratch and others live with multiple gunshot wounds to the chest.", 
        "intTime": 20090323, 
        "postID": 38, 
        "quote": "Originally posted by 10tenths: It takes at least .1 Amp to stop the heart and it would have to cross the heart in the circuit. I've been hit by .1 Amps from 10,000 V power supplies more than a few times. And, it has crossed my heart at least once and I am still kicking.", 
        "reply": " There is a world of difference between can and will. Some people die from what is basically a scratch and others live with multiple gunshot wounds to the chest.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:09:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "thorin001"
    }, 
    {
        "content": "Well, with that reasoning a car can kill somebody, so can alcohol, so can aspartame, so can just about any prescription drug available, so can walking, so can sneezing, so can eating, etc. We live in a world of averages, man. Here is a study: --http://www.medicalnewstoday.com/articles/84955.php", 
        "intTime": 20090323, 
        "postID": 39, 
        "quote": "", 
        "reply": "Well, with that reasoning a car can kill somebody, so can alcohol, so can aspartame, so can just about any prescription drug available, so can walking, so can sneezing, so can eating, etc. We live in a world of averages, man. Here is a study: --http://www.medicalnewstoday.com/articles/84955.php", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:16:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "10Tenths"
    }, 
    {
        "content": "The police abusing their powers again. No doubt the moaning and wails of \"Its a dangerous job\" will come....If its a dangerous job quit, no one is making you do that profession, stop annoying me with your complaints...you volunteered, quit.", 
        "intTime": 20090323, 
        "postID": 40, 
        "quote": "", 
        "reply": "The police abusing their powers again. No doubt the moaning and wails of \"Its a dangerous job\" will come....If its a dangerous job quit, no one is making you do that profession, stop annoying me with your complaints...you volunteered, quit.", 
        "threadID": "672198221_8480086812001", 
        "time": "2009-03-23 18:33:00", 
        "title": "Michigan Teen Dies From Police Tasering", 
        "userID": "Irwin_R_Schyster"
    }
]