[
    {
        "content": "President Job Approval-Average +29.5 Congress Job Approval -Average -24.7 Generic Congress Vote -Average Dems +2.7 Direction of Country -Average -16.6 These are through April 20, 2009 \"http://www.realclearpolitics.com/polls/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090424,
        "postID": 1,
        "quote": "",
        "reply": "President Job Approval-Average +29.5 Congress Job Approval -Average -24.7 Generic Congress Vote -Average Dems +2.7 Direction of Country -Average -16.6 These are through April 20, 2009 \"http://www.realclearpolitics.com/polls/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 09:47:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "Anbar7"
    },
    {
        "content": "Easy to be popular when you drive down the road throwing money at people",
        "intTime": 20090424,
        "postID": 2,
        "quote": "",
        "reply": "Easy to be popular when you drive down the road throwing money at people",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 09:53:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "EAG154"
    },
    {
        "content": "Yes, but it is funny how people on here associate Obama with the Dems. Obviously the American people don't. They approve of Obama, but very much dislike Congress. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090424,
        "postID": 3,
        "quote": "",
        "reply": "Yes, but it is funny how people on here associate Obama with the Dems. Obviously the American people don't. They approve of Obama, but very much dislike Congress. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 09:58:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: Yes, but it is funny how people on here associate Obama with the Dems. Obviously the American people don't. They approve of Obama, but very much dislike Congress. Up-stageing the congress with money give aways is a tuff job unless one has trillions of the taxpayers dollars to BURN",
        "intTime": 20090424,
        "postID": 4,
        "quote": "Originally posted by Anbar7: Yes, but it is funny how people on here associate Obama with the Dems. Obviously the American people don't. They approve of Obama, but very much dislike Congress.",
        "reply": " Up-stageing the congress with money give aways is a tuff job unless one has trillions of the taxpayers dollars to BURN",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 10:16:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people How did we get here? Let me guess: Jimmy Carter. LOL",
        "intTime": 20090424,
        "postID": 5,
        "quote": "Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people",
        "reply": " How did we get here? Let me guess: Jimmy Carter. LOL",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 11:24:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people How did we get here? Let me guess: Jimmy Carter. LOL When the next adm comes in and we are still at the same place, we'll see if you say that if a rebub is on office. Whatever you say about the last Adm's spending that last 90 days have made them look like neophytes in that realm.",
        "intTime": 20090424,
        "postID": 6,
        "quote": "Originally posted by mcgreer: quote: Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people How did we get here? Let me guess: Jimmy Carter. LOL",
        "reply": " When the next adm comes in and we are still at the same place, we'll see if you say that if a rebub is on office. Whatever you say about the last Adm's spending that last 90 days have made them look like neophytes in that realm.",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 11:27:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "GunnyRet03"
    },
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by mcgreer: quote: Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people How did we get here? Let me guess: Jimmy Carter. LOL When the next adm comes in and we are still at the same place, we'll see if you say that if a rebub is on office. Whatever you say about the last Adm's spending that last 90 days have made them look like neophytes in that realm. Budgets go up every year, Gunny. And the difference between the projected 2010 budget and last year's is not that much if you check the facts. What makes this one so different is what I consider manufactured outrage over the projected spending against the current deficit has placed a marker that we haven't dealt with in quite a few years. Again, looking at that, there isn't a whole lot of difference between what we've been doing over the past several years - unless you're a partisan who's looking for blame or excuses (depending on what side of the fence one stands). I also find it amusing that, while a majority of Americans aren't satisified with the \"direction of the country\", the numbers have improved over the past three months. So, actually, fewer people are dissatisfied.",
        "intTime": 20090424,
        "postID": 7,
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by mcgreer: quote: Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people How did we get here? Let me guess: Jimmy Carter. LOL When the next adm comes in and we are still at the same place, we'll see if you say that if a rebub is on office. Whatever you say about the last Adm's spending that last 90 days have made them look like neophytes in that realm.",
        "reply": " Budgets go up every year, Gunny. And the difference between the projected 2010 budget and last year's is not that much if you check the facts. What makes this one so different is what I consider manufactured outrage over the projected spending against the current deficit has placed a marker that we haven't dealt with in quite a few years. Again, looking at that, there isn't a whole lot of difference between what we've been doing over the past several years - unless you're a partisan who's looking for blame or excuses (depending on what side of the fence one stands). I also find it amusing that, while a majority of Americans aren't satisified with the \"direction of the country\", the numbers have improved over the past three months. So, actually, fewer people are dissatisfied.",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 12:08:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "mcgreer"
    },
    {
        "content": "quote: Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people Not really. The Bush tax rebate plan didn't increase his approval ratings.",
        "intTime": 20090424,
        "postID": 8,
        "quote": "Originally posted by EAG154: Easy to be popular when you drive down the road throwing money at people",
        "reply": " Not really. The Bush tax rebate plan didn't increase his approval ratings.",
        "threadID": "672198221_9400066122001",
        "time": "2009-04-24 17:35:00",
        "title": "Real Clear Polictics Poll Averages: Obama ok, Congress bad, Direction BAD",
        "userID": "mrmixitup"
    }
]