[
    {
        "content": ">http://www.independent.co.uk/news/world/middle-east/iraq-air-raids-hit-mostly-women-and-children-1669282.html British sources are again criticizing the use of airpower in Iraq and Afghanistan. They claim air attacks inflict unduly large civilian casualties and are a negative in the effort to develop trust, confidence and cooperation in the native population. Since 2001 the USAF has dropped over 14 000 tonnes of bombs on Afghan targets and 18 000 on Iraq. The USAF reports flying on average 140 tactical air missions over Iraq, and double that over Afghanistan, every week. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:11 PM", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": ">http://www.independent.co.uk/news/world/middle-east/iraq-air-raids-hit-mostly-women-and-children-1669282.html British sources are again criticizing the use of airpower in Iraq and Afghanistan. They claim air attacks inflict unduly large civilian casualties and are a negative in the effort to develop trust, confidence and cooperation in the native population. Since 2001 the USAF has dropped over 14 000 tonnes of bombs on Afghan targets and 18 000 on Iraq. The USAF reports flying on average 140 tactical air missions over Iraq, and double that over Afghanistan, every week. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:11 PM", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-17 20:25:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "intTime": 20090418, 
        "postID": 2, 
        "quote": "", 
        "reply": "maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-18 05:54:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead", 
        "intTime": 20090419, 
        "postID": 3, 
        "quote": "", 
        "reply": "The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:27:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations. yea hehehe no freckin joke...", 
        "intTime": 20090419, 
        "postID": 4, 
        "quote": "Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations.", 
        "reply": " yea hehehe no freckin joke...", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:31:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is.", 
        "intTime": 20090419, 
        "postID": 5, 
        "quote": "", 
        "reply": "Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:37:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is. More successful except in comparison to any other countries that don't drop bombs in the first place. Once again the observation is subjective. It's like the Japanese patting themselves on the back for only killing a milkman, a paperboy and a waitress on her way to work, while attacking the base at Pearl Harbor and killing 2500 military personnel. Precision bombing Afghanistan is only slightly more intelligent than carpet bombing the place -neither has been particularly effective, and, as the Brits are saying, might be making the situation worse. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:10 PM", 
        "intTime": 20090419, 
        "postID": 6, 
        "quote": "Originally posted by 10tenths: Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is.", 
        "reply": " More successful except in comparison to any other countries that don't drop bombs in the first place. Once again the observation is subjective. It's like the Japanese patting themselves on the back for only killing a milkman, a paperboy and a waitress on her way to work, while attacking the base at Pearl Harbor and killing 2500 military personnel. Precision bombing Afghanistan is only slightly more intelligent than carpet bombing the place -neither has been particularly effective, and, as the Brits are saying, might be making the situation worse. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:10 PM", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:48:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\".", 
        "intTime": 20090419, 
        "postID": 7, 
        "quote": "", 
        "reply": "Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\".", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:59:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal. I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it.", 
        "intTime": 20090419, 
        "postID": 8, 
        "quote": "Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead", 
        "reply": " They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal. I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:03:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "The Brits. bombed at night where there was, during WW2 very very little chance of hitting only military targets. So they aimed at cities. mostly THERE WERE CIVILIAN CASUALTIES. Now , with smart bombs, mostly there are combatant casualties. The civilians killed are the ones being used as shields against bombing attacks by the combatants. Making them, the islamofascist illegal combatants, the obnes who are RESPONSIBLE for the civilian deaths. Now, that's too much for their MSM, and we should listen because.....?", 
        "intTime": 20090419, 
        "postID": 9, 
        "quote": "", 
        "reply": "The Brits. bombed at night where there was, during WW2 very very little chance of hitting only military targets. So they aimed at cities. mostly THERE WERE CIVILIAN CASUALTIES. Now , with smart bombs, mostly there are combatant casualties. The civilians killed are the ones being used as shields against bombing attacks by the combatants. Making them, the islamofascist illegal combatants, the obnes who are RESPONSIBLE for the civilian deaths. Now, that's too much for their MSM, and we should listen because.....?", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:07:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "intTime": 20090419, 
        "postID": 10, 
        "quote": "Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\".", 
        "reply": " Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:08:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg", 
        "intTime": 20090419, 
        "postID": 11, 
        "quote": "", 
        "reply": "http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:10:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition...", 
        "intTime": 20090419, 
        "postID": 12, 
        "quote": "", 
        "reply": "What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition...", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:15:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum.", 
        "intTime": 20090419, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "reply": " Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:16:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition... Intriguing. Do tell us more, would ya?", 
        "intTime": 20090419, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition...", 
        "reply": " Intriguing. Do tell us more, would ya?", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:19:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg Where is that? West Bank? Looks like one of the new GBU-39's - the 'budget bomb'. Israel got anoter shipment recently, to make up for the ones they wasted in Gaza. They must have dropped all the weapons that got them 'targetted'. Or, just another 'accident'on the way. Great picture. Thx.", 
        "intTime": 20090419, 
        "postID": 15, 
        "quote": "Originally posted by 2nd_freedomfighter: http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg", 
        "reply": " Where is that? West Bank? Looks like one of the new GBU-39's - the 'budget bomb'. Israel got anoter shipment recently, to make up for the ones they wasted in Gaza. They must have dropped all the weapons that got them 'targetted'. Or, just another 'accident'on the way. Great picture. Thx.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:27:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal. And you would know that how with never serving? quote: Originally posted by popsiq: I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it. You rarely hear of it, because you rarely hear of the RAF performing such Missions in the first Place. Any idea as to Numbers of RAF Fighterbombers dedicated to the theater? At one point they had a Grand total of 7 Harriers available for service in Afghanistan, thats not even a Full Strength Squadron by RAF Standards. By Default the CAS Fixed Wing mission goes to US Air Assets just by sheer weight of numbers. 7 planes that each can take aloft 4 tons It's not the RAF's fault, their Government has hamstrung them. There are Chinooks(CH-47) sitting in the UK desperately needed in Afghanistan awaiting Insrumentation to be fitted for the last several years.", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "Originally posted by popsiq: They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal.", 
        "reply": " And you would know that how with never serving? quote: Originally posted by popsiq: I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it. You rarely hear of it, because you rarely hear of the RAF performing such Missions in the first Place. Any idea as to Numbers of RAF Fighterbombers dedicated to the theater? At one point they had a Grand total of 7 Harriers available for service in Afghanistan, thats not even a Full Strength Squadron by RAF Standards. By Default the CAS Fixed Wing mission goes to US Air Assets just by sheer weight of numbers. 7 planes that each can take aloft 4 tons It's not the RAF's fault, their Government has hamstrung them. There are Chinooks(CH-47) sitting in the UK desperately needed in Afghanistan awaiting Insrumentation to be fitted for the last several years.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 22:37:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me. Well, when you did have your profile posted, you said you were Canadian and had never served in the armed forces... Next... Respectfully, SUNLINER81", 
        "intTime": 20090419, 
        "postID": 17, 
        "quote": "Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "reply": " Well, when you did have your profile posted, you said you were Canadian and had never served in the armed forces... Next... Respectfully, SUNLINER81", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 22:41:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum. Gotta go allong with CJ on this one. It's a no brainer.", 
        "intTime": 20090420, 
        "postID": 18, 
        "quote": "Originally posted by popsiq: quote: Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum.", 
        "reply": " Gotta go allong with CJ on this one. It's a no brainer.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-20 01:08:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me. With all due respect Popsiq, you have posted that you have had 3 weeks of basic training (BT) in Salvation Army. To the topic at hand: Airstrikes are a very much valued and important tool of warfare. The question is, is how you use them in the first place. If you use your planes to \"soften targets\" before ground assault, or you use them for specific assassination missions (as they are used in A-stan), it is OK. If civilians die, they die because they have been used as live shields. Ergo...", 
        "intTime": 20090420, 
        "postID": 19, 
        "quote": "Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "reply": " With all due respect Popsiq, you have posted that you have had 3 weeks of basic training (BT) in Salvation Army. To the topic at hand: Airstrikes are a very much valued and important tool of warfare. The question is, is how you use them in the first place. If you use your planes to \"soften targets\" before ground assault, or you use them for specific assassination missions (as they are used in A-stan), it is OK. If civilians die, they die because they have been used as live shields. Ergo...", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-20 01:39:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. The problem is...How many of those bombs falling in Afghanistan make them want to bring down our buildings in NYC? and every accidental killing of a civilian creates the potential of another 9/11 plotter. It's just common sense. If a foreign government accidentally killed a family member of yours wouldn't you want revenge no matter how justified that government felt they were in their mission? and before anyone says it....No. I do NOT blame 9/11 or any other terrorist attacks on the U.S.", 
        "intTime": 20090420, 
        "postID": 20, 
        "quote": "I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "reply": " The problem is...How many of those bombs falling in Afghanistan make them want to bring down our buildings in NYC? and every accidental killing of a civilian creates the potential of another 9/11 plotter. It's just common sense. If a foreign government accidentally killed a family member of yours wouldn't you want revenge no matter how justified that government felt they were in their mission? and before anyone says it....No. I do NOT blame 9/11 or any other terrorist attacks on the U.S.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-20 03:12:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": ">http://www.independent.co.uk/news/world/middle-east/iraq-air-raids-hit-mostly-women-and-children-1669282.html British sources are again criticizing the use of airpower in Iraq and Afghanistan. They claim air attacks inflict unduly large civilian casualties and are a negative in the effort to develop trust, confidence and cooperation in the native population. Since 2001 the USAF has dropped over 14 000 tonnes of bombs on Afghan targets and 18 000 on Iraq. The USAF reports flying on average 140 tactical air missions over Iraq, and double that over Afghanistan, every week. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:11 PM", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "", 
        "reply": ">http://www.independent.co.uk/news/world/middle-east/iraq-air-raids-hit-mostly-women-and-children-1669282.html British sources are again criticizing the use of airpower in Iraq and Afghanistan. They claim air attacks inflict unduly large civilian casualties and are a negative in the effort to develop trust, confidence and cooperation in the native population. Since 2001 the USAF has dropped over 14 000 tonnes of bombs on Afghan targets and 18 000 on Iraq. The USAF reports flying on average 140 tactical air missions over Iraq, and double that over Afghanistan, every week. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:11 PM", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-17 20:25:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "intTime": 20090418, 
        "postID": 22, 
        "quote": "", 
        "reply": "maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-18 05:54:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead", 
        "intTime": 20090419, 
        "postID": 23, 
        "quote": "", 
        "reply": "The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:27:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations. yea hehehe no freckin joke...", 
        "intTime": 20090419, 
        "postID": 24, 
        "quote": "Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations.", 
        "reply": " yea hehehe no freckin joke...", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:31:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is.", 
        "intTime": 20090419, 
        "postID": 25, 
        "quote": "", 
        "reply": "Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:37:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is. More successful except in comparison to any other countries that don't drop bombs in the first place. Once again the observation is subjective. It's like the Japanese patting themselves on the back for only killing a milkman, a paperboy and a waitress on her way to work, while attacking the base at Pearl Harbor and killing 2500 military personnel. Precision bombing Afghanistan is only slightly more intelligent than carpet bombing the place -neither has been particularly effective, and, as the Brits are saying, might be making the situation worse. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:10 PM", 
        "intTime": 20090419, 
        "postID": 26, 
        "quote": "Originally posted by 10tenths: Hey, at least we aren't carpet bombing like we did in WWII (I think the Brits are quite familiar with both sides of the coin when talking about that method). In war, there will always be civilian casualties, you cannot avoid that. But, I will say that the US has been more successful than any other country in history at keeping civilian casualties to a minimum. In war, you cannot please everybody. But, you must still complete the mission. That is just the way it is.", 
        "reply": " More successful except in comparison to any other countries that don't drop bombs in the first place. Once again the observation is subjective. It's like the Japanese patting themselves on the back for only killing a milkman, a paperboy and a waitress on her way to work, while attacking the base at Pearl Harbor and killing 2500 military personnel. Precision bombing Afghanistan is only slightly more intelligent than carpet bombing the place -neither has been particularly effective, and, as the Brits are saying, might be making the situation worse. This message has been edited. Last edited by: popsiq, Sun 19 April 2009 02:10 PM", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:48:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\".", 
        "intTime": 20090419, 
        "postID": 27, 
        "quote": "", 
        "reply": "Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\".", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 13:59:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal. I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it.", 
        "intTime": 20090419, 
        "postID": 28, 
        "quote": "Originally posted by LineDoggie: The British could always stop requesting US Airstrikes for their Operations. Also a TAC Air mission is a Sortie, doesnt mean they always drop the load. I had to decline one once when a Pair of F-16's wanted to support us just outside Baghdad. A Bongo Truck had fled after its occupants had executed several workers. We were vectoring assests when the zoomies cut in wanting to drop 750lb'rs. We went with the KW option instead", 
        "reply": " They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal. I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:03:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "The Brits. bombed at night where there was, during WW2 very very little chance of hitting only military targets. So they aimed at cities. mostly THERE WERE CIVILIAN CASUALTIES. Now , with smart bombs, mostly there are combatant casualties. The civilians killed are the ones being used as shields against bombing attacks by the combatants. Making them, the islamofascist illegal combatants, the obnes who are RESPONSIBLE for the civilian deaths. Now, that's too much for their MSM, and we should listen because.....?", 
        "intTime": 20090419, 
        "postID": 29, 
        "quote": "", 
        "reply": "The Brits. bombed at night where there was, during WW2 very very little chance of hitting only military targets. So they aimed at cities. mostly THERE WERE CIVILIAN CASUALTIES. Now , with smart bombs, mostly there are combatant casualties. The civilians killed are the ones being used as shields against bombing attacks by the combatants. Making them, the islamofascist illegal combatants, the obnes who are RESPONSIBLE for the civilian deaths. Now, that's too much for their MSM, and we should listen because.....?", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:07:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "intTime": 20090419, 
        "postID": 30, 
        "quote": "Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\".", 
        "reply": " Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:08:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg", 
        "intTime": 20090419, 
        "postID": 31, 
        "quote": "", 
        "reply": "http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:10:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition...", 
        "intTime": 20090419, 
        "postID": 32, 
        "quote": "", 
        "reply": "What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition...", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:15:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum.", 
        "intTime": 20090419, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "reply": " Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:16:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition... Intriguing. Do tell us more, would ya?", 
        "intTime": 20090419, 
        "postID": 34, 
        "quote": "Originally posted by Irwin_R_Schyster: What do the brits know? These are the same clowns that had SAS Operators dressed as insurgents carrying out terrorist bombings on civilians to turn ethnic groups against one another instead of on the coalition...", 
        "reply": " Intriguing. Do tell us more, would ya?", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:19:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg Where is that? West Bank? Looks like one of the new GBU-39's - the 'budget bomb'. Israel got anoter shipment recently, to make up for the ones they wasted in Gaza. They must have dropped all the weapons that got them 'targetted'. Or, just another 'accident'on the way. Great picture. Thx.", 
        "intTime": 20090419, 
        "postID": 35, 
        "quote": "Originally posted by 2nd_freedomfighter: http://narf.at/pix/8ec057569e1de34cf59ecc8badd6db1e023d8081.jpg", 
        "reply": " Where is that? West Bank? Looks like one of the new GBU-39's - the 'budget bomb'. Israel got anoter shipment recently, to make up for the ones they wasted in Gaza. They must have dropped all the weapons that got them 'targetted'. Or, just another 'accident'on the way. Great picture. Thx.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 14:27:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal. And you would know that how with never serving? quote: Originally posted by popsiq: I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it. You rarely hear of it, because you rarely hear of the RAF performing such Missions in the first Place. Any idea as to Numbers of RAF Fighterbombers dedicated to the theater? At one point they had a Grand total of 7 Harriers available for service in Afghanistan, thats not even a Full Strength Squadron by RAF Standards. By Default the CAS Fixed Wing mission goes to US Air Assets just by sheer weight of numbers. 7 planes that each can take aloft 4 tons It's not the RAF's fault, their Government has hamstrung them. There are Chinooks(CH-47) sitting in the UK desperately needed in Afghanistan awaiting Insrumentation to be fitted for the last several years.", 
        "intTime": 20090419, 
        "postID": 36, 
        "quote": "Originally posted by popsiq: They're far easier to land with empty racks. Anybody doing the other regularly should qualify for an Air Medal.", 
        "reply": " And you would know that how with never serving? quote: Originally posted by popsiq: I think the Brits do a better job at observation and air-ground communications - you rarely hear of them blasting civilians with called-in air strikes, esp when the RAF does it. You rarely hear of it, because you rarely hear of the RAF performing such Missions in the first Place. Any idea as to Numbers of RAF Fighterbombers dedicated to the theater? At one point they had a Grand total of 7 Harriers available for service in Afghanistan, thats not even a Full Strength Squadron by RAF Standards. By Default the CAS Fixed Wing mission goes to US Air Assets just by sheer weight of numbers. 7 planes that each can take aloft 4 tons It's not the RAF's fault, their Government has hamstrung them. There are Chinooks(CH-47) sitting in the UK desperately needed in Afghanistan awaiting Insrumentation to be fitted for the last several years.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 22:37:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me. Well, when you did have your profile posted, you said you were Canadian and had never served in the armed forces... Next... Respectfully, SUNLINER81", 
        "intTime": 20090419, 
        "postID": 37, 
        "quote": "Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "reply": " Well, when you did have your profile posted, you said you were Canadian and had never served in the armed forces... Next... Respectfully, SUNLINER81", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-19 22:41:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum. Gotta go allong with CJ on this one. It's a no brainer.", 
        "intTime": 20090420, 
        "postID": 38, 
        "quote": "Originally posted by popsiq: quote: Originally posted by crackerjacks61: maybe...but it makes for good target practice though. I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. Target practice ? You sound like Goering. Target practice is dropping one from 30k into a pickle barrel in the Mojave, not disarticulating snotty-faced little Afghan kids 'by accident'. Those Afghans are as much to blame for 9/11 as you are, but ain't nobody slipping jdams down your lum.", 
        "reply": " Gotta go allong with CJ on this one. It's a no brainer.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-20 01:08:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me. With all due respect Popsiq, you have posted that you have had 3 weeks of basic training (BT) in Salvation Army. To the topic at hand: Airstrikes are a very much valued and important tool of warfare. The question is, is how you use them in the first place. If you use your planes to \"soften targets\" before ground assault, or you use them for specific assassination missions (as they are used in A-stan), it is OK. If civilians die, they die because they have been used as live shields. Ergo...", 
        "intTime": 20090420, 
        "postID": 39, 
        "quote": "Originally posted by popsiq: quote: Originally posted by dman1948: Popsiq, What I can see of your profile, it says \"Other\", so in other words you don't have a clue except what you read in the left handed news papers. Not much to say for you and your experence, thats for sure. Or did you get your experence from playing \"Battleship\" or \"Star Wars\" or maybe \"Cops and Robbers\" and throw in \"Cowboy and Indians\". Two more 'oopsey daisies' last week killing women and little kids. Would you care to stick to the topic? For you don't have a clue about me.", 
        "reply": " With all due respect Popsiq, you have posted that you have had 3 weeks of basic training (BT) in Salvation Army. To the topic at hand: Airstrikes are a very much valued and important tool of warfare. The question is, is how you use them in the first place. If you use your planes to \"soften targets\" before ground assault, or you use them for specific assassination missions (as they are used in A-stan), it is OK. If civilians die, they die because they have been used as live shields. Ergo...", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-20 01:39:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC. The problem is...How many of those bombs falling in Afghanistan make them want to bring down our buildings in NYC? and every accidental killing of a civilian creates the potential of another 9/11 plotter. It's just common sense. If a foreign government accidentally killed a family member of yours wouldn't you want revenge no matter how justified that government felt they were in their mission? and before anyone says it....No. I do NOT blame 9/11 or any other terrorist attacks on the U.S.", 
        "intTime": 20090420, 
        "postID": 40, 
        "quote": "I'd rather have the bombs falling in Afghanistan, than the buildings falling in NYC.", 
        "reply": " The problem is...How many of those bombs falling in Afghanistan make them want to bring down our buildings in NYC? and every accidental killing of a civilian creates the potential of another 9/11 plotter. It's just common sense. If a foreign government accidentally killed a family member of yours wouldn't you want revenge no matter how justified that government felt they were in their mission? and before anyone says it....No. I do NOT blame 9/11 or any other terrorist attacks on the U.S.", 
        "threadID": "672198221_4230080122001", 
        "time": "2009-04-20 03:12:00", 
        "title": "Brits Claim Bombing Affects Civilians", 
        "userID": "karlhungusjr"
    }
]