[
    {
        "content": "\"http://www.cbsnews.com/stories/2009/04/30/business/main4981084.shtml?tag=main_home_storiesBySection\" (AP) Riding a crest of populist anger, the House on Thursday approved a bill to restrict credit card practices and eliminate sudden increases in interest rates and late fees that have entangled millions of consumers.", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.cbsnews.com/stories/2009/04/30/business/main4981084.shtml?tag=main_home_storiesBySection\" (AP) Riding a crest of populist anger, the House on Thursday approved a bill to restrict credit card practices and eliminate sudden increases in interest rates and late fees that have entangled millions of consumers.", 
        "threadID": "672198221_2830091222001", 
        "time": "2009-04-30 16:36:00", 
        "title": "House Passes Bill To Aid Credit Card Users", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: \"http://www.cbsnews.com/stories/2009/04/30/business/main4981084.shtml?tag=main_home_storiesBySection\" (AP) Riding a crest of populist anger, the House on Thursday approved a bill to restrict credit card practices and eliminate sudden increases in interest rates and late fees that have entangled millions of consumers. I was interested in this at first until we read it doesn't become effect for year. The 45 day notification is, who cares? They still will do what they do. Charging late fee's when you're not, over the limit when they add the additional late fee's and then to pour vinegar on the wound, charge the higher rate of interest (up 10 points in a month) on all of the above. It gets frustrating. But my favorite of all credit cards \"The Home Depot\" recently called, reduce my interest by a 66% and spread my payments out guaranteeing a percentage rate.", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "Originally posted by ss_287: \"http://www.cbsnews.com/stories/2009/04/30/business/main4981084.shtml?tag=main_home_storiesBySection\" (AP) Riding a crest of populist anger, the House on Thursday approved a bill to restrict credit card practices and eliminate sudden increases in interest rates and late fees that have entangled millions of consumers.", 
        "reply": " I was interested in this at first until we read it doesn't become effect for year. The 45 day notification is, who cares? They still will do what they do. Charging late fee's when you're not, over the limit when they add the additional late fee's and then to pour vinegar on the wound, charge the higher rate of interest (up 10 points in a month) on all of the above. It gets frustrating. But my favorite of all credit cards \"The Home Depot\" recently called, reduce my interest by a 66% and spread my payments out guaranteeing a percentage rate.", 
        "threadID": "672198221_2830091222001", 
        "time": "2009-04-30 18:19:00", 
        "title": "House Passes Bill To Aid Credit Card Users", 
        "userID": "rayevinsonsr"
    }
]