[
    {
        "content": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 12:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "intTime": 20090517, 
        "postID": 2, 
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President.", 
        "reply": " Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:17:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "intTime": 20090517, 
        "postID": 3, 
        "quote": "", 
        "reply": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:26:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience. Blecchhhh....", 
        "intTime": 20090517, 
        "postID": 4, 
        "quote": "Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "reply": " Blecchhhh....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:33:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "badmac933"
    }, 
    {
        "content": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 5, 
        "quote": "", 
        "reply": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:34:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "intTime": 20090517, 
        "postID": 6, 
        "quote": "", 
        "reply": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "", 
        "reply": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:07:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "strobelvets"
    }, 
    {
        "content": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "", 
        "reply": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:43:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well.", 
        "reply": " Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:54:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "", 
        "reply": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:12:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "", 
        "reply": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:13:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "", 
        "reply": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 21:31:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?...", 
        "reply": " Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "", 
        "reply": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:10:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 17, 
        "quote": "", 
        "reply": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:20:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. I agree... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 18, 
        "quote": "Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well.", 
        "reply": " I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:30:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "intTime": 20090517, 
        "postID": 19, 
        "quote": "", 
        "reply": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 23:14:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "intTime": 20090518, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-18 03:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "busnrete8"
    }, 
    {
        "content": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 12:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "intTime": 20090517, 
        "postID": 22, 
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President.", 
        "reply": " Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:17:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "intTime": 20090517, 
        "postID": 23, 
        "quote": "", 
        "reply": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:26:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience. Blecchhhh....", 
        "intTime": 20090517, 
        "postID": 24, 
        "quote": "Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "reply": " Blecchhhh....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:33:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "badmac933"
    }, 
    {
        "content": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 25, 
        "quote": "", 
        "reply": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:34:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "intTime": 20090517, 
        "postID": 26, 
        "quote": "", 
        "reply": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 27, 
        "quote": "", 
        "reply": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "intTime": 20090517, 
        "postID": 28, 
        "quote": "", 
        "reply": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:07:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "strobelvets"
    }, 
    {
        "content": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "intTime": 20090517, 
        "postID": 29, 
        "quote": "", 
        "reply": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:43:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "intTime": 20090517, 
        "postID": 30, 
        "quote": "Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well.", 
        "reply": " Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:54:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 31, 
        "quote": "", 
        "reply": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:12:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "intTime": 20090517, 
        "postID": 32, 
        "quote": "", 
        "reply": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:13:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "intTime": 20090517, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 34, 
        "quote": "", 
        "reply": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 21:31:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "intTime": 20090517, 
        "postID": 35, 
        "quote": "Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?...", 
        "reply": " Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 36, 
        "quote": "", 
        "reply": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:10:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 37, 
        "quote": "", 
        "reply": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:20:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. I agree... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 38, 
        "quote": "Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well.", 
        "reply": " I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:30:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "intTime": 20090517, 
        "postID": 39, 
        "quote": "", 
        "reply": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 23:14:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "intTime": 20090518, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-18 03:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "busnrete8"
    }, 
    {
        "content": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 41, 
        "quote": "", 
        "reply": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 12:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "intTime": 20090517, 
        "postID": 42, 
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President.", 
        "reply": " Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:17:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "intTime": 20090517, 
        "postID": 43, 
        "quote": "", 
        "reply": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:26:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience. Blecchhhh....", 
        "intTime": 20090517, 
        "postID": 44, 
        "quote": "Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "reply": " Blecchhhh....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:33:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "badmac933"
    }, 
    {
        "content": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 45, 
        "quote": "", 
        "reply": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:34:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "intTime": 20090517, 
        "postID": 46, 
        "quote": "", 
        "reply": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 47, 
        "quote": "", 
        "reply": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "intTime": 20090517, 
        "postID": 48, 
        "quote": "", 
        "reply": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:07:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "strobelvets"
    }, 
    {
        "content": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "intTime": 20090517, 
        "postID": 49, 
        "quote": "", 
        "reply": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:43:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "intTime": 20090517, 
        "postID": 50, 
        "quote": "Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well.", 
        "reply": " Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:54:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 51, 
        "quote": "", 
        "reply": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:12:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "intTime": 20090517, 
        "postID": 52, 
        "quote": "", 
        "reply": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:13:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "intTime": 20090517, 
        "postID": 53, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 54, 
        "quote": "", 
        "reply": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 21:31:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "intTime": 20090517, 
        "postID": 55, 
        "quote": "Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?...", 
        "reply": " Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 56, 
        "quote": "", 
        "reply": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:10:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 57, 
        "quote": "", 
        "reply": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:20:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. I agree... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 58, 
        "quote": "Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well.", 
        "reply": " I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:30:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "intTime": 20090517, 
        "postID": 59, 
        "quote": "", 
        "reply": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 23:14:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "intTime": 20090518, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-18 03:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "busnrete8"
    }, 
    {
        "content": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 61, 
        "quote": "", 
        "reply": "\"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 12:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President. Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "intTime": 20090517, 
        "postID": 62, 
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090517/ap_on_go_pr_wh/us_obama_notre_dame\" ... from students and faculty, much to the chagrin of the right-wingers and orthodox Catholic out-of-touch hardliners. Every time the righties believe they have him (with their wedge issues), he comes and puts out their fire. Keep up the excellent work Mr. President.", 
        "reply": " Nearly 40 protesters arrested at Notre Dame By TOM COYNE, Associated Press Writer – 42 mins ago SOUTH BEND, Ind. – Nearly 40 people were arrested Sunday as they tried to enter the University of Notre Dame to protest President Barack Obama's appearance at commencement, police said. At least 39 people were taken into custody on trespassing charges, police Sgt. Bill Redman said. Among those arrested were Norma McCorvey, the plaintiff identified as \"Roe\" in the Roe v. Wade Supreme Court decision that legalized abortion. She now opposes abortion. Obama's commencement speech capped weeks of protests at the nation's most prominent Roman Catholic university. Critics have condemned the university's decision to invite Obama, who supports abortion rights and embryonic stem-cell research, and some have called for the resignation of the Rev. John Jenkins, the university's president. In his introduction for Obama, Jenkins reiterated the school's support for the church's teaching on the sanctity of human life but applauded Obama for coming to the school. \"Others might have avoided this venue for that reason, but President Obama is not someone who stops talking to those who differ with him,\" he said. Obama thanked graduates for their \"maturity and responsibility,\" acknowledging that his appearance \"has not been without controversy.\" Hundreds of people attended an outdoor Mass and rally on campus, while students who decided not to attend the commencement went elsewhere on campus for prayer. Students opposing the Obama invitation had urged peaceful protests. Victor Saenz, a philosophy graduate from Mexicali, Mexico, said attending the ceremony \"was something I just couldn't do\" because he believed Obama's invitation violated a 2004 statement adopted by U.S. bishops saying Catholic institutions should not honor those who don't adhere to church teachings. In his commencement appearance, Obama also received an honorary law degree. Bishop John D'Arcy, whose diocese includes Notre Dame, joined the rally and called students \"heroes\" for expressing their anger over the invitation to Obama. Some students who attended the rally carried signs declaring \"Shame on Notre Dame\" and \"Stop Abortion Now.\" Many wore anti-abortion T-shirts, one of which depicted a leprechaun throwing a baby into a trash can and the words \"May 17, 2009, The day the dome was forever tarnished,\" which referred to the school's famed golden dome. Sunsara Taylor, a New York City resident and a member of the abortion-rights group Abortion on Demand, said outside the school's gates that \"there was a voice missing\" in the controversy over Obama's visit. \"If women don't have a right to decide if they have a child, women aren't free,\" she said. \"We need to expand abortion access and abortion rights and lift the stigma. Fetuses are not babies and women are not incubators.\" School spokesman Dennis Brown said most of the arrests Sunday were at the school's front gate, where most of the protesters angered by Obama's campus appearance had gathered. He also said three people were ejected from the commencement venue after shouting anti-abortion slogans during Obama's speech. Kathleen Hession, a graduate from Iowa City, Iowa, said after the ceremony that the protests have overshadowed the students' academic achievements. \"This is our graduation, and it's neither the time nor the place to stage something like that,\" she said. \"I respect their beliefs, but it's not the right platform.\" yahoo.com/s/ap/20090517/ap_on_re_us/us_notre_dame_protests Had I been a graduating student I would have opted not to attend.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:17:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "intTime": 20090517, 
        "postID": 63, 
        "quote": "", 
        "reply": "I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:26:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience. Blecchhhh....", 
        "intTime": 20090517, 
        "postID": 64, 
        "quote": "Originally posted by fnewt: I listened to President Obama's address to the Notre Dame graduating class. It was a wonderful speech and it received a well deserved ovation by an appreciative audience.", 
        "reply": " Blecchhhh....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:33:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "badmac933"
    }, 
    {
        "content": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 65, 
        "quote": "", 
        "reply": "While I disagree with Mr. Obama's politics, and tend to question Notre Dame having invited him as a speaker considering the differances in their avowed beliefs, I am glad that everything for the most part went smoothly. As for the protestors, I think that was uncalled for. While I may disagree with the school inviting Obama, I have no right to go on their campus to gripe about it. Glad they were removed, as they were a blight on many students special day. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:34:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "intTime": 20090517, 
        "postID": 66, 
        "quote": "", 
        "reply": "It is pretty amusing and embarressing. Everyone pretends as if though all of the students at Notre Dome follow their catholic values LOL...yeah, i'm sure that is the case after every football game...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 17:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 67, 
        "quote": "", 
        "reply": "Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "intTime": 20090517, 
        "postID": 68, 
        "quote": "", 
        "reply": "Personally, I believe the POTUS stated his views as tactfully as He could. ND's reasons for inviting him aside. Politically, We have a new justice coming aboard soon...and All must be sounding the boards to see whcih way the political winds are blowing Re abortion, bearing arms...etc... We'll see...", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:07:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "strobelvets"
    }, 
    {
        "content": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "intTime": 20090517, 
        "postID": 69, 
        "quote": "", 
        "reply": "jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:43:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well. Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "intTime": 20090517, 
        "postID": 70, 
        "quote": "Originally posted by MM2_ss_Lewis: Irwin, I know better than to believe that all students at Notre Dame are ardent catholics. The school itself is alleged to espouse Catholic beliefs in their codes and avowed public statements, to me, that means the admin of the school are to support and uphold that doctrine. Like I said, the protest were wrong, I personally disagree with the invitation to the President in this situation, and lastly it is up to the schools admin to make the calls on who comes to their functions and who does not. Actually I'll add in that the people who fund the school have a bit of say on who comes and goes as well.", 
        "reply": " Agreed. It really made no sense inviting this President to this school UNLESS the institution had the backing of its very generous alumni... Notre Dame spends more time worring about their football program than their religious ideology.....Its obscene the ammount of money they spend on their football coaches, that money could be used to lift children out of poverty...etc..etc Again, this whole thing is a joke....", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 18:54:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 71, 
        "quote": "", 
        "reply": "So I've been doing some reading as I am bored out of my skull today... It seems that for Notre Dame to be a \"Catholic\" istitution, they have to conform to certain guidelines, and some of those points have been noted by various church officials who are discussing \"What should be done\"... Looks like it can range from nothing, to a quiet \"fix yourself\", all the way to no funds from the church and the school not being permitted to call itself \"Catholic\". Looks like it could have severe repercussions for Notre Dame if the powers that be want to go that route. As for the football team, couldn't care less myself, I support the Navy, the crimpson tide, the tigers, and of course the trojans here in Troy Alabama. But you have a point, the use of funds at Notre Dame, and most schools of higher learning are not used as they truly should be, but I guess it is harder to make a profit on good deeds and well earned degrees than it is when one packs the stadium every week... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:12:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "intTime": 20090517, 
        "postID": 72, 
        "quote": "", 
        "reply": "I wish President Obama would come to my college and give a speech. God bless Craven County Community College.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:13:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "intTime": 20090517, 
        "postID": 73, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " What positive comments were you expecting? I will admit he didn't barge on in .... he was invited. A very inappropriate invitation, IMHO. But that is the fault of the people who invited him. I would not have attended.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 19:56:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Boospar"
    }, 
    {
        "content": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 74, 
        "quote": "", 
        "reply": "Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 21:31:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?... Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "intTime": 20090517, 
        "postID": 75, 
        "quote": "Originally posted by MM2_ss_Lewis: Did some more digging, according to the people at \"replacejenkins.com\" alumni and other financial supporters have pledged to withhold 14 million dollars in future funds and donations to Notre Dame, until such time as Mr. Jenkins is no longer president of the university and it reclaims its \"Catholicness\"(for lack of a better word if it even is one). 14 million dollars, that would hurt the pocket book a bit I imagine... Anyone know what Notre Dame's budget looks like?...", 
        "reply": " Damn, I hope having President Obama come was worth 14million dollars... This can really turn ugly if some people want it to...and I think it might.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:03:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 76, 
        "quote": "", 
        "reply": "The point is, that the President was invited... Since he was invited, then the protests should have been left outside... I didn't vote for the POTUS but, I still have respect for the office and believe that protests should best be voiced at the ballot box or in a \"public\" forum, not the privacy of the Notre Dame assembly... Protest the President I will but, I will do it within the bounds of the law and of civility... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:10:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090517, 
        "postID": 77, 
        "quote": "", 
        "reply": "Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:20:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well. I agree... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 78, 
        "quote": "Originally posted by MM2_ss_Lewis: Sunliner81, I don't think anyone here would disagree tht the protestors should have stayed off campus, I make but one exception to that. Some students elected to skip the ceremoney and have a prayer vigil on the quad as a protest at the time the ceremony was being conducted, and did so with permission of the university, I support those students for standing for what they believe. The protesting groups compossed of non-Notre Dame people had no business on campus at all. The heart of the matter to me seems to be is Notre Dame going to retain its' catholic character or is it going to trade it in for publicity? Personally, I think the issuing of the invitation with the award of an honorary degree contrary to the standards set forth in 2004 regarding awards by catholic institutions to those who are at odds with church beliefs is a valid point of contention. At this point, Notre Dame is going to be forced to choose either to become more secular in nature, or else revert to their catholic roots. The invitation was made and accepted, now they will have to own the results as well.", 
        "reply": " I agree... Respectfully, SUNLINER81", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 22:30:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "intTime": 20090517, 
        "postID": 79, 
        "quote": "", 
        "reply": "I think President Obama is a master at what he does. He is a great public speaker to be sure. I hope he lives up to all his positive comments and helps America. Of course he will fall a few times, he is only human. As for the righties not given him credit, what do you expect when you don't give the same to their guy? You have to admit, Obama can get away with saying anything and most of the media and people on the left are star struck. They called out this guy named Savage on Bill Maher the other night for being all over Bush, Miss California and the righties and said Obama basically says the same thing and why don't you get on him? Savage hated to say it but he said Obama was a hypocrite when it comes to the gays. I think each said deserves a fair chance and to be treated with the respect the office deserves, However, you sure didn't see that when Bush was in office from the left so I don't know why they would expect it for their guy.", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-17 23:14:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do. Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "intTime": 20090518, 
        "postID": 80, 
        "quote": "Originally posted by crackerjacks61: jack I love how the righties never reply to positive topics about our President. Only if they come up something to pounce on him when they do.", 
        "reply": " Just like Boospar asked, what kind of positive comments did you want or were you looking for more 'soap box' material? I for one, didn't have a problem with him going to ND and speaking! I did, however, object to the rendering of an honorary degree. ND could have done the same as ASU and with held the degree part due to little time in office! Yeah, I know you all will say it's honorary and means nothing just as a symbol! Crackerjacks--go take a poll somewhere!", 
        "threadID": "672198221_3980005322001", 
        "time": "2009-05-18 03:08:00", 
        "title": "President Obama receives Lengthy Ovation at Notre Dame", 
        "userID": "busnrete8"
    }
]