[
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 14, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 15, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 16, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 17, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 18, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 19, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 20, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 21, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 22, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 23, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 24, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 25, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 26, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 27, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 28, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 29, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 30, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 31, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 32, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 33, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 34, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 35, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 36, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 37, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 38, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 39, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 40, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 41, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 42, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 43, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 44, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 45, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 46, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 47, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 48, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 49, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 50, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 51, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 52, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 53, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 54, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 55, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 56, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 57, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 58, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 59, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 60, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 61, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 62, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 63, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 64, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 65, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 66, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 67, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 68, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 69, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 70, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 71, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 72, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 73, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 74, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 75, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 76, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 77, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 78, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 79, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 80, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 81, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 82, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 83, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 84, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 85, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 86, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 87, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 88, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 89, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 90, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 91, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 92, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 93, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 94, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 95, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 96, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 97, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 98, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 99, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 100, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 101, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 102, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 103, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 104, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 105, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 106, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 107, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 108, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 109, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 110, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 111, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 112, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 113, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 114, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 115, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 116, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 117, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 118, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 119, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 120, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 121, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 122, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 123, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 124, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 125, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 126, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 127, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 128, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 129, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 130, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 131, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 132, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 133, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 134, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 135, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 136, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 137, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 138, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 139, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 140, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "intTime": 20090413, 
        "postID": 141, 
        "quote": "", 
        "reply": "I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 08:57:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "intTime": 20090413, 
        "postID": 142, 
        "quote": "", 
        "reply": "Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator? Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "intTime": 20090413, 
        "postID": 143, 
        "quote": "Originally posted by mrmixitup: Who cares what some idiot blowhard who's never been in the military has to say about the military? Especially one who's a lousy commentator?", 
        "reply": " Point is he was out of line and when you watch the video and see the disdain in his face it infuriates !", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 09:31:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "intTime": 20090413, 
        "postID": 144, 
        "quote": "", 
        "reply": "Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"The World's Finest\"", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:05:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "intTime": 20090413, 
        "postID": 145, 
        "quote": "", 
        "reply": "Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:10:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are. \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "intTime": 20090413, 
        "postID": 146, 
        "quote": "Originally posted by Kegler300: Glenn Beck has the utmost respect for our military. But, being typical liberals, you don't watch his TV show, or listen to him on the radio. You find some liberal, hate-filled diatribe on the Daily Kook, or Huff-n-Puff Post and run with it. Just shows how uninformed most liberals are.", 
        "reply": " \"Glenn Beck has the utmost respect for our military. \" And we know this how???? Cause you believe it? Cmon. If anyone else said what he said you would be screaming bloody murder but cause its a Right Winger they can get way with saying this garbage about the Navy. and I do stomach watching the man from time to time. His delusions of persecution are comical. I love how he linked the Japanese at Pearl harbor, the terrorist on 9/11 and the passage of the stim package as the \"them\" that attacked us. Whatever. Glenn Beck has a s much respect for the Military as any other chicken hawk. If Keith Olberman had said what he said I doubt you would say he has respect for the Military despite the fact Olbermann on numerous times has defended the military including one time when a talk radio host accuses the 82 Airborne of committing war crimes at Malmedy when it was the 82nd who were the VICTIMS of Nazi atrocities.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:53:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "intTime": 20090413, 
        "postID": 147, 
        "quote": "Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it!", 
        "reply": " \"I HOPE HE FAILS!\"-Limbaugh", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 10:55:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "intTime": 20090413, 
        "postID": 148, 
        "quote": "Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh", 
        "reply": " Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:00:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "intTime": 20090413, 
        "postID": 149, 
        "quote": "Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it.", 
        "reply": " Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:12:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid. Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "intTime": 20090413, 
        "postID": 150, 
        "quote": "Originally posted by spanner69: quote: Originally posted by sw614: quote: Originally posted by spanner69: quote: Originally posted by Motive25: Typical Faux-News, no-nothing ditto-heads. They were all hoping the operation would fail so they would have more oral diarrhea to spread about the POTUS. Well, now they can eat it and enjoy it! \"I HOPE HE FAILS!\"-Limbaugh Would be nice if you are going to quote Rush to atleast indicate you are using a partial quote of use the entire sentence. What you posted is misleading and you know it. Was just trying to be ironic. But yes the above quote was Limbaugh hoping President Obama's economic policies fail..Which to be fair would mean things in this country would get worse. But thats a discussion for another day. What Limbaugh did say about Obama and the Somalia incident is: \"This is President Obama voting present, declining to comment. This is President Obama not wanting to address anything that is hard. Addressing things that are hard bring your approval numbers down.\" Rush went on to attack Secretary of State Clinton for saying during a press event with the Moroccan foreign minister yesterday that the \"world must come together to end the scourge of piracy,\" and laughing as she was recounting America's cooperation with Morocco in combating piracy in the early 19th century. Rush said that Clinton \"warned\" us all about this \"3 a.m. phone call,\" but both she and Obama are \"inept\" in their handling of this. They \"don't know what to do.\" I guess he was wrong and stupid.", 
        "reply": " Gawd, but I've got a sandwich I'd love to feed him! I would let him have an oxycontin afterward so he would feel OK about it.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:16:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "Motive25"
    }, 
    {
        "content": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "intTime": 20090413, 
        "postID": 151, 
        "quote": "", 
        "reply": "Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:28:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 152, 
        "quote": "", 
        "reply": "**** Beck! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:35:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: **** Beck! 'They're air raiding villages' Obama.", 
        "intTime": 20090413, 
        "postID": 153, 
        "quote": "Originally posted by NSNN: **** Beck!", 
        "reply": " 'They're air raiding villages' Obama.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:38:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills. You like him, don't you? LOL", 
        "intTime": 20090413, 
        "postID": 154, 
        "quote": "Originally posted by BAGodbehere: Beck is as tame as it gets. He has nothing but respect for our military and just becuase he fumbles one, it doesn't mean squat. Mountians and molehills.", 
        "reply": " You like him, don't you? LOL", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "intTime": 20090413, 
        "postID": 155, 
        "quote": "", 
        "reply": "Ahh, I hardly watch or listen to him, we get him early in the morning on 990 am. It's a toss up but I usually listen to our local guy Rick Hamada 830am on the way to the site. I think Beck is kinda drippy, like the last guy picked for teams back in the ol school days. He's done pretty well for himself though. I normally go from Rick Hamada to Rush then to Hannity for an hour then switch over to Savage. Savage is my favorite becuase you never know what he is going to do but I know it's going to be entertaining and thats what they all are anyway, entertainers.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:46:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "intTime": 20090413, 
        "postID": 156, 
        "quote": "", 
        "reply": "If any of them can upset me it would be Dr. Laura, damn that women. I can only handle about ten min. of her before I want to smash my radio", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:48:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "intTime": 20090413, 
        "postID": 157, 
        "quote": "", 
        "reply": "Every time I hear Dr. Laura telling some young what to do I think of those nudy pictures of her back in her collage daze and think,,,,hypocrite.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 11:52:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "intTime": 20090413, 
        "postID": 158, 
        "quote": "", 
        "reply": "I generally don't comment on political issues. I generally don't like politicians period. But for once one of them kept their mouth shut about a situation and let the pros do what they do. Who gives a damn what some media type says. They just don't like dead air and have to talk to fill space. Most of them have their own self serving adgenda anyway. Screw 'em. Don't give me any CON. LIB. or REP. DEM. bs either they are all the same. Just running their mouths to hear themselves talk. They are worse than the guy screaming about mops on TV. BLAH BLAH BLAH BLAH. Who listens to that anyway.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "intTime": 20090413, 
        "postID": 159, 
        "quote": "Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole.", 
        "reply": " Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad. Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "intTime": 20090413, 
        "postID": 160, 
        "quote": "Originally posted by stec74: quote: Originally posted by spanner69: I wish I could find the stand alone video of this but I cant. But around the 38 second mark. Blowhard Beck starts saying that The Navy was looking to the FBI for advise about how to deal with the Pirates. Then later on he claims the Marines were needed in the standoff. \"http://www.dailykostv.com/w/001151/\" And he says \"And the Navy doesnt know how to fix this one\" While Beck may not like it that The President, Dec of Def and the naval commander on the scene didn't brief him on what was going on. Bottomline is The President and the SEALs GOT IT RIGHT! By the way if this was Olberman, Maddow or Moore claiming \"The Navy DOESNT KNOW how to fix thsi one\" What would the reaction on the board would be? Anyway, congrats to the NAVY!!! Well done! And Beck....Go Cheney yourself...ChickenHawk a-hole. Nice cut up job the \"Dailykook\" did in that video. If you saw the entire clips (the statements came from more than one, cherry picked nd cut to make him look bad) you would see that Beck was actually asking for the type of response that we ultimatly got. He was complaining about the fact that we had US Navy vessels on the scene and we are now to \"PC\" of a country to use force to remedy the situation. He was simply making fun of the fact that we have all of the resources of the US Navy available against a life boat and the Navy couldn't figure out how to \"fix this one\", he was being facetious. And his actual quote about the Marines was \"We have become so politically correct that no one would even dare think about sending in the Marines to fight pirates.\" Next time, try not to take your \"news\" from a weblog that pulls ten second clips from a five minute segment just to make a commentator look bad.", 
        "reply": " Right so the Navy was just twiddling its thumbs while they were trying to \"fix this\"..How about giving the Navy the benefit of the doubt and they were taking their time to make sure they got it right..Which they DID! What BEck saw on TV was NOT what was happening in the ocean. he was talking out his azz. Just like all tough talking chickenhawks who swear they are military geniuses. The Prez, Pentagon, Naval Commander on scene and the SEALs knew what they were gonna do when they were gonna do it. Reason you don't send in a Platoon of Marines to take over a boat is cause you have SEALs trained FOR THIS EXACT MISSION! But thats what happens when the bulk of his military education was watching Delta Force....The Movie with Rocket shooting Motorcycles and The Marine starring John Sena.", 
        "threadID": "672198221_3120095022001", 
        "time": "2009-04-13 12:49:00", 
        "title": "Glenn Beck disses The Navy", 
        "userID": "spanner69"
    }
]