[
    {
        "content": "quote: Russia's Victory Day parade biggest show of military might since Soviet days 1 hour, 54 minutes ago By Vladimir Isachenkov, The Associated Press MOSCOW - Rows of missiles and tanks rumbled through Moscow's Red Square and dozens of combat jets streaked overhead in the Victory Day parade Saturday in the largest display of military might since the Soviet times. President Dmitry Medvedev warned sternly that Russia was ready to respond to any challenge and said its military has proven this in real action - a clear reference to the war with neighbouring Georgia, a former Soviet republic. (...) Medvedev said that among soldiers taking part in Victory Day parade, \"there are those who have proven high capability of the Russian military in real action.\" \"We are confident that any aggression against our citizens will be firmly repelled,\" he said. The war and Russia's subsequent recognition of independence of South Ossetia and Abkhazia, another Georgian separatist province, badly strained Moscow's relations with the West. Medvedev underlined Russia's firm support for South Ossetia and Abkhazia by sending his Victory Day greetings to leaders of both regions, putting them on equal par with heads of ex-Soviet nations who he also congratulated. (...) He reaffirmed his push for a new European security treaty. He said security in Europe must be based on \"reliable arms control and reasonable sufficiency of military structures, broad co-operation between states and exclusively peaceful settlement of conflicts.\" Victory Day, marking the defeat of Nazi Germany, is Russia's most important secular holiday, and the parade reflected the Kremlin's efforts to revive the nation's armed forces and global clout. Russia first restored the Soviet-era practice of annual displays of heavy weaponry last year, but this time it put even more weapons on display. Medvedev and Vladimir Putin, his predecessor and now prime minister, watched the parade from a podium at Lenin's tomb, which was hidden by panels in three colours of Russian flag in an apparent effort to dodge comparisons with the Soviet past. The show displayed about 9,000 goose-stepping troops and more than 100 combat vehicles, including new Topol-M intercontinental ballistic missiles. For the first time, it featured the state-of-the art S-400 air defence missiles which Russian officials say are unrivalled in their combat capability. Also taking part in the parade were 69 combat planes and helicopters - twice the number featuring in last year's show. They included the world's heaviest An-124 Russian cargo plane, Tu-160 and Tu-95 strategic bombers and scores of fighter jets and helicopter gunships... ++http://ca.news.yahoo.com/s/capress/090509/world/russia_victory_day Yikes. Is Medevedev really coming more into his own as a leader with public demonstrations like this or he is merely again serving as Putin's mouthpiece?", 
        "intTime": 20090509, 
        "postID": 1, 
        "quote": "Russia's Victory Day parade biggest show of military might since Soviet days 1 hour, 54 minutes ago By Vladimir Isachenkov, The Associated Press MOSCOW - Rows of missiles and tanks rumbled through Moscow's Red Square and dozens of combat jets streaked overhead in the Victory Day parade Saturday in the largest display of military might since the Soviet times. President Dmitry Medvedev warned sternly that Russia was ready to respond to any challenge and said its military has proven this in real action - a clear reference to the war with neighbouring Georgia, a former Soviet republic. (...) Medvedev said that among soldiers taking part in Victory Day parade, \"there are those who have proven high capability of the Russian military in real action.\" \"We are confident that any aggression against our citizens will be firmly repelled,\" he said. The war and Russia's subsequent recognition of independence of South Ossetia and Abkhazia, another Georgian separatist province, badly strained Moscow's relations with the West. Medvedev underlined Russia's firm support for South Ossetia and Abkhazia by sending his Victory Day greetings to leaders of both regions, putting them on equal par with heads of ex-Soviet nations who he also congratulated. (...) He reaffirmed his push for a new European security treaty. He said security in Europe must be based on \"reliable arms control and reasonable sufficiency of military structures, broad co-operation between states and exclusively peaceful settlement of conflicts.\" Victory Day, marking the defeat of Nazi Germany, is Russia's most important secular holiday, and the parade reflected the Kremlin's efforts to revive the nation's armed forces and global clout. Russia first restored the Soviet-era practice of annual displays of heavy weaponry last year, but this time it put even more weapons on display. Medvedev and Vladimir Putin, his predecessor and now prime minister, watched the parade from a podium at Lenin's tomb, which was hidden by panels in three colours of Russian flag in an apparent effort to dodge comparisons with the Soviet past. The show displayed about 9,000 goose-stepping troops and more than 100 combat vehicles, including new Topol-M intercontinental ballistic missiles. For the first time, it featured the state-of-the art S-400 air defence missiles which Russian officials say are unrivalled in their combat capability. Also taking part in the parade were 69 combat planes and helicopters - twice the number featuring in last year's show. They included the world's heaviest An-124 Russian cargo plane, Tu-160 and Tu-95 strategic bombers and scores of fighter jets and helicopter gunships...", 
        "reply": " ++http://ca.news.yahoo.com/s/capress/090509/world/russia_victory_day Yikes. Is Medevedev really coming more into his own as a leader with public demonstrations like this or he is merely again serving as Putin's mouthpiece?", 
        "threadID": "672198221_7200009222001", 
        "time": "2009-05-09 10:31:00", 
        "title": "Medvedev vows to \"rebuff aggression\" at Russia's largest Victory-Day military parade", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "I should imagine that he's still got Putin's hand up his bum but I suspect what he says is nothing more than what the Russians want to hear. They love to hear their leaders playing the hard man, threats appear to appeal to the Russian psyche.", 
        "intTime": 20090509, 
        "postID": 2, 
        "quote": "", 
        "reply": "I should imagine that he's still got Putin's hand up his bum but I suspect what he says is nothing more than what the Russians want to hear. They love to hear their leaders playing the hard man, threats appear to appeal to the Russian psyche.", 
        "threadID": "672198221_7200009222001", 
        "time": "2009-05-09 12:36:00", 
        "title": "Medvedev vows to \"rebuff aggression\" at Russia's largest Victory-Day military parade", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: They love to hear their leaders playing the hard man, threats appear to appeal to the Russian psyche. And it doesnt appeal to any other nations \"psyche\"! Last few years beg to differ. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090509, 
        "postID": 3, 
        "quote": "Originally posted by Bladensburg: They love to hear their leaders playing the hard man, threats appear to appeal to the Russian psyche.", 
        "reply": " And it doesnt appeal to any other nations \"psyche\"! Last few years beg to differ. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7200009222001", 
        "time": "2009-05-09 12:41:00", 
        "title": "Medvedev vows to \"rebuff aggression\" at Russia's largest Victory-Day military parade", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Bladensburg: They love to hear their leaders playing the hard man, threats appear to appeal to the Russian psyche. And it doesnt appeal to any other nations \"psyche\"! Last few years beg to differ. Well yes you have a point , but there's a whole different tone to the Russian threats these days compared with those of Bush's mob. Much cruder if possible and born less out of a paranoid fear of attack than a desire to bully and dominate.", 
        "intTime": 20090509, 
        "postID": 4, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Bladensburg: They love to hear their leaders playing the hard man, threats appear to appeal to the Russian psyche. And it doesnt appeal to any other nations \"psyche\"! Last few years beg to differ.", 
        "reply": " Well yes you have a point , but there's a whole different tone to the Russian threats these days compared with those of Bush's mob. Much cruder if possible and born less out of a paranoid fear of attack than a desire to bully and dominate.", 
        "threadID": "672198221_7200009222001", 
        "time": "2009-05-09 14:16:00", 
        "title": "Medvedev vows to \"rebuff aggression\" at Russia's largest Victory-Day military parade", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "In pictures: Moscow Ukraine: Belorus Serbia \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090509, 
        "postID": 5, 
        "quote": "", 
        "reply": "In pictures: Moscow Ukraine: Belorus Serbia \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7200009222001", 
        "time": "2009-05-09 17:09:00", 
        "title": "Medvedev vows to \"rebuff aggression\" at Russia's largest Victory-Day military parade", 
        "userID": "NSNN"
    }, 
    {
        "content": "I thought once we lost President Bush everybody was going to LOVE and smoother America with kindness. Medevedev is playing to the home crowd or has become more paranoid that Stalin. A couple days ago our book of the month club buddy from Venezuela got on his soap box dictating to our President to stop the bombing in Afghanistan, people were being killed. Now that happens to be the truth, but the ones being killed are the same that have been killing the people. Right next door it seems to have really caught hold and people are losing their heads. Haven't got a thing against the once communistic soviet nation, not a thing that they can offer would get an influx of immigration, and their oil doesn't appeal with all the strings attached, check with the European countries . So just who are they rebuffing?", 
        "intTime": 20090509, 
        "postID": 6, 
        "quote": "", 
        "reply": "I thought once we lost President Bush everybody was going to LOVE and smoother America with kindness. Medevedev is playing to the home crowd or has become more paranoid that Stalin. A couple days ago our book of the month club buddy from Venezuela got on his soap box dictating to our President to stop the bombing in Afghanistan, people were being killed. Now that happens to be the truth, but the ones being killed are the same that have been killing the people. Right next door it seems to have really caught hold and people are losing their heads. Haven't got a thing against the once communistic soviet nation, not a thing that they can offer would get an influx of immigration, and their oil doesn't appeal with all the strings attached, check with the European countries . So just who are they rebuffing?", 
        "threadID": "672198221_7200009222001", 
        "time": "2009-05-09 18:39:00", 
        "title": "Medvedev vows to \"rebuff aggression\" at Russia's largest Victory-Day military parade", 
        "userID": "rayevinsonsr"
    }
]