[
    {
        "content": "\"After Arlen Specter bolted the GOP Tuesday, Republicans like party chair Michael Steele attacked him as a \"leftist\" with a history of \"left-wing\" stands. That was yesterday. Twenty-four hours later, his former colleagues in the Senate GOP are rushing to embrace Specter's past in a new campaign designed to highlight the consistency of his Republican record. \"In light of Senator Specter's changing political party, we felt it was our civic duty to adequately inform Pennsylvania Democrat primary voters about their new Senator's record and his close relationship with our former President George W. Bush,\" National Republican Senatorial Committee spokeswoman Amber Wilkerson said in a Wednesday announcement. The effort includes a Web page featuring YouTube clips of Specter's positive comments about conservatives like Rush Limbaugh and Rick Santorum, and criticism of Senate Democratic leader Harry Reid. It also involves robocalls to Pennsylvania voters to \"help you welcome your newest Democrat senator\" that use audio from Specter's old campaign ads — audio featuring what the NRSC describes as \"glowing support\" from former President George W. Bush.\" \"http://politicalticker.blogs.cnn.com/2009/04/29/gop-using-specters-own-campaign-ads-against-him/\" just amazing. If your whole plan to defeat your rivals is to link them to your own party then the GOP has some MAJOR issue they need to fix.",
        "intTime": 20090430,
        "postID": 1,
        "quote": "",
        "reply": "\"After Arlen Specter bolted the GOP Tuesday, Republicans like party chair Michael Steele attacked him as a \"leftist\" with a history of \"left-wing\" stands. That was yesterday. Twenty-four hours later, his former colleagues in the Senate GOP are rushing to embrace Specter's past in a new campaign designed to highlight the consistency of his Republican record. \"In light of Senator Specter's changing political party, we felt it was our civic duty to adequately inform Pennsylvania Democrat primary voters about their new Senator's record and his close relationship with our former President George W. Bush,\" National Republican Senatorial Committee spokeswoman Amber Wilkerson said in a Wednesday announcement. The effort includes a Web page featuring YouTube clips of Specter's positive comments about conservatives like Rush Limbaugh and Rick Santorum, and criticism of Senate Democratic leader Harry Reid. It also involves robocalls to Pennsylvania voters to \"help you welcome your newest Democrat senator\" that use audio from Specter's old campaign ads — audio featuring what the NRSC describes as \"glowing support\" from former President George W. Bush.\" \"http://politicalticker.blogs.cnn.com/2009/04/29/gop-using-specters-own-campaign-ads-against-him/\" just amazing. If your whole plan to defeat your rivals is to link them to your own party then the GOP has some MAJOR issue they need to fix.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 00:02:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "karlhungusjr"
    },
    {
        "content": "Specter is just plain too old to be in any party. A vote for him is a wasted vote. The only votes he will get are those who will vote straight Democratic ticket and not those who vote for whats right for America. The war becomes nearer.",
        "intTime": 20090430,
        "postID": 2,
        "quote": "",
        "reply": "Specter is just plain too old to be in any party. A vote for him is a wasted vote. The only votes he will get are those who will vote straight Democratic ticket and not those who vote for whats right for America. The war becomes nearer.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:10:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Duster6"
    },
    {
        "content": "ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "intTime": 20090430,
        "postID": 3,
        "quote": "",
        "reply": "ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:29:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "busnrete8"
    },
    {
        "content": "quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "intTime": 20090430,
        "postID": 4,
        "quote": "Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "reply": " Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:32:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "xnavycg"
    },
    {
        "content": "I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat.",
        "intTime": 20090430,
        "postID": 5,
        "quote": "",
        "reply": "I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:33:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "intTime": 20090430,
        "postID": 6,
        "quote": "Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "reply": " Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 06:02:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? We need term limits for everybody in Washington. This crap of going for multiple years until they are dead is horse shiet and needs to stop. Do 8-12 and get the feck out. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090430,
        "postID": 7,
        "quote": "Originally posted by xnavycg: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "reply": " We need term limits for everybody in Washington. This crap of going for multiple years until they are dead is horse shiet and needs to stop. Do 8-12 and get the feck out. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 06:17:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by xnavycg: I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat. A lot of southern democrats or dixiecrats had long since switched to the GOP as the Dem party continued to move left. There are millions of registered democrats in the south who've been voting GOP in national elections since 1980. Started with votes for President, and has since gone to Senate seats and governorships. Clinton, bless his soul, fooled some of them in 92...but they still remember being tricked, as elections results from 08 showed.",
        "intTime": 20090430,
        "postID": 8,
        "quote": "Originally posted by xnavycg: I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat.",
        "reply": " A lot of southern democrats or dixiecrats had long since switched to the GOP as the Dem party continued to move left. There are millions of registered democrats in the south who've been voting GOP in national elections since 1980. Started with votes for President, and has since gone to Senate seats and governorships. Clinton, bless his soul, fooled some of them in 92...but they still remember being tricked, as elections results from 08 showed.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 07:08:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jwr6"
    },
    {
        "content": "quote: Originally posted by Fightdirector: Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time. Sad to say, I agree...it would take Amending the Constitution to make it happen, and nobody wants to vote term limits on their own old guy who is really good at \"bringing home the bacon\". The only way I see it happening if if we had some sort of major political revolution that resulted in the entire executive and legislative branches being replaced all at once, and this new crop voted a term limit amendment on themselves and sent it to their constituents.",
        "intTime": 20090430,
        "postID": 9,
        "quote": "Originally posted by Fightdirector: Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "reply": " Sad to say, I agree...it would take Amending the Constitution to make it happen, and nobody wants to vote term limits on their own old guy who is really good at \"bringing home the bacon\". The only way I see it happening if if we had some sort of major political revolution that resulted in the entire executive and legislative branches being replaced all at once, and this new crop voted a term limit amendment on themselves and sent it to their constituents.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 07:21:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jwr6"
    },
    {
        "content": "Going back on topic. I think this is one of the funniest articles I've ever read. And made even funnier by the fact that it's being reported as a dead serious article. \"Don't vote for Specter because he's a Republican.\" They have got to be kidding here. Talk about \"cutting off your nose to spite your face,\" that expression must have been invented just for this situation. No offense to those who think this is clever on their part - But if anything ever illustrated the bankruptcy of todays Republican Party, this is it. Dave",
        "intTime": 20090430,
        "postID": 10,
        "quote": "",
        "reply": "Going back on topic. I think this is one of the funniest articles I've ever read. And made even funnier by the fact that it's being reported as a dead serious article. \"Don't vote for Specter because he's a Republican.\" They have got to be kidding here. Talk about \"cutting off your nose to spite your face,\" that expression must have been invented just for this situation. No offense to those who think this is clever on their part - But if anything ever illustrated the bankruptcy of todays Republican Party, this is it. Dave",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 11:21:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Grachus"
    },
    {
        "content": "Hey that KKK democrat senator is still in office and now talk about old...he can't even stay wake more then 5 mintues a day, and can't walk, but he did get his state a lot of pork money, everything is name after him in W.V.",
        "intTime": 20090430,
        "postID": 11,
        "quote": "",
        "reply": "Hey that KKK democrat senator is still in office and now talk about old...he can't even stay wake more then 5 mintues a day, and can't walk, but he did get his state a lot of pork money, everything is name after him in W.V.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 12:04:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "dman1948"
    },
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time. BS! Everyone I know that favors term limits (myself included) wants it for all congress critters. Almost every damn one of them become corrupt during or after their second term. IMHO, we do not need career politicians in DC that are only worried about the next election. We need them to look out for the best interest of the country instead.",
        "intTime": 20090430,
        "postID": 12,
        "quote": "Originally posted by Fightdirector: quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "reply": " BS! Everyone I know that favors term limits (myself included) wants it for all congress critters. Almost every damn one of them become corrupt during or after their second term. IMHO, we do not need career politicians in DC that are only worried about the next election. We need them to look out for the best interest of the country instead.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 12:19:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Woody_in_La"
    },
    {
        "content": "As for the topic, I have to agree with Dave on this.....",
        "intTime": 20090430,
        "postID": 13,
        "quote": "",
        "reply": "As for the topic, I have to agree with Dave on this.....",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 12:20:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Well, excuse me for not being more specific. But I felt my 'term limit' statement was all inclusive! However for those who mis-understood, it isn't just for those I oppose. Term limits for all! Fell better now?",
        "intTime": 20090501,
        "postID": 14,
        "quote": "Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "reply": " Well, excuse me for not being more specific. But I felt my 'term limit' statement was all inclusive! However for those who mis-understood, it isn't just for those I oppose. Term limits for all! Fell better now?",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 05:16:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "busnrete8"
    },
    {
        "content": "All true American's see Senator Spector's choice of joining the Democratic Party as a testament to Democracy in it's purest sense. As a Democrat I say \"WELCOME!\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090501,
        "postID": 15,
        "quote": "",
        "reply": "All true American's see Senator Spector's choice of joining the Democratic Party as a testament to Democracy in it's purest sense. As a Democrat I say \"WELCOME!\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 05:26:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090501,
        "postID": 16,
        "quote": "Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "reply": " Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 05:28:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures. Jack if you had read all the other posts on here you would see that most people are in favor of a term limit regardless of the party. The Left on here are the only ones that keep bringing up the \"ONLY\" part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090501,
        "postID": 17,
        "quote": "Originally posted by jack_flats: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures.",
        "reply": " Jack if you had read all the other posts on here you would see that most people are in favor of a term limit regardless of the party. The Left on here are the only ones that keep bringing up the \"ONLY\" part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 06:01:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Anbar7"
    },
    {
        "content": "I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones.",
        "intTime": 20090501,
        "postID": 18,
        "quote": "",
        "reply": "I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones.",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 07:07:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones. I absolutely AGREE with all three of your reasons. Indeed, I'll add number four 4. If people cannot be concerned enough to decide on the issues, why will they be concerned to learn about people they never heard of? All this does is turn the choice of our representatives over to Party hacks. Dave",
        "intTime": 20090501,
        "postID": 19,
        "quote": "Originally posted by Motive25: I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones.",
        "reply": " I absolutely AGREE with all three of your reasons. Indeed, I'll add number four 4. If people cannot be concerned enough to decide on the issues, why will they be concerned to learn about people they never heard of? All this does is turn the choice of our representatives over to Party hacks. Dave",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 11:17:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Grachus"
    },
    {
        "content": "lol ... That's the problem with the GOP. they truly believe the voters are stupid and will actually listen to them. The last 2 elections proved otherwise, so do you really think the good people of Pennsylvania are going to believe this garbage? Perhaps the GOP could use some good advice, like, \"Start actually listening to the Meghan McCain'sof the Party, and get rid of your guns, religion and abortion platform.\" Hell, it's bad enough the Party got itself hi-jacked by the radical-rightie Christan Fundamentalists and the NRA. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090501,
        "postID": 20,
        "quote": "",
        "reply": "lol ... That's the problem with the GOP. they truly believe the voters are stupid and will actually listen to them. The last 2 elections proved otherwise, so do you really think the good people of Pennsylvania are going to believe this garbage? Perhaps the GOP could use some good advice, like, \"Start actually listening to the Meghan McCain'sof the Party, and get rid of your guns, religion and abortion platform.\" Hell, it's bad enough the Party got itself hi-jacked by the radical-rightie Christan Fundamentalists and the NRA. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 16:49:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jack_flats"
    },
    {
        "content": "\"After Arlen Specter bolted the GOP Tuesday, Republicans like party chair Michael Steele attacked him as a \"leftist\" with a history of \"left-wing\" stands. That was yesterday. Twenty-four hours later, his former colleagues in the Senate GOP are rushing to embrace Specter's past in a new campaign designed to highlight the consistency of his Republican record. \"In light of Senator Specter's changing political party, we felt it was our civic duty to adequately inform Pennsylvania Democrat primary voters about their new Senator's record and his close relationship with our former President George W. Bush,\" National Republican Senatorial Committee spokeswoman Amber Wilkerson said in a Wednesday announcement. The effort includes a Web page featuring YouTube clips of Specter's positive comments about conservatives like Rush Limbaugh and Rick Santorum, and criticism of Senate Democratic leader Harry Reid. It also involves robocalls to Pennsylvania voters to \"help you welcome your newest Democrat senator\" that use audio from Specter's old campaign ads — audio featuring what the NRSC describes as \"glowing support\" from former President George W. Bush.\" \"http://politicalticker.blogs.cnn.com/2009/04/29/gop-using-specters-own-campaign-ads-against-him/\" just amazing. If your whole plan to defeat your rivals is to link them to your own party then the GOP has some MAJOR issue they need to fix.",
        "intTime": 20090430,
        "postID": 21,
        "quote": "",
        "reply": "\"After Arlen Specter bolted the GOP Tuesday, Republicans like party chair Michael Steele attacked him as a \"leftist\" with a history of \"left-wing\" stands. That was yesterday. Twenty-four hours later, his former colleagues in the Senate GOP are rushing to embrace Specter's past in a new campaign designed to highlight the consistency of his Republican record. \"In light of Senator Specter's changing political party, we felt it was our civic duty to adequately inform Pennsylvania Democrat primary voters about their new Senator's record and his close relationship with our former President George W. Bush,\" National Republican Senatorial Committee spokeswoman Amber Wilkerson said in a Wednesday announcement. The effort includes a Web page featuring YouTube clips of Specter's positive comments about conservatives like Rush Limbaugh and Rick Santorum, and criticism of Senate Democratic leader Harry Reid. It also involves robocalls to Pennsylvania voters to \"help you welcome your newest Democrat senator\" that use audio from Specter's old campaign ads — audio featuring what the NRSC describes as \"glowing support\" from former President George W. Bush.\" \"http://politicalticker.blogs.cnn.com/2009/04/29/gop-using-specters-own-campaign-ads-against-him/\" just amazing. If your whole plan to defeat your rivals is to link them to your own party then the GOP has some MAJOR issue they need to fix.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 00:02:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "karlhungusjr"
    },
    {
        "content": "Specter is just plain too old to be in any party. A vote for him is a wasted vote. The only votes he will get are those who will vote straight Democratic ticket and not those who vote for whats right for America. The war becomes nearer.",
        "intTime": 20090430,
        "postID": 22,
        "quote": "",
        "reply": "Specter is just plain too old to be in any party. A vote for him is a wasted vote. The only votes he will get are those who will vote straight Democratic ticket and not those who vote for whats right for America. The war becomes nearer.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:10:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Duster6"
    },
    {
        "content": "ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "intTime": 20090430,
        "postID": 23,
        "quote": "",
        "reply": "ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:29:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "busnrete8"
    },
    {
        "content": "quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "intTime": 20090430,
        "postID": 24,
        "quote": "Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "reply": " Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:32:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "xnavycg"
    },
    {
        "content": "I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat.",
        "intTime": 20090430,
        "postID": 25,
        "quote": "",
        "reply": "I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 04:33:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "xnavycg"
    },
    {
        "content": "quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "intTime": 20090430,
        "postID": 26,
        "quote": "Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "reply": " Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 06:02:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: Originally posted by xnavycg: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? We need term limits for everybody in Washington. This crap of going for multiple years until they are dead is horse shiet and needs to stop. Do 8-12 and get the feck out. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090430,
        "postID": 27,
        "quote": "Originally posted by xnavycg: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "reply": " We need term limits for everybody in Washington. This crap of going for multiple years until they are dead is horse shiet and needs to stop. Do 8-12 and get the feck out. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 06:17:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by xnavycg: I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat. A lot of southern democrats or dixiecrats had long since switched to the GOP as the Dem party continued to move left. There are millions of registered democrats in the south who've been voting GOP in national elections since 1980. Started with votes for President, and has since gone to Senate seats and governorships. Clinton, bless his soul, fooled some of them in 92...but they still remember being tricked, as elections results from 08 showed.",
        "intTime": 20090430,
        "postID": 28,
        "quote": "Originally posted by xnavycg: I think Richard Shelby should have to step down, he’s been there a while, and used to be a Democrat.",
        "reply": " A lot of southern democrats or dixiecrats had long since switched to the GOP as the Dem party continued to move left. There are millions of registered democrats in the south who've been voting GOP in national elections since 1980. Started with votes for President, and has since gone to Senate seats and governorships. Clinton, bless his soul, fooled some of them in 92...but they still remember being tricked, as elections results from 08 showed.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 07:08:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jwr6"
    },
    {
        "content": "quote: Originally posted by Fightdirector: Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time. Sad to say, I agree...it would take Amending the Constitution to make it happen, and nobody wants to vote term limits on their own old guy who is really good at \"bringing home the bacon\". The only way I see it happening if if we had some sort of major political revolution that resulted in the entire executive and legislative branches being replaced all at once, and this new crop voted a term limit amendment on themselves and sent it to their constituents.",
        "intTime": 20090430,
        "postID": 29,
        "quote": "Originally posted by Fightdirector: Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "reply": " Sad to say, I agree...it would take Amending the Constitution to make it happen, and nobody wants to vote term limits on their own old guy who is really good at \"bringing home the bacon\". The only way I see it happening if if we had some sort of major political revolution that resulted in the entire executive and legislative branches being replaced all at once, and this new crop voted a term limit amendment on themselves and sent it to their constituents.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 07:21:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jwr6"
    },
    {
        "content": "Going back on topic. I think this is one of the funniest articles I've ever read. And made even funnier by the fact that it's being reported as a dead serious article. \"Don't vote for Specter because he's a Republican.\" They have got to be kidding here. Talk about \"cutting off your nose to spite your face,\" that expression must have been invented just for this situation. No offense to those who think this is clever on their part - But if anything ever illustrated the bankruptcy of todays Republican Party, this is it. Dave",
        "intTime": 20090430,
        "postID": 30,
        "quote": "",
        "reply": "Going back on topic. I think this is one of the funniest articles I've ever read. And made even funnier by the fact that it's being reported as a dead serious article. \"Don't vote for Specter because he's a Republican.\" They have got to be kidding here. Talk about \"cutting off your nose to spite your face,\" that expression must have been invented just for this situation. No offense to those who think this is clever on their part - But if anything ever illustrated the bankruptcy of todays Republican Party, this is it. Dave",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 11:21:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Grachus"
    },
    {
        "content": "Hey that KKK democrat senator is still in office and now talk about old...he can't even stay wake more then 5 mintues a day, and can't walk, but he did get his state a lot of pork money, everything is name after him in W.V.",
        "intTime": 20090430,
        "postID": 31,
        "quote": "",
        "reply": "Hey that KKK democrat senator is still in office and now talk about old...he can't even stay wake more then 5 mintues a day, and can't walk, but he did get his state a lot of pork money, everything is name after him in W.V.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 12:04:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "dman1948"
    },
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time. BS! Everyone I know that favors term limits (myself included) wants it for all congress critters. Almost every damn one of them become corrupt during or after their second term. IMHO, we do not need career politicians in DC that are only worried about the next election. We need them to look out for the best interest of the country instead.",
        "intTime": 20090430,
        "postID": 32,
        "quote": "Originally posted by Fightdirector: quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Almost every person who favors term limits only favors term limits for the party they oppose, or supports term limits for politicians in a state or district they don't live in. Term limits = sore grapes, most of the time.",
        "reply": " BS! Everyone I know that favors term limits (myself included) wants it for all congress critters. Almost every damn one of them become corrupt during or after their second term. IMHO, we do not need career politicians in DC that are only worried about the next election. We need them to look out for the best interest of the country instead.",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 12:19:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Woody_in_La"
    },
    {
        "content": "As for the topic, I have to agree with Dave on this.....",
        "intTime": 20090430,
        "postID": 33,
        "quote": "",
        "reply": "As for the topic, I have to agree with Dave on this.....",
        "threadID": "672198221_9330031222001",
        "time": "2009-04-30 12:20:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party? Well, excuse me for not being more specific. But I felt my 'term limit' statement was all inclusive! However for those who mis-understood, it isn't just for those I oppose. Term limits for all! Fell better now?",
        "intTime": 20090501,
        "postID": 34,
        "quote": "Originally posted by xnavycg: Term limits for both parties, or just the one you don’t support? Or maybe when someone bolts from a party?",
        "reply": " Well, excuse me for not being more specific. But I felt my 'term limit' statement was all inclusive! However for those who mis-understood, it isn't just for those I oppose. Term limits for all! Fell better now?",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 05:16:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "busnrete8"
    },
    {
        "content": "All true American's see Senator Spector's choice of joining the Democratic Party as a testament to Democracy in it's purest sense. As a Democrat I say \"WELCOME!\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090501,
        "postID": 35,
        "quote": "",
        "reply": "All true American's see Senator Spector's choice of joining the Democratic Party as a testament to Democracy in it's purest sense. As a Democrat I say \"WELCOME!\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 05:26:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090501,
        "postID": 36,
        "quote": "Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him!",
        "reply": " Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 05:28:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures. Jack if you had read all the other posts on here you would see that most people are in favor of a term limit regardless of the party. The Left on here are the only ones that keep bringing up the \"ONLY\" part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090501,
        "postID": 37,
        "quote": "Originally posted by jack_flats: quote: Originally posted by busnrete8: ANOTHER classic example for TERM LIMITS! Hey, it just came back to me. I remember sending specter a fax (and I wasn't the only one) last summer blasting him for wanting to investigate the New England Patriots for filiming other teams! I suggested he had other higher priorities that affected the American People a lot more and he ended his part! Maybe now he can rethink his investigation--I might make that recommendation to him! Term Limits \"ONLY\" when a Senator makes a choice that goes against one's political beiefs. That figures.",
        "reply": " Jack if you had read all the other posts on here you would see that most people are in favor of a term limit regardless of the party. The Left on here are the only ones that keep bringing up the \"ONLY\" part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 06:01:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Anbar7"
    },
    {
        "content": "I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones.",
        "intTime": 20090501,
        "postID": 38,
        "quote": "",
        "reply": "I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones.",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 07:07:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones. I absolutely AGREE with all three of your reasons. Indeed, I'll add number four 4. If people cannot be concerned enough to decide on the issues, why will they be concerned to learn about people they never heard of? All this does is turn the choice of our representatives over to Party hacks. Dave",
        "intTime": 20090501,
        "postID": 39,
        "quote": "Originally posted by Motive25: I oppose term limits for three reasons: (1) It artifically prevents people from voting for the people they want to and for people to run for office who want to. (2) It is an \"easy out\" that allows the voters to escape responsibility for voting out bad encumbents. (3) It increases the influence of the permanent bureaucracy by replacing experienced elected officials with inexperienced ones.",
        "reply": " I absolutely AGREE with all three of your reasons. Indeed, I'll add number four 4. If people cannot be concerned enough to decide on the issues, why will they be concerned to learn about people they never heard of? All this does is turn the choice of our representatives over to Party hacks. Dave",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 11:17:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "Grachus"
    },
    {
        "content": "lol ... That's the problem with the GOP. they truly believe the voters are stupid and will actually listen to them. The last 2 elections proved otherwise, so do you really think the good people of Pennsylvania are going to believe this garbage? Perhaps the GOP could use some good advice, like, \"Start actually listening to the Meghan McCain'sof the Party, and get rid of your guns, religion and abortion platform.\" Hell, it's bad enough the Party got itself hi-jacked by the radical-rightie Christan Fundamentalists and the NRA. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090501,
        "postID": 40,
        "quote": "",
        "reply": "lol ... That's the problem with the GOP. they truly believe the voters are stupid and will actually listen to them. The last 2 elections proved otherwise, so do you really think the good people of Pennsylvania are going to believe this garbage? Perhaps the GOP could use some good advice, like, \"Start actually listening to the Meghan McCain'sof the Party, and get rid of your guns, religion and abortion platform.\" Hell, it's bad enough the Party got itself hi-jacked by the radical-rightie Christan Fundamentalists and the NRA. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9330031222001",
        "time": "2009-05-01 16:49:00",
        "title": "New GOP strategy. \"Arlen Specter is a true Republican...so don't vote for him.\"",
        "userID": "jack_flats"
    }
]