[
    {
        "content": "quote: US President Barack Obama has named the Republican Governor of Utah, Jon Huntsman, as ambassador to China. Mr Huntsman, 49, is a fluent speaker of Mandarin, which he learnt while serving as a Mormon missionary in Taiwan. He has served as a deputy trade representative and ambassador to Singapore, and was seen as a potential presidential contender in 2012. President Obama said he had made the appointment \"mindful of its extraordinary significance\". \"Given the breadth of issues at stake in our relationship with China, this ambassadorship is as important as any in the world,\" he said. The US could most effectively confront global challenges by working together with China, he added. Mr Huntsman co-chaired the campaign of John McCain, Mr Obama's rival in last year's presidential election, and the president said it would not be the \"easiest decision to explain to some members of his party\". \"But here is what I also know: I know Jon is the kind of leader that always puts country ahead of party,\" he said. Mr Huntsman is seen as a moderate voice within the Republican party, correspondents say. Standing next to the president at a televised news conference, Mr Huntsman said: \"I grew up understanding that the most basic responsibility one has is service to country.\" (....) +http://news.bbc.co.uk/2/hi/americas/8053698.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090516,
        "postID": 1,
        "quote": "US President Barack Obama has named the Republican Governor of Utah, Jon Huntsman, as ambassador to China. Mr Huntsman, 49, is a fluent speaker of Mandarin, which he learnt while serving as a Mormon missionary in Taiwan. He has served as a deputy trade representative and ambassador to Singapore, and was seen as a potential presidential contender in 2012. President Obama said he had made the appointment \"mindful of its extraordinary significance\". \"Given the breadth of issues at stake in our relationship with China, this ambassadorship is as important as any in the world,\" he said. The US could most effectively confront global challenges by working together with China, he added. Mr Huntsman co-chaired the campaign of John McCain, Mr Obama's rival in last year's presidential election, and the president said it would not be the \"easiest decision to explain to some members of his party\". \"But here is what I also know: I know Jon is the kind of leader that always puts country ahead of party,\" he said. Mr Huntsman is seen as a moderate voice within the Republican party, correspondents say. Standing next to the president at a televised news conference, Mr Huntsman said: \"I grew up understanding that the most basic responsibility one has is service to country.\" (....)",
        "reply": " +http://news.bbc.co.uk/2/hi/americas/8053698.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9440064322001",
        "time": "2009-05-16 15:08:00",
        "title": "Obama names ambassador to China",
        "userID": "NSNN"
    },
    {
        "content": "China is a great place for Huntsman - keep him there - - Wandering and Wondering",
        "intTime": 20090516,
        "postID": 2,
        "quote": "",
        "reply": "China is a great place for Huntsman - keep him there - - Wandering and Wondering",
        "threadID": "672198221_9440064322001",
        "time": "2009-05-16 18:35:00",
        "title": "Obama names ambassador to China",
        "userID": "greywolfghost"
    }
]