[
    {
        "content": "Tabulated by Iraq To-day from a variety of sources, this week's reports from Iraq and Afghanistan. A good week in Iraq saw only 48 reported dead and 89 wounded in 37 bombing and shooting incidents. 6 bodies were recovered by police. A notable increase in arrests (58) including 35 from one raid were announced. 3 US service personnel were reported to have died. The USAF reported 174 tactical air missions flown over Iraq. Notable this week was an uptick in people shot for failing to respond to road 'signals' from coaltion forces. Terrorists continues to target Sanwha leaders. The government continues to go after Shia militias. In Afghanistan, 241 people were reported killed, 28 wounded, in more than 12 bombing and shooting incidents. 4 'terrorists' were reported arrested. 9 US forces were reported to have died and 6 were reported wounded. The USAF reported that 468 tactical air missions were flown. This weeks news included an account of another attempt on the life of President Karzai's brother, who is a regional governor. Two US airstrikes, which included the services of B-1 bombers, were being blamed for high civilian casualties.", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "", 
        "reply": "Tabulated by Iraq To-day from a variety of sources, this week's reports from Iraq and Afghanistan. A good week in Iraq saw only 48 reported dead and 89 wounded in 37 bombing and shooting incidents. 6 bodies were recovered by police. A notable increase in arrests (58) including 35 from one raid were announced. 3 US service personnel were reported to have died. The USAF reported 174 tactical air missions flown over Iraq. Notable this week was an uptick in people shot for failing to respond to road 'signals' from coaltion forces. Terrorists continues to target Sanwha leaders. The government continues to go after Shia militias. In Afghanistan, 241 people were reported killed, 28 wounded, in more than 12 bombing and shooting incidents. 4 'terrorists' were reported arrested. 9 US forces were reported to have died and 6 were reported wounded. The USAF reported that 468 tactical air missions were flown. This weeks news included an account of another attempt on the life of President Karzai's brother, who is a regional governor. Two US airstrikes, which included the services of B-1 bombers, were being blamed for high civilian casualties.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-20 13:41:00", 
        "title": "Weekly Box Score", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-20 14:46:00", 
        "title": "Weekly Box Score", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\" The mission was to get Saddam out of power. That's what we did anything else is a new mission.", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\"", 
        "reply": " The mission was to get Saddam out of power. That's what we did anything else is a new mission.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-22 01:17:00", 
        "title": "Weekly Box Score", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: The mission was to get Saddam out of power. That's what we did anything else is a new mission. I thought the mission had something to do with WMDs? No wait, that changed when there were none. Then the mission was to prove the terrorist connection. But that changed when the only active camps found were in the Khurdish North were Sadman no longer was in control. Maybe the sign should have read \"Missions Accomplished\" with little tic marks for each time the mission changed.", 
        "intTime": 20090522, 
        "postID": 4, 
        "quote": "The mission was to get Saddam out of power. That's what we did anything else is a new mission.", 
        "reply": " I thought the mission had something to do with WMDs? No wait, that changed when there were none. Then the mission was to prove the terrorist connection. But that changed when the only active camps found were in the Khurdish North were Sadman no longer was in control. Maybe the sign should have read \"Missions Accomplished\" with little tic marks for each time the mission changed.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-22 04:50:00", 
        "title": "Weekly Box Score", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\" Wow that was fast flat Jack. Just one post from above and it is the same lame excuse. Blame it on Bush. Do you think Brother B will still be blaming Bush in 4 years from now when we are still in Afghanistan.", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\"", 
        "reply": " Wow that was fast flat Jack. Just one post from above and it is the same lame excuse. Blame it on Bush. Do you think Brother B will still be blaming Bush in 4 years from now when we are still in Afghanistan.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-22 04:57:00", 
        "title": "Weekly Box Score", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\" snicker...gota love that one.", 
        "intTime": 20090522, 
        "postID": 6, 
        "quote": "Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\"", 
        "reply": " snicker...gota love that one.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-22 15:06:00", 
        "title": "Weekly Box Score", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "May 19 - 26: Iraq: 130 Iraqis reported killed, 235 wounded in more than 37 bombing or shooting incidents. 25 unidentifed bodies found. 6 reported detained. US forces lost 5 with two SD employees and 3 civilians reported killed. No wounded reported. The USAF reported 178 tactical air sorties over Iraq. There was a notable up-tick in bombings in Baghdad and Anbar. Intel is reported to have broken a major bombing ring over the week-end. Some repeated violence in Basra. Afghanistan: 143 Afghans were reported killed and 45 were reported wounded this week. There were 10 ied/bombing incidents reported. 9 dissidents were reported arrested. ISAF forces lost 12 killed and eleven reported wounded. The USAF reported 471 tactical air missions flown over Afghanistan.", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "", 
        "reply": "May 19 - 26: Iraq: 130 Iraqis reported killed, 235 wounded in more than 37 bombing or shooting incidents. 25 unidentifed bodies found. 6 reported detained. US forces lost 5 with two SD employees and 3 civilians reported killed. No wounded reported. The USAF reported 178 tactical air sorties over Iraq. There was a notable up-tick in bombings in Baghdad and Anbar. Intel is reported to have broken a major bombing ring over the week-end. Some repeated violence in Basra. Afghanistan: 143 Afghans were reported killed and 45 were reported wounded this week. There were 10 ied/bombing incidents reported. 9 dissidents were reported arrested. ISAF forces lost 12 killed and eleven reported wounded. The USAF reported 471 tactical air missions flown over Afghanistan.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-26 11:51:00", 
        "title": "Weekly Box Score", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\" It is amazing that during that speech on the USS Lincoln, President Bush declared an end to major combat operarions while noting that the battle against terrorism was long from over. I always took the banner to mean the carrier's deployment of 10 months was over and that they did indeed accomplish their mission. They were deployed for the invasion of Iraq and the toppling of Saddam's regime and allowing for unrestricted access for inspections. Wasn't that accomplished? Where in the speech did President Bush say, as you quote, \"..the mission in Iraq has been accomplished\"? He did mention that the removal of Saddam and the Battle of Iraq had been accomplished and said that the forces were now engaged in securing the country, reconstrcution, and working with the Iraqis (which continues). I saw no wording as you quoted in the speech as posted on CNN. But I guess it is a matter of different perspective.", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "Originally posted by jack_flats: Yup, as President Bush once said \"...the U.S. mission in Iraq had been completed.\" \"Mission Accomplished.\"", 
        "reply": " It is amazing that during that speech on the USS Lincoln, President Bush declared an end to major combat operarions while noting that the battle against terrorism was long from over. I always took the banner to mean the carrier's deployment of 10 months was over and that they did indeed accomplish their mission. They were deployed for the invasion of Iraq and the toppling of Saddam's regime and allowing for unrestricted access for inspections. Wasn't that accomplished? Where in the speech did President Bush say, as you quote, \"..the mission in Iraq has been accomplished\"? He did mention that the removal of Saddam and the Battle of Iraq had been accomplished and said that the forces were now engaged in securing the country, reconstrcution, and working with the Iraqis (which continues). I saw no wording as you quoted in the speech as posted on CNN. But I guess it is a matter of different perspective.", 
        "threadID": "672198221_5500097322001", 
        "time": "2009-05-26 12:23:00", 
        "title": "Weekly Box Score", 
        "userID": "sw614"
    }
]