[
    {
        "content": "How can Congress pass a law that allows for industry bonuses in one month (the Stimulus Package in February) and in the next month, in a reflection of public outrage over the (legal) AIG bonuses, pass another bill that taxes those bonuses at the 90% level? The verbal gymnastics that the House Democrats are doing to explain this are amazing. Half of the House Republicans went along with the herd stampede. This bill an ex postal facto tax and blatantly confiscatory and therefore illegal on both counts. It hits a lot of people who did absolutely nothing wrong. In the case of AIG, the people who caused the meltdown of the Financial Products division are long gone and the ones who are left are working to clean up the mess on behalf of the taxpayer, since we own most of the company now. Many of the AIG people are going to return their bonuses and a letter of resignation in protest to this Bill, leaving the taxpayer on the hook for much of our bailout money, because no one else has the expertise historical knowledge needed to unwind the remaining hundreds of billions of bad deals (they have already fixed hundreds of billions). Rather than exercise some mature, adult leadership and say this bill is not only hypocritical, illegal and probably counterproductive, the Speaker and the rest of the Democratic leadership allowed to come to a vote, just because the people are angry at something they don't really understand. And Obama is talking about signing it if gets through the Senate. This is absurd! *http://www.cnn.com/2009/POLITICS/03/19/bonus.bill/index.html*", 
        "intTime": 20090319, 
        "postID": 1, 
        "quote": "", 
        "reply": "How can Congress pass a law that allows for industry bonuses in one month (the Stimulus Package in February) and in the next month, in a reflection of public outrage over the (legal) AIG bonuses, pass another bill that taxes those bonuses at the 90% level? The verbal gymnastics that the House Democrats are doing to explain this are amazing. Half of the House Republicans went along with the herd stampede. This bill an ex postal facto tax and blatantly confiscatory and therefore illegal on both counts. It hits a lot of people who did absolutely nothing wrong. In the case of AIG, the people who caused the meltdown of the Financial Products division are long gone and the ones who are left are working to clean up the mess on behalf of the taxpayer, since we own most of the company now. Many of the AIG people are going to return their bonuses and a letter of resignation in protest to this Bill, leaving the taxpayer on the hook for much of our bailout money, because no one else has the expertise historical knowledge needed to unwind the remaining hundreds of billions of bad deals (they have already fixed hundreds of billions). Rather than exercise some mature, adult leadership and say this bill is not only hypocritical, illegal and probably counterproductive, the Speaker and the rest of the Democratic leadership allowed to come to a vote, just because the people are angry at something they don't really understand. And Obama is talking about signing it if gets through the Senate. This is absurd! *http://www.cnn.com/2009/POLITICS/03/19/bonus.bill/index.html*", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-19 18:51:00", 
        "title": "Theater Of The Absurd", 
        "userID": "Motive25"
    }, 
    {
        "content": "What we are witnessing is akin to a pack of wild dogs arriving at a kill AFTER all the meat has been stripped off the bones of the carcass: Anger, frustration, embarrassment, etc., etc.... Pathetic. Will they learn their lesson THIS time? Don't bet on it.", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "", 
        "reply": "What we are witnessing is akin to a pack of wild dogs arriving at a kill AFTER all the meat has been stripped off the bones of the carcass: Anger, frustration, embarrassment, etc., etc.... Pathetic. Will they learn their lesson THIS time? Don't bet on it.", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-21 14:01:00", 
        "title": "Theater Of The Absurd", 
        "userID": "Dublin1916"
    }, 
    {
        "content": "Better question...How can a United States Republican President stand in front of millions of people and tell them the world is going to end unless they all give the Corporations Billions of dollars in their hard earned money? Take from Tommy to pay Frankie off and it's A ok, but don't bother giving Julie any. HOW ABSURD!!!!! Never forget it was President W that started this bailout crap and no one else.", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "", 
        "reply": "Better question...How can a United States Republican President stand in front of millions of people and tell them the world is going to end unless they all give the Corporations Billions of dollars in their hard earned money? Take from Tommy to pay Frankie off and it's A ok, but don't bother giving Julie any. HOW ABSURD!!!!! Never forget it was President W that started this bailout crap and no one else.", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-21 14:30:00", 
        "title": "Theater Of The Absurd", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Motive25: How can Congress pass a law that allows for industry bonuses in one month (the Stimulus Package in February) and in the next month, in a reflection of public outrage over the (legal) AIG bonuses, pass another bill that taxes those bonuses at the 90% level? The verbal gymnastics that the House Democrats are doing to explain this are amazing. Half of the House Republicans went along with the herd stampede. This bill an ex postal facto tax and blatantly confiscatory and therefore illegal on both counts. It hits a lot of people who did absolutely nothing wrong. In the case of AIG, the people who caused the meltdown of the Financial Products division are long gone and the ones who are left are working to clean up the mess on behalf of the taxpayer, since we own most of the company now. Many of the AIG people are going to return their bonuses and a letter of resignation in protest to this Bill, leaving the taxpayer on the hook for much of our bailout money, because no one else has the expertise historical knowledge needed to unwind the remaining hundreds of billions of bad deals (they have already fixed hundreds of billions). Rather than exercise some mature, adult leadership and say this bill is not only hypocritical, illegal and probably counterproductive, the Speaker and the rest of the Democratic leadership allowed to come to a vote, just because the people are angry at something they don't really understand. And Obama is talking about signing it if gets through the Senate. This is absurd! *http://www.cnn.com/2009/POLITICS/03/19/bonus.bill/index.html* Good post in my view. Worse, had not Senator Kyle objected, Senator Reid was going to put the House measure to a voice vote in the Senate. Hopefully by the time it comes up for debate next week, enough of us will have called/faxed/written our senators to tell them this is DUMB and calmer heads will prevail. IMHO, the whole \"Congressional outrage\" drill is a red herring to divert attention from their own culpability.", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "Originally posted by Motive25: How can Congress pass a law that allows for industry bonuses in one month (the Stimulus Package in February) and in the next month, in a reflection of public outrage over the (legal) AIG bonuses, pass another bill that taxes those bonuses at the 90% level? The verbal gymnastics that the House Democrats are doing to explain this are amazing. Half of the House Republicans went along with the herd stampede. This bill an ex postal facto tax and blatantly confiscatory and therefore illegal on both counts. It hits a lot of people who did absolutely nothing wrong. In the case of AIG, the people who caused the meltdown of the Financial Products division are long gone and the ones who are left are working to clean up the mess on behalf of the taxpayer, since we own most of the company now. Many of the AIG people are going to return their bonuses and a letter of resignation in protest to this Bill, leaving the taxpayer on the hook for much of our bailout money, because no one else has the expertise historical knowledge needed to unwind the remaining hundreds of billions of bad deals (they have already fixed hundreds of billions). Rather than exercise some mature, adult leadership and say this bill is not only hypocritical, illegal and probably counterproductive, the Speaker and the rest of the Democratic leadership allowed to come to a vote, just because the people are angry at something they don't really understand. And Obama is talking about signing it if gets through the Senate. This is absurd! *http://www.cnn.com/2009/POLITICS/03/19/bonus.bill/index.html*", 
        "reply": " Good post in my view. Worse, had not Senator Kyle objected, Senator Reid was going to put the House measure to a voice vote in the Senate. Hopefully by the time it comes up for debate next week, enough of us will have called/faxed/written our senators to tell them this is DUMB and calmer heads will prevail. IMHO, the whole \"Congressional outrage\" drill is a red herring to divert attention from their own culpability.", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-21 15:47:00", 
        "title": "Theater Of The Absurd", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "What I like is all the folks that followed the empty slogans, are getting a good dose of reality and don't know how to deal with the fact that they've been BS'd. All they can do is point to Bush with-- \"Yeah, but he ---\"", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "", 
        "reply": "What I like is all the folks that followed the empty slogans, are getting a good dose of reality and don't know how to deal with the fact that they've been BS'd. All they can do is point to Bush with-- \"Yeah, but he ---\"", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-21 15:54:00", 
        "title": "Theater Of The Absurd", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Better question...How can a United States Republican President stand in front of millions of people and tell them the world is going to end unless they all give the Corporations Billions of dollars in their hard earned money? Take from Tommy to pay Frankie off and it's A ok, but don't bother giving Julie any. HOW ABSURD!!!!! Never forget it was President W that started this bailout crap and no one else. Had everything to do with Banks and very little to do with AIG. Not looking up dates or timeline this started in September of last year. By the time Congress chewed on it a while $350 billion was handed to Bernenke's types to bailout banks and brokers. The secret list of who got what was never published except for the other $350 billion bailout was consulted with and went to the next administration. It wasn't Bush. Supposively the banks are back on their own and Wall Street brokers are back doing whatever they do. This absurbity is not on Bush's watch and his paultry $350 billion is chump change compared to whats being floated in D C now..", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: Better question...How can a United States Republican President stand in front of millions of people and tell them the world is going to end unless they all give the Corporations Billions of dollars in their hard earned money? Take from Tommy to pay Frankie off and it's A ok, but don't bother giving Julie any. HOW ABSURD!!!!! Never forget it was President W that started this bailout crap and no one else.", 
        "reply": " Had everything to do with Banks and very little to do with AIG. Not looking up dates or timeline this started in September of last year. By the time Congress chewed on it a while $350 billion was handed to Bernenke's types to bailout banks and brokers. The secret list of who got what was never published except for the other $350 billion bailout was consulted with and went to the next administration. It wasn't Bush. Supposively the banks are back on their own and Wall Street brokers are back doing whatever they do. This absurbity is not on Bush's watch and his paultry $350 billion is chump change compared to whats being floated in D C now..", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-21 16:55:00", 
        "title": "Theater Of The Absurd", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Better question...How can a United States Republican President stand in front of millions of people and tell them the world is going to end unless they all give the Corporations Billions of dollars in their hard earned money? Take from Tommy to pay Frankie off and it's A ok, but don't bother giving Julie any. HOW ABSURD!!!!! Never forget it was President W that started this bailout crap and no one else. Fortunatly, we elected a Democratic President who believes in change. One who will turn his back on the mistakes of the previous administration. Certainly one who would never take a bad idea from the Bush administration and expand on it. Never happen, eh CJ?", 
        "intTime": 20090322, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: Better question...How can a United States Republican President stand in front of millions of people and tell them the world is going to end unless they all give the Corporations Billions of dollars in their hard earned money? Take from Tommy to pay Frankie off and it's A ok, but don't bother giving Julie any. HOW ABSURD!!!!! Never forget it was President W that started this bailout crap and no one else.", 
        "reply": " Fortunatly, we elected a Democratic President who believes in change. One who will turn his back on the mistakes of the previous administration. Certainly one who would never take a bad idea from the Bush administration and expand on it. Never happen, eh CJ?", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-22 01:21:00", 
        "title": "Theater Of The Absurd", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I don't agree with bailouts on principle, be they Bush's bailouts or Obama's. If I mismanage a small buiness that I created and it fails, the government doesn't help me. It's pretty unfair when corporations, who have all the resources and talent in the world knowingly make bad decisions and then get paid. I'm against deregulation for the same reason. It allows the problems to continue and get worse. The economy is a fluid, flexible, complicated thing and using a set doctrine (socialism, unconstrained capitalism) in the face of reality is foolish. We need to balance taxes, regulation, funding, and the free market in order to make things work. Bailouts will not work in the long run because they reinforce bad behavior. Executives who run their companies into the ground need be kicked out on the street to live with their workers.", 
        "intTime": 20090322, 
        "postID": 8, 
        "quote": "", 
        "reply": "I don't agree with bailouts on principle, be they Bush's bailouts or Obama's. If I mismanage a small buiness that I created and it fails, the government doesn't help me. It's pretty unfair when corporations, who have all the resources and talent in the world knowingly make bad decisions and then get paid. I'm against deregulation for the same reason. It allows the problems to continue and get worse. The economy is a fluid, flexible, complicated thing and using a set doctrine (socialism, unconstrained capitalism) in the face of reality is foolish. We need to balance taxes, regulation, funding, and the free market in order to make things work. Bailouts will not work in the long run because they reinforce bad behavior. Executives who run their companies into the ground need be kicked out on the street to live with their workers.", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-22 09:11:00", 
        "title": "Theater Of The Absurd", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: I don't agree with bailouts on principle, be they Bush's bailouts or Obama's. If I mismanage a small buiness that I created and it fails, the government doesn't help me. It's pretty unfair when corporations, who have all the resources and talent in the world knowingly make bad decisions and then get paid. I'm against deregulation for the same reason. It allows the problems to continue and get worse. The economy is a fluid, flexible, complicated thing and using a set doctrine (socialism, unconstrained capitalism) in the face of reality is foolish. We need to balance taxes, regulation, funding, and the free market in order to make things work. Bailouts will not work in the long run because they reinforce bad behavior. Executives who run their companies into the ground need be kicked out on the street to live with their workers. ya after the trillions dollars bailouts we will be left with junk money, junk food and junk politics!", 
        "intTime": 20090322, 
        "postID": 9, 
        "quote": "Originally posted by foxred03: I don't agree with bailouts on principle, be they Bush's bailouts or Obama's. If I mismanage a small buiness that I created and it fails, the government doesn't help me. It's pretty unfair when corporations, who have all the resources and talent in the world knowingly make bad decisions and then get paid. I'm against deregulation for the same reason. It allows the problems to continue and get worse. The economy is a fluid, flexible, complicated thing and using a set doctrine (socialism, unconstrained capitalism) in the face of reality is foolish. We need to balance taxes, regulation, funding, and the free market in order to make things work. Bailouts will not work in the long run because they reinforce bad behavior. Executives who run their companies into the ground need be kicked out on the street to live with their workers.", 
        "reply": " ya after the trillions dollars bailouts we will be left with junk money, junk food and junk politics!", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-22 09:44:00", 
        "title": "Theater Of The Absurd", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Motive25: How can Congress pass a law that allows for industry bonuses in one month (the Stimulus Package in February) and in the next month, in a reflection of public outrage over the (legal) AIG bonuses, pass another bill that taxes those bonuses at the 90% level? The verbal gymnastics that the House Democrats are doing to explain this are amazing. Half of the House Republicans went along with the herd stampede. This bill an ex postal facto tax and blatantly confiscatory and therefore illegal on both counts. It hits a lot of people who did absolutely nothing wrong. In the case of AIG, the people who caused the meltdown of the Financial Products division are long gone and the ones who are left are working to clean up the mess on behalf of the taxpayer, since we own most of the company now. Many of the AIG people are going to return their bonuses and a letter of resignation in protest to this Bill, leaving the taxpayer on the hook for much of our bailout money, because no one else has the expertise historical knowledge needed to unwind the remaining hundreds of billions of bad deals (they have already fixed hundreds of billions). Rather than exercise some mature, adult leadership and say this bill is not only hypocritical, illegal and probably counterproductive, the Speaker and the rest of the Democratic leadership allowed to come to a vote, just because the people are angry at something they don't really understand. And Obama is talking about signing it if gets through the Senate. This is absurd! *http://www.cnn.com/2009/POLITICS/03/19/bonus.bill/index.html* Ex \"postal\" facto?... Whether accidental or intentional, a very funny and poignant slip... ROTFLMAO!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090322, 
        "postID": 10, 
        "quote": "Originally posted by Motive25: How can Congress pass a law that allows for industry bonuses in one month (the Stimulus Package in February) and in the next month, in a reflection of public outrage over the (legal) AIG bonuses, pass another bill that taxes those bonuses at the 90% level? The verbal gymnastics that the House Democrats are doing to explain this are amazing. Half of the House Republicans went along with the herd stampede. This bill an ex postal facto tax and blatantly confiscatory and therefore illegal on both counts. It hits a lot of people who did absolutely nothing wrong. In the case of AIG, the people who caused the meltdown of the Financial Products division are long gone and the ones who are left are working to clean up the mess on behalf of the taxpayer, since we own most of the company now. Many of the AIG people are going to return their bonuses and a letter of resignation in protest to this Bill, leaving the taxpayer on the hook for much of our bailout money, because no one else has the expertise historical knowledge needed to unwind the remaining hundreds of billions of bad deals (they have already fixed hundreds of billions). Rather than exercise some mature, adult leadership and say this bill is not only hypocritical, illegal and probably counterproductive, the Speaker and the rest of the Democratic leadership allowed to come to a vote, just because the people are angry at something they don't really understand. And Obama is talking about signing it if gets through the Senate. This is absurd! *http://www.cnn.com/2009/POLITICS/03/19/bonus.bill/index.html*", 
        "reply": " Ex \"postal\" facto?... Whether accidental or intentional, a very funny and poignant slip... ROTFLMAO!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-22 10:31:00", 
        "title": "Theater Of The Absurd", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I had some \"change\" in my pocket the other day. The gubernment came by and took it. They said it would be enough to feed the mice in San Francisco for a week!", 
        "intTime": 20090322, 
        "postID": 11, 
        "quote": "", 
        "reply": "I had some \"change\" in my pocket the other day. The gubernment came by and took it. They said it would be enough to feed the mice in San Francisco for a week!", 
        "threadID": "672198221_7470063812001", 
        "time": "2009-03-22 11:28:00", 
        "title": "Theater Of The Absurd", 
        "userID": "MSGCAVALRY"
    }
]