[
    {
        "content": "quote: Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "intTime": 20090328,
        "postID": 1,
        "quote": "Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "reply": "",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 06:56:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "intTime": 20090328,
        "postID": 2,
        "quote": "",
        "reply": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 08:05:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first? The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "intTime": 20090328,
        "postID": 3,
        "quote": "Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "reply": " The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:03:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "intTime": 20090328,
        "postID": 4,
        "quote": "",
        "reply": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:08:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "intTime": 20090328,
        "postID": 5,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 10:14:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "intTime": 20090328,
        "postID": 6,
        "quote": "",
        "reply": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:07:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "intTime": 20090328,
        "postID": 7,
        "quote": "Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "reply": " Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:29:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "intTime": 20090328,
        "postID": 8,
        "quote": "",
        "reply": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:25:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "intTime": 20090328,
        "postID": 9,
        "quote": "Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "reply": " Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:34:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "intTime": 20090328,
        "postID": 10,
        "quote": "",
        "reply": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 14:58:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Cider33_Alpha"
    },
    {
        "content": "quote: Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime. Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "intTime": 20090328,
        "postID": 11,
        "quote": "Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "reply": " Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 15:12:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "intTime": 20090329,
        "postID": 12,
        "quote": "Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "reply": " Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 06:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. They did lead with their vote!",
        "intTime": 20090329,
        "postID": 13,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " They did lead with their vote!",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 07:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. Always back to the slippery slope fallacy.",
        "intTime": 20090329,
        "postID": 14,
        "quote": "Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " Always back to the slippery slope fallacy.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:00:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "intTime": 20090329,
        "postID": 15,
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "reply": " Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:15:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Always back to the slippery slope fallacy. More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "intTime": 20090329,
        "postID": 16,
        "quote": "Always back to the slippery slope fallacy.",
        "reply": " More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:18:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: who the hell is the State to tell me what to do? The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "intTime": 20090329,
        "postID": 17,
        "quote": "who the hell is the State to tell me what to do?",
        "reply": " The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:19:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "intTime": 20090329,
        "postID": 18,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:16:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "intTime": 20090329,
        "postID": 19,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:27:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ArtMarsh"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution. I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "intTime": 20090329,
        "postID": 20,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "reply": " I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:35:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "intTime": 20090328,
        "postID": 21,
        "quote": "Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "reply": "",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 06:56:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "intTime": 20090328,
        "postID": 22,
        "quote": "",
        "reply": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 08:05:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first? The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "intTime": 20090328,
        "postID": 23,
        "quote": "Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "reply": " The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:03:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "intTime": 20090328,
        "postID": 24,
        "quote": "",
        "reply": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:08:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "intTime": 20090328,
        "postID": 25,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 10:14:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "intTime": 20090328,
        "postID": 26,
        "quote": "",
        "reply": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:07:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "intTime": 20090328,
        "postID": 27,
        "quote": "Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "reply": " Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:29:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "intTime": 20090328,
        "postID": 28,
        "quote": "",
        "reply": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:25:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "intTime": 20090328,
        "postID": 29,
        "quote": "Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "reply": " Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:34:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "intTime": 20090328,
        "postID": 30,
        "quote": "",
        "reply": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 14:58:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Cider33_Alpha"
    },
    {
        "content": "quote: Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime. Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "intTime": 20090328,
        "postID": 31,
        "quote": "Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "reply": " Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 15:12:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "intTime": 20090329,
        "postID": 32,
        "quote": "Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "reply": " Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 06:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. They did lead with their vote!",
        "intTime": 20090329,
        "postID": 33,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " They did lead with their vote!",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 07:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. Always back to the slippery slope fallacy.",
        "intTime": 20090329,
        "postID": 34,
        "quote": "Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " Always back to the slippery slope fallacy.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:00:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "intTime": 20090329,
        "postID": 35,
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "reply": " Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:15:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Always back to the slippery slope fallacy. More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "intTime": 20090329,
        "postID": 36,
        "quote": "Always back to the slippery slope fallacy.",
        "reply": " More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:18:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: who the hell is the State to tell me what to do? The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "intTime": 20090329,
        "postID": 37,
        "quote": "who the hell is the State to tell me what to do?",
        "reply": " The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:19:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "intTime": 20090329,
        "postID": 38,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:16:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "intTime": 20090329,
        "postID": 39,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:27:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ArtMarsh"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution. I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "intTime": 20090329,
        "postID": 40,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "reply": " I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:35:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "intTime": 20090328,
        "postID": 41,
        "quote": "Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "reply": "",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 06:56:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "intTime": 20090328,
        "postID": 42,
        "quote": "",
        "reply": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 08:05:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first? The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "intTime": 20090328,
        "postID": 43,
        "quote": "Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "reply": " The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:03:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "intTime": 20090328,
        "postID": 44,
        "quote": "",
        "reply": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:08:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "intTime": 20090328,
        "postID": 45,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 10:14:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "intTime": 20090328,
        "postID": 46,
        "quote": "",
        "reply": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:07:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "intTime": 20090328,
        "postID": 47,
        "quote": "Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "reply": " Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:29:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "intTime": 20090328,
        "postID": 48,
        "quote": "",
        "reply": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:25:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "intTime": 20090328,
        "postID": 49,
        "quote": "Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "reply": " Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:34:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "intTime": 20090328,
        "postID": 50,
        "quote": "",
        "reply": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 14:58:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Cider33_Alpha"
    },
    {
        "content": "quote: Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime. Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "intTime": 20090328,
        "postID": 51,
        "quote": "Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "reply": " Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 15:12:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "intTime": 20090329,
        "postID": 52,
        "quote": "Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "reply": " Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 06:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. They did lead with their vote!",
        "intTime": 20090329,
        "postID": 53,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " They did lead with their vote!",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 07:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. Always back to the slippery slope fallacy.",
        "intTime": 20090329,
        "postID": 54,
        "quote": "Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " Always back to the slippery slope fallacy.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:00:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "intTime": 20090329,
        "postID": 55,
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "reply": " Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:15:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Always back to the slippery slope fallacy. More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "intTime": 20090329,
        "postID": 56,
        "quote": "Always back to the slippery slope fallacy.",
        "reply": " More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:18:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: who the hell is the State to tell me what to do? The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "intTime": 20090329,
        "postID": 57,
        "quote": "who the hell is the State to tell me what to do?",
        "reply": " The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:19:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "intTime": 20090329,
        "postID": 58,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:16:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "intTime": 20090329,
        "postID": 59,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:27:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ArtMarsh"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution. I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "intTime": 20090329,
        "postID": 60,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "reply": " I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:35:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "intTime": 20090328,
        "postID": 61,
        "quote": "Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "reply": "",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 06:56:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "intTime": 20090328,
        "postID": 62,
        "quote": "",
        "reply": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 08:05:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first? The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "intTime": 20090328,
        "postID": 63,
        "quote": "Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "reply": " The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:03:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "intTime": 20090328,
        "postID": 64,
        "quote": "",
        "reply": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:08:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "intTime": 20090328,
        "postID": 65,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 10:14:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "intTime": 20090328,
        "postID": 66,
        "quote": "",
        "reply": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:07:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "intTime": 20090328,
        "postID": 67,
        "quote": "Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "reply": " Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:29:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "intTime": 20090328,
        "postID": 68,
        "quote": "",
        "reply": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:25:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "intTime": 20090328,
        "postID": 69,
        "quote": "Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "reply": " Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:34:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "intTime": 20090328,
        "postID": 70,
        "quote": "",
        "reply": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 14:58:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Cider33_Alpha"
    },
    {
        "content": "quote: Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime. Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "intTime": 20090328,
        "postID": 71,
        "quote": "Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "reply": " Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 15:12:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "intTime": 20090329,
        "postID": 72,
        "quote": "Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "reply": " Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 06:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. They did lead with their vote!",
        "intTime": 20090329,
        "postID": 73,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " They did lead with their vote!",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 07:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. Always back to the slippery slope fallacy.",
        "intTime": 20090329,
        "postID": 74,
        "quote": "Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " Always back to the slippery slope fallacy.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:00:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "intTime": 20090329,
        "postID": 75,
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "reply": " Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:15:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Always back to the slippery slope fallacy. More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "intTime": 20090329,
        "postID": 76,
        "quote": "Always back to the slippery slope fallacy.",
        "reply": " More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:18:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: who the hell is the State to tell me what to do? The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "intTime": 20090329,
        "postID": 77,
        "quote": "who the hell is the State to tell me what to do?",
        "reply": " The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:19:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "intTime": 20090329,
        "postID": 78,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:16:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "intTime": 20090329,
        "postID": 79,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:27:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ArtMarsh"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution. I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "intTime": 20090329,
        "postID": 80,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "reply": " I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:35:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "intTime": 20090328,
        "postID": 81,
        "quote": "Admittedly, the group isn't a fundraising juggernaut: NORML averages about $900 in donations daily, a total that jumped to $3,500 in the 24 hours since Obama joked about pot at the town hall. But St. Pierre said the anger among marijuana legalization advocates is real. \"Many of them were profoundly disappointed because many of them with great enthusiasm supported Obama from the point of his announcement to when he became president,\" he said. <more> \"http://politicalticker.blogs.cnn.com/\"",
        "reply": "",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 06:56:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "intTime": 20090328,
        "postID": 82,
        "quote": "",
        "reply": "As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 08:05:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first? The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "intTime": 20090328,
        "postID": 83,
        "quote": "Originally posted by SeaWitch1220: As someone who is NOT a “druggie”, but advocates decriminalizing marijuana, all I can say is “small steps”. How about we lift the ban on industrial hemp in this country first?",
        "reply": " The only politician with Guts in this country was Clinton's first Surgeon General who stated, (more or less) \"Are we nuts? Marijuanna is a harmless substance, and it's just plain crazy to lock up 700,000 people for using it.\" The overwhelming majority of politicians know this, but are afraid to simply come out and say it. Obama is no different. The best we can expect of him is that the Feds will stop locking up providers of medical marijuanna in those states that have (by referendum) approved its use to fight disease. Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:03:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "intTime": 20090328,
        "postID": 84,
        "quote": "",
        "reply": "Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 09:08:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "intTime": 20090328,
        "postID": 85,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " I do believe you're blaming the victim here. According to the Federal Government, 90 percent of weed in home grown. But what if you were right? What if ALL of it came from Mexico? Who's fault would that be? If weed was legal, American farmers would cash in - Do you doubt this? And if weed was legal, do you think grocery and candy stores would stage raids killing each other off in order to make BIG BUCK$? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 10:14:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "intTime": 20090328,
        "postID": 86,
        "quote": "",
        "reply": "The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:07:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "intTime": 20090328,
        "postID": 87,
        "quote": "Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income.",
        "reply": " Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 11:29:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "intTime": 20090328,
        "postID": 88,
        "quote": "",
        "reply": "OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:25:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "intTime": 20090328,
        "postID": 89,
        "quote": "Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned......",
        "reply": " Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 12:34:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "intTime": 20090328,
        "postID": 90,
        "quote": "",
        "reply": "Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 14:58:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Cider33_Alpha"
    },
    {
        "content": "quote: Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime. Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "intTime": 20090328,
        "postID": 91,
        "quote": "Originally posted by Cider33_Alpha: Wrong, Dave. Smoking weed, tobacco, banana peels, most anything is harmful. Weed and tobacco are about equal in the harm department, if they are smoked for equivalent lengths of time throughout a lifetime.",
        "reply": " Are you saying that people who smoke pot, smoke a \"pack\" a day? Two packs? Three? But that's not my point. My point is that it's not any of YOUR business - And if it's not any of YOUR business, who the hell is the State to tell me what to do? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-28 15:12:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "intTime": 20090329,
        "postID": 92,
        "quote": "Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave",
        "reply": " Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 06:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. They did lead with their vote!",
        "intTime": 20090329,
        "postID": 93,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " They did lead with their vote!",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 07:21:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. Always back to the slippery slope fallacy.",
        "intTime": 20090329,
        "postID": 94,
        "quote": "Originally posted by ss_287: Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " Always back to the slippery slope fallacy.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:00:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "intTime": 20090329,
        "postID": 95,
        "quote": "Originally posted by Grachus: quote: Originally posted by Motive25: The studies I've seen indicate that 70% of the Mexican drug cartels' income comes from marijuana sales. If we were to decriminalize it, domestic production would undercut Mexican imports and take a major bite out of the cartels' income. Before the Cartels became the equivalent of Al Qaeda, there were more factual, and less frenzied reports on how Americans get theirs. Try punching this into Google: \"Marijuana growing\" Dave",
        "reply": " Not the same thing_ I'm talking where the cartels get their income. not where we get our pot. Besides given the fact that the cartels see pot smuggling as such a lucrative business, it's obvious that domestic production is not meeting demand.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:15:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Motive25"
    },
    {
        "content": "quote: Always back to the slippery slope fallacy. More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "intTime": 20090329,
        "postID": 96,
        "quote": "Always back to the slippery slope fallacy.",
        "reply": " More like \"give 'em an inch and they'll take a mile\" ... and there is nothing \"faulty\" about it. Our history is replete with examples.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:18:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: who the hell is the State to tell me what to do? The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "intTime": 20090329,
        "postID": 97,
        "quote": "who the hell is the State to tell me what to do?",
        "reply": " The State Of Your Neighbor and fellow American crying because you are doing something that harms no one else, they do not believe in, is against their morals or religious values and the fact that you ****ed them off when you told them they could not drink alcohol on a Sunday after noon in the park. It's the State of US fighting amongst ourselves via proxy the government and the laws because we just can not mind our own business and leave each other alone even when no one else gets hurt. The government needs to get out of allot of things and drug enforcement is one of them. I don't care if people shoot up bleach as long as it does not hurt another who the heck cares.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 08:19:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies. I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "intTime": 20090329,
        "postID": 98,
        "quote": "Originally posted by ss_287: quote: Originally posted by Grachus: quote: Originally posted by Woody_in_La: OMG! Cry me a friggin river will ya! Y'all want to do away with tobacco while opening the doors for weed so everyone can get stoned...... Why would I want to do away with tobacco? I'm a grown up, I can choose to smoke tobacco or not. Althugh of course tobacco is far more harmful then weed... Dave Drugs weed or whatever you want to call it impairs your senses and when placed behind the wheel of a vehicle is classed the same as a Drunk driver and anyone should loose their driving privelage as do alchol related convictions. All the campaigns out for smoking cecesion and now the states and probably fed gov will allow smoking weed whats next a little heroin will be ok then soon we will be known as a nation of Druggies.",
        "reply": " I can't recall writing that people who are high on anything should be allowed to drive without a stiff penalty? Can you refresh my memory and post a link to where I said this? Dave",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:16:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "intTime": 20090329,
        "postID": 99,
        "quote": "Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don",
        "reply": " Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:27:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "ArtMarsh"
    },
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution. I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "intTime": 20090329,
        "postID": 100,
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by 21yrsUSCGUSCS: Waaaaaa! I want my weeeeeed! OK, sure, if it's grown locally but I highly doubt many pot smokers give a darn. So as they buy their weed, the profits trickle down to these Mexican cartels we see battling it out in Mexico. Nice sense of responsibility. Don Don, there isn't a single state in this nation that marijuana either doesn’t grow in the wild or that it could not grow in the wild. As a weed, it is extremely hardy. I am not advocating it’s decriminalization at all… many more “accurate and non-political” studies need to be done first… including social, economic, and health, but one thing is for certain. The drug cartels that rely on its growth and distribution would be totally gone in six months. I have never seen a plant as easy to grow as Weed is. The illegal drug cartels couldn’t manipulate that market… neither could the legal drug industries (medicine, alcohol, tobacco). So for clearing the cartels… legalizing the use, growth, and possession would be the quickest solution.",
        "reply": " I pretty much agree with that ... except I believe the cartels would simply intensify their efforts in other product areas. What sparks my comment is the observation you made the marijuana is so easy to grow ... That would seem to put a crimp in the \"regulate it and tax the heck out of it\" crowd's argument.",
        "threadID": "672198221_8740061912001",
        "time": "2009-03-29 11:35:00",
        "title": "POTUS 44's Druggie Demographic Angry ...",
        "userID": "I_M_Qwerty"
    }
]