[
    {
        "content": "You guys can beat up Obama all day long for this but the fact is it's not his fault. Our culture and laws always cater to and go after the crooks and then the inocent law biding ones are the ones that get screwed. This can be exampled in just about every thing we do. We have been a nanny state for decades but you have never complained about it until Obama got in office then you wonder why he can do what he does, way after the time that it should have been dealt with. This goes for many of of laws, freedoms and liberties. You first accepted this type of treatment when you started allowing the Fed government to take your money for taxes instead of placing a tax on sales. So who is really just as guilty? I think we all are. But we can change that, if people work together for that change and starting with our tax system would be a great first step. If you don't want to do it for yourself, work for your children and grand children so they can have it better. It's all about showing our governments that congress and our government works for us, not the other way around.",
        "intTime": 20090301,
        "postID": 13,
        "quote": "",
        "reply": "You guys can beat up Obama all day long for this but the fact is it's not his fault. Our culture and laws always cater to and go after the crooks and then the inocent law biding ones are the ones that get screwed. This can be exampled in just about every thing we do. We have been a nanny state for decades but you have never complained about it until Obama got in office then you wonder why he can do what he does, way after the time that it should have been dealt with. This goes for many of of laws, freedoms and liberties. You first accepted this type of treatment when you started allowing the Fed government to take your money for taxes instead of placing a tax on sales. So who is really just as guilty? I think we all are. But we can change that, if people work together for that change and starting with our tax system would be a great first step. If you don't want to do it for yourself, work for your children and grand children so they can have it better. It's all about showing our governments that congress and our government works for us, not the other way around.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-01 05:35:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars. \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why?",
        "intTime": 20090301,
        "postID": 14,
        "quote": "Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars.",
        "reply": " \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why?",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-01 06:09:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "6837602"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say. Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border, with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer. This message has been edited. Last edited by: popsiq, Tue 03 March 2009 07:46 AM",
        "intTime": 20090302,
        "postID": 15,
        "quote": "Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say.",
        "reply": " Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border, with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer. This message has been edited. Last edited by: popsiq, Tue 03 March 2009 07:46 AM",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:17:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. There is no such thing as an \"assault rifle.\" Or to paraphrase my favorite Senator Russ Feingold, It's a totally made up term to cover attacks on the Second Amendment. Why not outlaw \"assualt knives\" as well? Who needs them. Cut your meat with plastic butterknives. Dave About 2.5 million google hits in 2 seconds infer that you, and Russ Feingold could be wrong, Dave. >http://en.wikipedia.org/wiki/Assault_rifle That's the wiki post. The term 'assault rifle' is an english tanslation of the German 'sturmgewehr' - a class of WW2 infantry weapon, much like the machine pistol, but utilizing an adapted military rifle cartridge as opposed to a pistol round. The weapon combined an increased rate of fire, with extended range and accuracy out to a max of 150 m. The smaller cartridge meant more ammuntion could be carried per unit weight. I believe you'd have to be talking to a cretin to have him fail to understand what is commonly meant by 'assault rifle'. About the knife, I know there were 'combat knives' manufactured for that purpose. But an assault knife - that could be a butter knife, or Mom's bread knife - it's wicked! You don't think somebody couldn't turn you into a bleeder with a plastic knife Dave? Like the gun, it's the 'assault' part that's more important in the definition.",
        "intTime": 20090302,
        "postID": 16,
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. There is no such thing as an \"assault rifle.\" Or to paraphrase my favorite Senator Russ Feingold, It's a totally made up term to cover attacks on the Second Amendment. Why not outlaw \"assualt knives\" as well? Who needs them. Cut your meat with plastic butterknives. Dave",
        "reply": " About 2.5 million google hits in 2 seconds infer that you, and Russ Feingold could be wrong, Dave. >http://en.wikipedia.org/wiki/Assault_rifle That's the wiki post. The term 'assault rifle' is an english tanslation of the German 'sturmgewehr' - a class of WW2 infantry weapon, much like the machine pistol, but utilizing an adapted military rifle cartridge as opposed to a pistol round. The weapon combined an increased rate of fire, with extended range and accuracy out to a max of 150 m. The smaller cartridge meant more ammuntion could be carried per unit weight. I believe you'd have to be talking to a cretin to have him fail to understand what is commonly meant by 'assault rifle'. About the knife, I know there were 'combat knives' manufactured for that purpose. But an assault knife - that could be a butter knife, or Mom's bread knife - it's wicked! You don't think somebody couldn't turn you into a bleeder with a plastic knife Dave? Like the gun, it's the 'assault' part that's more important in the definition.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:32:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "popsiq"
    },
    {
        "content": "My favorite quote about guns: quote: Originally posted by Superbad: MOD HAT ON I don't know where you found that quote, but language like that is not allowed on this site and neither is using *'s to get around the language filter. I deleted it. Don't do it again. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:41 AM",
        "intTime": 20090302,
        "postID": 17,
        "quote": "Originally posted by Superbad:",
        "reply": "My favorite quote about guns:  MOD HAT ON I don't know where you found that quote, but language like that is not allowed on this site and neither is using *'s to get around the language filter. I deleted it. Don't do it again. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:41 AM",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:34:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: My favorite quote about guns: [/QUOTE] How's about: \"This one's my rifle; this one's my gun. The first one's for shooting, the other's for fun.\" - an apocryphal training lesson from 'On the Beach'. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:42 AM",
        "intTime": 20090302,
        "postID": 18,
        "quote": "Originally posted by mrmixitup: My favorite quote about guns:",
        "reply": " [/QUOTE] How's about: \"This one's my rifle; this one's my gun. The first one's for shooting, the other's for fun.\" - an apocryphal training lesson from 'On the Beach'. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:42 AM",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:41:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars. \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why? You can apply that same logic to nearly any issue concerning most of the amendments. It is a very slippery slope.",
        "intTime": 20090302,
        "postID": 19,
        "quote": "Originally posted by 6837602: quote: Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars. \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why?",
        "reply": " You can apply that same logic to nearly any issue concerning most of the amendments. It is a very slippery slope.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 09:36:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say. Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer. This is a classic logical fallacy. No one is arguing for owning artillery, in fact no one is even arguing for fully automatic weapons. Hunting laws are not gun laws, they restrict the use of certain weapons in certain hunts for very good reasons. However, none of these laws prevents the ownership of any weapon. Bottom line: Assault weapons are used in a very small percentage of crimes involving firearms.",
        "intTime": 20090302,
        "postID": 20,
        "quote": "Originally posted by popsiq: quote: Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say. Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer.",
        "reply": " This is a classic logical fallacy. No one is arguing for owning artillery, in fact no one is even arguing for fully automatic weapons. Hunting laws are not gun laws, they restrict the use of certain weapons in certain hunts for very good reasons. However, none of these laws prevents the ownership of any weapon. Bottom line: Assault weapons are used in a very small percentage of crimes involving firearms.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 09:38:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "foxred03"
    },
    {
        "content": "You guys can beat up Obama all day long for this but the fact is it's not his fault. Our culture and laws always cater to and go after the crooks and then the inocent law biding ones are the ones that get screwed. This can be exampled in just about every thing we do. We have been a nanny state for decades but you have never complained about it until Obama got in office then you wonder why he can do what he does, way after the time that it should have been dealt with. This goes for many of of laws, freedoms and liberties. You first accepted this type of treatment when you started allowing the Fed government to take your money for taxes instead of placing a tax on sales. So who is really just as guilty? I think we all are. But we can change that, if people work together for that change and starting with our tax system would be a great first step. If you don't want to do it for yourself, work for your children and grand children so they can have it better. It's all about showing our governments that congress and our government works for us, not the other way around.",
        "intTime": 20090301,
        "postID": 33,
        "quote": "",
        "reply": "You guys can beat up Obama all day long for this but the fact is it's not his fault. Our culture and laws always cater to and go after the crooks and then the inocent law biding ones are the ones that get screwed. This can be exampled in just about every thing we do. We have been a nanny state for decades but you have never complained about it until Obama got in office then you wonder why he can do what he does, way after the time that it should have been dealt with. This goes for many of of laws, freedoms and liberties. You first accepted this type of treatment when you started allowing the Fed government to take your money for taxes instead of placing a tax on sales. So who is really just as guilty? I think we all are. But we can change that, if people work together for that change and starting with our tax system would be a great first step. If you don't want to do it for yourself, work for your children and grand children so they can have it better. It's all about showing our governments that congress and our government works for us, not the other way around.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-01 05:35:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars. \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why?",
        "intTime": 20090301,
        "postID": 34,
        "quote": "Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars.",
        "reply": " \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why?",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-01 06:09:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "6837602"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say. Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border, with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer. This message has been edited. Last edited by: popsiq, Tue 03 March 2009 07:46 AM",
        "intTime": 20090302,
        "postID": 35,
        "quote": "Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say.",
        "reply": " Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border, with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer. This message has been edited. Last edited by: popsiq, Tue 03 March 2009 07:46 AM",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:17:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. There is no such thing as an \"assault rifle.\" Or to paraphrase my favorite Senator Russ Feingold, It's a totally made up term to cover attacks on the Second Amendment. Why not outlaw \"assualt knives\" as well? Who needs them. Cut your meat with plastic butterknives. Dave About 2.5 million google hits in 2 seconds infer that you, and Russ Feingold could be wrong, Dave. >http://en.wikipedia.org/wiki/Assault_rifle That's the wiki post. The term 'assault rifle' is an english tanslation of the German 'sturmgewehr' - a class of WW2 infantry weapon, much like the machine pistol, but utilizing an adapted military rifle cartridge as opposed to a pistol round. The weapon combined an increased rate of fire, with extended range and accuracy out to a max of 150 m. The smaller cartridge meant more ammuntion could be carried per unit weight. I believe you'd have to be talking to a cretin to have him fail to understand what is commonly meant by 'assault rifle'. About the knife, I know there were 'combat knives' manufactured for that purpose. But an assault knife - that could be a butter knife, or Mom's bread knife - it's wicked! You don't think somebody couldn't turn you into a bleeder with a plastic knife Dave? Like the gun, it's the 'assault' part that's more important in the definition.",
        "intTime": 20090302,
        "postID": 36,
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. There is no such thing as an \"assault rifle.\" Or to paraphrase my favorite Senator Russ Feingold, It's a totally made up term to cover attacks on the Second Amendment. Why not outlaw \"assualt knives\" as well? Who needs them. Cut your meat with plastic butterknives. Dave",
        "reply": " About 2.5 million google hits in 2 seconds infer that you, and Russ Feingold could be wrong, Dave. >http://en.wikipedia.org/wiki/Assault_rifle That's the wiki post. The term 'assault rifle' is an english tanslation of the German 'sturmgewehr' - a class of WW2 infantry weapon, much like the machine pistol, but utilizing an adapted military rifle cartridge as opposed to a pistol round. The weapon combined an increased rate of fire, with extended range and accuracy out to a max of 150 m. The smaller cartridge meant more ammuntion could be carried per unit weight. I believe you'd have to be talking to a cretin to have him fail to understand what is commonly meant by 'assault rifle'. About the knife, I know there were 'combat knives' manufactured for that purpose. But an assault knife - that could be a butter knife, or Mom's bread knife - it's wicked! You don't think somebody couldn't turn you into a bleeder with a plastic knife Dave? Like the gun, it's the 'assault' part that's more important in the definition.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:32:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "popsiq"
    },
    {
        "content": "My favorite quote about guns: quote: Originally posted by Superbad: MOD HAT ON I don't know where you found that quote, but language like that is not allowed on this site and neither is using *'s to get around the language filter. I deleted it. Don't do it again. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:41 AM",
        "intTime": 20090302,
        "postID": 37,
        "quote": "Originally posted by Superbad:",
        "reply": "My favorite quote about guns:  MOD HAT ON I don't know where you found that quote, but language like that is not allowed on this site and neither is using *'s to get around the language filter. I deleted it. Don't do it again. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:41 AM",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:34:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: My favorite quote about guns: [/QUOTE] How's about: \"This one's my rifle; this one's my gun. The first one's for shooting, the other's for fun.\" - an apocryphal training lesson from 'On the Beach'. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:42 AM",
        "intTime": 20090302,
        "postID": 38,
        "quote": "Originally posted by mrmixitup: My favorite quote about guns:",
        "reply": " [/QUOTE] How's about: \"This one's my rifle; this one's my gun. The first one's for shooting, the other's for fun.\" - an apocryphal training lesson from 'On the Beach'. This message has been edited. Last edited by: stillkit, Tue 03 March 2009 04:42 AM",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 08:41:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars. \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why? You can apply that same logic to nearly any issue concerning most of the amendments. It is a very slippery slope.",
        "intTime": 20090302,
        "postID": 39,
        "quote": "Originally posted by 6837602: quote: Originally posted by RRR52: http //abcnews.go.com/Politics/story?id=6960824&page=1 \"As President Obama indicated during the campaign, there are just a few gun-related changes that we would like to make, and among them would be to reinstitute the ban on the sale of assault weapons,\" Holder told reporters. Just a few. . . . and the bailout wastes \"just a few\" dollars. \"reinstitute the ban on the sale of assault weapons,\" And you need an assault weapon why?",
        "reply": " You can apply that same logic to nearly any issue concerning most of the amendments. It is a very slippery slope.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 09:36:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say. Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer. This is a classic logical fallacy. No one is arguing for owning artillery, in fact no one is even arguing for fully automatic weapons. Hunting laws are not gun laws, they restrict the use of certain weapons in certain hunts for very good reasons. However, none of these laws prevents the ownership of any weapon. Bottom line: Assault weapons are used in a very small percentage of crimes involving firearms.",
        "intTime": 20090302,
        "postID": 40,
        "quote": "Originally posted by popsiq: quote: Originally posted by L0A1: quote: Originally posted by popsiq: You 'need' an assault weapon like a Democrat needs an elephant. Fact is, that is none of your business. It's our constitutional RIGHT to Bare Arms. Since you are not covered under our Constitution, you have NO say. Everybody has the right to bare arms, some have bare asses too. In this country we have problems regularly, at the border with Americans who seem to think their constitutional rights follow them everywhere. We have the privilege of gun ownership, provided we abide by laws delimiting their acquistion, transport and storage. There are hunting laws that cover the use of guns, but I'd imagine you have those limitations on your freedom as well. Your constitution is held up as a model to the rest of us. So I can't agree that I can't pop off about your wanting to own a howitzer.",
        "reply": " This is a classic logical fallacy. No one is arguing for owning artillery, in fact no one is even arguing for fully automatic weapons. Hunting laws are not gun laws, they restrict the use of certain weapons in certain hunts for very good reasons. However, none of these laws prevents the ownership of any weapon. Bottom line: Assault weapons are used in a very small percentage of crimes involving firearms.",
        "threadID": "672198221_8530052612001",
        "time": "2009-03-02 09:38:00",
        "title": "Promises of Control-Freak, Freedom-Destroying Priorities",
        "userID": "foxred03"
    }
]