[
    {
        "content": "Music is taboo for them? Okayyyy.... quote: PESHAWAR, Pakistan (AFP) - Taliban militants in northwest Buner district shaved the heads and moustaches of four Pakistani men as punishment for listening to music, one of the men said Sunday. Buner has been subject to huge US concern after hundreds of Taliban fighters advanced into the area from the neighbouring Swat, where the hardliners fought a brutal, nearly two-year insurgency to enforce Islamic law. Although Taliban and local officials said the fighters retreated from Buner by Saturday, local members of the movement remain. Residents said many fighters were still present in the hilly outskirts of the district. In one incident late Saturday, Taliban hardliners shaved the heads and moustaches of four men for listening to music, a young man from Buner told AFP by telephone, requesting not to be identified. \"I was with three other friends in my car, listening to music when armed Taliban stopped us and, after smashing cassettes and the cassette player, they shaved half our heads and moustaches,\" he said. \"The Taliban also beat us and asked us not to listen to music ever again,\" said the terrified man. (...) Residents in Mingora, the main town in Swat, said Taliban posters had been put up in streets and markets ordering women not to go shopping. The posters had appeared after the Taliban's controversial agreement with the government to enforce Islamic law in the region. (...) Hardline Islamists in the extremist Taliban consider it \"obscene\" for women to leave their homes, and ban females from venturing out in public without an immediate male relative -- namely a father, brother, son or husband. For years, Swat was a popular ski resort frequented by Westerners but the Pakistani government effectively lost control of the mountainous district after the violent Taliban campaign to enforce sharia law... ++http://ca.news.yahoo.com/s/afp/090426/world/pakistan_unrest_northwest_music_women", 
        "intTime": 20090426, 
        "postID": 1, 
        "quote": "PESHAWAR, Pakistan (AFP) - Taliban militants in northwest Buner district shaved the heads and moustaches of four Pakistani men as punishment for listening to music, one of the men said Sunday. Buner has been subject to huge US concern after hundreds of Taliban fighters advanced into the area from the neighbouring Swat, where the hardliners fought a brutal, nearly two-year insurgency to enforce Islamic law. Although Taliban and local officials said the fighters retreated from Buner by Saturday, local members of the movement remain. Residents said many fighters were still present in the hilly outskirts of the district. In one incident late Saturday, Taliban hardliners shaved the heads and moustaches of four men for listening to music, a young man from Buner told AFP by telephone, requesting not to be identified. \"I was with three other friends in my car, listening to music when armed Taliban stopped us and, after smashing cassettes and the cassette player, they shaved half our heads and moustaches,\" he said. \"The Taliban also beat us and asked us not to listen to music ever again,\" said the terrified man. (...) Residents in Mingora, the main town in Swat, said Taliban posters had been put up in streets and markets ordering women not to go shopping. The posters had appeared after the Taliban's controversial agreement with the government to enforce Islamic law in the region. (...) Hardline Islamists in the extremist Taliban consider it \"obscene\" for women to leave their homes, and ban females from venturing out in public without an immediate male relative -- namely a father, brother, son or husband. For years, Swat was a popular ski resort frequented by Westerners but the Pakistani government effectively lost control of the mountainous district after the violent Taliban campaign to enforce sharia law... ++http://ca.news.yahoo.com/s/afp/090426/world/pakistan_unrest_northwest_music_women", 
        "reply": "Music is taboo for them? Okayyyy.... ", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-26 18:34:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "\"They beat us and ASKED us never to listen to music again\" - something's been lost in translation. Was a time, in some more civilized places, you got dead because you were the wrong color, or beat up for being the wrong 'gender'. Strikes me that Talies wouldn't have much common ground with the western 'ski set'. Nor would Burqahs and shalwar kameez make much of a fashion statement on the slopes.", 
        "intTime": 20090427, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"They beat us and ASKED us never to listen to music again\" - something's been lost in translation. Was a time, in some more civilized places, you got dead because you were the wrong color, or beat up for being the wrong 'gender'. Strikes me that Talies wouldn't have much common ground with the western 'ski set'. Nor would Burqahs and shalwar kameez make much of a fashion statement on the slopes.", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 07:09:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "popsiq"
    }, 
    {
        "content": "Its all Obama's fault, its his watch!!!", 
        "intTime": 20090427, 
        "postID": 3, 
        "quote": "", 
        "reply": "Its all Obama's fault, its his watch!!!", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 09:43:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "dman1948"
    }, 
    {
        "content": "I'd like to see them come over here and try to do that to all our Rap music lovers. Thats why I say we will never be invaded by another country unless China and India team up and join forces. Then we may be in a little trouble.", 
        "intTime": 20090427, 
        "postID": 4, 
        "quote": "", 
        "reply": "I'd like to see them come over here and try to do that to all our Rap music lovers. Thats why I say we will never be invaded by another country unless China and India team up and join forces. Then we may be in a little trouble.", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 09:48:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "Duster6"
    }, 
    {
        "content": "Hey, conservatives! See why you need liberals around? The Taliban seriously need to get over their own fear of modernity.", 
        "intTime": 20090427, 
        "postID": 5, 
        "quote": "", 
        "reply": "Hey, conservatives! See why you need liberals around? The Taliban seriously need to get over their own fear of modernity.", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 10:18:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Hey, conservatives! See why you need liberals around? The Taliban seriously need to get over their own fear of modernity. You mean you don't think their quite yet ready to enter the Ninth Century? Dave", 
        "intTime": 20090427, 
        "postID": 6, 
        "quote": "Originally posted by mrmixitup: Hey, conservatives! See why you need liberals around? The Taliban seriously need to get over their own fear of modernity.", 
        "reply": " You mean you don't think their quite yet ready to enter the Ninth Century? Dave", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 10:31:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Hey, conservatives! See why you need liberals around? The Taliban seriously need to get over their own fear of modernity. Please, for all of our sake, go over and meet with them and let them hear your views. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 7, 
        "quote": "Originally posted by mrmixitup: Hey, conservatives! See why you need liberals around? The Taliban seriously need to get over their own fear of modernity.", 
        "reply": " Please, for all of our sake, go over and meet with them and let them hear your views. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 10:42:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "L0A1"
    }, 
    {
        "content": "The only thing that can change the mind of a taliban'r is a bullet", 
        "intTime": 20090427, 
        "postID": 8, 
        "quote": "", 
        "reply": "The only thing that can change the mind of a taliban'r is a bullet", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 11:24:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Religion kills.", 
        "intTime": 20090427, 
        "postID": 9, 
        "quote": "", 
        "reply": "Religion kills.", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 11:38:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "JBL266"
    }, 
    {
        "content": "More Chuck Berry", 
        "intTime": 20090427, 
        "postID": 10, 
        "quote": "", 
        "reply": "More Chuck Berry", 
        "threadID": "672198221_2210068122001", 
        "time": "2009-04-27 11:44:00", 
        "title": "Taliban beat and shave men's heads for listening to music", 
        "userID": "Sand_Flea"
    }
]