[
    {
        "content": "Since when is going bankrupt such a great deed to be receiving 14.billion dollars which is part of my money? If I go bankrupt will you all give me a million dollar reward bonus? Thanks US GUBERMENT! BTW, there is no doubt in my mind this would still had happen no matter what REP or DEM was in office. Keep placing either party in people and there will not be a United States left for our furture offspring. and you need to think about this VERY LONG and HARD before deciding to \"stay devoted to your team\". Whichever one it is next go around. Kick All the damn reps and dems out of DC!!!", 
        "intTime": 20090601, 
        "postID": 1, 
        "quote": "", 
        "reply": "Since when is going bankrupt such a great deed to be receiving 14.billion dollars which is part of my money? If I go bankrupt will you all give me a million dollar reward bonus? Thanks US GUBERMENT! BTW, there is no doubt in my mind this would still had happen no matter what REP or DEM was in office. Keep placing either party in people and there will not be a United States left for our furture offspring. and you need to think about this VERY LONG and HARD before deciding to \"stay devoted to your team\". Whichever one it is next go around. Kick All the damn reps and dems out of DC!!!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 05:19:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "50 Billion dollars of American taxpayer money will be shot to hell!! Why don't the Obama Crew just split that money up and give each one of us a piece of it... That would be roughly $200.00 for every man, woman, and child in this country!! Might buy a tent and some food for a lot of homeless - - Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 2, 
        "quote": "", 
        "reply": "50 Billion dollars of American taxpayer money will be shot to hell!! Why don't the Obama Crew just split that money up and give each one of us a piece of it... That would be roughly $200.00 for every man, woman, and child in this country!! Might buy a tent and some food for a lot of homeless - - Wandering and Wondering", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 06:16:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? Already past the future", 
        "intTime": 20090601, 
        "postID": 3, 
        "quote": "", 
        "reply": "Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? Already past the future", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 06:38:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "6486143"
    }, 
    {
        "content": "Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "intTime": 20090601, 
        "postID": 4, 
        "quote": "", 
        "reply": "Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 08:12:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "intTime": 20090601, 
        "postID": 5, 
        "quote": "Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "reply": " Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 08:29:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? I was just thinking the same thing while driving. I thought about it out of thin air, there is NO DOUBT in my mind that they will do it.", 
        "intTime": 20090601, 
        "postID": 6, 
        "quote": "Originally posted by 6486143: Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....????", 
        "reply": " I was just thinking the same thing while driving. I thought about it out of thin air, there is NO DOUBT in my mind that they will do it.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:17:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also. I have to dis-agree. I could not force my Chevy truck to break down and it gets great gas milage. I will never own a rice burner truck. Motorcycle on the other hand, because of the HD price, they can stick it.", 
        "intTime": 20090601, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "reply": " I have to dis-agree. I could not force my Chevy truck to break down and it gets great gas milage. I will never own a rice burner truck. Motorcycle on the other hand, because of the HD price, they can stick it.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:18:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "There's a FORD in your future", 
        "intTime": 20090601, 
        "postID": 8, 
        "quote": "", 
        "reply": "There's a FORD in your future", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:26:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "EAG154"
    }, 
    {
        "content": "/ / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it \"Jobs that Americans refuse to do\"!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries using slaves, two cents an hour employees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! This message has been edited. Last edited by: SSGDuke53, Mon 01 June 2009 03:18 PM", 
        "intTime": 20090601, 
        "postID": 9, 
        "quote": "", 
        "reply": "/ / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it \"Jobs that Americans refuse to do\"!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries using slaves, two cents an hour employees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! This message has been edited. Last edited by: SSGDuke53, Mon 01 June 2009 03:18 PM", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:58:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "SSGDuke53"
    }, 
    {
        "content": ">http://www.reuters.com/article/domesticNews/idUSTRE55050V20090601 GM files bankruptcy through the Harlem dealership, to take advantage of more favorable NY laws. What will have the most 'bang-on' effect on the economy dumping the debt, or those union pensions?", 
        "intTime": 20090601, 
        "postID": 10, 
        "quote": "", 
        "reply": ">http://www.reuters.com/article/domesticNews/idUSTRE55050V20090601 GM files bankruptcy through the Harlem dealership, to take advantage of more favorable NY laws. What will have the most 'bang-on' effect on the economy dumping the debt, or those union pensions?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:16:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090601, 
        "postID": 11, 
        "quote": "", 
        "reply": "Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:24:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. Obama managed them right to china. They wanted bankruptcy in the beginning but no we cant have that can we. We have to spend money on a bailout then micromanage them appoint and fire people just so they can go overseas. Great Job Obama!", 
        "intTime": 20090601, 
        "postID": 12, 
        "quote": "Originally posted by Anbar7: Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different.", 
        "reply": " Obama managed them right to china. They wanted bankruptcy in the beginning but no we cant have that can we. We have to spend money on a bailout then micromanage them appoint and fire people just so they can go overseas. Great Job Obama!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:26:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! You tell 'em Staff Sergeant Duke!... Till the ridiculous and idiotic trade agreements that we now have, are renegotiated or negated, we will not survive economically and thus as a nation... The PRC who is the largest single carrier of our debt, has already warned us that our policy of turning on the presses without financial backing of our debt, will crush us... Very soon the PRC will just say no and start dumping our debt and our then de-valuating currency and thus ends our hope for any recovery... If things continue, just as they are, we are still looking at hyperinflation and shortages of food, clothing and services, such as fire, police, trash removal and the loss of basic utilities such as WATER, electricity, natural gas, the delivery of home heating oil... We are on the precipice and unless immediate action to stop it is taken, we will shortly be beyond the tipping point, if we are not already and the deepening depression will make the depression of the 1930s look like a minor hiccup... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090601, 
        "postID": 13, 
        "quote": "Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!!", 
        "reply": " You tell 'em Staff Sergeant Duke!... Till the ridiculous and idiotic trade agreements that we now have, are renegotiated or negated, we will not survive economically and thus as a nation... The PRC who is the largest single carrier of our debt, has already warned us that our policy of turning on the presses without financial backing of our debt, will crush us... Very soon the PRC will just say no and start dumping our debt and our then de-valuating currency and thus ends our hope for any recovery... If things continue, just as they are, we are still looking at hyperinflation and shortages of food, clothing and services, such as fire, police, trash removal and the loss of basic utilities such as WATER, electricity, natural gas, the delivery of home heating oil... We are on the precipice and unless immediate action to stop it is taken, we will shortly be beyond the tipping point, if we are not already and the deepening depression will make the depression of the 1930s look like a minor hiccup... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 11:20:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! I agree completely with your comments. This nation will not survive because of greed and selishnish against the country.", 
        "intTime": 20090601, 
        "postID": 14, 
        "quote": "Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!!", 
        "reply": " I agree completely with your comments. This nation will not survive because of greed and selishnish against the country.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 12:08:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "If I am now part owner of GM where is my $200.00 worth of stock that every man woman and child has or will throw away to this company?? 50 Billion!!! Where's my free Camero!!! Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 15, 
        "quote": "", 
        "reply": "If I am now part owner of GM where is my $200.00 worth of stock that every man woman and child has or will throw away to this company?? 50 Billion!!! Where's my free Camero!!! Wandering and Wondering", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 12:28:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Government motors...thanks a billions. \"The World's Finest\"", 
        "intTime": 20090601, 
        "postID": 16, 
        "quote": "", 
        "reply": "Government motors...thanks a billions. \"The World's Finest\"", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 15:48:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also. Duster, We are car people and we own what our neighbors jokingly call \"a fleet\". One of our favorites is a Suburban with 73,000 miles on it, never a major repair, excellent mileage for its size, and one of the best vehicles we have ever owned. We traded in a '99 Tahoe with 133,000 miles for the Suburban and it was also one fine vehicle. I'm sold on GM trucks and larger SUV's. Jack", 
        "intTime": 20090601, 
        "postID": 17, 
        "quote": "Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "reply": " Duster, We are car people and we own what our neighbors jokingly call \"a fleet\". One of our favorites is a Suburban with 73,000 miles on it, never a major repair, excellent mileage for its size, and one of the best vehicles we have ever owned. We traded in a '99 Tahoe with 133,000 miles for the Suburban and it was also one fine vehicle. I'm sold on GM trucks and larger SUV's. Jack", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:18:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Hey Union workers. Can you hear us now?", 
        "intTime": 20090601, 
        "postID": 18, 
        "quote": "", 
        "reply": "Hey Union workers. Can you hear us now?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:21:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Duster6"
    }, 
    {
        "content": "hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "intTime": 20090601, 
        "postID": 19, 
        "quote": "", 
        "reply": "hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:58:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: hey CEOs that make 10 million dollars a hear THANKS A LOT! hey 1 million 72 dollar an hour union employees THANKS ALOT! wait one: 10 million dollar CEO's cave'd to the union's, thanks alot CEO's. now I'm confused! wait wait: thanks alot greedy everyone", 
        "intTime": 20090601, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "reply": " hey 1 million 72 dollar an hour union employees THANKS ALOT! wait one: 10 million dollar CEO's cave'd to the union's, thanks alot CEO's. now I'm confused! wait wait: thanks alot greedy everyone", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 17:47:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "EAG154"
    }, 
    {
        "content": "Since when is going bankrupt such a great deed to be receiving 14.billion dollars which is part of my money? If I go bankrupt will you all give me a million dollar reward bonus? Thanks US GUBERMENT! BTW, there is no doubt in my mind this would still had happen no matter what REP or DEM was in office. Keep placing either party in people and there will not be a United States left for our furture offspring. and you need to think about this VERY LONG and HARD before deciding to \"stay devoted to your team\". Whichever one it is next go around. Kick All the damn reps and dems out of DC!!!", 
        "intTime": 20090601, 
        "postID": 21, 
        "quote": "", 
        "reply": "Since when is going bankrupt such a great deed to be receiving 14.billion dollars which is part of my money? If I go bankrupt will you all give me a million dollar reward bonus? Thanks US GUBERMENT! BTW, there is no doubt in my mind this would still had happen no matter what REP or DEM was in office. Keep placing either party in people and there will not be a United States left for our furture offspring. and you need to think about this VERY LONG and HARD before deciding to \"stay devoted to your team\". Whichever one it is next go around. Kick All the damn reps and dems out of DC!!!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 05:19:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "50 Billion dollars of American taxpayer money will be shot to hell!! Why don't the Obama Crew just split that money up and give each one of us a piece of it... That would be roughly $200.00 for every man, woman, and child in this country!! Might buy a tent and some food for a lot of homeless - - Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 22, 
        "quote": "", 
        "reply": "50 Billion dollars of American taxpayer money will be shot to hell!! Why don't the Obama Crew just split that money up and give each one of us a piece of it... That would be roughly $200.00 for every man, woman, and child in this country!! Might buy a tent and some food for a lot of homeless - - Wandering and Wondering", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 06:16:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? Already past the future", 
        "intTime": 20090601, 
        "postID": 23, 
        "quote": "", 
        "reply": "Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? Already past the future", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 06:38:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "6486143"
    }, 
    {
        "content": "Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "intTime": 20090601, 
        "postID": 24, 
        "quote": "", 
        "reply": "Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 08:12:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "intTime": 20090601, 
        "postID": 25, 
        "quote": "Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "reply": " Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 08:29:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? I was just thinking the same thing while driving. I thought about it out of thin air, there is NO DOUBT in my mind that they will do it.", 
        "intTime": 20090601, 
        "postID": 26, 
        "quote": "Originally posted by 6486143: Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....????", 
        "reply": " I was just thinking the same thing while driving. I thought about it out of thin air, there is NO DOUBT in my mind that they will do it.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:17:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also. I have to dis-agree. I could not force my Chevy truck to break down and it gets great gas milage. I will never own a rice burner truck. Motorcycle on the other hand, because of the HD price, they can stick it.", 
        "intTime": 20090601, 
        "postID": 27, 
        "quote": "Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "reply": " I have to dis-agree. I could not force my Chevy truck to break down and it gets great gas milage. I will never own a rice burner truck. Motorcycle on the other hand, because of the HD price, they can stick it.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:18:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "There's a FORD in your future", 
        "intTime": 20090601, 
        "postID": 28, 
        "quote": "", 
        "reply": "There's a FORD in your future", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:26:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "EAG154"
    }, 
    {
        "content": "/ / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it \"Jobs that Americans refuse to do\"!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries using slaves, two cents an hour employees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! This message has been edited. Last edited by: SSGDuke53, Mon 01 June 2009 03:18 PM", 
        "intTime": 20090601, 
        "postID": 29, 
        "quote": "", 
        "reply": "/ / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it \"Jobs that Americans refuse to do\"!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries using slaves, two cents an hour employees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! This message has been edited. Last edited by: SSGDuke53, Mon 01 June 2009 03:18 PM", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:58:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "SSGDuke53"
    }, 
    {
        "content": ">http://www.reuters.com/article/domesticNews/idUSTRE55050V20090601 GM files bankruptcy through the Harlem dealership, to take advantage of more favorable NY laws. What will have the most 'bang-on' effect on the economy dumping the debt, or those union pensions?", 
        "intTime": 20090601, 
        "postID": 30, 
        "quote": "", 
        "reply": ">http://www.reuters.com/article/domesticNews/idUSTRE55050V20090601 GM files bankruptcy through the Harlem dealership, to take advantage of more favorable NY laws. What will have the most 'bang-on' effect on the economy dumping the debt, or those union pensions?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:16:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090601, 
        "postID": 31, 
        "quote": "", 
        "reply": "Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:24:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. Obama managed them right to china. They wanted bankruptcy in the beginning but no we cant have that can we. We have to spend money on a bailout then micromanage them appoint and fire people just so they can go overseas. Great Job Obama!", 
        "intTime": 20090601, 
        "postID": 32, 
        "quote": "Originally posted by Anbar7: Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different.", 
        "reply": " Obama managed them right to china. They wanted bankruptcy in the beginning but no we cant have that can we. We have to spend money on a bailout then micromanage them appoint and fire people just so they can go overseas. Great Job Obama!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:26:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! You tell 'em Staff Sergeant Duke!... Till the ridiculous and idiotic trade agreements that we now have, are renegotiated or negated, we will not survive economically and thus as a nation... The PRC who is the largest single carrier of our debt, has already warned us that our policy of turning on the presses without financial backing of our debt, will crush us... Very soon the PRC will just say no and start dumping our debt and our then de-valuating currency and thus ends our hope for any recovery... If things continue, just as they are, we are still looking at hyperinflation and shortages of food, clothing and services, such as fire, police, trash removal and the loss of basic utilities such as WATER, electricity, natural gas, the delivery of home heating oil... We are on the precipice and unless immediate action to stop it is taken, we will shortly be beyond the tipping point, if we are not already and the deepening depression will make the depression of the 1930s look like a minor hiccup... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090601, 
        "postID": 33, 
        "quote": "Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!!", 
        "reply": " You tell 'em Staff Sergeant Duke!... Till the ridiculous and idiotic trade agreements that we now have, are renegotiated or negated, we will not survive economically and thus as a nation... The PRC who is the largest single carrier of our debt, has already warned us that our policy of turning on the presses without financial backing of our debt, will crush us... Very soon the PRC will just say no and start dumping our debt and our then de-valuating currency and thus ends our hope for any recovery... If things continue, just as they are, we are still looking at hyperinflation and shortages of food, clothing and services, such as fire, police, trash removal and the loss of basic utilities such as WATER, electricity, natural gas, the delivery of home heating oil... We are on the precipice and unless immediate action to stop it is taken, we will shortly be beyond the tipping point, if we are not already and the deepening depression will make the depression of the 1930s look like a minor hiccup... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 11:20:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! I agree completely with your comments. This nation will not survive because of greed and selishnish against the country.", 
        "intTime": 20090601, 
        "postID": 34, 
        "quote": "Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!!", 
        "reply": " I agree completely with your comments. This nation will not survive because of greed and selishnish against the country.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 12:08:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "If I am now part owner of GM where is my $200.00 worth of stock that every man woman and child has or will throw away to this company?? 50 Billion!!! Where's my free Camero!!! Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 35, 
        "quote": "", 
        "reply": "If I am now part owner of GM where is my $200.00 worth of stock that every man woman and child has or will throw away to this company?? 50 Billion!!! Where's my free Camero!!! Wandering and Wondering", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 12:28:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Government motors...thanks a billions. \"The World's Finest\"", 
        "intTime": 20090601, 
        "postID": 36, 
        "quote": "", 
        "reply": "Government motors...thanks a billions. \"The World's Finest\"", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 15:48:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also. Duster, We are car people and we own what our neighbors jokingly call \"a fleet\". One of our favorites is a Suburban with 73,000 miles on it, never a major repair, excellent mileage for its size, and one of the best vehicles we have ever owned. We traded in a '99 Tahoe with 133,000 miles for the Suburban and it was also one fine vehicle. I'm sold on GM trucks and larger SUV's. Jack", 
        "intTime": 20090601, 
        "postID": 37, 
        "quote": "Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "reply": " Duster, We are car people and we own what our neighbors jokingly call \"a fleet\". One of our favorites is a Suburban with 73,000 miles on it, never a major repair, excellent mileage for its size, and one of the best vehicles we have ever owned. We traded in a '99 Tahoe with 133,000 miles for the Suburban and it was also one fine vehicle. I'm sold on GM trucks and larger SUV's. Jack", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:18:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Hey Union workers. Can you hear us now?", 
        "intTime": 20090601, 
        "postID": 38, 
        "quote": "", 
        "reply": "Hey Union workers. Can you hear us now?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:21:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Duster6"
    }, 
    {
        "content": "hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "intTime": 20090601, 
        "postID": 39, 
        "quote": "", 
        "reply": "hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:58:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: hey CEOs that make 10 million dollars a hear THANKS A LOT! hey 1 million 72 dollar an hour union employees THANKS ALOT! wait one: 10 million dollar CEO's cave'd to the union's, thanks alot CEO's. now I'm confused! wait wait: thanks alot greedy everyone", 
        "intTime": 20090601, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "reply": " hey 1 million 72 dollar an hour union employees THANKS ALOT! wait one: 10 million dollar CEO's cave'd to the union's, thanks alot CEO's. now I'm confused! wait wait: thanks alot greedy everyone", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 17:47:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "EAG154"
    }, 
    {
        "content": "Since when is going bankrupt such a great deed to be receiving 14.billion dollars which is part of my money? If I go bankrupt will you all give me a million dollar reward bonus? Thanks US GUBERMENT! BTW, there is no doubt in my mind this would still had happen no matter what REP or DEM was in office. Keep placing either party in people and there will not be a United States left for our furture offspring. and you need to think about this VERY LONG and HARD before deciding to \"stay devoted to your team\". Whichever one it is next go around. Kick All the damn reps and dems out of DC!!!", 
        "intTime": 20090601, 
        "postID": 41, 
        "quote": "", 
        "reply": "Since when is going bankrupt such a great deed to be receiving 14.billion dollars which is part of my money? If I go bankrupt will you all give me a million dollar reward bonus? Thanks US GUBERMENT! BTW, there is no doubt in my mind this would still had happen no matter what REP or DEM was in office. Keep placing either party in people and there will not be a United States left for our furture offspring. and you need to think about this VERY LONG and HARD before deciding to \"stay devoted to your team\". Whichever one it is next go around. Kick All the damn reps and dems out of DC!!!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 05:19:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "50 Billion dollars of American taxpayer money will be shot to hell!! Why don't the Obama Crew just split that money up and give each one of us a piece of it... That would be roughly $200.00 for every man, woman, and child in this country!! Might buy a tent and some food for a lot of homeless - - Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 42, 
        "quote": "", 
        "reply": "50 Billion dollars of American taxpayer money will be shot to hell!! Why don't the Obama Crew just split that money up and give each one of us a piece of it... That would be roughly $200.00 for every man, woman, and child in this country!! Might buy a tent and some food for a lot of homeless - - Wandering and Wondering", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 06:16:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? Already past the future", 
        "intTime": 20090601, 
        "postID": 43, 
        "quote": "", 
        "reply": "Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? Already past the future", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 06:38:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "6486143"
    }, 
    {
        "content": "Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "intTime": 20090601, 
        "postID": 44, 
        "quote": "", 
        "reply": "Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 08:12:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "athos20"
    }, 
    {
        "content": "quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "intTime": 20090601, 
        "postID": 45, 
        "quote": "Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing?", 
        "reply": " Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 08:29:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 6486143: Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....???? I was just thinking the same thing while driving. I thought about it out of thin air, there is NO DOUBT in my mind that they will do it.", 
        "intTime": 20090601, 
        "postID": 46, 
        "quote": "Originally posted by 6486143: Let's see if Ralph Nader speaks the truth: 2 days ago he claimed to have insider intel that when GM gets the check from Mr O they are going to move to China..lock stock and welfare check on a prearranged deal.....????", 
        "reply": " I was just thinking the same thing while driving. I thought about it out of thin air, there is NO DOUBT in my mind that they will do it.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:17:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also. I have to dis-agree. I could not force my Chevy truck to break down and it gets great gas milage. I will never own a rice burner truck. Motorcycle on the other hand, because of the HD price, they can stick it.", 
        "intTime": 20090601, 
        "postID": 47, 
        "quote": "Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "reply": " I have to dis-agree. I could not force my Chevy truck to break down and it gets great gas milage. I will never own a rice burner truck. Motorcycle on the other hand, because of the HD price, they can stick it.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:18:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "There's a FORD in your future", 
        "intTime": 20090601, 
        "postID": 48, 
        "quote": "", 
        "reply": "There's a FORD in your future", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:26:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "EAG154"
    }, 
    {
        "content": "/ / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it \"Jobs that Americans refuse to do\"!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries using slaves, two cents an hour employees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! This message has been edited. Last edited by: SSGDuke53, Mon 01 June 2009 03:18 PM", 
        "intTime": 20090601, 
        "postID": 49, 
        "quote": "", 
        "reply": "/ / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it \"Jobs that Americans refuse to do\"!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries using slaves, two cents an hour employees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! This message has been edited. Last edited by: SSGDuke53, Mon 01 June 2009 03:18 PM", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 09:58:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "SSGDuke53"
    }, 
    {
        "content": ">http://www.reuters.com/article/domesticNews/idUSTRE55050V20090601 GM files bankruptcy through the Harlem dealership, to take advantage of more favorable NY laws. What will have the most 'bang-on' effect on the economy dumping the debt, or those union pensions?", 
        "intTime": 20090601, 
        "postID": 50, 
        "quote": "", 
        "reply": ">http://www.reuters.com/article/domesticNews/idUSTRE55050V20090601 GM files bankruptcy through the Harlem dealership, to take advantage of more favorable NY laws. What will have the most 'bang-on' effect on the economy dumping the debt, or those union pensions?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:16:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090601, 
        "postID": 51, 
        "quote": "", 
        "reply": "Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:24:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different. Obama managed them right to china. They wanted bankruptcy in the beginning but no we cant have that can we. We have to spend money on a bailout then micromanage them appoint and fire people just so they can go overseas. Great Job Obama!", 
        "intTime": 20090601, 
        "postID": 52, 
        "quote": "Originally posted by Anbar7: Yeah, maybe Obama and the rest of the dumbarses will figure out that we shouldn't reward people who fail. Failure is a good thing, it brings on new designs. But if you keep rewarding them there is no need to try and do anything different.", 
        "reply": " Obama managed them right to china. They wanted bankruptcy in the beginning but no we cant have that can we. We have to spend money on a bailout then micromanage them appoint and fire people just so they can go overseas. Great Job Obama!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 10:26:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! You tell 'em Staff Sergeant Duke!... Till the ridiculous and idiotic trade agreements that we now have, are renegotiated or negated, we will not survive economically and thus as a nation... The PRC who is the largest single carrier of our debt, has already warned us that our policy of turning on the presses without financial backing of our debt, will crush us... Very soon the PRC will just say no and start dumping our debt and our then de-valuating currency and thus ends our hope for any recovery... If things continue, just as they are, we are still looking at hyperinflation and shortages of food, clothing and services, such as fire, police, trash removal and the loss of basic utilities such as WATER, electricity, natural gas, the delivery of home heating oil... We are on the precipice and unless immediate action to stop it is taken, we will shortly be beyond the tipping point, if we are not already and the deepening depression will make the depression of the 1930s look like a minor hiccup... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090601, 
        "postID": 53, 
        "quote": "Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!!", 
        "reply": " You tell 'em Staff Sergeant Duke!... Till the ridiculous and idiotic trade agreements that we now have, are renegotiated or negated, we will not survive economically and thus as a nation... The PRC who is the largest single carrier of our debt, has already warned us that our policy of turning on the presses without financial backing of our debt, will crush us... Very soon the PRC will just say no and start dumping our debt and our then de-valuating currency and thus ends our hope for any recovery... If things continue, just as they are, we are still looking at hyperinflation and shortages of food, clothing and services, such as fire, police, trash removal and the loss of basic utilities such as WATER, electricity, natural gas, the delivery of home heating oil... We are on the precipice and unless immediate action to stop it is taken, we will shortly be beyond the tipping point, if we are not already and the deepening depression will make the depression of the 1930s look like a minor hiccup... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 11:20:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!! I agree completely with your comments. This nation will not survive because of greed and selishnish against the country.", 
        "intTime": 20090601, 
        "postID": 54, 
        "quote": "Originally posted by SSGDuke53: / / / / / / And now the decline of America begins on a pace that will rival the fall of Rome in ancient time. We are our own worst enemy for allowing this to happen! Yep! What our enemies tried to do to us military and failed has now succeeded by economics and we pathetic fools allowed it!!! Once we were able to make many things like Television, Radios, Cars, Cameras, many different shoes and clothing. And now we hardly make ANYTHING ANYMORE! Our greed and Corp America ( now they are part of Corp World) have allowed our manufacturing capabilities ship overseas, outsource to cheap third world countries, and/or ship as many Illegal Aliens in our country to replace American/Legal Immigrant workers and called it jobs that Americans refuse to do!!! NAFTIA was the biggest JOKE played on the American/Legal Immigrant workers! They called it Free Trade! What was free about it?!! How do you compete when those cheap third world countries use slaves, two cents an hour enployees, or child labor and at the same time tells America you cannot export into their country!!! The Politicians, CEOs, Upper Management, and Union Bosses have fattened their piggy banks on the backs of the very workers they were supposed to help and support!! How pathetic we are to allow this to happen! Well fools (and that include myself) we will pay the price of this folly and so will our great, great Grandchildren. For when you wipe out the Middle Class you have wipe out what made America GREAT. Welcome to the Third World People Socialist Republic of UnUnited States Comrad!!!", 
        "reply": " I agree completely with your comments. This nation will not survive because of greed and selishnish against the country.", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 12:08:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "If I am now part owner of GM where is my $200.00 worth of stock that every man woman and child has or will throw away to this company?? 50 Billion!!! Where's my free Camero!!! Wandering and Wondering", 
        "intTime": 20090601, 
        "postID": 55, 
        "quote": "", 
        "reply": "If I am now part owner of GM where is my $200.00 worth of stock that every man woman and child has or will throw away to this company?? 50 Billion!!! Where's my free Camero!!! Wandering and Wondering", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 12:28:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Government motors...thanks a billions. \"The World's Finest\"", 
        "intTime": 20090601, 
        "postID": 56, 
        "quote": "", 
        "reply": "Government motors...thanks a billions. \"The World's Finest\"", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 15:48:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also. Duster, We are car people and we own what our neighbors jokingly call \"a fleet\". One of our favorites is a Suburban with 73,000 miles on it, never a major repair, excellent mileage for its size, and one of the best vehicles we have ever owned. We traded in a '99 Tahoe with 133,000 miles for the Suburban and it was also one fine vehicle. I'm sold on GM trucks and larger SUV's. Jack", 
        "intTime": 20090601, 
        "postID": 57, 
        "quote": "Originally posted by Duster6: quote: Originally posted by athos20: Let's see, now that we will own 60 percent of GM will we all get employee pricing? Thats the best joke I've heard all day. The only vehicle from GM that I would ever consider owning would be the Corvette. I had three of them in the past but stopped driving them in 77. Been a Toyota man ever since. When Toyota starts getting greedy I'll start buying Chinese vehicles. Oh by the way, Toyota is starting to suck a little now also.", 
        "reply": " Duster, We are car people and we own what our neighbors jokingly call \"a fleet\". One of our favorites is a Suburban with 73,000 miles on it, never a major repair, excellent mileage for its size, and one of the best vehicles we have ever owned. We traded in a '99 Tahoe with 133,000 miles for the Suburban and it was also one fine vehicle. I'm sold on GM trucks and larger SUV's. Jack", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:18:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "Hey Union workers. Can you hear us now?", 
        "intTime": 20090601, 
        "postID": 58, 
        "quote": "", 
        "reply": "Hey Union workers. Can you hear us now?", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:21:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "Duster6"
    }, 
    {
        "content": "hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "intTime": 20090601, 
        "postID": 59, 
        "quote": "", 
        "reply": "hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 16:58:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: hey CEOs that make 10 million dollars a hear THANKS A LOT! hey 1 million 72 dollar an hour union employees THANKS ALOT! wait one: 10 million dollar CEO's cave'd to the union's, thanks alot CEO's. now I'm confused! wait wait: thanks alot greedy everyone", 
        "intTime": 20090601, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: hey CEOs that make 10 million dollars a hear THANKS A LOT!", 
        "reply": " hey 1 million 72 dollar an hour union employees THANKS ALOT! wait one: 10 million dollar CEO's cave'd to the union's, thanks alot CEO's. now I'm confused! wait wait: thanks alot greedy everyone", 
        "threadID": "672198221_1370077422001", 
        "time": "2009-06-01 17:47:00", 
        "title": "It's Official Gm Files For Bankruptcy", 
        "userID": "EAG154"
    }
]