[
    {
        "content": "Just like MacArthur, Hussein has returned!! quote: BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\" \"The World's Finest\"", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\"", 
        "reply": "Just like MacArthur, Hussein has returned!!  \"The World's Finest\"", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 08:14:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 08:19:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment.", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "Originally posted by Kegler300: Just like MacArthur, Hussein has returned!!", 
        "reply": " Typical Bush League comment.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 08:23:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. \"The World's Finest\"", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment.", 
        "reply": " Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. \"The World's Finest\"", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 09:57:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying?", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits.", 
        "reply": " Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying?", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 10:00:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave", 
        "intTime": 20090407, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits.", 
        "reply": " I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 10:00:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave At least he didn't come under imaginary sniper fire \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave", 
        "reply": " At least he didn't come under imaginary sniper fire \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 10:09:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying? That the surge under Bush made it safe enough to land at that time!", 
        "intTime": 20090407, 
        "postID": 8, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying?", 
        "reply": " That the surge under Bush made it safe enough to land at that time!", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:22:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave", 
        "intTime": 20090407, 
        "postID": 9, 
        "quote": "Originally posted by Anbar7: At least he didn't come under imaginary sniper fire", 
        "reply": " Err, you got a link to Obama saying he came under sniper fire? Dave", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:30:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Geez, Marine - you really hate the President, don't you? LOL Wow...", 
        "intTime": 20090407, 
        "postID": 10, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits.", 
        "reply": " Geez, Marine - you really hate the President, don't you? LOL Wow...", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:42:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave That would be your princess clinton. Not Obama, you all ready forgot about that, uh? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 11, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave", 
        "reply": " That would be your princess clinton. Not Obama, you all ready forgot about that, uh? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:50:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\".", 
        "intTime": 20090407, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\".", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 12:20:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! quote: BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" You mean in 'air raiding' villages? Oh, that was Afganistan He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\"", 
        "intTime": 20090407, 
        "postID": 13, 
        "quote": "Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! quote: BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" You mean in 'air raiding' villages? Oh, that was Afganistan He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\"", 
        "reply": "", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 12:32:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\". 3 terms you used that he wouldnt know what they were.", 
        "intTime": 20090407, 
        "postID": 14, 
        "quote": "Originally posted by Duster6: I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\".", 
        "reply": " 3 terms you used that he wouldnt know what they were.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 12:37:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave That would be your princess clinton. Not Obama, you all ready forgot about that, uh? Now now Anbar, you surely don't read my posts on this board, and you just proved it... My princess? Really? I would have voted for McCain instead of Nader, if she had been running. Dave", 
        "intTime": 20090407, 
        "postID": 15, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave That would be your princess clinton. Not Obama, you all ready forgot about that, uh?", 
        "reply": " Now now Anbar, you surely don't read my posts on this board, and you just proved it... My princess? Really? I would have voted for McCain instead of Nader, if she had been running. Dave", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 14:52:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090407, 
        "postID": 16, 
        "quote": "", 
        "reply": "Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 14:57:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "", 
        "intTime": 20090407, 
        "postID": 17, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 15:07:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! What an ignorant ass title.", 
        "intTime": 20090407, 
        "postID": 18, 
        "quote": "Originally posted by Kegler300: Just like MacArthur, Hussein has returned!!", 
        "reply": " What an ignorant ass title.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 15:08:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! What an ignorant ass title. Now Now that's not a valid statement until IM says it LOL Ahh but wait, IM won't because well..you know lol", 
        "intTime": 20090407, 
        "postID": 19, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! What an ignorant ass title.", 
        "reply": " Now Now that's not a valid statement until IM says it LOL Ahh but wait, IM won't because well..you know lol", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 15:39:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office. Bush was just a pathetic little shrub.....We got a real man in office now.", 
        "intTime": 20090407, 
        "postID": 20, 
        "quote": "Originally posted by jrnh5150: Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office.", 
        "reply": " Bush was just a pathetic little shrub.....We got a real man in office now.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 18:30:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Just like MacArthur, Hussein has returned!! quote: BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\" \"The World's Finest\"", 
        "intTime": 20090407, 
        "postID": 21, 
        "quote": "BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\"", 
        "reply": "Just like MacArthur, Hussein has returned!!  \"The World's Finest\"", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 08:14:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "", 
        "intTime": 20090407, 
        "postID": 22, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 08:19:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment.", 
        "intTime": 20090407, 
        "postID": 23, 
        "quote": "Originally posted by Kegler300: Just like MacArthur, Hussein has returned!!", 
        "reply": " Typical Bush League comment.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 08:23:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. \"The World's Finest\"", 
        "intTime": 20090407, 
        "postID": 24, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment.", 
        "reply": " Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. \"The World's Finest\"", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 09:57:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying?", 
        "intTime": 20090407, 
        "postID": 25, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits.", 
        "reply": " Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying?", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 10:00:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave", 
        "intTime": 20090407, 
        "postID": 26, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits.", 
        "reply": " I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 10:00:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave At least he didn't come under imaginary sniper fire \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 27, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. I complained about the wonderful photograph of him serving a plastic turkey. Maybe you like plastic turkey? I hear that it's really, really \"Crunchy.\" Dave", 
        "reply": " At least he didn't come under imaginary sniper fire \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 10:09:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying? That the surge under Bush made it safe enough to land at that time!", 
        "intTime": 20090407, 
        "postID": 28, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Hardly: Obama landed at 4:42 in the afternoon. Now, what were you saying?", 
        "reply": " That the surge under Bush made it safe enough to land at that time!", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:22:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave", 
        "intTime": 20090407, 
        "postID": 29, 
        "quote": "Originally posted by Anbar7: At least he didn't come under imaginary sniper fire", 
        "reply": " Err, you got a link to Obama saying he came under sniper fire? Dave", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:30:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits. Geez, Marine - you really hate the President, don't you? LOL Wow...", 
        "intTime": 20090407, 
        "postID": 30, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! Typical Bush League comment. Which reminds me, when Bush flew into Baghdad to visit the troop under the cloak of darkness, shrouded in secrecy, the Bush-haters called him a coward and political opportunist. I haven't heard them say the same thing about Barack Hussein, nor do I expect them to, because they are hypocrits.", 
        "reply": " Geez, Marine - you really hate the President, don't you? LOL Wow...", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:42:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave That would be your princess clinton. Not Obama, you all ready forgot about that, uh? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 31, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave", 
        "reply": " That would be your princess clinton. Not Obama, you all ready forgot about that, uh? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 11:50:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\".", 
        "intTime": 20090407, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\".", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 12:20:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! quote: BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" You mean in 'air raiding' villages? Oh, that was Afganistan He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\"", 
        "intTime": 20090407, 
        "postID": 33, 
        "quote": "Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! quote: BAGHDAD (Reuters) – U.S. President Barack Obama, on a visit to Iraq, said on Tuesday he hoped his trip could help factions in the country reach \"equitable, fair\" solutions to problems that he said could come to a head in advance of elections later this year. Obama landed at Baghdad International Airport and was meeting U.S. commanders and troops during his first visit to the country since taking office in January. Earlier, his spokesman said Obama would not be able to see Iraqi leaders in person because poor weather prevented helicopter travel in the capital. But the White House said later that Obama would meet with Prime Minister Nuri al-Maliki at the U.S. military base. Obama, speaking to reporters, said he came to Iraq for face-to-face meetings and to get a better sense of the security situation. \"We spent a lot of time trying to get Afghanistan right (but) there's still a lot of work to be done here.\" \"We've made significant progress here Obama said one major reason for his visit was to thank the troops. \"They are doing extraordinary work. General Odierno has been helping to lead a very effective operation here.\" You mean in 'air raiding' villages? Oh, that was Afganistan He spoke with General Ray Odierno, the top U.S. commander in Iraq, sitting at his side. Source: \"http://news.yahoo.com/s/nm/20090407/pl_nm/us_iraq_obama\"", 
        "reply": "", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 12:32:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\". 3 terms you used that he wouldnt know what they were.", 
        "intTime": 20090407, 
        "postID": 34, 
        "quote": "Originally posted by Duster6: I'm glad he took time to visit the troops. However, I wish he would have said,\"Take me to the field, I want to see my beloved Green Berets\". \"Now the rest of you legs go back to your desks\".", 
        "reply": " 3 terms you used that he wouldnt know what they were.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 12:37:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave That would be your princess clinton. Not Obama, you all ready forgot about that, uh? Now now Anbar, you surely don't read my posts on this board, and you just proved it... My princess? Really? I would have voted for McCain instead of Nader, if she had been running. Dave", 
        "intTime": 20090407, 
        "postID": 35, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: quote: Originally posted by Anbar7: At least he didn't come under imaginary sniper fire Err, you got a link to Obama saying he came under sniper fire? Dave That would be your princess clinton. Not Obama, you all ready forgot about that, uh?", 
        "reply": " Now now Anbar, you surely don't read my posts on this board, and you just proved it... My princess? Really? I would have voted for McCain instead of Nader, if she had been running. Dave", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 14:52:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090407, 
        "postID": 36, 
        "quote": "", 
        "reply": "Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 14:57:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "", 
        "intTime": 20090407, 
        "postID": 37, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 15:07:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! What an ignorant ass title.", 
        "intTime": 20090407, 
        "postID": 38, 
        "quote": "Originally posted by Kegler300: Just like MacArthur, Hussein has returned!!", 
        "reply": " What an ignorant ass title.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 15:08:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! What an ignorant ass title. Now Now that's not a valid statement until IM says it LOL Ahh but wait, IM won't because well..you know lol", 
        "intTime": 20090407, 
        "postID": 39, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Just like MacArthur, Hussein has returned!! What an ignorant ass title.", 
        "reply": " Now Now that's not a valid statement until IM says it LOL Ahh but wait, IM won't because well..you know lol", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 15:39:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office. Bush was just a pathetic little shrub.....We got a real man in office now.", 
        "intTime": 20090407, 
        "postID": 40, 
        "quote": "Originally posted by jrnh5150: Again..... This kind of crap wouldn't have lasted 5 minutes when Bush was in office.", 
        "reply": " Bush was just a pathetic little shrub.....We got a real man in office now.", 
        "threadID": "672198221_7670050022001", 
        "time": "2009-04-07 18:30:00", 
        "title": "Hussein Returns To Baghdad!", 
        "userID": "Irwin_R_Schyster"
    }
]