[
    {
        "content": "\"http://news.yahoo.com/s/nm/20090315/pl_nm/us_usa_congress_obama_1 \"It's more than dead on arrival,\" said House Agriculture Committee chairman Collin Peterson, a Minnesota Democrat.", 
        "intTime": 20090315, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://news.yahoo.com/s/nm/20090315/pl_nm/us_usa_congress_obama_1 \"It's more than dead on arrival,\" said House Agriculture Committee chairman Collin Peterson, a Minnesota Democrat.", 
        "threadID": "672198221_1970019712001", 
        "time": "2009-03-15 08:43:00", 
        "title": "Obamas farm", 
        "userID": "EAG154"
    }, 
    {
        "content": "Farm Subsidies? Thought NAFTA said that was a no-no? Or maybe that's NAFTA for others. The biggie in Obama's package is doing something about global warming. Cap and trade is his choice, that's not as much as Kyoto required but it's a start. As one english scientist said, earth's economies have about 100 months to do something about the changing environment. After that it will be too late. The environment will change those economies. He could be wrong, wanna wait and see?", 
        "intTime": 20090315, 
        "postID": 2, 
        "quote": "", 
        "reply": "Farm Subsidies? Thought NAFTA said that was a no-no? Or maybe that's NAFTA for others. The biggie in Obama's package is doing something about global warming. Cap and trade is his choice, that's not as much as Kyoto required but it's a start. As one english scientist said, earth's economies have about 100 months to do something about the changing environment. After that it will be too late. The environment will change those economies. He could be wrong, wanna wait and see?", 
        "threadID": "672198221_1970019712001", 
        "time": "2009-03-15 08:55:00", 
        "title": "Obamas farm", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Farm Subsidies? Thought NAFTA said that was a no-no? Or maybe that's NAFTA for others. The biggie in Obama's package is doing something about global warming. Cap and trade is his choice, that's not as much as Kyoto required but it's a start. As one english scientist said, earth's economies have about 100 months to do something about the changing environment. After that it will be too late. The environment will change those economies. He could be wrong, wanna wait and see? have to! we can't change it! cap and trade is horse pukey, new corp. new alotment otherwise no groth = no Country!", 
        "intTime": 20090315, 
        "postID": 3, 
        "quote": "Originally posted by popsiq: Farm Subsidies? Thought NAFTA said that was a no-no? Or maybe that's NAFTA for others. The biggie in Obama's package is doing something about global warming. Cap and trade is his choice, that's not as much as Kyoto required but it's a start. As one english scientist said, earth's economies have about 100 months to do something about the changing environment. After that it will be too late. The environment will change those economies. He could be wrong, wanna wait and see?", 
        "reply": " have to! we can't change it! cap and trade is horse pukey, new corp. new alotment otherwise no groth = no Country!", 
        "threadID": "672198221_1970019712001", 
        "time": "2009-03-15 09:01:00", 
        "title": "Obamas farm", 
        "userID": "EAG154"
    }
]