[
    {
        "content": "\"http://www.infowars.com/cop-rams-car-forces-driver-off-road/\" 3 Children in the car. I would OWN this Police Department.", 
        "intTime": 20090301, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.infowars.com/cop-rams-car-forces-driver-off-road/\" 3 Children in the car. I would OWN this Police Department.", 
        "threadID": "672198221_6940095612001", 
        "time": "2009-03-01 11:15:00", 
        "title": "Cop Rams Car, Forces Driver With Kids Off Road", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: http://www.infowars.com/cop-rams-car-forces-driver-off-road/ Julia Morrow seems to disagree with you. \"First of all, she didn't ram it\" Then she talks about him doing 70...like she never has?", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "http://www.infowars.com/cop-rams-car-forces-driver-off-road/", 
        "reply": " Julia Morrow seems to disagree with you. \"First of all, she didn't ram it\" Then she talks about him doing 70...like she never has?", 
        "threadID": "672198221_6940095612001", 
        "time": "2009-03-01 11:24:00", 
        "title": "Cop Rams Car, Forces Driver With Kids Off Road", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Crackerjacks, are you on a \"stupid cop\" kick today??? I do not know of one single state that mandates an immediate pulling to the right regardless of safety for emergency vehicles . All the motor vehicle laws I have seen ALWAYS mentioned safety… and many state exactly what that man did… slow down, give an indication that you will be complying and stop as soon as it is safe to do so. That cop was placing her OWN life in danger as well as the lives of the supposed purps. She definitely has some aggression problems to be trying that stopping maneuver at 5mph. The State refused to press charges… I suspect that the department WILL be settling civil allegations outside the courtroom. Stopping in less than a mile starting at 70mph? And in traffic? With snow on the roadsides? Not something even I think I might be able to do with predictable repeatability. BTW: the guy was wrong in travelling that fast… and it would be worth the ticket… but the cop totally destroyed any hope of that outcome by taking the actions she did. And why exactly did she do the stop the way she did in the first place? Something else happened that placed her into this very aggressive mindset prior to her run in with the minivan. I wonder if her department is looking into that? Or are they too busy circling the wagons? What city and state was this in?", 
        "intTime": 20090301, 
        "postID": 3, 
        "quote": "", 
        "reply": "Crackerjacks, are you on a \"stupid cop\" kick today??? I do not know of one single state that mandates an immediate pulling to the right regardless of safety for emergency vehicles . All the motor vehicle laws I have seen ALWAYS mentioned safety… and many state exactly what that man did… slow down, give an indication that you will be complying and stop as soon as it is safe to do so. That cop was placing her OWN life in danger as well as the lives of the supposed purps. She definitely has some aggression problems to be trying that stopping maneuver at 5mph. The State refused to press charges… I suspect that the department WILL be settling civil allegations outside the courtroom. Stopping in less than a mile starting at 70mph? And in traffic? With snow on the roadsides? Not something even I think I might be able to do with predictable repeatability. BTW: the guy was wrong in travelling that fast… and it would be worth the ticket… but the cop totally destroyed any hope of that outcome by taking the actions she did. And why exactly did she do the stop the way she did in the first place? Something else happened that placed her into this very aggressive mindset prior to her run in with the minivan. I wonder if her department is looking into that? Or are they too busy circling the wagons? What city and state was this in?", 
        "threadID": "672198221_6940095612001", 
        "time": "2009-03-01 12:48:00", 
        "title": "Cop Rams Car, Forces Driver With Kids Off Road", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Is this the USSR under Stalin or the USA? completely inexcusable and simply proves some folks do not deserve to wear a badge and are totally unfit to serve the community.", 
        "intTime": 20090301, 
        "postID": 4, 
        "quote": "", 
        "reply": "Is this the USSR under Stalin or the USA? completely inexcusable and simply proves some folks do not deserve to wear a badge and are totally unfit to serve the community.", 
        "threadID": "672198221_6940095612001", 
        "time": "2009-03-01 13:10:00", 
        "title": "Cop Rams Car, Forces Driver With Kids Off Road", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "St. Paul Minnesota is where it happened. quote: At the end of a New Year's Eve traffic stop on Interstate 94 in St. Paul, State Patrol Sgt. Carrie Rindal rammed Salter's 2001 Toyota Sienna van \"http://www.startribune.com/local/east/38980869.html?elr=KArksLckD8EQDUoaEyqyP4OW3ckUiD3aPc:_Yyc:aUnciaec8O7EyUsl\" Yank her badge and return her to civilian life where she won't have to worry as much about her anger issues possibly getting somebody killed.", 
        "intTime": 20090301, 
        "postID": 5, 
        "quote": "At the end of a New Year's Eve traffic stop on Interstate 94 in St. Paul, State Patrol Sgt. Carrie Rindal rammed Salter's 2001 Toyota Sienna van", 
        "reply": "St. Paul Minnesota is where it happened.  \"http://www.startribune.com/local/east/38980869.html?elr=KArksLckD8EQDUoaEyqyP4OW3ckUiD3aPc:_Yyc:aUnciaec8O7EyUsl\" Yank her badge and return her to civilian life where she won't have to worry as much about her anger issues possibly getting somebody killed.", 
        "threadID": "672198221_6940095612001", 
        "time": "2009-03-01 14:48:00", 
        "title": "Cop Rams Car, Forces Driver With Kids Off Road", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: St. Paul Minnesota is where it happened. quote: At the end of a New Year's Eve traffic stop on Interstate 94 in St. Paul, State Patrol Sgt. Carrie Rindal rammed Salter's 2001 Toyota Sienna van \"http://www.startribune.com/local/east/38980869.html?elr=KArksLckD8EQDUoaEyqyP4OW3ckUiD3aPc:_Yyc:aUnciaec8O7EyUsl\" Yank her badge and return her to civilian life where she won't have to worry as much about her anger issues possibly getting somebody killed. Thanks for the link... in looking at the three videos there I could see no place for him to pull over without leaving both his van and the police car partially on the plowed roadway. IMO the driver responded the way he should have. This is just a couple of minutes before New Years... being anywhere near a road was going to be dangerous. I am also now wondering if he was in fact speeding at all. The ONLY citation to come out of this was an unsafe lane change. I assume it was for the one on the camera. If he was speeding, it is my take that the State Police felt that they would not want their officer in court attempting to explain what happened. I expect that she is not creditable at this point. I hope the guy contests that last charge.", 
        "intTime": 20090301, 
        "postID": 6, 
        "quote": "Originally posted by PhoenixDark: St. Paul Minnesota is where it happened. quote: At the end of a New Year's Eve traffic stop on Interstate 94 in St. Paul, State Patrol Sgt. Carrie Rindal rammed Salter's 2001 Toyota Sienna van \"http://www.startribune.com/local/east/38980869.html?elr=KArksLckD8EQDUoaEyqyP4OW3ckUiD3aPc:_Yyc:aUnciaec8O7EyUsl\" Yank her badge and return her to civilian life where she won't have to worry as much about her anger issues possibly getting somebody killed.", 
        "reply": " Thanks for the link... in looking at the three videos there I could see no place for him to pull over without leaving both his van and the police car partially on the plowed roadway. IMO the driver responded the way he should have. This is just a couple of minutes before New Years... being anywhere near a road was going to be dangerous. I am also now wondering if he was in fact speeding at all. The ONLY citation to come out of this was an unsafe lane change. I assume it was for the one on the camera. If he was speeding, it is my take that the State Police felt that they would not want their officer in court attempting to explain what happened. I expect that she is not creditable at this point. I hope the guy contests that last charge.", 
        "threadID": "672198221_6940095612001", 
        "time": "2009-03-01 16:28:00", 
        "title": "Cop Rams Car, Forces Driver With Kids Off Road", 
        "userID": "ArtMarsh"
    }
]