[
    {
        "content": "\"A fierce solar storm could lead to a global disaster on an unprecedented scale\" According to a NASA Study Link to the study in the NEWS article. \"http://www.newscientist.com/article/mg20127001.300-space-storm-alert-90-seconds-from-catastrophe.html?full=true\"", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"A fierce solar storm could lead to a global disaster on an unprecedented scale\" According to a NASA Study Link to the study in the NEWS article. \"http://www.newscientist.com/article/mg20127001.300-space-storm-alert-90-seconds-from-catastrophe.html?full=true\"", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 14:09:00", 
        "title": "Screwed...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"A fierce solar storm could lead to a global disaster on an unprecedented scale\" According to a NASA Study Link to the study in the NEWS article. \"http://www.newscientist.com/article/mg20127001.300-space-storm-alert-90-seconds-from-catastrophe.html?full=true\" Like there is anything that we could do about it?... Sooner or later, this old globe will cease to exist and there is not a single solitary thing or group of things that anyone can do to prevent it... So, why worry about what you can do nothing about?... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: \"A fierce solar storm could lead to a global disaster on an unprecedented scale\" According to a NASA Study Link to the study in the NEWS article. \"http://www.newscientist.com/article/mg20127001.300-space-storm-alert-90-seconds-from-catastrophe.html?full=true\"", 
        "reply": " Like there is anything that we could do about it?... Sooner or later, this old globe will cease to exist and there is not a single solitary thing or group of things that anyone can do to prevent it... So, why worry about what you can do nothing about?... Respectfully, SUNLINER81", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 14:17:00", 
        "title": "Screwed...", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "We could do something about it. We could have already had a colony on the moon or Mars even by now.", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "", 
        "reply": "We could do something about it. We could have already had a colony on the moon or Mars even by now.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 14:20:00", 
        "title": "Screwed...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now. If you were on the moon or Mars, you'd still be toast... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now.", 
        "reply": " If you were on the moon or Mars, you'd still be toast... Respectfully, SUNLINER81", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 14:26:00", 
        "title": "Screwed...", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell.", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 17:40:00", 
        "title": "Screwed...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell. Oh thank God.", 
        "intTime": 20090326, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell.", 
        "reply": " Oh thank God.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 17:56:00", 
        "title": "Screwed...", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell. And, as stars go, it ain't all that big or powerful! Have a happy! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090326, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell.", 
        "reply": " And, as stars go, it ain't all that big or powerful! Have a happy! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-26 18:00:00", 
        "title": "Screwed...", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now. Wow--really? And all this time I didn't think you had any imagination!", 
        "intTime": 20090327, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now.", 
        "reply": " Wow--really? And all this time I didn't think you had any imagination!", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-27 03:56:00", 
        "title": "Screwed...", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Eventually, every star burns out and goes Supernova. And I aint talking big block here. When that happens, the entire solar system will be toast on the moon, Mars or even Uranus. What did one nudist say to the other? \"I can see Uranus clearly tonight.\" not this super nova", 
        "intTime": 20090327, 
        "postID": 9, 
        "quote": "", 
        "reply": "Eventually, every star burns out and goes Supernova. And I aint talking big block here. When that happens, the entire solar system will be toast on the moon, Mars or even Uranus. What did one nudist say to the other? \"I can see Uranus clearly tonight.\" not this super nova", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-27 11:44:00", 
        "title": "Screwed...", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: quote: Originally posted by crackerjacks61: Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell. And, as stars go, it ain't all that big or powerful! Have a happy! yea thats what they say.. im not disputing it at all either...", 
        "intTime": 20090327, 
        "postID": 10, 
        "quote": "Originally posted by KJ1110: quote: Originally posted by crackerjacks61: Amazing how powerfull the sun is. 93 Million miles and the damn thing can zap us all to hell. And, as stars go, it ain't all that big or powerful! Have a happy!", 
        "reply": " yea thats what they say.. im not disputing it at all either...", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-27 11:57:00", 
        "title": "Screwed...", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now. Last thing I saw it said in 1 billion yrs earth will disappear into the sun and the sun is and will grow larger. yeh, I am worried about it.", 
        "intTime": 20090327, 
        "postID": 11, 
        "quote": "Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now.", 
        "reply": " Last thing I saw it said in 1 billion yrs earth will disappear into the sun and the sun is and will grow larger. yeh, I am worried about it.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-27 12:10:00", 
        "title": "Screwed...", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now. Last thing I saw it said in 1 billion yrs earth will disappear into the sun and the sun is and will grow larger. yeh, I am worried about it. Well this has nothing to do with the sun turning in to a red giant in it's old age, what they are saying is the Sun could \"fart\" at any time and guess who takes the blunt end of it? I don't worry about this stuff, I just find it interesting...but would like to see our efforts into space and beyond much more than what they are now.", 
        "intTime": 20090327, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by crackerjacks61: We could do something about it. We could have already had a colony on the moon or Mars even by now. Last thing I saw it said in 1 billion yrs earth will disappear into the sun and the sun is and will grow larger. yeh, I am worried about it.", 
        "reply": " Well this has nothing to do with the sun turning in to a red giant in it's old age, what they are saying is the Sun could \"fart\" at any time and guess who takes the blunt end of it? I don't worry about this stuff, I just find it interesting...but would like to see our efforts into space and beyond much more than what they are now.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-27 18:55:00", 
        "title": "Screwed...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "There was once a world in which the concept of exploring the universe was imaginable. Now the world is more concerned with \"American Idol\". Should a solar flare scour mankind from the face of the planet would it affect reality on a major scale? Not anymore.", 
        "intTime": 20090327, 
        "postID": 13, 
        "quote": "", 
        "reply": "There was once a world in which the concept of exploring the universe was imaginable. Now the world is more concerned with \"American Idol\". Should a solar flare scour mankind from the face of the planet would it affect reality on a major scale? Not anymore.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-27 19:31:00", 
        "title": "Screwed...", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by NM11AZ: There was once a world in which the concept of exploring the universe was imaginable. Now the world is more concerned with \"American Idol\". Should a solar flare scour mankind from the face of the planet would it affect reality on a major scale? Not anymore. A scene from \"Independence Day\" comes to mind; All those UFO nut's are on the roof of that skyscraper as the ship's main weapon doors are opening and the beam is building to fire and that ditzy chick looks into it saying; \"Pretty!\" *FOOM* It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090328, 
        "postID": 14, 
        "quote": "Originally posted by NM11AZ: There was once a world in which the concept of exploring the universe was imaginable. Now the world is more concerned with \"American Idol\". Should a solar flare scour mankind from the face of the planet would it affect reality on a major scale? Not anymore.", 
        "reply": " A scene from \"Independence Day\" comes to mind; All those UFO nut's are on the roof of that skyscraper as the ship's main weapon doors are opening and the beam is building to fire and that ditzy chick looks into it saying; \"Pretty!\" *FOOM* It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-28 05:23:00", 
        "title": "Screwed...", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: crackerjacks61 10 day warning Thread Disrupsion 04 Apr 09 MD Posted Thu 26 March 2009 02:20 PM Hide Post We could do something about it. We could have already had a colony on the moon or Mars even by now. What was it?, blotter or shroomz? or Omni magizine perhaps.", 
        "intTime": 20090328, 
        "postID": 15, 
        "quote": "crackerjacks61 10 day warning Thread Disrupsion 04 Apr 09 MD Posted Thu 26 March 2009 02:20 PM Hide Post We could do something about it. We could have already had a colony on the moon or Mars even by now.", 
        "reply": " What was it?, blotter or shroomz? or Omni magizine perhaps.", 
        "threadID": "672198221_7890099812001", 
        "time": "2009-03-28 10:05:00", 
        "title": "Screwed...", 
        "userID": "BAGodbehere"
    }
]