[
    {
        "content": "\"http://www.lvrj.com/news/breaking_news/44307912.html\"", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.lvrj.com/news/breaking_news/44307912.html\"", 
        "threadID": "672198221_3790074222001", 
        "time": "2009-05-04 14:53:00", 
        "title": "State attorney charges ACORN", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I don't get it. I don't see where they broke any laws *sarcastic grin* quote: ACORN, an activist group that turned in 90,000 completed voter registration forms in Clark County for last year's election, violated state law by setting mandatory quotas for workers who canvassed neighborhoods looking for people to register to vote, according to the state attorney general's office. Officials this morning released a complaint naming the Association of Community Organization for Reform Now Inc., as well as Christopher Howell Edwards, who was the group's Las Vegas field director, and deputy regional director Amy Busefink. Canvassers were required to register at least 20 people a day, and could be fired if they didn't, officials said. ACORN also instituted a bonus program led \"blackjack\" or \"21 plus\" in which a worker could earn an extra $5 per shift by registering 21 or more people. The problem with the quota system is it encouraged workers to turn in false registrations, said Secretary of State Ross Miller and Larry Lomax, Clark County's registrar of voters. \"This is individuals ripping off their bosses because they have quotas to make,\" Lomax said. Nevada Attorney General Catherine Cortez Masto said ACORN's policy required \"illegal acts in performing the job.\" \"These practices are clearly in violation of Nevada law,\" she said. \"By structuring employment and compensation around a quota system, ACORN facilitated voter registration fraud in this state.\" The criminal complaint lists 26 counts of compensation for registration of voters and another 13 counts of principal to the crime of registration of voters. As long as they can't prove voter fraud not voter regisration fraud, can't complain too much. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 2, 
        "quote": "ACORN, an activist group that turned in 90,000 completed voter registration forms in Clark County for last year's election, violated state law by setting mandatory quotas for workers who canvassed neighborhoods looking for people to register to vote, according to the state attorney general's office. Officials this morning released a complaint naming the Association of Community Organization for Reform Now Inc., as well as Christopher Howell Edwards, who was the group's Las Vegas field director, and deputy regional director Amy Busefink. Canvassers were required to register at least 20 people a day, and could be fired if they didn't, officials said. ACORN also instituted a bonus program led \"blackjack\" or \"21 plus\" in which a worker could earn an extra $5 per shift by registering 21 or more people. The problem with the quota system is it encouraged workers to turn in false registrations, said Secretary of State Ross Miller and Larry Lomax, Clark County's registrar of voters. \"This is individuals ripping off their bosses because they have quotas to make,\" Lomax said. Nevada Attorney General Catherine Cortez Masto said ACORN's policy required \"illegal acts in performing the job.\" \"These practices are clearly in violation of Nevada law,\" she said. \"By structuring employment and compensation around a quota system, ACORN facilitated voter registration fraud in this state.\" The criminal complaint lists 26 counts of compensation for registration of voters and another 13 counts of principal to the crime of registration of voters.", 
        "reply": "I don't get it. I don't see where they broke any laws *sarcastic grin*  As long as they can't prove voter fraud not voter regisration fraud, can't complain too much. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3790074222001", 
        "time": "2009-05-04 15:19:00", 
        "title": "State attorney charges ACORN", 
        "userID": "L0A1"
    }, 
    {
        "content": "Production rate and rewards. 2 of them They \"produced\" false names they are charging acorn as well \"These practices are clearly in violation of Nevada law,\" she said. \"By structuring employment and compensation around a quota system, ACORN facilitated voter registration fraud in this state.\" Seems more political driven than anything. I wouldn't go as far as saying \"ACORN facilitated voter registration fraud\" They were just out to make money.", 
        "intTime": 20090504, 
        "postID": 3, 
        "quote": "", 
        "reply": "Production rate and rewards. 2 of them They \"produced\" false names they are charging acorn as well \"These practices are clearly in violation of Nevada law,\" she said. \"By structuring employment and compensation around a quota system, ACORN facilitated voter registration fraud in this state.\" Seems more political driven than anything. I wouldn't go as far as saying \"ACORN facilitated voter registration fraud\" They were just out to make money.", 
        "threadID": "672198221_3790074222001", 
        "time": "2009-05-04 15:25:00", 
        "title": "State attorney charges ACORN", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "As soon as Obama reads this he will have his Harvard brother, the Attorney General on this like a duck after a June Bug.", 
        "intTime": 20090504, 
        "postID": 4, 
        "quote": "", 
        "reply": "As soon as Obama reads this he will have his Harvard brother, the Attorney General on this like a duck after a June Bug.", 
        "threadID": "672198221_3790074222001", 
        "time": "2009-05-04 15:25:00", 
        "title": "State attorney charges ACORN", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Production rate and rewards. 2 of them They \"produced\" false names they are charging acorn as well \"These practices are clearly in violation of Nevada law,\" she said. \"By structuring employment and compensation around a quota system, ACORN facilitated voter registration fraud in this state.\" Seems more political driven than anything. I wouldn't go as far as saying \"ACORN facilitated voter registration fraud\" They were just out to make money. Everything is politically motivated these days. Even Climate change. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 5, 
        "quote": "Originally posted by crackerjacks61: Production rate and rewards. 2 of them They \"produced\" false names they are charging acorn as well \"These practices are clearly in violation of Nevada law,\" she said. \"By structuring employment and compensation around a quota system, ACORN facilitated voter registration fraud in this state.\" Seems more political driven than anything. I wouldn't go as far as saying \"ACORN facilitated voter registration fraud\" They were just out to make money.", 
        "reply": " Everything is politically motivated these days. Even Climate change. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3790074222001", 
        "time": "2009-05-04 15:55:00", 
        "title": "State attorney charges ACORN", 
        "userID": "L0A1"
    }
]