[
    {
        "content": "quote: Top Air Force officials said that they supported the Obama administration’s decision to buy only four more of the advanced F-22 fighter jets, making it less likely that Congress will insist on extending its production. The Air Force had previously said it needed 60 more of the planes, a position that had built expectations for a fierce battle in Congress over the program’s future. Legislators from Georgia, Connecticut and other states with major suppliers are still likely to push for more planes. But it will be much harder for them to succeed if the Air Force is not quietly supporting their efforts, military analysts said.(Washington Times, April 14, 2009, Pg. B3) Final nail in the coffin for the F-22 (for the foreseeable future) IMHO! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090414,
        "postID": 1,
        "quote": "Top Air Force officials said that they supported the Obama administration’s decision to buy only four more of the advanced F-22 fighter jets, making it less likely that Congress will insist on extending its production. The Air Force had previously said it needed 60 more of the planes, a position that had built expectations for a fierce battle in Congress over the program’s future. Legislators from Georgia, Connecticut and other states with major suppliers are still likely to push for more planes. But it will be much harder for them to succeed if the Air Force is not quietly supporting their efforts, military analysts said.(Washington Times, April 14, 2009, Pg. B3)",
        "reply": " Final nail in the coffin for the F-22 (for the foreseeable future) IMHO! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_8840086022001",
        "time": "2009-04-14 07:23:00",
        "title": "Air Force Officials Agree On An SECDEF's Cutback",
        "userID": "NSNN"
    },
    {
        "content": "I think this is just group step talk. SecDef had them sign non-disclosure agreements about what was being said before he announced the cuts. General Schwartz is on record for wanting 50-70 more F-22s. It is odd how that is all of a sudden not being said anymore. Of course the previous USAF leadership pushed too hard and as soon as SecDEf had the chance, he canned them. Lessoned learned????? Darn thing is in production and exercises indicate it works very well. I gave up on the 381 number long ago, but I thought enough would be bought to make it a viable force. We are putting all our eggs in the F-35 basket and I do not believe that is a wise thing to do. Another thought. What ais the ANG going to get to replace their old F-15s and F-16s. They really do not need an $80 million F-35 for CONUS defense. IMHO they should get new-built F-16s, maybe even an updated version of the F-16XL given it carries 83% more internal fuel.",
        "intTime": 20090414,
        "postID": 2,
        "quote": "",
        "reply": "I think this is just group step talk. SecDef had them sign non-disclosure agreements about what was being said before he announced the cuts. General Schwartz is on record for wanting 50-70 more F-22s. It is odd how that is all of a sudden not being said anymore. Of course the previous USAF leadership pushed too hard and as soon as SecDEf had the chance, he canned them. Lessoned learned????? Darn thing is in production and exercises indicate it works very well. I gave up on the 381 number long ago, but I thought enough would be bought to make it a viable force. We are putting all our eggs in the F-35 basket and I do not believe that is a wise thing to do. Another thought. What ais the ANG going to get to replace their old F-15s and F-16s. They really do not need an $80 million F-35 for CONUS defense. IMHO they should get new-built F-16s, maybe even an updated version of the F-16XL given it carries 83% more internal fuel.",
        "threadID": "672198221_8840086022001",
        "time": "2009-04-14 08:01:00",
        "title": "Air Force Officials Agree On An SECDEF's Cutback",
        "userID": "sw614"
    },
    {
        "content": "quote: What ais the ANG going to get to replace their old F-15s and F-16s. They really do not need an $80 million F-35 for CONUS defense. IMHO they should get new-built F-16s, maybe even an updated version of the F-16XL given it carries 83% more internal fuel. That is a great point that is almost always ignored. Whenever a given piece of military hardware approaches the end of its service length, defense contractors and many others always use it as a justification for a new and exponentially more expensive replacement. Now that is often the correct answer. However, a brand new batch of F-15 and F-16 fighters would almost certainly remain perfectly capable aircraft for the next 10 to 20 years. We absolutely need the F-22, but given the economy and the types of wars we are currently engaged in; it is also clear that defense spending needs to be focused elsewhere.",
        "intTime": 20090414,
        "postID": 3,
        "quote": "What ais the ANG going to get to replace their old F-15s and F-16s. They really do not need an $80 million F-35 for CONUS defense. IMHO they should get new-built F-16s, maybe even an updated version of the F-16XL given it carries 83% more internal fuel.",
        "reply": " That is a great point that is almost always ignored. Whenever a given piece of military hardware approaches the end of its service length, defense contractors and many others always use it as a justification for a new and exponentially more expensive replacement. Now that is often the correct answer. However, a brand new batch of F-15 and F-16 fighters would almost certainly remain perfectly capable aircraft for the next 10 to 20 years. We absolutely need the F-22, but given the economy and the types of wars we are currently engaged in; it is also clear that defense spending needs to be focused elsewhere.",
        "threadID": "672198221_8840086022001",
        "time": "2009-04-14 08:21:00",
        "title": "Air Force Officials Agree On An SECDEF's Cutback",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: quote: What ais the ANG going to get to replace their old F-15s and F-16s. They really do not need an $80 million F-35 for CONUS defense. IMHO they should get new-built F-16s, maybe even an updated version of the F-16XL given it carries 83% more internal fuel. That is a great point that is almost always ignored. Whenever a given piece of military hardware approaches the end of its service length, defense contractors and many others always use it as a justification for a new and exponentially more expensive replacement. Now that is often the correct answer. However, a brand new batch of F-15 and F-16 fighters would almost certainly remain perfectly capable aircraft for the next 10 to 20 years. We absolutely need the F-22, but given the economy and the types of wars we are currently engaged in; it is also clear that defense spending needs to be focused elsewhere. Oh, I agree that the warfighters need what they need, but buying the F-22 would not be for current operations, it would be for possible future conflicts that we may, or may not be able to avoid. But it is not just the F-22 decision that rankles me. The SecDef cancelled the next generation bomber and the replacement CSAR helo. So with this he puts 3 core USAF missions on the back burner. In 10 years, we will have more comitments than we do acft to fill them. At peak production, the F-35 will only be bought at around 100 per year. At that rate, it will take 25 years to buy them all. Yes, new F-15s or -16s would fit the CONUS AD mission nicely. Spend what we need to not what we want to.",
        "intTime": 20090414,
        "postID": 4,
        "quote": "Originally posted by foxred03: quote: What ais the ANG going to get to replace their old F-15s and F-16s. They really do not need an $80 million F-35 for CONUS defense. IMHO they should get new-built F-16s, maybe even an updated version of the F-16XL given it carries 83% more internal fuel. That is a great point that is almost always ignored. Whenever a given piece of military hardware approaches the end of its service length, defense contractors and many others always use it as a justification for a new and exponentially more expensive replacement. Now that is often the correct answer. However, a brand new batch of F-15 and F-16 fighters would almost certainly remain perfectly capable aircraft for the next 10 to 20 years. We absolutely need the F-22, but given the economy and the types of wars we are currently engaged in; it is also clear that defense spending needs to be focused elsewhere.",
        "reply": " Oh, I agree that the warfighters need what they need, but buying the F-22 would not be for current operations, it would be for possible future conflicts that we may, or may not be able to avoid. But it is not just the F-22 decision that rankles me. The SecDef cancelled the next generation bomber and the replacement CSAR helo. So with this he puts 3 core USAF missions on the back burner. In 10 years, we will have more comitments than we do acft to fill them. At peak production, the F-35 will only be bought at around 100 per year. At that rate, it will take 25 years to buy them all. Yes, new F-15s or -16s would fit the CONUS AD mission nicely. Spend what we need to not what we want to.",
        "threadID": "672198221_8840086022001",
        "time": "2009-04-14 12:05:00",
        "title": "Air Force Officials Agree On An SECDEF's Cutback",
        "userID": "sw614"
    }
]