[
    {
        "content": ">http://www.theglobeandmail.com/servlet/story/RTGAM.20090515.wgitmo0515/BNStory/International/home President Obama announced to-day that the US was going to take another 'stab' at Military Tribunals for Gitmo detainees. The *new*improved* tribunals are being designed to be seen to be 'just' by barring any evidence derived from torture, and by allowing detainees to select their own lawyers. The tribunals will allow 'hearsay' evidence providing the Army can prove it came from a 'trustworthy' source. Since most of the latter evidence comes from material supposedly relayed to 'friendly' guards, the prosecution should be a 'slam-dunk'. Left out of the cakewalk, however, are the greater number of detainees about which no evidence exists and those who are known to be innocent but who can't be safely released. Remaining unanswered, as well, are questions relating to those who might actually win their case. President Obama is not only applying lipstick to GWB's porker. To make America look good he's giving Ms Piggy a complete makeover.", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "", 
        "reply": ">http://www.theglobeandmail.com/servlet/story/RTGAM.20090515.wgitmo0515/BNStory/International/home President Obama announced to-day that the US was going to take another 'stab' at Military Tribunals for Gitmo detainees. The *new*improved* tribunals are being designed to be seen to be 'just' by barring any evidence derived from torture, and by allowing detainees to select their own lawyers. The tribunals will allow 'hearsay' evidence providing the Army can prove it came from a 'trustworthy' source. Since most of the latter evidence comes from material supposedly relayed to 'friendly' guards, the prosecution should be a 'slam-dunk'. Left out of the cakewalk, however, are the greater number of detainees about which no evidence exists and those who are known to be innocent but who can't be safely released. Remaining unanswered, as well, are questions relating to those who might actually win their case. President Obama is not only applying lipstick to GWB's porker. To make America look good he's giving Ms Piggy a complete makeover.", 
        "threadID": "672198221_3480004322001", 
        "time": "2009-05-15 17:27:00", 
        "title": "President Obama Resuscitates Porker", 
        "userID": "popsiq"
    }, 
    {
        "content": "I know pops, we should release them all, and live a strict life of their version of the Quran. Then they would have to engage in terrorism. It is our fault they became terrorist, it is just to show us the way.", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "I know pops, we should release them all, and live a strict life of their version of the Quran. Then they would have to engage in terrorism. It is our fault they became terrorist, it is just to show us the way.", 
        "threadID": "672198221_3480004322001", 
        "time": "2009-05-15 18:41:00", 
        "title": "President Obama Resuscitates Porker", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: I know pops, we should release them all, and live a strict life of their version of the Quran. Then they would have to engage in terrorism. It is our fault they became terrorist, it is just to show us the way. I think you're on the button with your second comment Gonzo. And that ties in with the first. Releasing them IS a real problem for just that reason - if they weren't anti-American, they sure as hell are now. What they can, or will, do about that is debatable. But while you got em, without being able to demonstrate their guilt, America looks like the 'heavy' in the piece. Keeping them if they aren't found guilty will be worse. And finding them guilty now is going to look like that decorated pig. It's all about optics now, another 'tiger by the tail'.", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "Originally posted by iamgonzo: I know pops, we should release them all, and live a strict life of their version of the Quran. Then they would have to engage in terrorism. It is our fault they became terrorist, it is just to show us the way.", 
        "reply": " I think you're on the button with your second comment Gonzo. And that ties in with the first. Releasing them IS a real problem for just that reason - if they weren't anti-American, they sure as hell are now. What they can, or will, do about that is debatable. But while you got em, without being able to demonstrate their guilt, America looks like the 'heavy' in the piece. Keeping them if they aren't found guilty will be worse. And finding them guilty now is going to look like that decorated pig. It's all about optics now, another 'tiger by the tail'.", 
        "threadID": "672198221_3480004322001", 
        "time": "2009-05-16 03:01:00", 
        "title": "President Obama Resuscitates Porker", 
        "userID": "popsiq"
    }, 
    {
        "content": "The decision will come back to bite Obama in the backside later - as in Election Day 2012. Putting an end to the tribunals at Gitmo was one of his key campaign themes - and among other backtracks such as releasing torture photos, I suspect he'll regret the move come campaign time.", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "", 
        "reply": "The decision will come back to bite Obama in the backside later - as in Election Day 2012. Putting an end to the tribunals at Gitmo was one of his key campaign themes - and among other backtracks such as releasing torture photos, I suspect he'll regret the move come campaign time.", 
        "threadID": "672198221_3480004322001", 
        "time": "2009-05-16 05:29:00", 
        "title": "President Obama Resuscitates Porker", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I say we send them all to Canada. Maybe they can do for our Gitmo Detainees what they have done for health care.", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "", 
        "reply": "I say we send them all to Canada. Maybe they can do for our Gitmo Detainees what they have done for health care.", 
        "threadID": "672198221_3480004322001", 
        "time": "2009-05-16 05:36:00", 
        "title": "President Obama Resuscitates Porker", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: The decision will come back to bite Obama in the backside later - as in Election Day 2012. Putting an end to the tribunals at Gitmo was one of his key campaign themes - and among other backtracks such as releasing torture photos, I suspect he'll regret the move come campaign time. Obama was elected for change. He changed what he said he would do. We got what was promised.", 
        "intTime": 20090516, 
        "postID": 6, 
        "quote": "Originally posted by PhoenixDark: The decision will come back to bite Obama in the backside later - as in Election Day 2012. Putting an end to the tribunals at Gitmo was one of his key campaign themes - and among other backtracks such as releasing torture photos, I suspect he'll regret the move come campaign time.", 
        "reply": " Obama was elected for change. He changed what he said he would do. We got what was promised.", 
        "threadID": "672198221_3480004322001", 
        "time": "2009-05-16 06:38:00", 
        "title": "President Obama Resuscitates Porker", 
        "userID": "iamgonzo"
    }
]