[
    {
        "content": "quote: You've certainly never seen one quite like it before: President Barack Obama's appearance on NBC's Tonight Show With Jay Leno Thursday night was the first such late-night guest spot by a sitting president. Not everyone was thrilled by the prospect; some found the idea unpresidential, and others simply think this particular president risks being overexposed. But watching the show, it really did seem like it was a pretty good evening for the guest, the host and Tonight itself. To be sure, there were moments that required some adjustment. We're not used to seeing presidents in such informal TV interview settings, and they're generally not used to having to follow jokes about Madonna's dating habits and St. Patrick's Day shot glasses. The show is what it is, but for the most part at least, Tonight accommodated itself to Obama rather than the other way around. There was a monologue at the start and a one-song performance by Garth Brooks at the end, but otherwise the entire show was devoted to Leno's interview with Obama. And even Brooks' appearance was clearly presented by Leno as a way to make the show even more \"special.\" Wisely, Obama did not try to reshape his style or approach to fit the show; he may have kidded with Leno some, but he was there as president, not as entertainer-in-chief. Calm, witty and in control, he came to deliver a message — the economy is in trouble, but it will recover — and that's what he did, with very few diversions. And he did it, you'd have to think, without inflicting any damage on the integrity of the presidency. Whatever one thinks of his policies, no one can accuse Obama of lacking gravity or dignity. He doesn't need any particularly setting to bestow those qualities on him; he carries them with him. (.....) I watched the show, and I honestly thought the President did a great job! +http://www.usatoday.com/life/television/reviews/2009-03-20-obama-leno_N.htm", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "You've certainly never seen one quite like it before: President Barack Obama's appearance on NBC's Tonight Show With Jay Leno Thursday night was the first such late-night guest spot by a sitting president. Not everyone was thrilled by the prospect; some found the idea unpresidential, and others simply think this particular president risks being overexposed. But watching the show, it really did seem like it was a pretty good evening for the guest, the host and Tonight itself. To be sure, there were moments that required some adjustment. We're not used to seeing presidents in such informal TV interview settings, and they're generally not used to having to follow jokes about Madonna's dating habits and St. Patrick's Day shot glasses. The show is what it is, but for the most part at least, Tonight accommodated itself to Obama rather than the other way around. There was a monologue at the start and a one-song performance by Garth Brooks at the end, but otherwise the entire show was devoted to Leno's interview with Obama. And even Brooks' appearance was clearly presented by Leno as a way to make the show even more \"special.\" Wisely, Obama did not try to reshape his style or approach to fit the show; he may have kidded with Leno some, but he was there as president, not as entertainer-in-chief. Calm, witty and in control, he came to deliver a message — the economy is in trouble, but it will recover — and that's what he did, with very few diversions. And he did it, you'd have to think, without inflicting any damage on the integrity of the presidency. Whatever one thinks of his policies, no one can accuse Obama of lacking gravity or dignity. He doesn't need any particularly setting to bestow those qualities on him; he carries them with him. (.....)", 
        "reply": " I watched the show, and I honestly thought the President did a great job! +http://www.usatoday.com/life/television/reviews/2009-03-20-obama-leno_N.htm", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 05:59:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "No problems with the teleprompter then? That's good.", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "", 
        "reply": "No problems with the teleprompter then? That's good.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:05:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:08:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "ACR26"
    }, 
    {
        "content": "We also learned that Special Olympians are not a demographic of concern to the current administration.", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "We also learned that Special Olympians are not a demographic of concern to the current administration.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:14:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next Don't forget Rachel Ray. They could devote an entire program to special \"recession proof\" dinners.", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next", 
        "reply": " Don't forget Rachel Ray. They could devote an entire program to special \"recession proof\" dinners.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:17:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: No problems with the teleprompter then? That's good. No teleprompter period, and no mumbling & bumbling either! quote: Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next Your right, he should have taken a vacation……shoot some deer or something.", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "Originally posted by I_M_Qwerty: No problems with the teleprompter then? That's good.", 
        "reply": " No teleprompter period, and no mumbling & bumbling either! quote: Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next Your right, he should have taken a vacation……shoot some deer or something.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:17:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration. Miserable man opens his mouth, but not his eyes.", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration.", 
        "reply": " Miserable man opens his mouth, but not his eyes.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:18:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration. Miserable man opens his mouth, but not his eyes. Or, as in your case, opens mouth and closes mind.", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "Originally posted by Knele: quote: Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration. Miserable man opens his mouth, but not his eyes.", 
        "reply": " Or, as in your case, opens mouth and closes mind.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:20:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Or, as in your case, opens mouth and closes mind. Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\"", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Or, as in your case, opens mouth and closes mind.", 
        "reply": " Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\"", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:28:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Good intertainment, not as good as MASH but, I wanted some different laughs. I got them.", 
        "intTime": 20090320, 
        "postID": 10, 
        "quote": "", 
        "reply": "Good intertainment, not as good as MASH but, I wanted some different laughs. I got them.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:41:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Drink some?", 
        "intTime": 20090320, 
        "postID": 11, 
        "quote": "", 
        "reply": "Drink some?", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:46:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Or, as in your case, opens mouth and closes mind. Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\" There's coffee all over my keyboard n it's you n your daddy's fault", 
        "intTime": 20090320, 
        "postID": 12, 
        "quote": "Originally posted by I_M_Qwerty: quote: Or, as in your case, opens mouth and closes mind. Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\"", 
        "reply": " There's coffee all over my keyboard n it's you n your daddy's fault", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:58:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno. Isn't anyone disgusted in the way the politicians in Washington D.C. feel they can do what they please, when they want to do it, Constitution be damned? Or is it more important that the POTUS looked good in yet another televised event? I have news for everyone. The only thing the POTUS is concerned with is his own reelection. That is a major problem when he is less then 100 days into his presidency. Appearances on talk shows, endless town hall meetings and fake \"State of the Union Addresses\" will not fix what is wrong with this country. But while the puppet masters run wild in D.C., all the POTUS is concerned with isgetting as much media face time as possible. I guess that is \"Change we can believe in\".", 
        "intTime": 20090320, 
        "postID": 13, 
        "quote": "", 
        "reply": "I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno. Isn't anyone disgusted in the way the politicians in Washington D.C. feel they can do what they please, when they want to do it, Constitution be damned? Or is it more important that the POTUS looked good in yet another televised event? I have news for everyone. The only thing the POTUS is concerned with is his own reelection. That is a major problem when he is less then 100 days into his presidency. Appearances on talk shows, endless town hall meetings and fake \"State of the Union Addresses\" will not fix what is wrong with this country. But while the puppet masters run wild in D.C., all the POTUS is concerned with isgetting as much media face time as possible. I guess that is \"Change we can believe in\".", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:08:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants?", 
        "intTime": 20090320, 
        "postID": 14, 
        "quote": "Originally posted by Knele: Drink some?", 
        "reply": " Why does Obama hate Special Olympics participants?", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:23:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno. Just goes to show they prefer intertainment based on a fictional novel wrote during the campaign, their \"Messiah\" being the author.", 
        "intTime": 20090320, 
        "postID": 15, 
        "quote": "Originally posted by stec74: I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno.", 
        "reply": " Just goes to show they prefer intertainment based on a fictional novel wrote during the campaign, their \"Messiah\" being the author.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:26:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants? Please....you’re being pathetic!", 
        "intTime": 20090320, 
        "postID": 16, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants?", 
        "reply": " Please....you’re being pathetic!", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:32:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you.", 
        "intTime": 20090320, 
        "postID": 17, 
        "quote": "Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants? Please....you’re being pathetic!", 
        "reply": " Calling the kettle black is an understatement with you.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:35:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you. Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older!", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you.", 
        "reply": " Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older!", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:43:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "Watched it and the President seemed more relaxed than any other time since the election. Other than the special olympics gaff, went without a hitch. What's the big deal?", 
        "intTime": 20090320, 
        "postID": 19, 
        "quote": "", 
        "reply": "Watched it and the President seemed more relaxed than any other time since the election. Other than the special olympics gaff, went without a hitch. What's the big deal?", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:53:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you. Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older! Same does not go for me, I stay consistant in my beliefs and opinions and neither a smooth talker or you can change them. You do have age and experience over you right though.", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Originally posted by Knele: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you. Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older!", 
        "reply": " Same does not go for me, I stay consistant in my beliefs and opinions and neither a smooth talker or you can change them. You do have age and experience over you right though.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 08:06:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: You've certainly never seen one quite like it before: President Barack Obama's appearance on NBC's Tonight Show With Jay Leno Thursday night was the first such late-night guest spot by a sitting president. Not everyone was thrilled by the prospect; some found the idea unpresidential, and others simply think this particular president risks being overexposed. But watching the show, it really did seem like it was a pretty good evening for the guest, the host and Tonight itself. To be sure, there were moments that required some adjustment. We're not used to seeing presidents in such informal TV interview settings, and they're generally not used to having to follow jokes about Madonna's dating habits and St. Patrick's Day shot glasses. The show is what it is, but for the most part at least, Tonight accommodated itself to Obama rather than the other way around. There was a monologue at the start and a one-song performance by Garth Brooks at the end, but otherwise the entire show was devoted to Leno's interview with Obama. And even Brooks' appearance was clearly presented by Leno as a way to make the show even more \"special.\" Wisely, Obama did not try to reshape his style or approach to fit the show; he may have kidded with Leno some, but he was there as president, not as entertainer-in-chief. Calm, witty and in control, he came to deliver a message — the economy is in trouble, but it will recover — and that's what he did, with very few diversions. And he did it, you'd have to think, without inflicting any damage on the integrity of the presidency. Whatever one thinks of his policies, no one can accuse Obama of lacking gravity or dignity. He doesn't need any particularly setting to bestow those qualities on him; he carries them with him. (.....) I watched the show, and I honestly thought the President did a great job! +http://www.usatoday.com/life/television/reviews/2009-03-20-obama-leno_N.htm", 
        "intTime": 20090320, 
        "postID": 21, 
        "quote": "You've certainly never seen one quite like it before: President Barack Obama's appearance on NBC's Tonight Show With Jay Leno Thursday night was the first such late-night guest spot by a sitting president. Not everyone was thrilled by the prospect; some found the idea unpresidential, and others simply think this particular president risks being overexposed. But watching the show, it really did seem like it was a pretty good evening for the guest, the host and Tonight itself. To be sure, there were moments that required some adjustment. We're not used to seeing presidents in such informal TV interview settings, and they're generally not used to having to follow jokes about Madonna's dating habits and St. Patrick's Day shot glasses. The show is what it is, but for the most part at least, Tonight accommodated itself to Obama rather than the other way around. There was a monologue at the start and a one-song performance by Garth Brooks at the end, but otherwise the entire show was devoted to Leno's interview with Obama. And even Brooks' appearance was clearly presented by Leno as a way to make the show even more \"special.\" Wisely, Obama did not try to reshape his style or approach to fit the show; he may have kidded with Leno some, but he was there as president, not as entertainer-in-chief. Calm, witty and in control, he came to deliver a message — the economy is in trouble, but it will recover — and that's what he did, with very few diversions. And he did it, you'd have to think, without inflicting any damage on the integrity of the presidency. Whatever one thinks of his policies, no one can accuse Obama of lacking gravity or dignity. He doesn't need any particularly setting to bestow those qualities on him; he carries them with him. (.....)", 
        "reply": " I watched the show, and I honestly thought the President did a great job! +http://www.usatoday.com/life/television/reviews/2009-03-20-obama-leno_N.htm", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 05:59:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "No problems with the teleprompter then? That's good.", 
        "intTime": 20090320, 
        "postID": 22, 
        "quote": "", 
        "reply": "No problems with the teleprompter then? That's good.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:05:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next", 
        "intTime": 20090320, 
        "postID": 23, 
        "quote": "", 
        "reply": "Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:08:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "ACR26"
    }, 
    {
        "content": "We also learned that Special Olympians are not a demographic of concern to the current administration.", 
        "intTime": 20090320, 
        "postID": 24, 
        "quote": "", 
        "reply": "We also learned that Special Olympians are not a demographic of concern to the current administration.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:14:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next Don't forget Rachel Ray. They could devote an entire program to special \"recession proof\" dinners.", 
        "intTime": 20090320, 
        "postID": 25, 
        "quote": "Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next", 
        "reply": " Don't forget Rachel Ray. They could devote an entire program to special \"recession proof\" dinners.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:17:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: No problems with the teleprompter then? That's good. No teleprompter period, and no mumbling & bumbling either! quote: Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next Your right, he should have taken a vacation……shoot some deer or something.", 
        "intTime": 20090320, 
        "postID": 26, 
        "quote": "Originally posted by I_M_Qwerty: No problems with the teleprompter then? That's good.", 
        "reply": " No teleprompter period, and no mumbling & bumbling either! quote: Originally posted by ACR26: Can't wait till he goes on \"The View\". Sure do like it when our President goes on an entertainment show during the \"Worst crisis since the Great Depression\". Guess that is the only way to get his point across. MTV and BET next Your right, he should have taken a vacation……shoot some deer or something.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:17:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration. Miserable man opens his mouth, but not his eyes.", 
        "intTime": 20090320, 
        "postID": 27, 
        "quote": "Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration.", 
        "reply": " Miserable man opens his mouth, but not his eyes.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:18:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration. Miserable man opens his mouth, but not his eyes. Or, as in your case, opens mouth and closes mind.", 
        "intTime": 20090320, 
        "postID": 28, 
        "quote": "Originally posted by Knele: quote: Originally posted by adminnco1: We also learned that Special Olympians are not a demographic of concern to the current administration. Miserable man opens his mouth, but not his eyes.", 
        "reply": " Or, as in your case, opens mouth and closes mind.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:20:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Or, as in your case, opens mouth and closes mind. Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\"", 
        "intTime": 20090320, 
        "postID": 29, 
        "quote": "Or, as in your case, opens mouth and closes mind.", 
        "reply": " Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\"", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:28:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Good intertainment, not as good as MASH but, I wanted some different laughs. I got them.", 
        "intTime": 20090320, 
        "postID": 30, 
        "quote": "", 
        "reply": "Good intertainment, not as good as MASH but, I wanted some different laughs. I got them.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:41:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Drink some?", 
        "intTime": 20090320, 
        "postID": 31, 
        "quote": "", 
        "reply": "Drink some?", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:46:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Or, as in your case, opens mouth and closes mind. Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\" There's coffee all over my keyboard n it's you n your daddy's fault", 
        "intTime": 20090320, 
        "postID": 32, 
        "quote": "Originally posted by I_M_Qwerty: quote: Or, as in your case, opens mouth and closes mind. Or, as my sainted daddy used to say ... \"If your going to open your yap, pull your head out of your azz first!\"", 
        "reply": " There's coffee all over my keyboard n it's you n your daddy's fault", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 06:58:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno. Isn't anyone disgusted in the way the politicians in Washington D.C. feel they can do what they please, when they want to do it, Constitution be damned? Or is it more important that the POTUS looked good in yet another televised event? I have news for everyone. The only thing the POTUS is concerned with is his own reelection. That is a major problem when he is less then 100 days into his presidency. Appearances on talk shows, endless town hall meetings and fake \"State of the Union Addresses\" will not fix what is wrong with this country. But while the puppet masters run wild in D.C., all the POTUS is concerned with isgetting as much media face time as possible. I guess that is \"Change we can believe in\".", 
        "intTime": 20090320, 
        "postID": 33, 
        "quote": "", 
        "reply": "I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno. Isn't anyone disgusted in the way the politicians in Washington D.C. feel they can do what they please, when they want to do it, Constitution be damned? Or is it more important that the POTUS looked good in yet another televised event? I have news for everyone. The only thing the POTUS is concerned with is his own reelection. That is a major problem when he is less then 100 days into his presidency. Appearances on talk shows, endless town hall meetings and fake \"State of the Union Addresses\" will not fix what is wrong with this country. But while the puppet masters run wild in D.C., all the POTUS is concerned with isgetting as much media face time as possible. I guess that is \"Change we can believe in\".", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:08:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants?", 
        "intTime": 20090320, 
        "postID": 34, 
        "quote": "Originally posted by Knele: Drink some?", 
        "reply": " Why does Obama hate Special Olympics participants?", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:23:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno. Just goes to show they prefer intertainment based on a fictional novel wrote during the campaign, their \"Messiah\" being the author.", 
        "intTime": 20090320, 
        "postID": 35, 
        "quote": "Originally posted by stec74: I think it is just wonderful how one day after the US House of Representatives wiped their collective backsides with the Constitution, all the Obama supporters can talk about is how well he did on Jay Leno.", 
        "reply": " Just goes to show they prefer intertainment based on a fictional novel wrote during the campaign, their \"Messiah\" being the author.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:26:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants? Please....you’re being pathetic!", 
        "intTime": 20090320, 
        "postID": 36, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants?", 
        "reply": " Please....you’re being pathetic!", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:32:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you.", 
        "intTime": 20090320, 
        "postID": 37, 
        "quote": "Originally posted by Knele: quote: Originally posted by GunnyRet03: quote: Originally posted by Knele: Drink some? Why does Obama hate Special Olympics participants? Please....you’re being pathetic!", 
        "reply": " Calling the kettle black is an understatement with you.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:35:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you. Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older!", 
        "intTime": 20090320, 
        "postID": 38, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you.", 
        "reply": " Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older!", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:43:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "Knele"
    }, 
    {
        "content": "Watched it and the President seemed more relaxed than any other time since the election. Other than the special olympics gaff, went without a hitch. What's the big deal?", 
        "intTime": 20090320, 
        "postID": 39, 
        "quote": "", 
        "reply": "Watched it and the President seemed more relaxed than any other time since the election. Other than the special olympics gaff, went without a hitch. What's the big deal?", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 07:53:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you. Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older! Same does not go for me, I stay consistant in my beliefs and opinions and neither a smooth talker or you can change them. You do have age and experience over you right though.", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "Originally posted by Knele: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Knele: quote: Originally posted by GunnyRet03: Why does Obama hate Special Olympics participants? Please....you’re being pathetic! Calling the kettle black is an understatement with you. Same goes for you! Its amazing how two individuals of your age & experience are so piteous! I guess the height is not the only thing that rewinds as we grow older!", 
        "reply": " Same does not go for me, I stay consistant in my beliefs and opinions and neither a smooth talker or you can change them. You do have age and experience over you right though.", 
        "threadID": "672198221_4020004812001", 
        "time": "2009-03-20 08:06:00", 
        "title": "Presidential dignity still intact after Obama's Leno visit", 
        "userID": "SignalSgtWilliams"
    }
]