[
    {
        "content": "The headquarters of Murtech, in a low-slung, bland building in a Glen Burnie business park, has its blinds drawn tight and few signs of life. On several days of visits, a handful of cars sit in the parking lot, and no trucks arrive at the 10 loading bays at the back of the building. Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services. With its long corridor of sparsely occupied offices and an unmanned reception area, Murtech's most striking feature is its owner -- Robert C. Murtha Jr., 49. He is the nephew of Rep. John P. Murtha, the Pennsylvania Democrat who has significant sway over the Defense Department's spending as chairman of the House Appropriations defense subcommittee. Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. He said Murtech's 17 employees \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats, \"and that's about as far as I feel comfortable going.\" Giving more details could provide important clues to terrorist plotters, he said. Murtha's power has had beneficial effects within his family. His brother, Robert C. \"Kit\" Murtha, built a longtime lobbying practice around clients seeking defense funds through the Appropriations Committee and became one of the top members of KSA, a lobbying firm whose contractor clients often received multimillion-dollar earmarks directed through the committee chairman. Rest here: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050403743.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "", 
        "reply": "The headquarters of Murtech, in a low-slung, bland building in a Glen Burnie business park, has its blinds drawn tight and few signs of life. On several days of visits, a handful of cars sit in the parking lot, and no trucks arrive at the 10 loading bays at the back of the building. Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services. With its long corridor of sparsely occupied offices and an unmanned reception area, Murtech's most striking feature is its owner -- Robert C. Murtha Jr., 49. He is the nephew of Rep. John P. Murtha, the Pennsylvania Democrat who has significant sway over the Defense Department's spending as chairman of the House Appropriations defense subcommittee. Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. He said Murtech's 17 employees \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats, \"and that's about as far as I feel comfortable going.\" Giving more details could provide important clues to terrorist plotters, he said. Murtha's power has had beneficial effects within his family. His brother, Robert C. \"Kit\" Murtha, built a longtime lobbying practice around clients seeking defense funds through the Appropriations Committee and became one of the top members of KSA, a lobbying firm whose contractor clients often received multimillion-dollar earmarks directed through the committee chairman. Rest here: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050403743.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 08:53:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me.", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews.", 
        "reply": " Having read that article it actually looks legit to me.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 08:57:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me.", 
        "reply": " He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:01:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts. I'm all about hating Defense contractors (and I do, with a passion), but if you read the article where it says what they do (Nuclear detection?!?!?!), I can understand the need for secrecy and no-bid contracts.", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts.", 
        "reply": " I'm all about hating Defense contractors (and I do, with a passion), but if you read the article where it says what they do (Nuclear detection?!?!?!), I can understand the need for secrecy and no-bid contracts.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:04:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "intTime": 20090505, 
        "postID": 5, 
        "quote": "", 
        "reply": "These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:05:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about. I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 6, 
        "quote": "Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "reply": " I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:07:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services.", 
        "intTime": 20090505, 
        "postID": 7, 
        "quote": "Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company?", 
        "reply": " Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:10:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services. So a no name company of 17 employees is randomly selected for NUCLEAR DETECTION? I don't think so. They aren't even that popular nor have they done that much work. There is no way the Pentagon was just sitting around and decided hey, those guys look cool let's select them for a no-bid contract not knowing what kind of skills they had. It just isn't a sound business practice to that. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 8, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services.", 
        "reply": " So a no name company of 17 employees is randomly selected for NUCLEAR DETECTION? I don't think so. They aren't even that popular nor have they done that much work. There is no way the Pentagon was just sitting around and decided hey, those guys look cool let's select them for a no-bid contract not knowing what kind of skills they had. It just isn't a sound business practice to that. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:15:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. I have to agree, even in the article it says: quote: Leo Fratis, the Army contracting officer who handled the matter, said there was \"nothing improper\" about the contract. He said it was awarded on a no-bid basis only because the Army command \"had a lot of things going on at the time.\" Pentagon spokesman Julius Evans said the congressman never contacted the Army command about his nephew's company and has no say in its procurement decisions. \"Congressman Murtha has had no influence over any contract award by our organization,\" Evans said. Comming from the military tells me it's legit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090505, 
        "postID": 9, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me.", 
        "reply": " I have to agree, even in the article it says: quote: Leo Fratis, the Army contracting officer who handled the matter, said there was \"nothing improper\" about the contract. He said it was awarded on a no-bid basis only because the Army command \"had a lot of things going on at the time.\" Pentagon spokesman Julius Evans said the congressman never contacted the Army command about his nephew's company and has no say in its procurement decisions. \"Congressman Murtha has had no influence over any contract award by our organization,\" Evans said. Comming from the military tells me it's legit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:18:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about. Read again, he says his business is to \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats. So, his company isn't the one doing the actual detecting...he's providing \"logistical support\", i.e., he has a warehouse full of office chairs and computer paper doing 4 mil a year in sales without having to bid. May be irritating to see a little nepotism going on, but the military buys a lot more than that every year under no-bid contracts. On the other hand, it's not like he's in some top-secret national security role. He has a warehouse full of overpriced supplies.", 
        "intTime": 20090505, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "reply": " Read again, he says his business is to \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats. So, his company isn't the one doing the actual detecting...he's providing \"logistical support\", i.e., he has a warehouse full of office chairs and computer paper doing 4 mil a year in sales without having to bid. May be irritating to see a little nepotism going on, but the military buys a lot more than that every year under no-bid contracts. On the other hand, it's not like he's in some top-secret national security role. He has a warehouse full of overpriced supplies.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:55:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "jwr6"
    }, 
    {
        "content": "“If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview", 
        "intTime": 20090505, 
        "postID": 11, 
        "quote": "", 
        "reply": "“If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 11:00:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: “If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview Already past the future", 
        "intTime": 20090505, 
        "postID": 12, 
        "quote": "Originally posted by rayevinsonsr: “If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview", 
        "reply": " Already past the future", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 11:36:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "6486143"
    }, 
    {
        "content": "Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "intTime": 20090505, 
        "postID": 13, 
        "quote": "", 
        "reply": "Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 12:03:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that. the only thing I can say is, it's old news, besides incorrect.", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "reply": " the only thing I can say is, it's old news, besides incorrect.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 12:10:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that. No he didnt, but it does show your ignorance on the details. First of all. Cheney stopped working for Halliburton in 1999. Cheney (and his Wife) signed a legal document turning over all deferred compensation before taxes to 3 charities in Jan. 2001. XXXhttp://www.giveitupcheney.org/CheneyGiftAgreement.pdfXXX George Washington University Medical Faculty associates - 40% University of Wyoming- 40% Capital partners for Education- 20% XXXhttp://www.factcheck.org/kerry_ad_falsely_accuses_cheney_on_halliburton.htmlXXX Here's some further sources: \"Vice President Dick Cheney discusses the war with Iraq, the economy and other topics,\" NBC News \"Meet the Press\" 14 Sep 2003. Jack Maskell, \"Official's Stock Options In and Deferred Compensation From a Corporation as a \"Financial Interest\" of an Executive Branch Official in Such a Corporation,\" Memorandum , American Law Division, Congressional Research Service, 22 Sep 2003. US Code of Federal Regulations,TITLE 5, CHAPTER XVI--OFFICE OF GOVERNMENT ETHICS, PART 2640--INTERPRETATION, EXEMPTIONS AND WAIVER GUIDANCE CONCERNING 18 U.S.C. 208 (ACTS AFFECTING A PERSONAL FINANCIAL INTEREST) 5CFR2640.103(b) Timothy J. Burger and Adam Zagorin, \"The Paper Trail: Did Cheney Okay a Deal?\", Time magazine, 7 June 2004: 42. Larry Margasak, \"Cheney never heard plan to give work to Halliburton for rebuilding of Iraq,\" The Associated Press 16 June 2004. But hey, never let it be said facts get in the way of a rant, eh?", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "reply": " No he didnt, but it does show your ignorance on the details. First of all. Cheney stopped working for Halliburton in 1999. Cheney (and his Wife) signed a legal document turning over all deferred compensation before taxes to 3 charities in Jan. 2001. XXXhttp://www.giveitupcheney.org/CheneyGiftAgreement.pdfXXX George Washington University Medical Faculty associates - 40% University of Wyoming- 40% Capital partners for Education- 20% XXXhttp://www.factcheck.org/kerry_ad_falsely_accuses_cheney_on_halliburton.htmlXXX Here's some further sources: \"Vice President Dick Cheney discusses the war with Iraq, the economy and other topics,\" NBC News \"Meet the Press\" 14 Sep 2003. Jack Maskell, \"Official's Stock Options In and Deferred Compensation From a Corporation as a \"Financial Interest\" of an Executive Branch Official in Such a Corporation,\" Memorandum , American Law Division, Congressional Research Service, 22 Sep 2003. US Code of Federal Regulations,TITLE 5, CHAPTER XVI--OFFICE OF GOVERNMENT ETHICS, PART 2640--INTERPRETATION, EXEMPTIONS AND WAIVER GUIDANCE CONCERNING 18 U.S.C. 208 (ACTS AFFECTING A PERSONAL FINANCIAL INTEREST) 5CFR2640.103(b) Timothy J. Burger and Adam Zagorin, \"The Paper Trail: Did Cheney Okay a Deal?\", Time magazine, 7 June 2004: 42. Larry Margasak, \"Cheney never heard plan to give work to Halliburton for rebuilding of Iraq,\" The Associated Press 16 June 2004. But hey, never let it be said facts get in the way of a rant, eh?", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 15:06:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090505, 
        "postID": 16, 
        "quote": "", 
        "reply": "Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 15:21:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. I think you missed part of the article. First sentence of the second paragraph Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services.", 
        "intTime": 20090505, 
        "postID": 17, 
        "quote": "Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him.", 
        "reply": " I think you missed part of the article. First sentence of the second paragraph Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 18:50:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "fredette"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. Are you truly that obtuse? 1- It's Murthas NEPHEW being investigated. So unless your saying ABSCAM Jack is doing the Hillbilly Lambada with his sister, he cant be his Nephews daddy..... 2- Your reading comprehension leaves much to be desired, He got the contract as a No-Bid- twas in the first paragraph. Isnt that one of the things y'all been whining about for Pentagon Contracts for 8 years?", 
        "intTime": 20090505, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him.", 
        "reply": " Are you truly that obtuse? 1- It's Murthas NEPHEW being investigated. So unless your saying ABSCAM Jack is doing the Hillbilly Lambada with his sister, he cant be his Nephews daddy..... 2- Your reading comprehension leaves much to be desired, He got the contract as a No-Bid- twas in the first paragraph. Isnt that one of the things y'all been whining about for Pentagon Contracts for 8 years?", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 19:51:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "rayevinsonsr; quote: Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? What else is the airport used for?? Let's see..among other things... quote: A National Guard Joint Use Aviation Center was constructed for the US Army Reserve and National Guard, this is a 113,000 square foot hangar and houses 24-30 helicopters and fixed wing aircraft. The facility is used for pilot training and helicopter maintenance. This project included a National Guard Reserve Training Center which provides military training for 500-600 reservists on weekends. A Distance Learning Center, which is located in the building, provides excellent training and support services to the military. \"http://flyjohnstownairport.com/about/index.htm\"", 
        "intTime": 20090505, 
        "postID": 19, 
        "quote": "Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day?", 
        "reply": "rayevinsonsr;  What else is the airport used for?? Let's see..among other things... quote: A National Guard Joint Use Aviation Center was constructed for the US Army Reserve and National Guard, this is a 113,000 square foot hangar and houses 24-30 helicopters and fixed wing aircraft. The facility is used for pilot training and helicopter maintenance. This project included a National Guard Reserve Training Center which provides military training for 500-600 reservists on weekends. A Distance Learning Center, which is located in the building, provides excellent training and support services to the military. \"http://flyjohnstownairport.com/about/index.htm\"", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 19:58:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "3678131"
    }, 
    {
        "content": "And thats needed why? Ft. Indiantown Gaps Muir Army Airfield is large enough for Transport aircraft like C-17's XXXhttp://www.airnav.com/airport/KMUI/XXX \"Fig\" also is the Headquarters of the PAARNG & 28th Infantry Division with all manner of training facilities including being the regional RTI(Regional Training Institute) that even regular Army soldiers attend. OCS/PLDC(WTC)/BNCOC/ANCOC/MOSQ which has a Distance Learning Center (As all RTI's have). The base can easily hold an Entire Division. It was that important to build such a Facility within 50 miles for the National Guards Aircraft? I call Bullsh_t on that excuse", 
        "intTime": 20090505, 
        "postID": 20, 
        "quote": "", 
        "reply": "And thats needed why? Ft. Indiantown Gaps Muir Army Airfield is large enough for Transport aircraft like C-17's XXXhttp://www.airnav.com/airport/KMUI/XXX \"Fig\" also is the Headquarters of the PAARNG & 28th Infantry Division with all manner of training facilities including being the regional RTI(Regional Training Institute) that even regular Army soldiers attend. OCS/PLDC(WTC)/BNCOC/ANCOC/MOSQ which has a Distance Learning Center (As all RTI's have). The base can easily hold an Entire Division. It was that important to build such a Facility within 50 miles for the National Guards Aircraft? I call Bullsh_t on that excuse", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 20:22:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "The headquarters of Murtech, in a low-slung, bland building in a Glen Burnie business park, has its blinds drawn tight and few signs of life. On several days of visits, a handful of cars sit in the parking lot, and no trucks arrive at the 10 loading bays at the back of the building. Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services. With its long corridor of sparsely occupied offices and an unmanned reception area, Murtech's most striking feature is its owner -- Robert C. Murtha Jr., 49. He is the nephew of Rep. John P. Murtha, the Pennsylvania Democrat who has significant sway over the Defense Department's spending as chairman of the House Appropriations defense subcommittee. Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. He said Murtech's 17 employees \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats, \"and that's about as far as I feel comfortable going.\" Giving more details could provide important clues to terrorist plotters, he said. Murtha's power has had beneficial effects within his family. His brother, Robert C. \"Kit\" Murtha, built a longtime lobbying practice around clients seeking defense funds through the Appropriations Committee and became one of the top members of KSA, a lobbying firm whose contractor clients often received multimillion-dollar earmarks directed through the committee chairman. Rest here: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050403743.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 21, 
        "quote": "", 
        "reply": "The headquarters of Murtech, in a low-slung, bland building in a Glen Burnie business park, has its blinds drawn tight and few signs of life. On several days of visits, a handful of cars sit in the parking lot, and no trucks arrive at the 10 loading bays at the back of the building. Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services. With its long corridor of sparsely occupied offices and an unmanned reception area, Murtech's most striking feature is its owner -- Robert C. Murtha Jr., 49. He is the nephew of Rep. John P. Murtha, the Pennsylvania Democrat who has significant sway over the Defense Department's spending as chairman of the House Appropriations defense subcommittee. Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. He said Murtech's 17 employees \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats, \"and that's about as far as I feel comfortable going.\" Giving more details could provide important clues to terrorist plotters, he said. Murtha's power has had beneficial effects within his family. His brother, Robert C. \"Kit\" Murtha, built a longtime lobbying practice around clients seeking defense funds through the Appropriations Committee and became one of the top members of KSA, a lobbying firm whose contractor clients often received multimillion-dollar earmarks directed through the committee chairman. Rest here: \"http://www.washingtonpost.com/wp-dyn/content/article/2009/05/04/AR2009050403743.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 08:53:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me.", 
        "intTime": 20090505, 
        "postID": 22, 
        "quote": "Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews.", 
        "reply": " Having read that article it actually looks legit to me.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 08:57:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 23, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me.", 
        "reply": " He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:01:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts. I'm all about hating Defense contractors (and I do, with a passion), but if you read the article where it says what they do (Nuclear detection?!?!?!), I can understand the need for secrecy and no-bid contracts.", 
        "intTime": 20090505, 
        "postID": 24, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. He won them without competition. Unless it was a sole source award, you have to comptete for the contract. I'm sure out of the hundreds of contractors around that his name was the only one that was brought up to have it. And this isn't just 1 or 2 contracts.", 
        "reply": " I'm all about hating Defense contractors (and I do, with a passion), but if you read the article where it says what they do (Nuclear detection?!?!?!), I can understand the need for secrecy and no-bid contracts.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:04:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "intTime": 20090505, 
        "postID": 25, 
        "quote": "", 
        "reply": "These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:05:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about. I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 26, 
        "quote": "Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "reply": " I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:07:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services.", 
        "intTime": 20090505, 
        "postID": 27, 
        "quote": "Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company?", 
        "reply": " Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:10:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services. So a no name company of 17 employees is randomly selected for NUCLEAR DETECTION? I don't think so. They aren't even that popular nor have they done that much work. There is no way the Pentagon was just sitting around and decided hey, those guys look cool let's select them for a no-bid contract not knowing what kind of skills they had. It just isn't a sound business practice to that. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090505, 
        "postID": 28, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: [QUOTE]Originally posted by mrmixitup: I'm not saying it should be out there in the public, but it probably will. I mean we have people from the CIA being ousted and secure information being provided. That is what an open Administration is all about right ....I have a problem with them being able to win these contracts without competition. Who is to say they are the most qualified with only 17 employees versus some other company? Those people from the CIA lied about thier experience and were contractors and also committed violations of their contracts. Do we know these people have done the same yet? If they are providing nuclear detection services(!?!?!?), the point of a no-bid contract is to keep the specifics of their contractual obligations secret. I don't have a problem with that when it comes to something like nuclear detection services.", 
        "reply": " So a no name company of 17 employees is randomly selected for NUCLEAR DETECTION? I don't think so. They aren't even that popular nor have they done that much work. There is no way the Pentagon was just sitting around and decided hey, those guys look cool let's select them for a no-bid contract not knowing what kind of skills they had. It just isn't a sound business practice to that. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:15:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me. I have to agree, even in the article it says: quote: Leo Fratis, the Army contracting officer who handled the matter, said there was \"nothing improper\" about the contract. He said it was awarded on a no-bid basis only because the Army command \"had a lot of things going on at the time.\" Pentagon spokesman Julius Evans said the congressman never contacted the Army command about his nephew's company and has no say in its procurement decisions. \"Congressman Murtha has had no influence over any contract award by our organization,\" Evans said. Comming from the military tells me it's legit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090505, 
        "postID": 29, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: Robert Murtha said he is not at liberty to discuss in detail what his company does, but for four years it has subsisted on defense contracts, according to records and interviews. Having read that article it actually looks legit to me.", 
        "reply": " I have to agree, even in the article it says: quote: Leo Fratis, the Army contracting officer who handled the matter, said there was \"nothing improper\" about the contract. He said it was awarded on a no-bid basis only because the Army command \"had a lot of things going on at the time.\" Pentagon spokesman Julius Evans said the congressman never contacted the Army command about his nephew's company and has no say in its procurement decisions. \"Congressman Murtha has had no influence over any contract award by our organization,\" Evans said. Comming from the military tells me it's legit. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:18:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about. Read again, he says his business is to \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats. So, his company isn't the one doing the actual detecting...he's providing \"logistical support\", i.e., he has a warehouse full of office chairs and computer paper doing 4 mil a year in sales without having to bid. May be irritating to see a little nepotism going on, but the military buys a lot more than that every year under no-bid contracts. On the other hand, it's not like he's in some top-secret national security role. He has a warehouse full of overpriced supplies.", 
        "intTime": 20090505, 
        "postID": 30, 
        "quote": "Originally posted by mrmixitup: These guys aren't exactly providing food for the Pentagon or housing for politicians or gas guzzling SUVs for low-level staffers. Their services sound like something pretty important and worth keeping quiet about.", 
        "reply": " Read again, he says his business is to \"provide necessary logistical support\" to Pentagon testing programs that focus on detecting chemical, biological, radiological and nuclear threats. So, his company isn't the one doing the actual detecting...he's providing \"logistical support\", i.e., he has a warehouse full of office chairs and computer paper doing 4 mil a year in sales without having to bid. May be irritating to see a little nepotism going on, but the military buys a lot more than that every year under no-bid contracts. On the other hand, it's not like he's in some top-secret national security role. He has a warehouse full of overpriced supplies.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 09:55:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "jwr6"
    }, 
    {
        "content": "“If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview", 
        "intTime": 20090505, 
        "postID": 31, 
        "quote": "", 
        "reply": "“If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 11:00:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: “If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview Already past the future", 
        "intTime": 20090505, 
        "postID": 32, 
        "quote": "Originally posted by rayevinsonsr: “If I’m corrupt, it’s because I take care of my district.” - Rep. John Murtha, 3-29-09 Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? Someone is out to get Murtha, it's not conservatives. \"http://www.cnn.com/2009/POLITICS/04/23/murtha.airport/?iref=mpstoryview", 
        "reply": " Already past the future", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 11:36:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "6486143"
    }, 
    {
        "content": "Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "intTime": 20090505, 
        "postID": 33, 
        "quote": "", 
        "reply": "Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 12:03:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that. the only thing I can say is, it's old news, besides incorrect.", 
        "intTime": 20090505, 
        "postID": 34, 
        "quote": "Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "reply": " the only thing I can say is, it's old news, besides incorrect.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 12:10:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that. No he didnt, but it does show your ignorance on the details. First of all. Cheney stopped working for Halliburton in 1999. Cheney (and his Wife) signed a legal document turning over all deferred compensation before taxes to 3 charities in Jan. 2001. XXXhttp://www.giveitupcheney.org/CheneyGiftAgreement.pdfXXX George Washington University Medical Faculty associates - 40% University of Wyoming- 40% Capital partners for Education- 20% XXXhttp://www.factcheck.org/kerry_ad_falsely_accuses_cheney_on_halliburton.htmlXXX Here's some further sources: \"Vice President Dick Cheney discusses the war with Iraq, the economy and other topics,\" NBC News \"Meet the Press\" 14 Sep 2003. Jack Maskell, \"Official's Stock Options In and Deferred Compensation From a Corporation as a \"Financial Interest\" of an Executive Branch Official in Such a Corporation,\" Memorandum , American Law Division, Congressional Research Service, 22 Sep 2003. US Code of Federal Regulations,TITLE 5, CHAPTER XVI--OFFICE OF GOVERNMENT ETHICS, PART 2640--INTERPRETATION, EXEMPTIONS AND WAIVER GUIDANCE CONCERNING 18 U.S.C. 208 (ACTS AFFECTING A PERSONAL FINANCIAL INTEREST) 5CFR2640.103(b) Timothy J. Burger and Adam Zagorin, \"The Paper Trail: Did Cheney Okay a Deal?\", Time magazine, 7 June 2004: 42. Larry Margasak, \"Cheney never heard plan to give work to Halliburton for rebuilding of Iraq,\" The Associated Press 16 June 2004. But hey, never let it be said facts get in the way of a rant, eh?", 
        "intTime": 20090505, 
        "postID": 35, 
        "quote": "Originally posted by Flygirl62: Replace the title with Cheney/KBR get millions in defense contracts without competition. See how many people howl like a mashed cat about how it was all legit. The VP didn't do anything wrong....like keep his stocks...or misuse his position. Nope. None of that.", 
        "reply": " No he didnt, but it does show your ignorance on the details. First of all. Cheney stopped working for Halliburton in 1999. Cheney (and his Wife) signed a legal document turning over all deferred compensation before taxes to 3 charities in Jan. 2001. XXXhttp://www.giveitupcheney.org/CheneyGiftAgreement.pdfXXX George Washington University Medical Faculty associates - 40% University of Wyoming- 40% Capital partners for Education- 20% XXXhttp://www.factcheck.org/kerry_ad_falsely_accuses_cheney_on_halliburton.htmlXXX Here's some further sources: \"Vice President Dick Cheney discusses the war with Iraq, the economy and other topics,\" NBC News \"Meet the Press\" 14 Sep 2003. Jack Maskell, \"Official's Stock Options In and Deferred Compensation From a Corporation as a \"Financial Interest\" of an Executive Branch Official in Such a Corporation,\" Memorandum , American Law Division, Congressional Research Service, 22 Sep 2003. US Code of Federal Regulations,TITLE 5, CHAPTER XVI--OFFICE OF GOVERNMENT ETHICS, PART 2640--INTERPRETATION, EXEMPTIONS AND WAIVER GUIDANCE CONCERNING 18 U.S.C. 208 (ACTS AFFECTING A PERSONAL FINANCIAL INTEREST) 5CFR2640.103(b) Timothy J. Burger and Adam Zagorin, \"The Paper Trail: Did Cheney Okay a Deal?\", Time magazine, 7 June 2004: 42. Larry Margasak, \"Cheney never heard plan to give work to Halliburton for rebuilding of Iraq,\" The Associated Press 16 June 2004. But hey, never let it be said facts get in the way of a rant, eh?", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 15:06:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090505, 
        "postID": 36, 
        "quote": "", 
        "reply": "Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 15:21:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. I think you missed part of the article. First sentence of the second paragraph Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services.", 
        "intTime": 20090505, 
        "postID": 37, 
        "quote": "Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him.", 
        "reply": " I think you missed part of the article. First sentence of the second paragraph Yet last year, Murtech received $4 million in Pentagon work, all of it without competition, for a variety of warehousing and engineering services.", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 18:50:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "fredette"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him. Are you truly that obtuse? 1- It's Murthas NEPHEW being investigated. So unless your saying ABSCAM Jack is doing the Hillbilly Lambada with his sister, he cant be his Nephews daddy..... 2- Your reading comprehension leaves much to be desired, He got the contract as a No-Bid- twas in the first paragraph. Isnt that one of the things y'all been whining about for Pentagon Contracts for 8 years?", 
        "intTime": 20090505, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: Excellent - I hope his son made alot of money. If his company was qualified and followed the bidding rules, more power to him.", 
        "reply": " Are you truly that obtuse? 1- It's Murthas NEPHEW being investigated. So unless your saying ABSCAM Jack is doing the Hillbilly Lambada with his sister, he cant be his Nephews daddy..... 2- Your reading comprehension leaves much to be desired, He got the contract as a No-Bid- twas in the first paragraph. Isnt that one of the things y'all been whining about for Pentagon Contracts for 8 years?", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 19:51:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "rayevinsonsr; quote: Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day? What else is the airport used for?? Let's see..among other things... quote: A National Guard Joint Use Aviation Center was constructed for the US Army Reserve and National Guard, this is a 113,000 square foot hangar and houses 24-30 helicopters and fixed wing aircraft. The facility is used for pilot training and helicopter maintenance. This project included a National Guard Reserve Training Center which provides military training for 500-600 reservists on weekends. A Distance Learning Center, which is located in the building, provides excellent training and support services to the military. \"http://flyjohnstownairport.com/about/index.htm\"", 
        "intTime": 20090505, 
        "postID": 39, 
        "quote": "Not hidden, Murtha overtly begs, pleads, demands, threatens, for his district. I think Old John is getting a piece of the action for himself but convinces the voters that's how politic's are played. His name is on the six billion dollar airport, no one uses. Upgrades through the bailout funding see good money following bad. The eight million dollar radar site goes unmanned for the lack of traffic. Six planes a day?", 
        "reply": "rayevinsonsr;  What else is the airport used for?? Let's see..among other things... quote: A National Guard Joint Use Aviation Center was constructed for the US Army Reserve and National Guard, this is a 113,000 square foot hangar and houses 24-30 helicopters and fixed wing aircraft. The facility is used for pilot training and helicopter maintenance. This project included a National Guard Reserve Training Center which provides military training for 500-600 reservists on weekends. A Distance Learning Center, which is located in the building, provides excellent training and support services to the military. \"http://flyjohnstownairport.com/about/index.htm\"", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 19:58:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "3678131"
    }, 
    {
        "content": "And thats needed why? Ft. Indiantown Gaps Muir Army Airfield is large enough for Transport aircraft like C-17's XXXhttp://www.airnav.com/airport/KMUI/XXX \"Fig\" also is the Headquarters of the PAARNG & 28th Infantry Division with all manner of training facilities including being the regional RTI(Regional Training Institute) that even regular Army soldiers attend. OCS/PLDC(WTC)/BNCOC/ANCOC/MOSQ which has a Distance Learning Center (As all RTI's have). The base can easily hold an Entire Division. It was that important to build such a Facility within 50 miles for the National Guards Aircraft? I call Bullsh_t on that excuse", 
        "intTime": 20090505, 
        "postID": 40, 
        "quote": "", 
        "reply": "And thats needed why? Ft. Indiantown Gaps Muir Army Airfield is large enough for Transport aircraft like C-17's XXXhttp://www.airnav.com/airport/KMUI/XXX \"Fig\" also is the Headquarters of the PAARNG & 28th Infantry Division with all manner of training facilities including being the regional RTI(Regional Training Institute) that even regular Army soldiers attend. OCS/PLDC(WTC)/BNCOC/ANCOC/MOSQ which has a Distance Learning Center (As all RTI's have). The base can easily hold an Entire Division. It was that important to build such a Facility within 50 miles for the National Guards Aircraft? I call Bullsh_t on that excuse", 
        "threadID": "672198221_5590035222001", 
        "time": "2009-05-05 20:22:00", 
        "title": "Murtha's Nephew Got Millions in Defense Contracts w/out Competition", 
        "userID": "LineDoggie"
    }
]