[
    {
        "content": "quote: An Iraqi journalist who hurled his shoes at George Bush was sentenced to three years in prison today for assaulting a foreign leader. Muntazer al-Zaidi, 30, said: “Long live Iraq” as the guilty verdict was read out in a Baghdad courtroom before being led away. The punishment prompted an angry reaction from family and friends who described it as harsh and politically motivated. Al-Zaidi’s defence team plans to launch an appeal. The journalist captured headlines across the world when he flung his shoes at the then-US President during a press conference in Baghdad last December. This is a goodbye kiss from the Iraqi people, dog! This is from the widows, the orphans and those who were killed in Iraq,” the reporter, from Al-Baghdadiya television, shouted before being bundled to the ground. Al-Zaidi, who has been held in detention since December 14, denies any wrong-doing. Wearing a light-brown suit, brown sweatshirt and thin-framed glasses, he stood confidently inside a wooden pen at the Iraq Central Criminal Court after being brought in under a heavy police escort. Asked by Presiding Judge Abdul-Amir al-Rubaie whether he was innocent or guilty, the defendant said: “I am innocent. What I did was a natural response to the occupation.” Some 200 people, including family members, lawyers and journalists, packed the courtroom to listen to the second day of the trial, which had been adjourned since February 19 for the three judges to weigh a defence argument that the charge was inapplicable because Mr Bush had not been in Baghdad as an official guest. Judge Al-Rubaie, however, read a response from the Prime Minister's office today insisting that the trip had been official despite being unannounced. Most people were sent out of the courtroom while the verdict and sentence were delivered. The three-year prison term is lower than the 5-to-15 years carried by the assault charge because the judge took into consideration al-Zaidi’s young age and the fact that it was a first offence. This did little to pacify his family. Upon hearing the outcome, one sister, Ruqaiya, burst into tears. \"Down with (Iraqi Prime Minister) Maliki, agent of the Americans,\" she said outside the courtroom. Several other family members shouted anti-American slogans and tried to surge back inside. They were pushed away by police. Dhiaa al-Saadi, the chief defence lawyer, said that his team would appeal. “This sentence is harsh and is not in harmony with the law, and eventually the defence team will contest this in the appeals court,\" he said. (...) +http://www.timesonline.co.uk/tol/news/world/iraq/article5893747.ece", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "An Iraqi journalist who hurled his shoes at George Bush was sentenced to three years in prison today for assaulting a foreign leader. Muntazer al-Zaidi, 30, said: “Long live Iraq” as the guilty verdict was read out in a Baghdad courtroom before being led away. The punishment prompted an angry reaction from family and friends who described it as harsh and politically motivated. Al-Zaidi’s defence team plans to launch an appeal. The journalist captured headlines across the world when he flung his shoes at the then-US President during a press conference in Baghdad last December. This is a goodbye kiss from the Iraqi people, dog! This is from the widows, the orphans and those who were killed in Iraq,” the reporter, from Al-Baghdadiya television, shouted before being bundled to the ground. Al-Zaidi, who has been held in detention since December 14, denies any wrong-doing. Wearing a light-brown suit, brown sweatshirt and thin-framed glasses, he stood confidently inside a wooden pen at the Iraq Central Criminal Court after being brought in under a heavy police escort. Asked by Presiding Judge Abdul-Amir al-Rubaie whether he was innocent or guilty, the defendant said: “I am innocent. What I did was a natural response to the occupation.” Some 200 people, including family members, lawyers and journalists, packed the courtroom to listen to the second day of the trial, which had been adjourned since February 19 for the three judges to weigh a defence argument that the charge was inapplicable because Mr Bush had not been in Baghdad as an official guest. Judge Al-Rubaie, however, read a response from the Prime Minister's office today insisting that the trip had been official despite being unannounced. Most people were sent out of the courtroom while the verdict and sentence were delivered. The three-year prison term is lower than the 5-to-15 years carried by the assault charge because the judge took into consideration al-Zaidi’s young age and the fact that it was a first offence. This did little to pacify his family. Upon hearing the outcome, one sister, Ruqaiya, burst into tears. \"Down with (Iraqi Prime Minister) Maliki, agent of the Americans,\" she said outside the courtroom. Several other family members shouted anti-American slogans and tried to surge back inside. They were pushed away by police. Dhiaa al-Saadi, the chief defence lawyer, said that his team would appeal. “This sentence is harsh and is not in harmony with the law, and eventually the defence team will contest this in the appeals court,\" he said. (...)", 
        "reply": " +http://www.timesonline.co.uk/tol/news/world/iraq/article5893747.ece", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 07:41:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam.", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 08:31:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "sw614"
    }, 
    {
        "content": "Should've sent him to Club-Gitmo. \"The World's Finest\"", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "", 
        "reply": "Should've sent him to Club-Gitmo. \"The World's Finest\"", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 08:42:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Should've sent him to Club-Gitmo. Why BHO would just let him go. Hey that could be a slogan. BO let GITMO GO \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "Originally posted by Kegler300: Should've sent him to Club-Gitmo.", 
        "reply": " Why BHO would just let him go. Hey that could be a slogan. BO let GITMO GO \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 08:45:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam. Yup, with Saddam he would have been hung weeks ago.", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam.", 
        "reply": " Yup, with Saddam he would have been hung weeks ago.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 11:38:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Grimbo"
    }, 
    {
        "content": "quote: Originally posted by Grimbo: quote: Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam. Yup, with Saddam he would have been hung weeks ago. Just like he was!", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "Originally posted by Grimbo: quote: Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam. Yup, with Saddam he would have been hung weeks ago.", 
        "reply": " Just like he was!", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 11:44:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "I'm glad he got three years. He should have gotten 5 years.", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "", 
        "reply": "I'm glad he got three years. He should have gotten 5 years.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 12:01:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Duster6"
    }, 
    {
        "content": "No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "", 
        "reply": "No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 12:23:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Yep, he had a trial for assaulting a foreign dignitary and was sentenced. Whats wrong? Co'z it was GB2 he should have walked? It's an extreme sentence? hey its the middle east, maybe they should have chopped off his throwing hand. If it was Obama I would feel the same way. Besides he is an Iraqi and got Iraqi justice, no problem.", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "reply": " Yep, he had a trial for assaulting a foreign dignitary and was sentenced. Whats wrong? Co'z it was GB2 he should have walked? It's an extreme sentence? hey its the middle east, maybe they should have chopped off his throwing hand. If it was Obama I would feel the same way. Besides he is an Iraqi and got Iraqi justice, no problem.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 12:38:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules.", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "", 
        "reply": "I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 14:39:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "good and i agree he should of gotten a one way ticket to gitmo....", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "", 
        "reply": "good and i agree he should of gotten a one way ticket to gitmo....", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 14:59:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "", 
        "reply": "If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 18:33:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "vladiatornz"
    }, 
    {
        "content": "quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American....", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "reply": " hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American....", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 18:56:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American.... I meant if he did it in the USA. 3 years does not fit the crime.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American....", 
        "reply": " I meant if he did it in the USA. 3 years does not fit the crime.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 19:09:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "vladiatornz"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules. Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received.", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules.", 
        "reply": " Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 04:49:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules. Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received. Looking at it like that, I guess three would fit their culture. But I guess I am just used to our laws and ways of not seeing this as insulting as they do. I also have to admit that I am both surprised and pleased with the Iraqi courts in having fair trials and not putting him to death or chopping off hands and such.", 
        "intTime": 20090313, 
        "postID": 16, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules. Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received.", 
        "reply": " Looking at it like that, I guess three would fit their culture. But I guess I am just used to our laws and ways of not seeing this as insulting as they do. I also have to admit that I am both surprised and pleased with the Iraqi courts in having fair trials and not putting him to death or chopping off hands and such.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 06:14:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? Apples & Oranges. Compare US law & punishment to other countries & you see extremes. In Saudi Arabia a thief can get his hand cut off, here a thief (if first timer) may only get probation(depending on circumstances).", 
        "intTime": 20090313, 
        "postID": 17, 
        "quote": "Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "reply": " Apples & Oranges. Compare US law & punishment to other countries & you see extremes. In Saudi Arabia a thief can get his hand cut off, here a thief (if first timer) may only get probation(depending on circumstances).", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 07:44:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)!", 
        "intTime": 20090313, 
        "postID": 18, 
        "quote": "Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "reply": " Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)!", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 08:12:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)! But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened.", 
        "intTime": 20090313, 
        "postID": 19, 
        "quote": "Originally posted by Knele: quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)!", 
        "reply": " But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 08:41:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by Knele: Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)! But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened. I know, I was just being facetious.", 
        "intTime": 20090313, 
        "postID": 20, 
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by Knele: Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)! But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened.", 
        "reply": " I know, I was just being facetious.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 08:45:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: An Iraqi journalist who hurled his shoes at George Bush was sentenced to three years in prison today for assaulting a foreign leader. Muntazer al-Zaidi, 30, said: “Long live Iraq” as the guilty verdict was read out in a Baghdad courtroom before being led away. The punishment prompted an angry reaction from family and friends who described it as harsh and politically motivated. Al-Zaidi’s defence team plans to launch an appeal. The journalist captured headlines across the world when he flung his shoes at the then-US President during a press conference in Baghdad last December. This is a goodbye kiss from the Iraqi people, dog! This is from the widows, the orphans and those who were killed in Iraq,” the reporter, from Al-Baghdadiya television, shouted before being bundled to the ground. Al-Zaidi, who has been held in detention since December 14, denies any wrong-doing. Wearing a light-brown suit, brown sweatshirt and thin-framed glasses, he stood confidently inside a wooden pen at the Iraq Central Criminal Court after being brought in under a heavy police escort. Asked by Presiding Judge Abdul-Amir al-Rubaie whether he was innocent or guilty, the defendant said: “I am innocent. What I did was a natural response to the occupation.” Some 200 people, including family members, lawyers and journalists, packed the courtroom to listen to the second day of the trial, which had been adjourned since February 19 for the three judges to weigh a defence argument that the charge was inapplicable because Mr Bush had not been in Baghdad as an official guest. Judge Al-Rubaie, however, read a response from the Prime Minister's office today insisting that the trip had been official despite being unannounced. Most people were sent out of the courtroom while the verdict and sentence were delivered. The three-year prison term is lower than the 5-to-15 years carried by the assault charge because the judge took into consideration al-Zaidi’s young age and the fact that it was a first offence. This did little to pacify his family. Upon hearing the outcome, one sister, Ruqaiya, burst into tears. \"Down with (Iraqi Prime Minister) Maliki, agent of the Americans,\" she said outside the courtroom. Several other family members shouted anti-American slogans and tried to surge back inside. They were pushed away by police. Dhiaa al-Saadi, the chief defence lawyer, said that his team would appeal. “This sentence is harsh and is not in harmony with the law, and eventually the defence team will contest this in the appeals court,\" he said. (...) +http://www.timesonline.co.uk/tol/news/world/iraq/article5893747.ece", 
        "intTime": 20090312, 
        "postID": 21, 
        "quote": "An Iraqi journalist who hurled his shoes at George Bush was sentenced to three years in prison today for assaulting a foreign leader. Muntazer al-Zaidi, 30, said: “Long live Iraq” as the guilty verdict was read out in a Baghdad courtroom before being led away. The punishment prompted an angry reaction from family and friends who described it as harsh and politically motivated. Al-Zaidi’s defence team plans to launch an appeal. The journalist captured headlines across the world when he flung his shoes at the then-US President during a press conference in Baghdad last December. This is a goodbye kiss from the Iraqi people, dog! This is from the widows, the orphans and those who were killed in Iraq,” the reporter, from Al-Baghdadiya television, shouted before being bundled to the ground. Al-Zaidi, who has been held in detention since December 14, denies any wrong-doing. Wearing a light-brown suit, brown sweatshirt and thin-framed glasses, he stood confidently inside a wooden pen at the Iraq Central Criminal Court after being brought in under a heavy police escort. Asked by Presiding Judge Abdul-Amir al-Rubaie whether he was innocent or guilty, the defendant said: “I am innocent. What I did was a natural response to the occupation.” Some 200 people, including family members, lawyers and journalists, packed the courtroom to listen to the second day of the trial, which had been adjourned since February 19 for the three judges to weigh a defence argument that the charge was inapplicable because Mr Bush had not been in Baghdad as an official guest. Judge Al-Rubaie, however, read a response from the Prime Minister's office today insisting that the trip had been official despite being unannounced. Most people were sent out of the courtroom while the verdict and sentence were delivered. The three-year prison term is lower than the 5-to-15 years carried by the assault charge because the judge took into consideration al-Zaidi’s young age and the fact that it was a first offence. This did little to pacify his family. Upon hearing the outcome, one sister, Ruqaiya, burst into tears. \"Down with (Iraqi Prime Minister) Maliki, agent of the Americans,\" she said outside the courtroom. Several other family members shouted anti-American slogans and tried to surge back inside. They were pushed away by police. Dhiaa al-Saadi, the chief defence lawyer, said that his team would appeal. “This sentence is harsh and is not in harmony with the law, and eventually the defence team will contest this in the appeals court,\" he said. (...)", 
        "reply": " +http://www.timesonline.co.uk/tol/news/world/iraq/article5893747.ece", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 07:41:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam.", 
        "intTime": 20090312, 
        "postID": 22, 
        "quote": "", 
        "reply": "Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 08:31:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "sw614"
    }, 
    {
        "content": "Should've sent him to Club-Gitmo. \"The World's Finest\"", 
        "intTime": 20090312, 
        "postID": 23, 
        "quote": "", 
        "reply": "Should've sent him to Club-Gitmo. \"The World's Finest\"", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 08:42:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Should've sent him to Club-Gitmo. Why BHO would just let him go. Hey that could be a slogan. BO let GITMO GO \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 24, 
        "quote": "Originally posted by Kegler300: Should've sent him to Club-Gitmo.", 
        "reply": " Why BHO would just let him go. Hey that could be a slogan. BO let GITMO GO \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 08:45:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam. Yup, with Saddam he would have been hung weeks ago.", 
        "intTime": 20090312, 
        "postID": 25, 
        "quote": "Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam.", 
        "reply": " Yup, with Saddam he would have been hung weeks ago.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 11:38:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Grimbo"
    }, 
    {
        "content": "quote: Originally posted by Grimbo: quote: Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam. Yup, with Saddam he would have been hung weeks ago. Just like he was!", 
        "intTime": 20090312, 
        "postID": 26, 
        "quote": "Originally posted by Grimbo: quote: Originally posted by sw614: Well, regardless of motive, you can not assault people. The silver lining I see in all this is how some Iraqis are able to voice their opinion publically and have a free press and have an appeals process. That was not possible under Saddam. Yup, with Saddam he would have been hung weeks ago.", 
        "reply": " Just like he was!", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 11:44:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "I'm glad he got three years. He should have gotten 5 years.", 
        "intTime": 20090312, 
        "postID": 27, 
        "quote": "", 
        "reply": "I'm glad he got three years. He should have gotten 5 years.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 12:01:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Duster6"
    }, 
    {
        "content": "No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "intTime": 20090312, 
        "postID": 28, 
        "quote": "", 
        "reply": "No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 12:23:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Yep, he had a trial for assaulting a foreign dignitary and was sentenced. Whats wrong? Co'z it was GB2 he should have walked? It's an extreme sentence? hey its the middle east, maybe they should have chopped off his throwing hand. If it was Obama I would feel the same way. Besides he is an Iraqi and got Iraqi justice, no problem.", 
        "intTime": 20090312, 
        "postID": 29, 
        "quote": "Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "reply": " Yep, he had a trial for assaulting a foreign dignitary and was sentenced. Whats wrong? Co'z it was GB2 he should have walked? It's an extreme sentence? hey its the middle east, maybe they should have chopped off his throwing hand. If it was Obama I would feel the same way. Besides he is an Iraqi and got Iraqi justice, no problem.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 12:38:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules.", 
        "intTime": 20090312, 
        "postID": 30, 
        "quote": "", 
        "reply": "I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 14:39:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "good and i agree he should of gotten a one way ticket to gitmo....", 
        "intTime": 20090312, 
        "postID": 31, 
        "quote": "", 
        "reply": "good and i agree he should of gotten a one way ticket to gitmo....", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 14:59:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "intTime": 20090312, 
        "postID": 32, 
        "quote": "", 
        "reply": "If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 18:33:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "vladiatornz"
    }, 
    {
        "content": "quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American....", 
        "intTime": 20090312, 
        "postID": 33, 
        "quote": "Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "reply": " hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American....", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 18:56:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American.... I meant if he did it in the USA. 3 years does not fit the crime.", 
        "intTime": 20090312, 
        "postID": 34, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? hell they would of been killed... as it stands now there are several of duel American\\iran citizens being held hostage in iran for well being half American....", 
        "reply": " I meant if he did it in the USA. 3 years does not fit the crime.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-12 19:09:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "vladiatornz"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules. Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received.", 
        "intTime": 20090313, 
        "postID": 35, 
        "quote": "Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules.", 
        "reply": " Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 04:49:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules. Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received. Looking at it like that, I guess three would fit their culture. But I guess I am just used to our laws and ways of not seeing this as insulting as they do. I also have to admit that I am both surprised and pleased with the Iraqi courts in having fair trials and not putting him to death or chopping off hands and such.", 
        "intTime": 20090313, 
        "postID": 36, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by fishnfanatic: I gotta agree, 3 years is a little too harsh. The punishment certainly does not fit the crime. But, Iraq is their own country, they make their own rules. Why doesn't it fit the crime? The use of a shoe as an insult is meaningless in the USA, but in Iraq it is deeply offensive. The man exposed a visiting head of state to such an insult and is therefore subject to the laws and customs governing such behavior. As other posters have suggested, it is well for him that he did so in a relatively benign American influenced legal admosphere. The irony is that he should probably be grateful to President Bush for the lenient sentence he received.", 
        "reply": " Looking at it like that, I guess three would fit their culture. But I guess I am just used to our laws and ways of not seeing this as insulting as they do. I also have to admit that I am both surprised and pleased with the Iraqi courts in having fair trials and not putting him to death or chopping off hands and such.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 06:14:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that? Apples & Oranges. Compare US law & punishment to other countries & you see extremes. In Saudi Arabia a thief can get his hand cut off, here a thief (if first timer) may only get probation(depending on circumstances).", 
        "intTime": 20090313, 
        "postID": 37, 
        "quote": "Originally posted by vladiatornz: If an American who threw a shoe at, say, Sarkozy or Iranian President, got 3 years in jail in the USA, you would have no issues with that?", 
        "reply": " Apples & Oranges. Compare US law & punishment to other countries & you see extremes. In Saudi Arabia a thief can get his hand cut off, here a thief (if first timer) may only get probation(depending on circumstances).", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 07:44:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)!", 
        "intTime": 20090313, 
        "postID": 38, 
        "quote": "Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women.", 
        "reply": " Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)!", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 08:12:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)! But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened.", 
        "intTime": 20090313, 
        "postID": 39, 
        "quote": "Originally posted by Knele: quote: Originally posted by peter3_1: No, Saddam's \"secret\" police qwould have taken the guy out back and put a 9mm thru his brain pan. Then destroyed his family, his children (Saddam's)would hAVE RAPED AND MURDERED the women. Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)!", 
        "reply": " But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 08:41:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by Knele: Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)! But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened. I know, I was just being facetious.", 
        "intTime": 20090313, 
        "postID": 40, 
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by Knele: Actually, if he threw a shoot at Bush during Saddam, he would have probably been given a VP spot (palace included)! But you seem to be overlooking the fact that Bush was an invited guest. What if it had been one of Saddam's invited guests? After learning just what he and his sons did, he might just have the ol wood chipper fired up shortly after it happened.", 
        "reply": " I know, I was just being facetious.", 
        "threadID": "672198221_7030046712001", 
        "time": "2009-03-13 08:45:00", 
        "title": "Iraqi who threw shoes at President Bush jailed for three years", 
        "userID": "Knele"
    }
]