[
    {
        "content": "The parents of slain U.S. Army Ranger and American football star Pat Tillman said Tuesday they have misgivings that the general who played a role in mischaracterizing their son's death could be put in charge of military operations in Afghanistan. In a brief interview with The Associated Press, Pat Tillman Sr. accused Lt. Gen. Stanley McChrystal of covering up the circumstances of the 2004 death. \"I do believe that guy participated in a falsified homicide investigation,\" Tillman Sr. said. Separately, Mary Tillman called it \"imperative\" that McChrystal's record be carefully considered before he is confirmed. Pentagon spokesman Geoff Morrell said Defense Secretary Robert Gates has complete confidence in McChrystal, whom he hopes can be confirmed by the Senate before month's end. \"We feel terrible for what the Tillman family went through, but this matter has been investigated thoroughly by the Pentagon, by the Congress, by outside experts, and all of them have come to the same conclusion: that there was no wrongdoing by Gen. McChrystal,\" Morrell said. Aides to the top Democrat and Republican on the Senate Armed Services Committee, which will consider the nomination, said they were unaware of any opposition to McChrystal. McChrystal, a former \"black ops\" special forces chief credited with capturing one of the most-wanted fugitives in Iraq, was tapped Monday to lead U.S. and NATO forces in Afghanistan. If confirmed by the Senate, he would replace Gen. David McKiernan, who was fired in an unusual wartime shake-up. Rest here: \"http://www.military.com/news/article/tillmans-want-mcchrystal-record-probed.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "", 
        "reply": "The parents of slain U.S. Army Ranger and American football star Pat Tillman said Tuesday they have misgivings that the general who played a role in mischaracterizing their son's death could be put in charge of military operations in Afghanistan. In a brief interview with The Associated Press, Pat Tillman Sr. accused Lt. Gen. Stanley McChrystal of covering up the circumstances of the 2004 death. \"I do believe that guy participated in a falsified homicide investigation,\" Tillman Sr. said. Separately, Mary Tillman called it \"imperative\" that McChrystal's record be carefully considered before he is confirmed. Pentagon spokesman Geoff Morrell said Defense Secretary Robert Gates has complete confidence in McChrystal, whom he hopes can be confirmed by the Senate before month's end. \"We feel terrible for what the Tillman family went through, but this matter has been investigated thoroughly by the Pentagon, by the Congress, by outside experts, and all of them have come to the same conclusion: that there was no wrongdoing by Gen. McChrystal,\" Morrell said. Aides to the top Democrat and Republican on the Senate Armed Services Committee, which will consider the nomination, said they were unaware of any opposition to McChrystal. McChrystal, a former \"black ops\" special forces chief credited with capturing one of the most-wanted fugitives in Iraq, was tapped Monday to lead U.S. and NATO forces in Afghanistan. If confirmed by the Senate, he would replace Gen. David McKiernan, who was fired in an unusual wartime shake-up. Rest here: \"http://www.military.com/news/article/tillmans-want-mcchrystal-record-probed.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-13 09:14:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "Anbar7"
    }, 
    {
        "content": "As bad as it was for the Tillman family to go through what they did - the loss of a child/brother is beyond description - ultimately it comes down to the fact that one man (Tillman) does not and should not determine the course of fighting a war. Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. If the man is the best we have to do the job, then let him do it. Patton wasn't perfect - remember the slapping-a-battle-fatigued-soldier incident that cost him a star? - but he was the best at what he did, and so was allowed to continue to do it. Have we learned nothing in sixty years?", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "As bad as it was for the Tillman family to go through what they did - the loss of a child/brother is beyond description - ultimately it comes down to the fact that one man (Tillman) does not and should not determine the course of fighting a war. Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. If the man is the best we have to do the job, then let him do it. Patton wasn't perfect - remember the slapping-a-battle-fatigued-soldier incident that cost him a star? - but he was the best at what he did, and so was allowed to continue to do it. Have we learned nothing in sixty years?", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-13 12:05:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "The family needs to let it go, they are obsessed with punishing anybody and everybody for what was an ACCIDENT. I PERSONALLY know guys who were in his convey on that very day, it was an accident pure and simple. Just because military officials did everything they could make the family of a very high profile soldier feel comfortable, even if that included some ill advised twisting of the truth, it was still an accident. I really do not understand them at this point...", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "The family needs to let it go, they are obsessed with punishing anybody and everybody for what was an ACCIDENT. I PERSONALLY know guys who were in his convey on that very day, it was an accident pure and simple. Just because military officials did everything they could make the family of a very high profile soldier feel comfortable, even if that included some ill advised twisting of the truth, it was still an accident. I really do not understand them at this point...", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-13 12:38:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. And just what was that 'evidence of which there is 'enough'? There was no investigation of Tillman's death. Obviously it wasn't and isn't 'enough' for the Tillmans who are still being told to 'just let it go'. The very timeline of the incident itself, the mistated circumstances and 'bogus' award of a decoration for being killed are 'enough' to warrant an investigation. For General McChrystal's benefit, that should have been a prerequiste to advancement. He takes office with an albatross around his neck.", 
        "intTime": 20090513, 
        "postID": 4, 
        "quote": "Originally posted by Cider33_Alpha: Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide.", 
        "reply": " And just what was that 'evidence of which there is 'enough'? There was no investigation of Tillman's death. Obviously it wasn't and isn't 'enough' for the Tillmans who are still being told to 'just let it go'. The very timeline of the incident itself, the mistated circumstances and 'bogus' award of a decoration for being killed are 'enough' to warrant an investigation. For General McChrystal's benefit, that should have been a prerequiste to advancement. He takes office with an albatross around his neck.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-13 19:20:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by Cider33_Alpha: Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. And just what was that 'evidence of which there is 'enough'? There was no investigation of Tillman's death. Obviously it wasn't and isn't 'enough' for the Tillmans who are still being told to 'just let it go'. The very timeline of the incident itself, the mistated circumstances and 'bogus' award of a decoration for being killed are 'enough' to warrant an investigation. For General McChrystal's benefit, that should have been a prerequiste to advancement. He takes office with an albatross around his neck. quote: \"We feel terrible for what the Tillman family went through, but this matter has been investigated thoroughly by the Pentagon, by the Congress, by outside experts, and all of them have come to the same conclusion: that there was no wrongdoing by Gen. McChrystal,\" Morrell said. That doesn't sound like \"no investigation of Tillman's death\" to me, bro. One of us (and it very well could be me) is missing something here, as Morrell is claiming no less than three independent investigations of McChrystal's findings of the death of Tillman. While not exactly the truth, General McChrystal was found to have committed no wrong-doing, leading one to infer that the final analysis, an accidental death by fratricide, is the correct conclusion. But Cider33 is correct, in any case: regardless of past transgressions against this one family, if McChrystal is the best man for the job, than he should be appointed despite their personal animosity. This truly is bigger than any one man or any one family. I never would and never will condone the lack of immediate truth the Tillmans have suffered. But the matter is closed, and their attempt to politicize this is a bit of a slap in the face of the one true victim, Pat Tillman. One does not honor the fallen by using them as platforms for political statements. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "Originally posted by popsiq: quote: Originally posted by Cider33_Alpha: Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. And just what was that 'evidence of which there is 'enough'? There was no investigation of Tillman's death. Obviously it wasn't and isn't 'enough' for the Tillmans who are still being told to 'just let it go'. The very timeline of the incident itself, the mistated circumstances and 'bogus' award of a decoration for being killed are 'enough' to warrant an investigation. For General McChrystal's benefit, that should have been a prerequiste to advancement. He takes office with an albatross around his neck.", 
        "reply": " quote: \"We feel terrible for what the Tillman family went through, but this matter has been investigated thoroughly by the Pentagon, by the Congress, by outside experts, and all of them have come to the same conclusion: that there was no wrongdoing by Gen. McChrystal,\" Morrell said. That doesn't sound like \"no investigation of Tillman's death\" to me, bro. One of us (and it very well could be me) is missing something here, as Morrell is claiming no less than three independent investigations of McChrystal's findings of the death of Tillman. While not exactly the truth, General McChrystal was found to have committed no wrong-doing, leading one to infer that the final analysis, an accidental death by fratricide, is the correct conclusion. But Cider33 is correct, in any case: regardless of past transgressions against this one family, if McChrystal is the best man for the job, than he should be appointed despite their personal animosity. This truly is bigger than any one man or any one family. I never would and never will condone the lack of immediate truth the Tillmans have suffered. But the matter is closed, and their attempt to politicize this is a bit of a slap in the face of the one true victim, Pat Tillman. One does not honor the fallen by using them as platforms for political statements. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-14 01:40:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: That doesn't sound like \"no investigation of Tillman's death\" to me, bro. One of us (and it very well could be me) is missing something here, as Morrell is claiming no less than three independent investigations of McChrystal's findings of the death of Tillman. While not exactly the truth, General McChrystal was found to have committed no wrong-doing, leading one to infer that the final analysis, an accidental death by fratricide, is the correct conclusion. But Cider33 is correct, in any case: regardless of past transgressions against this one family, if McChrystal is the best man for the job, than he should be appointed despite their personal animosity. This truly is bigger than any one man or any one family. I never would and never will condone the lack of immediate truth the Tillmans have suffered. But the matter is closed, and their attempt to politicize this is a bit of a slap in the face of the one true victim, Pat Tillman. One does not honor the fallen by using them as platforms for political statements. Well said Richard!", 
        "intTime": 20090514, 
        "postID": 6, 
        "quote": "Originally posted by FollowMeInfantry: That doesn't sound like \"no investigation of Tillman's death\" to me, bro. One of us (and it very well could be me) is missing something here, as Morrell is claiming no less than three independent investigations of McChrystal's findings of the death of Tillman. While not exactly the truth, General McChrystal was found to have committed no wrong-doing, leading one to infer that the final analysis, an accidental death by fratricide, is the correct conclusion. But Cider33 is correct, in any case: regardless of past transgressions against this one family, if McChrystal is the best man for the job, than he should be appointed despite their personal animosity. This truly is bigger than any one man or any one family. I never would and never will condone the lack of immediate truth the Tillmans have suffered. But the matter is closed, and their attempt to politicize this is a bit of a slap in the face of the one true victim, Pat Tillman. One does not honor the fallen by using them as platforms for political statements.", 
        "reply": " Well said Richard!", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-14 04:22:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "busnrete8"
    }, 
    {
        "content": "McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death).", 
        "intTime": 20090514, 
        "postID": 7, 
        "quote": "", 
        "reply": "McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death).", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-14 11:09:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by Cider33_Alpha: Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. And just what was that 'evidence of which there is 'enough'? There was no investigation of Tillman's death. Obviously it wasn't and isn't 'enough' for the Tillmans who are still being told to 'just let it go'. The very timeline of the incident itself, the mistated circumstances and 'bogus' award of a decoration for being killed are 'enough' to warrant an investigation. For General McChrystal's benefit, that should have been a prerequiste to advancement. He takes office with an albatross around his neck. Pop, whether you may or may not consider it to be investigated enough, every death of a soldier, whether in training, off duty, or in combat, is investigated. It might not result in a Congressional hearing, but an investigation of some sort is always done.", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "Originally posted by popsiq: quote: Originally posted by Cider33_Alpha: Pat Tillman was high-profile, but from all accounts, he tried NOT to be. For him to be resurrected as a possible source of objection to McChrystal's assignment, if it comes to that, is absurd. There is more than enough evidence on the record that indicates McChrystal's involvement was not as part of any \"cover-up\" (that never happened) of fratricide. And just what was that 'evidence of which there is 'enough'? There was no investigation of Tillman's death. Obviously it wasn't and isn't 'enough' for the Tillmans who are still being told to 'just let it go'. The very timeline of the incident itself, the mistated circumstances and 'bogus' award of a decoration for being killed are 'enough' to warrant an investigation. For General McChrystal's benefit, that should have been a prerequiste to advancement. He takes office with an albatross around his neck.", 
        "reply": " Pop, whether you may or may not consider it to be investigated enough, every death of a soldier, whether in training, off duty, or in combat, is investigated. It might not result in a Congressional hearing, but an investigation of some sort is always done.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-14 11:41:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death). Maybe by standing up and waving your arms and screaming cease fire to get friendly forces to stop shooting at your buddy? I guess in your book an action can only be heroic if the tracers are green...", 
        "intTime": 20090514, 
        "postID": 9, 
        "quote": "Originally posted by mrmixitup: McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death).", 
        "reply": " Maybe by standing up and waving your arms and screaming cease fire to get friendly forces to stop shooting at your buddy? I guess in your book an action can only be heroic if the tracers are green...", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-14 11:44:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death). In the abscence of complete verified proof at the time that Tillmans reccomendation came through, how was he supposed to not sign it on just a hunch? Tillmans actions in Trying to outflank the ambush, and then when he realized he was under US Fire to order his team to cover and expose himself so as to Identify himself as friendly to the Soldiers was a series of actions showing Gallantry.", 
        "intTime": 20090514, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death).", 
        "reply": " In the abscence of complete verified proof at the time that Tillmans reccomendation came through, how was he supposed to not sign it on just a hunch? Tillmans actions in Trying to outflank the ambush, and then when he realized he was under US Fire to order his team to cover and expose himself so as to Identify himself as friendly to the Soldiers was a series of actions showing Gallantry.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-14 11:51:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by mrmixitup: McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death). In the abscence of complete verified proof at the time that Tillmans reccomendation came through, how was he supposed to not sign it on just a hunch? Tillmans actions in Trying to outflank the ambush, and then when he realized he was under US Fire to order his team to cover and expose himself so as to Identify himself as friendly to the Soldiers was a series of actions showing Gallantry. They expidited it to save face. The fact that they rushed it makes it even worse in my opinion. Fact is; no enemy present, you don't get one. That's what the Soldier's Medal is for.", 
        "intTime": 20090515, 
        "postID": 11, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by mrmixitup: McChrystal was one of the men who signed off on Tillman's Silver Star. How do you recieve a Silver Star again when there were no enemy present and no heroic actions performed? (I'm not trashing Tillman, but it's obvious his award was approved to cover for the disaster that was his death). In the abscence of complete verified proof at the time that Tillmans reccomendation came through, how was he supposed to not sign it on just a hunch? Tillmans actions in Trying to outflank the ambush, and then when he realized he was under US Fire to order his team to cover and expose himself so as to Identify himself as friendly to the Soldiers was a series of actions showing Gallantry.", 
        "reply": " They expidited it to save face. The fact that they rushed it makes it even worse in my opinion. Fact is; no enemy present, you don't get one. That's what the Soldier's Medal is for.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-15 04:50:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Fact is there WAS enemy Present, thats why the dismount and attempted flanking Manuever. The Patrol wasnt stopped for a Pizz break and Tillman didnt decide on a Lark to flank, it was the IED which initiated the actions.", 
        "intTime": 20090515, 
        "postID": 12, 
        "quote": "", 
        "reply": "Fact is there WAS enemy Present, thats why the dismount and attempted flanking Manuever. The Patrol wasnt stopped for a Pizz break and Tillman didnt decide on a Lark to flank, it was the IED which initiated the actions.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-15 11:56:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "The investigation is settled. I feel bad for Tilman's family, of course. I understand the bad blood they'd feel towards GEN McChrystal. But be that as it may, the General's got some very good ideas, and he should be given a chance in Afghanistan. Petraeus has picked him for good reason: he commanded in Iraq for quite a while, and was instrumental in getting special operations guys, government agencies, and conventional forces to work together, leading to a high rate of success in targeting and eliminating bad guys and in soft power work. I wish the General all the luck. He'll need it. And I hope nobody in Congress puts up any serious roadblock to his appointment.", 
        "intTime": 20090515, 
        "postID": 13, 
        "quote": "", 
        "reply": "The investigation is settled. I feel bad for Tilman's family, of course. I understand the bad blood they'd feel towards GEN McChrystal. But be that as it may, the General's got some very good ideas, and he should be given a chance in Afghanistan. Petraeus has picked him for good reason: he commanded in Iraq for quite a while, and was instrumental in getting special operations guys, government agencies, and conventional forces to work together, leading to a high rate of success in targeting and eliminating bad guys and in soft power work. I wish the General all the luck. He'll need it. And I hope nobody in Congress puts up any serious roadblock to his appointment.", 
        "threadID": "672198221_7220012322001", 
        "time": "2009-05-15 19:50:00", 
        "title": "Tillmans Want McChrystal Record Probed", 
        "userID": "Ruanne"
    }
]