[
    {
        "content": "\"http://news.yahoo.com/s/ap/20090523/ap_on_en_tv/us_csi_lawsuit_4\" quote: A couple sued a writer for the CBS show \"CSI,\" claiming two shady characters on the show were named after them in revenge for a real estate deal gone bad. Real estate agents Melinda and Scott Tamkin on Friday sued writer and producer Sarah Goldfinger for defamation and invasion-of-privacy. They are seeking $6 million in damages, alleging the show hurt their real estate business. Calls to Goldfinger and CBS were not immediately returned. The Tamkins represented the owners of a Los Angeles home that Goldfinger wanted to buy in 2005, according to the lawsuit. Goldfinger pulled out when the sale was in escrow, but there was no indication of any animosity at the time. The \"CSI: Crime Scene Investigation\" show set in Las Vegas featured a real estate agent named Melinda, who dies under mysterious circumstances, and her husband Scott, a mortgage broker who watches pornography, drinks and is suspected of killing his wife, according to the suit. The characters had the last name Tamkin in an original screenplay and Goldfinger helped cast actors who looked like the Tamkins, according to the lawsuit. The Tamkins claim the characters' last name was changed to Tucker at the last minute, which they said was evidence Goldfinger borrowed details from their lives. Anthony Glassman, the Tamkins' attorney, said potential clients looking for their real estate company could have been deterred from contacting them because episode descriptions were online for months before the program aired. Be careful who you upset - or you might find yourself on TV in unflattering ways.", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "A couple sued a writer for the CBS show \"CSI,\" claiming two shady characters on the show were named after them in revenge for a real estate deal gone bad. Real estate agents Melinda and Scott Tamkin on Friday sued writer and producer Sarah Goldfinger for defamation and invasion-of-privacy. They are seeking $6 million in damages, alleging the show hurt their real estate business. Calls to Goldfinger and CBS were not immediately returned. The Tamkins represented the owners of a Los Angeles home that Goldfinger wanted to buy in 2005, according to the lawsuit. Goldfinger pulled out when the sale was in escrow, but there was no indication of any animosity at the time. The \"CSI: Crime Scene Investigation\" show set in Las Vegas featured a real estate agent named Melinda, who dies under mysterious circumstances, and her husband Scott, a mortgage broker who watches pornography, drinks and is suspected of killing his wife, according to the suit. The characters had the last name Tamkin in an original screenplay and Goldfinger helped cast actors who looked like the Tamkins, according to the lawsuit. The Tamkins claim the characters' last name was changed to Tucker at the last minute, which they said was evidence Goldfinger borrowed details from their lives. Anthony Glassman, the Tamkins' attorney, said potential clients looking for their real estate company could have been deterred from contacting them because episode descriptions were online for months before the program aired.", 
        "reply": "\"http://news.yahoo.com/s/ap/20090523/ap_on_en_tv/us_csi_lawsuit_4\"  Be careful who you upset - or you might find yourself on TV in unflattering ways.", 
        "threadID": "672198221_2050070422001", 
        "time": "2009-05-23 09:37:00", 
        "title": "Never annoy a screenwriter", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "I'd like to know which 'details' from their lives were 'borrowed'? Obviously one of them ISN'T dead, so the other one couldn't be a suspect. So is it their first names and the parasitical occupation they're in? Or is it the more 'entertaining' part about porn and booze? Inquiring mines knead to no.", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "", 
        "reply": "I'd like to know which 'details' from their lives were 'borrowed'? Obviously one of them ISN'T dead, so the other one couldn't be a suspect. So is it their first names and the parasitical occupation they're in? Or is it the more 'entertaining' part about porn and booze? Inquiring mines knead to no.", 
        "threadID": "672198221_2050070422001", 
        "time": "2009-05-23 23:07:00", 
        "title": "Never annoy a screenwriter", 
        "userID": "AliBubba"
    }
]