[
    {
        "content": "quote: An Air Force F-22 crashed Wednesday near Edwards Air Force Base in California, Air Force officials said. The single-seat fighter crashed about 10:30 a.m. (1:30 p.m. ET) for unknown reasons, the officials said. The status of the pilot was unknown. http://cnnwire.blogs.cnn.com/2009/03/25/air-force-jet-crashes-in-california/ Damn! ETA: The Pilot did eject! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "An Air Force F-22 crashed Wednesday near Edwards Air Force Base in California, Air Force officials said. The single-seat fighter crashed about 10:30 a.m. (1:30 p.m. ET) for unknown reasons, the officials said. The status of the pilot was unknown.", 
        "reply": " http://cnnwire.blogs.cnn.com/2009/03/25/air-force-jet-crashes-in-california/ Damn! ETA: The Pilot did eject! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:06:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "KJ1110"
    }, 
    {
        "content": "we better those AIG bonuses back so we can buy another one.", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "we better those AIG bonuses back so we can buy another one.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:11:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "wharthog"
    }, 
    {
        "content": "Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:18:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Yeah! It Sux? Gravity is a bugger! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090325, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " Yeah! It Sux? Gravity is a bugger! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:31:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? It's Obama's fault- he's gutted the military [sarcasm off].", 
        "intTime": 20090325, 
        "postID": 5, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " It's Obama's fault- he's gutted the military [sarcasm off].", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:34:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Is it something to do with the magnetism of the earth? yeah, remember it is supposed to reverse here sometime soon... so up is down and left is right, right? Or would right now be write, rite? but lets do hope that the pilot is alright. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090325, 
        "postID": 6, 
        "quote": "Originally posted by Anbar7: Is it something to do with the magnetism of the earth?", 
        "reply": " yeah, remember it is supposed to reverse here sometime soon... so up is down and left is right, right? Or would right now be write, rite? but lets do hope that the pilot is alright. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:40:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows.", 
        "intTime": 20090325, 
        "postID": 7, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:13:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows. Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 8, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows.", 
        "reply": " Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:19:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "rm444"
    }, 
    {
        "content": "Modern fighters almost don't fly!", 
        "intTime": 20090325, 
        "postID": 9, 
        "quote": "", 
        "reply": "Modern fighters almost don't fly!", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:21:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "EAG154"
    }, 
    {
        "content": "Longest production run fighter in histery!", 
        "intTime": 20090325, 
        "postID": 10, 
        "quote": "", 
        "reply": "Longest production run fighter in histery!", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:28:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair.", 
        "intTime": 20090325, 
        "postID": 11, 
        "quote": "Originally posted by EAG154: Longest production run fighter in histery!", 
        "reply": " Always one of my favorites, the F4U Corsair.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:30:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? No to all of the above. Something new we have all overlooked: gravity.", 
        "intTime": 20090325, 
        "postID": 12, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " No to all of the above. Something new we have all overlooked: gravity.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:31:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? No to all of the above. Something new we have all overlooked: gravity. {....psssst!....} Forth post in the thread! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090325, 
        "postID": 13, 
        "quote": "Originally posted by badmac933: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? No to all of the above. Something new we have all overlooked: gravity.", 
        "reply": " {....psssst!....} Forth post in the thread! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:44:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: No to all of the above. Something new we have all overlooked: gravity. When I was skydiving I learned all about gravity. It is not just a theory and I spent seven months in a wheelchair proving it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090325, 
        "postID": 14, 
        "quote": "No to all of the above. Something new we have all overlooked: gravity.", 
        "reply": " When I was skydiving I learned all about gravity. It is not just a theory and I spent seven months in a wheelchair proving it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:50:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by rm444: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows. Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. <edit> I take that back.I forgot about the Fed-Ex DC-10 that crashed and killed the crew. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 15, 
        "quote": "Originally posted by rm444: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows. Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. <edit> I take that back.I forgot about the Fed-Ex DC-10 that crashed and killed the crew.", 
        "reply": " \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:51:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair. It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090325, 
        "postID": 16, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair.", 
        "reply": " It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:04:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair. It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please. All great planes but I'll take the P-38 Lightning, anytime.", 
        "intTime": 20090325, 
        "postID": 17, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair. It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please.", 
        "reply": " All great planes but I'll take the P-38 Lightning, anytime.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:08:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Dual engines save lives...", 
        "intTime": 20090325, 
        "postID": 18, 
        "quote": "", 
        "reply": "Dual engines save lives...", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:15:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "You all need a check-up from the neck up. This is da shizzy right here. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 19, 
        "quote": "", 
        "reply": "You all need a check-up from the neck up. This is da shizzy right here. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:38:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by rm444: You all need a check-up from the neck up. This is da shizzy right here. The \"Jug\".............", 
        "intTime": 20090325, 
        "postID": 20, 
        "quote": "Originally posted by rm444: You all need a check-up from the neck up. This is da shizzy right here.", 
        "reply": " The \"Jug\".............", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:52:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: An Air Force F-22 crashed Wednesday near Edwards Air Force Base in California, Air Force officials said. The single-seat fighter crashed about 10:30 a.m. (1:30 p.m. ET) for unknown reasons, the officials said. The status of the pilot was unknown. http://cnnwire.blogs.cnn.com/2009/03/25/air-force-jet-crashes-in-california/ Damn! ETA: The Pilot did eject! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090325, 
        "postID": 21, 
        "quote": "An Air Force F-22 crashed Wednesday near Edwards Air Force Base in California, Air Force officials said. The single-seat fighter crashed about 10:30 a.m. (1:30 p.m. ET) for unknown reasons, the officials said. The status of the pilot was unknown.", 
        "reply": " http://cnnwire.blogs.cnn.com/2009/03/25/air-force-jet-crashes-in-california/ Damn! ETA: The Pilot did eject! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:06:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "KJ1110"
    }, 
    {
        "content": "we better those AIG bonuses back so we can buy another one.", 
        "intTime": 20090325, 
        "postID": 22, 
        "quote": "", 
        "reply": "we better those AIG bonuses back so we can buy another one.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:11:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "wharthog"
    }, 
    {
        "content": "Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090325, 
        "postID": 23, 
        "quote": "", 
        "reply": "Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:18:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Yeah! It Sux? Gravity is a bugger! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090325, 
        "postID": 24, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " Yeah! It Sux? Gravity is a bugger! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:31:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? It's Obama's fault- he's gutted the military [sarcasm off].", 
        "intTime": 20090325, 
        "postID": 25, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " It's Obama's fault- he's gutted the military [sarcasm off].", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:34:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Is it something to do with the magnetism of the earth? yeah, remember it is supposed to reverse here sometime soon... so up is down and left is right, right? Or would right now be write, rite? but lets do hope that the pilot is alright. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090325, 
        "postID": 26, 
        "quote": "Originally posted by Anbar7: Is it something to do with the magnetism of the earth?", 
        "reply": " yeah, remember it is supposed to reverse here sometime soon... so up is down and left is right, right? Or would right now be write, rite? but lets do hope that the pilot is alright. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 12:40:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows.", 
        "intTime": 20090325, 
        "postID": 27, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:13:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows. Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 28, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows.", 
        "reply": " Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:19:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "rm444"
    }, 
    {
        "content": "Modern fighters almost don't fly!", 
        "intTime": 20090325, 
        "postID": 29, 
        "quote": "", 
        "reply": "Modern fighters almost don't fly!", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:21:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "EAG154"
    }, 
    {
        "content": "Longest production run fighter in histery!", 
        "intTime": 20090325, 
        "postID": 30, 
        "quote": "", 
        "reply": "Longest production run fighter in histery!", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:28:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair.", 
        "intTime": 20090325, 
        "postID": 31, 
        "quote": "Originally posted by EAG154: Longest production run fighter in histery!", 
        "reply": " Always one of my favorites, the F4U Corsair.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:30:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? No to all of the above. Something new we have all overlooked: gravity.", 
        "intTime": 20090325, 
        "postID": 32, 
        "quote": "Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth?", 
        "reply": " No to all of the above. Something new we have all overlooked: gravity.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:31:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? No to all of the above. Something new we have all overlooked: gravity. {....psssst!....} Forth post in the thread! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090325, 
        "postID": 33, 
        "quote": "Originally posted by badmac933: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? No to all of the above. Something new we have all overlooked: gravity.", 
        "reply": " {....psssst!....} Forth post in the thread! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:44:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: No to all of the above. Something new we have all overlooked: gravity. When I was skydiving I learned all about gravity. It is not just a theory and I spent seven months in a wheelchair proving it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090325, 
        "postID": 34, 
        "quote": "No to all of the above. Something new we have all overlooked: gravity.", 
        "reply": " When I was skydiving I learned all about gravity. It is not just a theory and I spent seven months in a wheelchair proving it. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:50:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by rm444: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows. Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. <edit> I take that back.I forgot about the Fed-Ex DC-10 that crashed and killed the crew. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 35, 
        "quote": "Originally posted by rm444: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Seems like there are a lot of plane crashes lately. What is going on? Is it just bad mechanical maintenance? Is it something to do with the magnetism of the earth? Not always but most of the time, planes crashes come in threes, same as railroad and ship/boats. Especially planes...........for some reason, maybe karma, who the hell knows. Same thing when famous people kick the bucket. 3 at a time. Are we talking Military or commercial crashes here? Military had an F-18 in San Diego, a B-2 on Guam and now this. Commercial had the crash in Buffalo, NY and a crash in the Hudson River and a crash in Butte, MT. No casualties in the Hudson River crash so we might have another one on the way. <edit> I take that back.I forgot about the Fed-Ex DC-10 that crashed and killed the crew.", 
        "reply": " \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 13:51:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair. It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "intTime": 20090325, 
        "postID": 36, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair.", 
        "reply": " It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please. How come I pressed \"One for English\" and still can't understand a word the dude is saying?", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:04:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "Vicdude"
    }, 
    {
        "content": "quote: Originally posted by Vicdude: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair. It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please. All great planes but I'll take the P-38 Lightning, anytime.", 
        "intTime": 20090325, 
        "postID": 37, 
        "quote": "Originally posted by Vicdude: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by EAG154: Longest production run fighter in histery! Always one of my favorites, the F4U Corsair. It's a nice old bucket for sure but I'll have a North American Rockwell P51-D Mustang please.", 
        "reply": " All great planes but I'll take the P-38 Lightning, anytime.", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:08:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Dual engines save lives...", 
        "intTime": 20090325, 
        "postID": 38, 
        "quote": "", 
        "reply": "Dual engines save lives...", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:15:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "You all need a check-up from the neck up. This is da shizzy right here. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090325, 
        "postID": 39, 
        "quote": "", 
        "reply": "You all need a check-up from the neck up. This is da shizzy right here. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:38:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by rm444: You all need a check-up from the neck up. This is da shizzy right here. The \"Jug\".............", 
        "intTime": 20090325, 
        "postID": 40, 
        "quote": "Originally posted by rm444: You all need a check-up from the neck up. This is da shizzy right here.", 
        "reply": " The \"Jug\".............", 
        "threadID": "672198221_1920088812001", 
        "time": "2009-03-25 14:52:00", 
        "title": "F-22 Crash 1:30pm EST 03/25", 
        "userID": "SignalSgtWilliams"
    }
]