[
    {
        "content": "quote: \"Most cruises offer a mini-bar We offer a mounted Mini-Gun\" ++http://www.somalicruises.com", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "\"Most cruises offer a mini-bar We offer a mounted Mini-Gun\" ++http://www.somalicruises.com", 
        "reply": "", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-15 20:20:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "LOL!!!!", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "LOL!!!!", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-15 23:07:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Good one.", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "", 
        "reply": "Good one.", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 01:07:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "That what i call \"money thinking\". The one that have thought about it is a genius.", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "", 
        "reply": "That what i call \"money thinking\". The one that have thought about it is a genius.", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 08:04:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: \"Most cruises offer a mini-bar We offer a mounted Mini-Gun\" ++http://www.somalicruises.com Anyone remember the TV series, \"American Sportsmen?\" They could have a celebrity massacre some Ducks, or something while shooting a semi-documentary implying nerves of steel, and danger abounds. This looks like they can finally, finally have a TV reality show that will knock em dead. Of course only cable can show it... The airways would find such shootouts to be \"offensive programing.\" Dave", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "Originally posted by Canuck_Centaur: quote: \"Most cruises offer a mini-bar We offer a mounted Mini-Gun\" ++http://www.somalicruises.com", 
        "reply": " Anyone remember the TV series, \"American Sportsmen?\" They could have a celebrity massacre some Ducks, or something while shooting a semi-documentary implying nerves of steel, and danger abounds. This looks like they can finally, finally have a TV reality show that will knock em dead. Of course only cable can show it... The airways would find such shootouts to be \"offensive programing.\" Dave", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 08:45:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "Grachus"
    }, 
    {
        "content": "I just spit Lucky Charms all over my computer!", 
        "intTime": 20090516, 
        "postID": 6, 
        "quote": "", 
        "reply": "I just spit Lucky Charms all over my computer!", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 08:46:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "shuman14"
    }, 
    {
        "content": "I do have some vacation time accrued....", 
        "intTime": 20090516, 
        "postID": 7, 
        "quote": "", 
        "reply": "I do have some vacation time accrued....", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 09:40:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "And my son is on one of those sissie Disney cruises to the caribbean while he could be in some real action. He's going to be so mad. Loved the cat fights and testimonies.", 
        "intTime": 20090516, 
        "postID": 8, 
        "quote": "", 
        "reply": "And my son is on one of those sissie Disney cruises to the caribbean while he could be in some real action. He's going to be so mad. Loved the cat fights and testimonies.", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 10:14:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I wouldn't be too fast to jump on this cruise. Remember what happened to a company of Rangers when they went up against these Pirates and these same pirates held off the most powerful Navy in the world for 5 days just a month ago. Be careful what you wish for. Right now the only three people in the world that I believe can handle this pirate situation is Obama, Pelosi, and Flat Jacks. Period.", 
        "intTime": 20090516, 
        "postID": 9, 
        "quote": "", 
        "reply": "I wouldn't be too fast to jump on this cruise. Remember what happened to a company of Rangers when they went up against these Pirates and these same pirates held off the most powerful Navy in the world for 5 days just a month ago. Be careful what you wish for. Right now the only three people in the world that I believe can handle this pirate situation is Obama, Pelosi, and Flat Jacks. Period.", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 10:23:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I wouldn't be too fast to jump on this cruise. Remember what happened to a company of Rangers when they went up against these Pirates and these same pirates held off the most powerful Navy in the world for 5 days just a month ago. Be careful what you wish for. Right now the only three people in the world that I believe can handle this pirate situation is Obama, Pelosi, and Flat Jacks. Period. Now, now. This is serious sport. This is not people armed with semi-automatic weapons going after dangerous wild chickens. If you want a trophy head, you're going to have to earn it. Maybe there will be leagues formed? Degree of difficulty? Will bow-hunting be allowed, where you get extra bonus points? Of course, \"eating what you kill\" will be a no no, one small adjustment to the \"game\" being hunted. No doubt that the expression, \"Crazy Americans\" will have a new lease on life. Catches on, it might very well end the pirate problem. Maybe limits on the kill? Size limits? No hunting on weekends? Boone and Crockett will just have to open up and estabish a weighing station in the area. Dave", 
        "intTime": 20090516, 
        "postID": 10, 
        "quote": "Originally posted by Duster6: I wouldn't be too fast to jump on this cruise. Remember what happened to a company of Rangers when they went up against these Pirates and these same pirates held off the most powerful Navy in the world for 5 days just a month ago. Be careful what you wish for. Right now the only three people in the world that I believe can handle this pirate situation is Obama, Pelosi, and Flat Jacks. Period.", 
        "reply": " Now, now. This is serious sport. This is not people armed with semi-automatic weapons going after dangerous wild chickens. If you want a trophy head, you're going to have to earn it. Maybe there will be leagues formed? Degree of difficulty? Will bow-hunting be allowed, where you get extra bonus points? Of course, \"eating what you kill\" will be a no no, one small adjustment to the \"game\" being hunted. No doubt that the expression, \"Crazy Americans\" will have a new lease on life. Catches on, it might very well end the pirate problem. Maybe limits on the kill? Size limits? No hunting on weekends? Boone and Crockett will just have to open up and estabish a weighing station in the area. Dave", 
        "threadID": "672198221_5070014322001", 
        "time": "2009-05-16 10:32:00", 
        "title": "Somali Cruises: pirate-hunting fun for the whole family!", 
        "userID": "Grachus"
    }
]