[
    {
        "content": "Like I said in the last thread, HE CAN FIGHT THIS and I commend him on his discision to do so. quote: US President Barack Obama has changed his mind and will now attempt to block the publication of photographs showing the abuse of prisoners by US soldiers. The US government had previously said it would not fight a court ruling ordering the release of the pictures. Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. The pictures were due to be released by 28 May, according to the court ruling. The court order was issued by the US Court of Appeals for the Second Circuit in September 2008, in response to a Freedom of Information Act request by the American Civil Liberties Union (ACLU). 'Disappointed' The US Department of Defence had been preparing to release the images, but Mr Obama has now directed his White House Counsel, Greg Craig, to raise an objection to their publication. The dispute could now end up before the US Supreme Court. Whie House officials said Mr Obama did not feel comfortable with the release of the photographs because he believed their release would endanger US troops, and because the national security implications of such a release had not been fully presented to the court. Good going President Obama!! Read the rest at the BBC site. This message has been edited. Last edited by: L0A1, Wed 13 May 2009 01:32 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "US President Barack Obama has changed his mind and will now attempt to block the publication of photographs showing the abuse of prisoners by US soldiers. The US government had previously said it would not fight a court ruling ordering the release of the pictures. Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. The pictures were due to be released by 28 May, according to the court ruling. The court order was issued by the US Court of Appeals for the Second Circuit in September 2008, in response to a Freedom of Information Act request by the American Civil Liberties Union (ACLU). 'Disappointed' The US Department of Defence had been preparing to release the images, but Mr Obama has now directed his White House Counsel, Greg Craig, to raise an objection to their publication. The dispute could now end up before the US Supreme Court. Whie House officials said Mr Obama did not feel comfortable with the release of the photographs because he believed their release would endanger US troops, and because the national security implications of such a release had not been fully presented to the court.", 
        "reply": "Like I said in the last thread, HE CAN FIGHT THIS and I commend him on his discision to do so.  Good going President Obama!! Read the rest at the BBC site. This message has been edited. Last edited by: L0A1, Wed 13 May 2009 01:32 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 10:47:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Like I said in the last thread, HE CAN FIGHT THIS and I commend him on his discision to do so. quote: US President Barack Obama has changed his mind and will now attempt to block the publication of photographs showing the abuse of prisoners by US soldiers. The US government had previously said it would not fight a court ruling ordering the release of the pictures. Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. The pictures were due to be released by 28 May, according to the court ruling. The court order was issued by the US Court of Appeals for the Second Circuit in September 2008, in response to a Freedom of Information Act request by the American Civil Liberties Union (ACLU). 'Disappointed' The US Department of Defence had been preparing to release the images, but Mr Obama has now directed his White House Counsel, Greg Craig, to raise an objection to their publication. The dispute could now end up before the US Supreme Court. Whie House officials said Mr Obama did not feel comfortable with the release of the photographs because he believed their release would endanger US troops, and because the national security implications of such a release had not been fully presented to the court. Read the rest at the BBC site. Politically this is very clever. He can now release the images in Oct of 2010, and not even the Republicans will be able to claim a political motive. Dave", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "Originally posted by L0A1: Like I said in the last thread, HE CAN FIGHT THIS and I commend him on his discision to do so. quote: US President Barack Obama has changed his mind and will now attempt to block the publication of photographs showing the abuse of prisoners by US soldiers. The US government had previously said it would not fight a court ruling ordering the release of the pictures. Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. The pictures were due to be released by 28 May, according to the court ruling. The court order was issued by the US Court of Appeals for the Second Circuit in September 2008, in response to a Freedom of Information Act request by the American Civil Liberties Union (ACLU). 'Disappointed' The US Department of Defence had been preparing to release the images, but Mr Obama has now directed his White House Counsel, Greg Craig, to raise an objection to their publication. The dispute could now end up before the US Supreme Court. Whie House officials said Mr Obama did not feel comfortable with the release of the photographs because he believed their release would endanger US troops, and because the national security implications of such a release had not been fully presented to the court. Read the rest at the BBC site.", 
        "reply": " Politically this is very clever. He can now release the images in Oct of 2010, and not even the Republicans will be able to claim a political motive. Dave", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 10:51:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Grachus"
    }, 
    {
        "content": "Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom?", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "", 
        "reply": "Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom?", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 10:53:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave", 
        "intTime": 20090513, 
        "postID": 4, 
        "quote": "Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom?", 
        "reply": " Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 11:27:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. Well no s h i t....who would have ever of thought that. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090513, 
        "postID": 5, 
        "quote": "Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said.", 
        "reply": " Well no s h i t....who would have ever of thought that. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 11:30:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. Well no s h i t....who would have ever of thought that. no S H I T is correct.... why not dig up all of our dirty laundry and hang it out for the whole world to poke at! Obama's plan.... Part of this administrations stench!", 
        "intTime": 20090513, 
        "postID": 6, 
        "quote": "Originally posted by Anbar7: quote: Mr Obama now believes the release of the photos would make the job of US troops in Iraq and Afghanistan more difficult, White House officials said. Well no s h i t....who would have ever of thought that.", 
        "reply": " no S H I T is correct.... why not dig up all of our dirty laundry and hang it out for the whole world to poke at! Obama's plan.... Part of this administrations stench!", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 11:39:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave", 
        "reply": " I thought the Female General was booted over this. I can't remember her name. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 11:49:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name. She had her career cut short. And she resigned. She too, in her own way was a scapegoat. Taguba concluded that she knew nothing about these activities but SHOULD have known about these activities. Even so, she not only didn't do time in jail, but wasn't charged with anything. quote: “From what I knew, troops just don’t take it upon themselves to initiate what they did without any form of knowledge of the higher-ups,” Taguba told me. His orders were clear, however: he was to investigate only the military police at Abu Ghraib, and not those above them in the chain of command. “These M.P. troops were not that creative,” he said. “Somebody was giving them guidance, but I was legally prevented from further investigation into higher authority. I was limited to a box.” ************************* The former senior intelligence official said that when the images of Abu Ghraib were published, there were some in the Pentagon and the White House who “didn’t think the photographs were that bad”—in that they put the focus on enlisted soldiers, rather than on secret task-force operations. Referring to the task-force members, he said, “Guys on the inside ask me, ‘What’s the difference between shooting a guy on the street, or in his bed, or in a prison?’ ” A Pentagon consultant on the war on terror also said that the “basic strategy was ‘prosecute the kids in the photographs but protect the big picture.’ ” ******************** “From the moment a soldier enlists, we inculcate loyalty, duty, honor, integrity, and selfless service,” Taguba said. “And yet when we get to the senior-officer level we forget those values. I know that my peers in the Army will be mad at me for speaking out, but the fact is that we violated the laws of land warfare in Abu Ghraib. We violated the tenets of the Geneva Convention. We violated our own principles and we violated the core of our military values. The stress of combat is not an excuse, and I believe, even today, that those civilian and military leaders responsible should be held accountable.” “http://www.newyorker.com/reporting/2007/06/25/070625fa_fact_hersh” Dave", 
        "intTime": 20090513, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name.", 
        "reply": " She had her career cut short. And she resigned. She too, in her own way was a scapegoat. Taguba concluded that she knew nothing about these activities but SHOULD have known about these activities. Even so, she not only didn't do time in jail, but wasn't charged with anything. quote: “From what I knew, troops just don’t take it upon themselves to initiate what they did without any form of knowledge of the higher-ups,” Taguba told me. His orders were clear, however: he was to investigate only the military police at Abu Ghraib, and not those above them in the chain of command. “These M.P. troops were not that creative,” he said. “Somebody was giving them guidance, but I was legally prevented from further investigation into higher authority. I was limited to a box.” ************************* The former senior intelligence official said that when the images of Abu Ghraib were published, there were some in the Pentagon and the White House who “didn’t think the photographs were that bad”—in that they put the focus on enlisted soldiers, rather than on secret task-force operations. Referring to the task-force members, he said, “Guys on the inside ask me, ‘What’s the difference between shooting a guy on the street, or in his bed, or in a prison?’ ” A Pentagon consultant on the war on terror also said that the “basic strategy was ‘prosecute the kids in the photographs but protect the big picture.’ ” ******************** “From the moment a soldier enlists, we inculcate loyalty, duty, honor, integrity, and selfless service,” Taguba said. “And yet when we get to the senior-officer level we forget those values. I know that my peers in the Army will be mad at me for speaking out, but the fact is that we violated the laws of land warfare in Abu Ghraib. We violated the tenets of the Geneva Convention. We violated our own principles and we violated the core of our military values. The stress of combat is not an excuse, and I believe, even today, that those civilian and military leaders responsible should be held accountable.” “http://www.newyorker.com/reporting/2007/06/25/070625fa_fact_hersh” Dave", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 11:58:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Grachus"
    }, 
    {
        "content": "U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING...", 
        "intTime": 20090513, 
        "postID": 9, 
        "quote": "", 
        "reply": "U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING...", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 12:41:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name. She had her career cut short. And she resigned. She too, in her own way was a scapegoat. Taguba concluded that she knew nothing about these activities but SHOULD have known about these activities. Even so, she not only didn't do time in jail, but wasn't charged with anything. quote: “From what I knew, troops just don’t take it upon themselves to initiate what they did without any form of knowledge of the higher-ups,” Taguba told me. His orders were clear, however: he was to investigate only the military police at Abu Ghraib, and not those above them in the chain of command. “These M.P. troops were not that creative,” he said. “Somebody was giving them guidance, but I was legally prevented from further investigation into higher authority. I was limited to a box.” ************************* The former senior intelligence official said that when the images of Abu Ghraib were published, there were some in the Pentagon and the White House who “didn’t think the photographs were that bad”—in that they put the focus on enlisted soldiers, rather than on secret task-force operations. Referring to the task-force members, he said, “Guys on the inside ask me, ‘What’s the difference between shooting a guy on the street, or in his bed, or in a prison?’ ” A Pentagon consultant on the war on terror also said that the “basic strategy was ‘prosecute the kids in the photographs but protect the big picture.’ ” ******************** “From the moment a soldier enlists, we inculcate loyalty, duty, honor, integrity, and selfless service,” Taguba said. “And yet when we get to the senior-officer level we forget those values. I know that my peers in the Army will be mad at me for speaking out, but the fact is that we violated the laws of land warfare in Abu Ghraib. We violated the tenets of the Geneva Convention. We violated our own principles and we violated the core of our military values. The stress of combat is not an excuse, and I believe, even today, that those civilian and military leaders responsible should be held accountable.” “http://www.newyorker.com/reporting/2007/06/25/070625fa_fact_hersh” Dave Again I have to agree, she was a scapegoat. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 10, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name. She had her career cut short. And she resigned. She too, in her own way was a scapegoat. Taguba concluded that she knew nothing about these activities but SHOULD have known about these activities. Even so, she not only didn't do time in jail, but wasn't charged with anything. quote: “From what I knew, troops just don’t take it upon themselves to initiate what they did without any form of knowledge of the higher-ups,” Taguba told me. His orders were clear, however: he was to investigate only the military police at Abu Ghraib, and not those above them in the chain of command. “These M.P. troops were not that creative,” he said. “Somebody was giving them guidance, but I was legally prevented from further investigation into higher authority. I was limited to a box.” ************************* The former senior intelligence official said that when the images of Abu Ghraib were published, there were some in the Pentagon and the White House who “didn’t think the photographs were that bad”—in that they put the focus on enlisted soldiers, rather than on secret task-force operations. Referring to the task-force members, he said, “Guys on the inside ask me, ‘What’s the difference between shooting a guy on the street, or in his bed, or in a prison?’ ” A Pentagon consultant on the war on terror also said that the “basic strategy was ‘prosecute the kids in the photographs but protect the big picture.’ ” ******************** “From the moment a soldier enlists, we inculcate loyalty, duty, honor, integrity, and selfless service,” Taguba said. “And yet when we get to the senior-officer level we forget those values. I know that my peers in the Army will be mad at me for speaking out, but the fact is that we violated the laws of land warfare in Abu Ghraib. We violated the tenets of the Geneva Convention. We violated our own principles and we violated the core of our military values. The stress of combat is not an excuse, and I believe, even today, that those civilian and military leaders responsible should be held accountable.” “http://www.newyorker.com/reporting/2007/06/25/070625fa_fact_hersh” Dave", 
        "reply": " Again I have to agree, she was a scapegoat. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 13:06:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave", 
        "intTime": 20090513, 
        "postID": 11, 
        "quote": "Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING...", 
        "reply": " Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 13:28:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave Hey Dave, how do I get to my signature part of my profile so I can add my name to it? Jay Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave", 
        "reply": " Hey Dave, how do I get to my signature part of my profile so I can add my name to it? Jay Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 13:31:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "L0A1"
    }, 
    {
        "content": "Col. Karpinski was the former Gen. in charge at ABU. We know she was a scapegoat because SHE says she was ! She was in charge, she paid an appropriate price. \"\"http://www.infowars.com/articles/ps/abu_ghraib_karpinski_demoted.htm Dave, forget SCOTUS and POTUS, what does TOTUS say, that's all that matters!", 
        "intTime": 20090513, 
        "postID": 13, 
        "quote": "", 
        "reply": "Col. Karpinski was the former Gen. in charge at ABU. We know she was a scapegoat because SHE says she was ! She was in charge, she paid an appropriate price. \"\"http://www.infowars.com/articles/ps/abu_ghraib_karpinski_demoted.htm Dave, forget SCOTUS and POTUS, what does TOTUS say, that's all that matters!", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 13:36:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave Hey Dave, how do I get to my signature part of my profile so I can add my name to it? Jay Checking my copy of the Koran, running through the index of Das Kapital, reading the works of Thucydides, the answer is very clear. Beats me... You notice that our avatars have joined Buddha in Nirvana?... (Ohh, my bad, you still have yours...) Dave", 
        "intTime": 20090513, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave Hey Dave, how do I get to my signature part of my profile so I can add my name to it? Jay", 
        "reply": " Checking my copy of the Koran, running through the index of Das Kapital, reading the works of Thucydides, the answer is very clear. Beats me... You notice that our avatars have joined Buddha in Nirvana?... (Ohh, my bad, you still have yours...) Dave", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 13:43:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name. She had her career cut short. And she resigned. She too, in her own way was a scapegoat. Taguba concluded that she knew nothing about these activities but SHOULD have known about these activities. Even so, she not only didn't do time in jail, but wasn't charged with anything. quote: “From what I knew, troops just don’t take it upon themselves to initiate what they did without any form of knowledge of the higher-ups,” Taguba told me. His orders were clear, however: he was to investigate only the military police at Abu Ghraib, and not those above them in the chain of command. “These M.P. troops were not that creative,” he said. “Somebody was giving them guidance, but I was legally prevented from further investigation into higher authority. I was limited to a box.” ************************* The former senior intelligence official said that when the images of Abu Ghraib were published, there were some in the Pentagon and the White House who “didn’t think the photographs were that bad”—in that they put the focus on enlisted soldiers, rather than on secret task-force operations. Referring to the task-force members, he said, “Guys on the inside ask me, ‘What’s the difference between shooting a guy on the street, or in his bed, or in a prison?’ ” A Pentagon consultant on the war on terror also said that the “basic strategy was ‘prosecute the kids in the photographs but protect the big picture.’ ” ******************** “From the moment a soldier enlists, we inculcate loyalty, duty, honor, integrity, and selfless service,” Taguba said. “And yet when we get to the senior-officer level we forget those values. I know that my peers in the Army will be mad at me for speaking out, but the fact is that we violated the laws of land warfare in Abu Ghraib. We violated the tenets of the Geneva Convention. We violated our own principles and we violated the core of our military values. The stress of combat is not an excuse, and I believe, even today, that those civilian and military leaders responsible should be held accountable.” “http://www.newyorker.com/reporting/2007/06/25/070625fa_fact_hersh” Dave Lets face some facts here. Soldiers are held accountable due to UCMJ. CIA not under UCMJ restrictions and because of their clandestine service are not totally held accountable under civilian law. That pretty much states the facts of the matter.", 
        "intTime": 20090513, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by usa_girl: Isn't it enough that we found out it was going on and punish the people who did the acts? Even if you are going to drag it all out in court after the fact to humiliate Bush, do we really need to put our men and women in harms way that are still out there fighting for freedom? Many people refer to our policy as high school hijinks. They are satisfied that the guilty were punished - And oddly enough all of those punished were enlisted personal. No officers, no one above the level of Sargeant is being held responsible. There are some questions that cannot be swept under the rug, and scapegoat some people on the lowest edge of responsibility. I doubt if these images, are going to hurt us. While facing up to, admitting, and at the same time repudiating these policies will in fact raise the level of respect for us around the world - Which in turn will make it safer for ANY American. Dave I thought the Female General was booted over this. I can't remember her name. She had her career cut short. And she resigned. She too, in her own way was a scapegoat. Taguba concluded that she knew nothing about these activities but SHOULD have known about these activities. Even so, she not only didn't do time in jail, but wasn't charged with anything. quote: “From what I knew, troops just don’t take it upon themselves to initiate what they did without any form of knowledge of the higher-ups,” Taguba told me. His orders were clear, however: he was to investigate only the military police at Abu Ghraib, and not those above them in the chain of command. “These M.P. troops were not that creative,” he said. “Somebody was giving them guidance, but I was legally prevented from further investigation into higher authority. I was limited to a box.” ************************* The former senior intelligence official said that when the images of Abu Ghraib were published, there were some in the Pentagon and the White House who “didn’t think the photographs were that bad”—in that they put the focus on enlisted soldiers, rather than on secret task-force operations. Referring to the task-force members, he said, “Guys on the inside ask me, ‘What’s the difference between shooting a guy on the street, or in his bed, or in a prison?’ ” A Pentagon consultant on the war on terror also said that the “basic strategy was ‘prosecute the kids in the photographs but protect the big picture.’ ” ******************** “From the moment a soldier enlists, we inculcate loyalty, duty, honor, integrity, and selfless service,” Taguba said. “And yet when we get to the senior-officer level we forget those values. I know that my peers in the Army will be mad at me for speaking out, but the fact is that we violated the laws of land warfare in Abu Ghraib. We violated the tenets of the Geneva Convention. We violated our own principles and we violated the core of our military values. The stress of combat is not an excuse, and I believe, even today, that those civilian and military leaders responsible should be held accountable.” “http://www.newyorker.com/reporting/2007/06/25/070625fa_fact_hersh” Dave", 
        "reply": " Lets face some facts here. Soldiers are held accountable due to UCMJ. CIA not under UCMJ restrictions and because of their clandestine service are not totally held accountable under civilian law. That pretty much states the facts of the matter.", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 13:49:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: Lets face some facts here. Soldiers are held accountable due to UCMJ. CIA not under UCMJ restrictions and because of their clandestine service are not totally held accountable under civilian law. That pretty much states the facts of the matter. Their accountable (to civilian courts) if their caught. But orders were given NOT to \"catch\" them. Dave", 
        "intTime": 20090513, 
        "postID": 16, 
        "quote": "Originally posted by NickBrand: Lets face some facts here. Soldiers are held accountable due to UCMJ. CIA not under UCMJ restrictions and because of their clandestine service are not totally held accountable under civilian law. That pretty much states the facts of the matter.", 
        "reply": " Their accountable (to civilian courts) if their caught. But orders were given NOT to \"catch\" them. Dave", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 14:00:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Grachus"
    }, 
    {
        "content": "Thank you Mr. President. I just hope Barney Frank, Nancy and Harry are not mad at you.", 
        "intTime": 20090513, 
        "postID": 17, 
        "quote": "", 
        "reply": "Thank you Mr. President. I just hope Barney Frank, Nancy and Harry are not mad at you.", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 14:28:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave Hey Dave, how do I get to my signature part of my profile so I can add my name to it? Jay Checking my copy of the Koran, running through the index of Das Kapital, reading the works of Thucydides, the answer is very clear. Beats me... You notice that our avatars have joined Buddha in Nirvana?... (Ohh, my bad, you still have yours...) Dave I noticed it since the profile change. My signature went the way of the dinosaurs. Jay Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: quote: Originally posted by Grachus: quote: Originally posted by Irwin_R_Schyster: U-turn...more like total flip-flop. Another rookie mistake exposed, these pictures should not have even been mentioned in the first place. What I REALLY want to see him address is members of his own party, those highly placed and extremey powerful members like the House speaker, who knew about waterboarding, egged it on, and NOW want to condemn those decisions?? STOP HIDING... Not at all. In an earlier discussion withy LOA1, I pointed out that if Obama was clever, he would try to delay the release of these images. I also pointed out that there's not a chance in the world that these images WONT be released - They WILL be released. But now, by being clever, Obama can time this so that it impacts the next election. FYI the Bush administration arguments of National Security were all shot down by the SCOTUS. In THIS case the Bush argument (which is NOW the Obama argument) is that they don't want the images released because it would violate the rights of the prisoners under the Geneva Conventions... If you think the SCOTUS is going to buy this, well... Dave Hey Dave, how do I get to my signature part of my profile so I can add my name to it? Jay Checking my copy of the Koran, running through the index of Das Kapital, reading the works of Thucydides, the answer is very clear. Beats me... You notice that our avatars have joined Buddha in Nirvana?... (Ohh, my bad, you still have yours...) Dave", 
        "reply": " I noticed it since the profile change. My signature went the way of the dinosaurs. Jay Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4410022322001", 
        "time": "2009-05-13 15:15:00", 
        "title": "Obama U-turn on abuse photographs", 
        "userID": "L0A1"
    }
]