[
    {
        "content": "Marlene H. PhillipsPosted May 4, 2009 | 05:29 PM (EST) Retired Brigadier General: Those Who Approved Torture \"Must Be Held Accountable\" Retired Brigadier General John Adams has something in common with his namesake and distant relative. Like the second president of the United States, the retired brigadier general adheres to one basic principle in his professional actions and beliefs: defend and uphold the Constitution of the United States. He stands convinced that those that have acted in a way that would, as he put it, \"triage the Constitution\" must be brought to justice, including those who approved of and authorized the use of torture on U.S. held detainees. John Adams understands the gathering of intelligence, having served thirty-plus years in the military in numerous capacities around the world including as a U.S. Army Military Intelligence Officer. Adams was also a distinguished graduate of the Intelligence Officer Basic Tactical Course at the United States Army Intelligence Center in 1977. In my interview with Adams, he made clear that during all his years of service and training, including his tenure as a professor at West Point, what he learned and what he taught was consistent: the United States military always acts under the rule of law, in accordance with the Geneva Convention, and upholds the Constitution. What was not taught, or even discussed, were terms like harsh or enhanced interrogation techniques (\"I never heard those terms used\"), or arguments concerning what constitutes a so-called unique enemy (\"In all my training, the current discussions are the first time I ever heard that argument used\"). Said Adams: \"I have never known anyone in a leadership position in the military who would condone torture. They would never do it. It would go against all the training we had, and against what we were trained to do, which is to uphold the Constitution and the rule of law.\" Adams had of course heard the argument as to why this longstanding military policy changed, that '9/11 changed everything.' No one needs to tell Adams what that day represents; on September 11, 2001, he was stationed in the Pentagon as Deputy Director of European Policy in the Office of the Secretary of Defense, and he assisted in recovery operations in the immediate aftermath of the attack. The pain of that day will always be with him; his voice choked recalling the destruction he witnessed, how his thoughts immediately turned to his own children and the sadness he felt thinking their world had changed forever. Emotions in the Pentagon ran very high after the attack: \"Of course there was a lot of emotion,\" said Adams, \"and a lot of motivation for revenge, a feeling of 'let's go get these guys.' We're only human.\" But Adams said bluntly that leaders need to make the distinction between gut level reaction and smart action. \"The reason we have leaders is to make sure we don't give in to those urges, to help us channel those emotions and remember our training.\" Adams stated, unequivocally, that the guiding principle operating in the Pentagon on September 10, 2001 was the same on September 12, 2001: respect and uphold the law. Even following the worst terrorist attack on American soil, as military leaders broke down at the memorial service held for the victims at the Pentagon, Adams insisted the intense emotion was always tempered by one thought: \"There is a role for reason.\" From the Huffington Post. Walt", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "", 
        "reply": "Marlene H. PhillipsPosted May 4, 2009 | 05:29 PM (EST) Retired Brigadier General: Those Who Approved Torture \"Must Be Held Accountable\" Retired Brigadier General John Adams has something in common with his namesake and distant relative. Like the second president of the United States, the retired brigadier general adheres to one basic principle in his professional actions and beliefs: defend and uphold the Constitution of the United States. He stands convinced that those that have acted in a way that would, as he put it, \"triage the Constitution\" must be brought to justice, including those who approved of and authorized the use of torture on U.S. held detainees. John Adams understands the gathering of intelligence, having served thirty-plus years in the military in numerous capacities around the world including as a U.S. Army Military Intelligence Officer. Adams was also a distinguished graduate of the Intelligence Officer Basic Tactical Course at the United States Army Intelligence Center in 1977. In my interview with Adams, he made clear that during all his years of service and training, including his tenure as a professor at West Point, what he learned and what he taught was consistent: the United States military always acts under the rule of law, in accordance with the Geneva Convention, and upholds the Constitution. What was not taught, or even discussed, were terms like harsh or enhanced interrogation techniques (\"I never heard those terms used\"), or arguments concerning what constitutes a so-called unique enemy (\"In all my training, the current discussions are the first time I ever heard that argument used\"). Said Adams: \"I have never known anyone in a leadership position in the military who would condone torture. They would never do it. It would go against all the training we had, and against what we were trained to do, which is to uphold the Constitution and the rule of law.\" Adams had of course heard the argument as to why this longstanding military policy changed, that '9/11 changed everything.' No one needs to tell Adams what that day represents; on September 11, 2001, he was stationed in the Pentagon as Deputy Director of European Policy in the Office of the Secretary of Defense, and he assisted in recovery operations in the immediate aftermath of the attack. The pain of that day will always be with him; his voice choked recalling the destruction he witnessed, how his thoughts immediately turned to his own children and the sadness he felt thinking their world had changed forever. Emotions in the Pentagon ran very high after the attack: \"Of course there was a lot of emotion,\" said Adams, \"and a lot of motivation for revenge, a feeling of 'let's go get these guys.' We're only human.\" But Adams said bluntly that leaders need to make the distinction between gut level reaction and smart action. \"The reason we have leaders is to make sure we don't give in to those urges, to help us channel those emotions and remember our training.\" Adams stated, unequivocally, that the guiding principle operating in the Pentagon on September 10, 2001 was the same on September 12, 2001: respect and uphold the law. Even following the worst terrorist attack on American soil, as military leaders broke down at the memorial service held for the victims at the Pentagon, Adams insisted the intense emotion was always tempered by one thought: \"There is a role for reason.\" From the Huffington Post. Walt", 
        "threadID": "672198221_3520035222001", 
        "time": "2009-05-05 05:28:00", 
        "title": "Retired Brigadier General: Those Who Approved Torture \"Must Be Held Accountable\"", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "I agree General. Those who approved torture must be put to death.", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "", 
        "reply": "I agree General. Those who approved torture must be put to death.", 
        "threadID": "672198221_3520035222001", 
        "time": "2009-05-05 05:33:00", 
        "title": "Retired Brigadier General: Those Who Approved Torture \"Must Be Held Accountable\"", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Those Who Approved Torture \"Must Be Held Accountable\" And in a perfect world: \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 3, 
        "quote": "Those Who Approved Torture \"Must Be Held Accountable\"", 
        "reply": " And in a perfect world: \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3520035222001", 
        "time": "2009-05-05 05:40:00", 
        "title": "Retired Brigadier General: Those Who Approved Torture \"Must Be Held Accountable\"", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I agree General. Those who approved torture must be put to death. Well the Convention on Torture signed by Pres. Reagan just says: Article 4 Each State Party shall ensure that all acts of torture are offences under its criminal law. The same shall apply to an attempt to commit torture and to an act by any person which constitutes complicity or participation in torture. Each State Party shall make these offences punishable by appropriate penalties which take into account their grave nature.\" So death may or may not be appropriate. On the other hand, these offenses by Bush Administration officials were flgrant and repetetive. Walt", 
        "intTime": 20090505, 
        "postID": 4, 
        "quote": "Originally posted by Duster6: I agree General. Those who approved torture must be put to death.", 
        "reply": " Well the Convention on Torture signed by Pres. Reagan just says: Article 4 Each State Party shall ensure that all acts of torture are offences under its criminal law. The same shall apply to an attempt to commit torture and to an act by any person which constitutes complicity or participation in torture. Each State Party shall make these offences punishable by appropriate penalties which take into account their grave nature.\" So death may or may not be appropriate. On the other hand, these offenses by Bush Administration officials were flgrant and repetetive. Walt", 
        "threadID": "672198221_3520035222001", 
        "time": "2009-05-05 05:44:00", 
        "title": "Retired Brigadier General: Those Who Approved Torture \"Must Be Held Accountable\"", 
        "userID": "WhiskeyPapa"
    }
]