[
    {
        "content": "Obama promises to post the porkulus bill on the web for 48 hours so Americans have a chance to review it, but then doesn't; Obama promises to eliminate pork-barrel projects in spending legislation, but allows over 9,000 earmarks in the porkulus bill; the democrats vote overwhelmingly to pass the porkulus bill without even reading it; now Obama says he wants to leave oversight up to taxpayers by tracking the spending. He says he will post the information at the Recovery Act website possibly next year (but really never). quote: So just who's tracking that $787 billion in taxpayer money that President Obama and the Democrat-led Congress are doling out? You are. Or you're supposed to be, anyway. \"We are, in essence, deputizing the entire American citizenry to help with the oversight of this program,\" said Rep. Brad Miller, chairman of the House Committee on Science and Technology's subcommittee on investigations and oversight. So, too, said Earl Devaney, the ex-cop who's now chairman of the Recovery Act Accountability and Transparency Board, charged with tracking the torrent of cash now pouring out of federal coffers. \"I'm going to have millions of citizens to help me,\" he said, comparing run-of-the-mill Americans to inspectors general, the high-ranking officials charged with ferreting out waste and abuse in federal agencies. \"I'm going to have a million little IGs running around,\" the chairman said Tuesday after his testimony before the subcommittee. And perhaps that's just as well, given the turnout of the panel tasked with keeping track of thousands of millions of dollars. Just three of the 10 members bothered to show up for the subcommittee's second meeting, dramatically titled \"Follow the Money Part II.\" \"These hearings are titled 'follow the money' after the character in the movie - and the book - 'All the President's Men,' \" Mr. Miller said. \"The Deep Throat character, he told [reporters Carl] Bernstein and [Bob] Woodward to trace the money back to find out where the corruption began. \"We hope this will not end up as anything as sordid as that was,\" he joked. Still, the North Carolina Democrat said he realized that tracking so much money will be difficult, acknowledging that \"we're trying to spend $500 billion quickly.\" Mr. Devaney, though, said his board - made up of 10 IGs - has a dual mission: \"First, the board is responsible for establishing and maintaining a Web site.\" Oh, and second, it's supposed to \"help minimize fraud, waste or mismanagement.\" Corrected paragraph: While Mr. Miller and the panel's top Republican were there, only Rep. Kathy Dahlkemper, Pennsylvania Democrats, came to the hearing. Absent were Democratic Reps. Steven R. Rothman of New Jersey, Lincoln Davis of Tennessee, Charles A. Wilson of Ohio, Alan Grayson of Florida and Bart Gordon of Tennessee. Republican Rep. Ralph M. Hall of Texas also skipped the session, while Rep. Brian P. Bilbray of California dropped by for the final hour of the nearly three-hour hearing. Still, to a sparse crowd, Mr. Miller got right to the point. \"President Obama promised a level of transparency, through the Internet, Recovery.gov. ... How do you intend to provide that level of transparency, to see how - who actually got the contract to pour asphalt?\" \"As I mentioned in my testimony,\" Mr. Devaney said, \"that Web site is evolving. ... I would probably be the first to admit today the Web site doesn't give you that kind of information.\" Rep. Paul Broun of Georgia, the subcommittee's ranking Republican, noted that he voted against the $787 billion stimulus plan. \"Simply put, the American people need to know what they got for their money,\" he said. \"Under the Obama budget, the national debt will double in five years and triple in 10.\" Mr. Broun was most interested in Mr. Obama's claim that the recovery plan would create \"or save\" 4 million jobs, but noted that the number of jobs \"saved\" is likely unknowable and that since the president took office, 1.3 million jobs have been lost. \"How do you plan to verify the actual number of jobs created?\" he asked. \"Sir, we haven't really received any information about that on the Web site,\" Mr. Devaney said. The repeated lack of information, though, sets up a fantastic sequel: \"Follow the Money III.\" Source: \"http://washingtontimes.com/news/2009/may/06/stimulus-oversight-left-up-to-taxpayers/\" \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "So just who's tracking that $787 billion in taxpayer money that President Obama and the Democrat-led Congress are doling out? You are. Or you're supposed to be, anyway. \"We are, in essence, deputizing the entire American citizenry to help with the oversight of this program,\" said Rep. Brad Miller, chairman of the House Committee on Science and Technology's subcommittee on investigations and oversight. So, too, said Earl Devaney, the ex-cop who's now chairman of the Recovery Act Accountability and Transparency Board, charged with tracking the torrent of cash now pouring out of federal coffers. \"I'm going to have millions of citizens to help me,\" he said, comparing run-of-the-mill Americans to inspectors general, the high-ranking officials charged with ferreting out waste and abuse in federal agencies. \"I'm going to have a million little IGs running around,\" the chairman said Tuesday after his testimony before the subcommittee. And perhaps that's just as well, given the turnout of the panel tasked with keeping track of thousands of millions of dollars. Just three of the 10 members bothered to show up for the subcommittee's second meeting, dramatically titled \"Follow the Money Part II.\" \"These hearings are titled 'follow the money' after the character in the movie - and the book - 'All the President's Men,' \" Mr. Miller said. \"The Deep Throat character, he told [reporters Carl] Bernstein and [Bob] Woodward to trace the money back to find out where the corruption began. \"We hope this will not end up as anything as sordid as that was,\" he joked. Still, the North Carolina Democrat said he realized that tracking so much money will be difficult, acknowledging that \"we're trying to spend $500 billion quickly.\" Mr. Devaney, though, said his board - made up of 10 IGs - has a dual mission: \"First, the board is responsible for establishing and maintaining a Web site.\" Oh, and second, it's supposed to \"help minimize fraud, waste or mismanagement.\" Corrected paragraph: While Mr. Miller and the panel's top Republican were there, only Rep. Kathy Dahlkemper, Pennsylvania Democrats, came to the hearing. Absent were Democratic Reps. Steven R. Rothman of New Jersey, Lincoln Davis of Tennessee, Charles A. Wilson of Ohio, Alan Grayson of Florida and Bart Gordon of Tennessee. Republican Rep. Ralph M. Hall of Texas also skipped the session, while Rep. Brian P. Bilbray of California dropped by for the final hour of the nearly three-hour hearing. Still, to a sparse crowd, Mr. Miller got right to the point. \"President Obama promised a level of transparency, through the Internet, Recovery.gov. ... How do you intend to provide that level of transparency, to see how - who actually got the contract to pour asphalt?\" \"As I mentioned in my testimony,\" Mr. Devaney said, \"that Web site is evolving. ... I would probably be the first to admit today the Web site doesn't give you that kind of information.\" Rep. Paul Broun of Georgia, the subcommittee's ranking Republican, noted that he voted against the $787 billion stimulus plan. \"Simply put, the American people need to know what they got for their money,\" he said. \"Under the Obama budget, the national debt will double in five years and triple in 10.\" Mr. Broun was most interested in Mr. Obama's claim that the recovery plan would create \"or save\" 4 million jobs, but noted that the number of jobs \"saved\" is likely unknowable and that since the president took office, 1.3 million jobs have been lost. \"How do you plan to verify the actual number of jobs created?\" he asked. \"Sir, we haven't really received any information about that on the Web site,\" Mr. Devaney said. The repeated lack of information, though, sets up a fantastic sequel: \"Follow the Money III.\"", 
        "reply": "Obama promises to post the porkulus bill on the web for 48 hours so Americans have a chance to review it, but then doesn't; Obama promises to eliminate pork-barrel projects in spending legislation, but allows over 9,000 earmarks in the porkulus bill; the democrats vote overwhelmingly to pass the porkulus bill without even reading it; now Obama says he wants to leave oversight up to taxpayers by tracking the spending. He says he will post the information at the Recovery Act website possibly next year (but really never).  Source: \"http://washingtontimes.com/news/2009/may/06/stimulus-oversight-left-up-to-taxpayers/\" \"The World's Finest\"", 
        "threadID": "672198221_3320046222001", 
        "time": "2009-05-06 10:14:00", 
        "title": "Stimulus Oversight Left Up To Taxpayers?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "If he posts this, you o-bots might want to go through it to see where your mortgage payments and free gas are... \"The World's Finest\"", 
        "intTime": 20090507, 
        "postID": 2, 
        "quote": "", 
        "reply": "If he posts this, you o-bots might want to go through it to see where your mortgage payments and free gas are... \"The World's Finest\"", 
        "threadID": "672198221_3320046222001", 
        "time": "2009-05-07 05:09:00", 
        "title": "Stimulus Oversight Left Up To Taxpayers?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Change is a com'n.....(repeat for 4 yrs) and open your eyes... Already past the future", 
        "intTime": 20090507, 
        "postID": 3, 
        "quote": "", 
        "reply": "Change is a com'n.....(repeat for 4 yrs) and open your eyes... Already past the future", 
        "threadID": "672198221_3320046222001", 
        "time": "2009-05-07 05:12:00", 
        "title": "Stimulus Oversight Left Up To Taxpayers?", 
        "userID": "6486143"
    }, 
    {
        "content": "48 hours?? That really isn't a very long time for folks to review these things.", 
        "intTime": 20090507, 
        "postID": 4, 
        "quote": "", 
        "reply": "48 hours?? That really isn't a very long time for folks to review these things.", 
        "threadID": "672198221_3320046222001", 
        "time": "2009-05-07 07:05:00", 
        "title": "Stimulus Oversight Left Up To Taxpayers?", 
        "userID": "3678131"
    }
]