[
    {
        "content": "quote: LONDON, March 16 (Reuters) - A group of leading judges and investigators called on Monday for a \"prompt, independent and impartial\" investigation into allegations of war crimes committed during Israel's conflict in Gaza earlier this year. In a letter to the secretary general of the United Nations, the 16 signatories, including Richard Goldstone, a former chief prosecutor for Yugoslavia and Rwanda, and Nobel laureate Archbishop Desmond Tutu, said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says. \"Without setting the record straight in a credible and impartial manner, it will be difficult for those communities that have borne the heavy cost of violence to move beyond the terrible aftermath of conflict. \"A prompt, independent and impartial investigation would provide a public record of gross violations of international humanitarian law committed and provide recommendations on how those responsible for crimes should be held to account.\" Israel launched a three-week offensive in Gaza on Dec. 27, 2008, saying the land, sea and aerial attack was designed to put a stop to the firing of rockets across the border into southern Israel by militant groups, including Hamas. A Palestinian human rights group said last week its own investigation had shown that 1,434 Gazans were killed during the conflict, including 960 civilians, 239 police officers and 235 fighters. Among the civilians were 288 children and 121 women. In response to those findings, an Israeli military spokesman said the army had \"made every effort to minimise harm to the civilian population\". Thirteen Israelis were killed during the war, including 3 hit by rockets fired into Israel. +http://www.reuters.com/article/latestCrisis/idUSLF572446", 
        "intTime": 20090315, 
        "postID": 1, 
        "quote": "LONDON, March 16 (Reuters) - A group of leading judges and investigators called on Monday for a \"prompt, independent and impartial\" investigation into allegations of war crimes committed during Israel's conflict in Gaza earlier this year. In a letter to the secretary general of the United Nations, the 16 signatories, including Richard Goldstone, a former chief prosecutor for Yugoslavia and Rwanda, and Nobel laureate Archbishop Desmond Tutu, said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says. \"Without setting the record straight in a credible and impartial manner, it will be difficult for those communities that have borne the heavy cost of violence to move beyond the terrible aftermath of conflict. \"A prompt, independent and impartial investigation would provide a public record of gross violations of international humanitarian law committed and provide recommendations on how those responsible for crimes should be held to account.\" Israel launched a three-week offensive in Gaza on Dec. 27, 2008, saying the land, sea and aerial attack was designed to put a stop to the firing of rockets across the border into southern Israel by militant groups, including Hamas. A Palestinian human rights group said last week its own investigation had shown that 1,434 Gazans were killed during the conflict, including 960 civilians, 239 police officers and 235 fighters. Among the civilians were 288 children and 121 women. In response to those findings, an Israeli military spokesman said the army had \"made every effort to minimise harm to the civilian population\". Thirteen Israelis were killed during the war, including 3 hit by rockets fired into Israel.", 
        "reply": " +http://www.reuters.com/article/latestCrisis/idUSLF572446", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-15 20:10:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "intTime": 20090316, 
        "postID": 2, 
        "quote": "", 
        "reply": "Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 08:33:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "intTime": 20090316, 
        "postID": 3, 
        "quote": "Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "reply": "", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 09:00:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense. said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says.", 
        "intTime": 20090316, 
        "postID": 4, 
        "quote": "Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "reply": " said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 09:34:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with?", 
        "intTime": 20090316, 
        "postID": 5, 
        "quote": "", 
        "reply": "It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with?", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 11:02:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele.", 
        "intTime": 20090316, 
        "postID": 6, 
        "quote": "", 
        "reply": "Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 11:37:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....) At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm", 
        "intTime": 20090316, 
        "postID": 7, 
        "quote": "EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....)", 
        "reply": " At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 12:50:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....) At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them.", 
        "intTime": 20090316, 
        "postID": 8, 
        "quote": "Originally posted by Knele: quote: EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....) At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm", 
        "reply": " The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 14:05:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them. I understand, but I’ve long stopped believing in miracles…..", 
        "intTime": 20090316, 
        "postID": 9, 
        "quote": "Originally posted by PhoenixDark: The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them.", 
        "reply": " I understand, but I’ve long stopped believing in miracles…..", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 14:44:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele. Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those.", 
        "intTime": 20090317, 
        "postID": 10, 
        "quote": "Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele.", 
        "reply": " Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 07:20:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with? The usual suspects...", 
        "intTime": 20090317, 
        "postID": 11, 
        "quote": "Originally posted by LineDoggie: It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with?", 
        "reply": " The usual suspects...", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 07:28:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though!", 
        "intTime": 20090317, 
        "postID": 12, 
        "quote": "", 
        "reply": "Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though!", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 10:04:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though! You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction.", 
        "intTime": 20090317, 
        "postID": 13, 
        "quote": "Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though!", 
        "reply": " You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 13:33:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though! You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. That’s your story and you’re sticking to it? The entire world is out to get them!? Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction. Camp David Summit I cannot possibly imagine why Arafat would refuse below terms! -73% of the West Bank (27% less than the 1993 agreed Green Line borders) -Refugees (some 700,000) would not be allowed to return to (their homes) in present day Israel! -West Bank would be separated by a road from Jerusalem to the Dead Sea Palestinians would have free passage, at Israeli discretion of course. -Give up Jerusalem in exchange for “surrounding villages”. -Israeli Early warning stations inside the Palestinian state -Israeli control of Palestinian airspace -The right of Israel to deploy troops in the Palestinian state -Palestinian state was to be demilitarized So, how was their situation going to change from what it is now? What concessions was Israel planing on making? Camp David Summit was equivalent to buying a car at the dealership! Car is worth $20,000 but when you get there it’s priced at $24,000; hence you spend the next 3 hours talking them down to $20,000.....dealer gets what he originaly wanted without any compromise, and the buyer gets the illusion of a “getting a great deal”! This message has been edited. Last edited by: Knele, Thu 19 March 2009 05:51 AM", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though! You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. That’s your story and you’re sticking to it? The entire world is out to get them!? Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction. Camp David Summit I cannot possibly imagine why Arafat would refuse below terms! -73% of the West Bank (27% less than the 1993 agreed Green Line borders) -Refugees (some 700,000) would not be allowed to return to (their homes) in present day Israel! -West Bank would be separated by a road from Jerusalem to the Dead Sea Palestinians would have free passage, at Israeli discretion of course. -Give up Jerusalem in exchange for “surrounding villages”. -Israeli Early warning stations inside the Palestinian state -Israeli control of Palestinian airspace -The right of Israel to deploy troops in the Palestinian state -Palestinian state was to be demilitarized So, how was their situation going to change from what it is now? What concessions was Israel planing on making?", 
        "reply": " Camp David Summit was equivalent to buying a car at the dealership! Car is worth $20,000 but when you get there it’s priced at $24,000; hence you spend the next 3 hours talking them down to $20,000.....dealer gets what he originaly wanted without any compromise, and the buyer gets the illusion of a “getting a great deal”! This message has been edited. Last edited by: Knele, Thu 19 March 2009 05:51 AM", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 05:10:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele. Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those. They could have been easily charged with \"soldiering in civil uniform\". I believe that there is a law against it. Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip.", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "Originally posted by popsiq: quote: Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele. Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those.", 
        "reply": " They could have been easily charged with \"soldiering in civil uniform\". I believe that there is a law against it. Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 12:07:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip. I’m not sure where you are getting that information (rhetorical, I do ), but last year’s Human Rights Watch World report included over 75 countries. Including: Burma, China, Cuba, Eritrea, Libya, Iran, North Korea, Saudi Arabia, Vietnam....etc. +http://www.hrw.org/sites/default/files/reports/wr2k8_web.pdf", 
        "intTime": 20090319, 
        "postID": 16, 
        "quote": "Originally posted by PanzerMeister: Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip.", 
        "reply": " I’m not sure where you are getting that information (rhetorical, I do ), but last year’s Human Rights Watch World report included over 75 countries. Including: Burma, China, Cuba, Eritrea, Libya, Iran, North Korea, Saudi Arabia, Vietnam....etc. +http://www.hrw.org/sites/default/files/reports/wr2k8_web.pdf", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 12:43:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76?", 
        "intTime": 20090319, 
        "postID": 17, 
        "quote": "", 
        "reply": "....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76?", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 13:37:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "UN consists of 191 member states of course there are more than that Taiwan for one had its UN seat taken away in 1971 to appease the Chicoms", 
        "intTime": 20090319, 
        "postID": 18, 
        "quote": "", 
        "reply": "UN consists of 191 member states of course there are more than that Taiwan for one had its UN seat taken away in 1971 to appease the Chicoms", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 13:41:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: ....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76? What are you talking about? 75 countries were listed as having some issues with human rights(Raging from downright oppression to benign issues)?! There are 195 countries in the world (recognized by the UN or not)!", 
        "intTime": 20090319, 
        "postID": 19, 
        "quote": "Originally posted by PanzerMeister: ....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76?", 
        "reply": " What are you talking about? 75 countries were listed as having some issues with human rights(Raging from downright oppression to benign issues)?! There are 195 countries in the world (recognized by the UN or not)!", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 13:43:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "Oops, my mistake. I have somehow read \"75 times\" not 75 states.", 
        "intTime": 20090319, 
        "postID": 20, 
        "quote": "", 
        "reply": "Oops, my mistake. I have somehow read \"75 times\" not 75 states.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 14:05:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: LONDON, March 16 (Reuters) - A group of leading judges and investigators called on Monday for a \"prompt, independent and impartial\" investigation into allegations of war crimes committed during Israel's conflict in Gaza earlier this year. In a letter to the secretary general of the United Nations, the 16 signatories, including Richard Goldstone, a former chief prosecutor for Yugoslavia and Rwanda, and Nobel laureate Archbishop Desmond Tutu, said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says. \"Without setting the record straight in a credible and impartial manner, it will be difficult for those communities that have borne the heavy cost of violence to move beyond the terrible aftermath of conflict. \"A prompt, independent and impartial investigation would provide a public record of gross violations of international humanitarian law committed and provide recommendations on how those responsible for crimes should be held to account.\" Israel launched a three-week offensive in Gaza on Dec. 27, 2008, saying the land, sea and aerial attack was designed to put a stop to the firing of rockets across the border into southern Israel by militant groups, including Hamas. A Palestinian human rights group said last week its own investigation had shown that 1,434 Gazans were killed during the conflict, including 960 civilians, 239 police officers and 235 fighters. Among the civilians were 288 children and 121 women. In response to those findings, an Israeli military spokesman said the army had \"made every effort to minimise harm to the civilian population\". Thirteen Israelis were killed during the war, including 3 hit by rockets fired into Israel. +http://www.reuters.com/article/latestCrisis/idUSLF572446", 
        "intTime": 20090315, 
        "postID": 21, 
        "quote": "LONDON, March 16 (Reuters) - A group of leading judges and investigators called on Monday for a \"prompt, independent and impartial\" investigation into allegations of war crimes committed during Israel's conflict in Gaza earlier this year. In a letter to the secretary general of the United Nations, the 16 signatories, including Richard Goldstone, a former chief prosecutor for Yugoslavia and Rwanda, and Nobel laureate Archbishop Desmond Tutu, said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says. \"Without setting the record straight in a credible and impartial manner, it will be difficult for those communities that have borne the heavy cost of violence to move beyond the terrible aftermath of conflict. \"A prompt, independent and impartial investigation would provide a public record of gross violations of international humanitarian law committed and provide recommendations on how those responsible for crimes should be held to account.\" Israel launched a three-week offensive in Gaza on Dec. 27, 2008, saying the land, sea and aerial attack was designed to put a stop to the firing of rockets across the border into southern Israel by militant groups, including Hamas. A Palestinian human rights group said last week its own investigation had shown that 1,434 Gazans were killed during the conflict, including 960 civilians, 239 police officers and 235 fighters. Among the civilians were 288 children and 121 women. In response to those findings, an Israeli military spokesman said the army had \"made every effort to minimise harm to the civilian population\". Thirteen Israelis were killed during the war, including 3 hit by rockets fired into Israel.", 
        "reply": " +http://www.reuters.com/article/latestCrisis/idUSLF572446", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-15 20:10:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "intTime": 20090316, 
        "postID": 22, 
        "quote": "", 
        "reply": "Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 08:33:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "intTime": 20090316, 
        "postID": 23, 
        "quote": "Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "reply": "", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 09:00:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense. said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says.", 
        "intTime": 20090316, 
        "postID": 24, 
        "quote": "Originally posted by rayevinsonsr: Not one word about Hamas? Just one line even suggesting both sides have accountability? First and foremost the ones that initial action drew fire that consume those around them is the responsible party. It's not brain surgery, it's common sense.", 
        "reply": " said both sides in the conflict had allegations to answer for and needed to be held to account. \"Allegations of serious violations of the laws of war have emerged throughout the latest Gaza conflict, relating to conduct and actions by both the Israeli military and by the Palestinian armed groups,\" the letter says.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 09:34:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with?", 
        "intTime": 20090316, 
        "postID": 25, 
        "quote": "", 
        "reply": "It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with?", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 11:02:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele.", 
        "intTime": 20090316, 
        "postID": 26, 
        "quote": "", 
        "reply": "Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 11:37:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....) At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm", 
        "intTime": 20090316, 
        "postID": 27, 
        "quote": "EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....)", 
        "reply": " At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 12:50:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....) At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them.", 
        "intTime": 20090316, 
        "postID": 28, 
        "quote": "Originally posted by Knele: quote: EU Links Israel Ties to Two-State Solution The European Union says its relations with Israel will depend on the Jewish state's commitment to a two-state solution to the Israeli-Palestinian conflict. EU foreign policy chief Javier Solana urged Israel's Prime Minister-designate Benjamin Netanyahu Monday to craft a government that will embrace the long-standing goal of an independent Palestinian state living side by side with Israel. Netanyahu's Likud party Sunday secured its first coalition partner, the ultra-right Yisrael Beitenu party, which favors reducing the land available to Palestinians in any final settlement. Israeli media report that Yisrael Beitenu secured leadership of the foreign ministry along with the ministries of internal security, infrastructure, tourism and integration of new immigrants. Also Monday, a group of international war crimes experts called on the United Nations to look into allegations that both Israeli forces and Palestinian militants in the Gaza Strip violated humanitarian law during their recent war. Among those who signed an open letter to U.N. Secretary General Ban Ki-moon are Nobel Laureate Archbishop Desmond Tutu and the former chief prosecutor for war crimes in Yugoslavia and Rwanda Richard Goldstone. Asked about the letter, a spokeswoman for Mr. Ban said he is waiting for a report from a board of inquiry he set up to look into a number of incidents during the conflict. She said Mr. Ban expects the investigation will be finished by the end of the month and he will decide then what, if any, further steps to take. (....) At least somebody is willing to put some pressure on Israel..... +http://www.voanews.com/english/2009-03-16-voa73.cfm", 
        "reply": " The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 14:05:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them. I understand, but I’ve long stopped believing in miracles…..", 
        "intTime": 20090316, 
        "postID": 29, 
        "quote": "Originally posted by PhoenixDark: The only thing that would put pressure on Israel would be for the US to cut off all arms shipments, spare parts, and Foreign Military Aid payments to them.", 
        "reply": " I understand, but I’ve long stopped believing in miracles…..", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-16 14:44:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele. Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those.", 
        "intTime": 20090317, 
        "postID": 30, 
        "quote": "Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele.", 
        "reply": " Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 07:20:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with? The usual suspects...", 
        "intTime": 20090317, 
        "postID": 31, 
        "quote": "Originally posted by LineDoggie: It will be simply another Durban, full of \"The evil jooooose did it\" from the usual cast of suspects, and cheered on by the usual cast of fellow travelers like those who post at the end of their posts. Hamas will not be held accountable, as the Impartial investigators will be carefully chosen to spin the Anti-Israel slant to the proceedings. It would be like the Bull Conner investigating whether the Klan or the Blacks were guilty of Violence WOnder who they would side with?", 
        "reply": " The usual suspects...", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 07:28:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though!", 
        "intTime": 20090317, 
        "postID": 32, 
        "quote": "", 
        "reply": "Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though!", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 10:04:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though! You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction.", 
        "intTime": 20090317, 
        "postID": 33, 
        "quote": "Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though!", 
        "reply": " You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-17 13:33:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though! You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. That’s your story and you’re sticking to it? The entire world is out to get them!? Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction. Camp David Summit I cannot possibly imagine why Arafat would refuse below terms! -73% of the West Bank (27% less than the 1993 agreed Green Line borders) -Refugees (some 700,000) would not be allowed to return to (their homes) in present day Israel! -West Bank would be separated by a road from Jerusalem to the Dead Sea Palestinians would have free passage, at Israeli discretion of course. -Give up Jerusalem in exchange for “surrounding villages”. -Israeli Early warning stations inside the Palestinian state -Israeli control of Palestinian airspace -The right of Israel to deploy troops in the Palestinian state -Palestinian state was to be demilitarized So, how was their situation going to change from what it is now? What concessions was Israel planing on making? Camp David Summit was equivalent to buying a car at the dealership! Car is worth $20,000 but when you get there it’s priced at $24,000; hence you spend the next 3 hours talking them down to $20,000.....dealer gets what he originaly wanted without any compromise, and the buyer gets the illusion of a “getting a great deal”! This message has been edited. Last edited by: Knele, Thu 19 March 2009 05:51 AM", 
        "intTime": 20090319, 
        "postID": 34, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by Knele: Two apologists and one perpetrator....talking smack, but no comment on the words of some of the worlds most renowned diplomats! No surprise, though! You need to lower the price of the popcorn it's out of reach for most of us. Being able to read since the age of five I understand what your link was saying, but they have only one they would prosecute or take action against. As you know the UN is the harbor of propaganda and venue to harass Israel. That’s your story and you’re sticking to it? The entire world is out to get them!? Not to mention being a dark cloud over the mideast keeping Palestine in the 10th century. Not only the US but Europe and even Russia has spent time and money trying aid this region. Recent evidence of the big guns in the neighborhood accepting an equal place at the table and not dictating as the leader of Arab league shows promise. Second part of the equation, by nullifying Israel right to defend themselves and holding military upgrades you're not only putting them at risk but the many Arab nations that we supply more goods and revenue also. They would be subject to being inferior to neighbors as Somalia, Rwanda, and unfriendlies like Iran or Zimbabwee. Or , limiting the Jew/Arab population of Israel as a subservient? Not very well thought out plan on someones part. The two State theory was first floated by a guy named Bill. President Clinton suggested this publicly for the first time and was shot down by not only the opposition but his party. Finally, the idea caught on he busted his butt on pulling it off but the little ratfink Arafat was already planning infatada dos. That's nine years ago and yet no one assigns responsibility to the originator of the latest version of death and destruction. Camp David Summit I cannot possibly imagine why Arafat would refuse below terms! -73% of the West Bank (27% less than the 1993 agreed Green Line borders) -Refugees (some 700,000) would not be allowed to return to (their homes) in present day Israel! -West Bank would be separated by a road from Jerusalem to the Dead Sea Palestinians would have free passage, at Israeli discretion of course. -Give up Jerusalem in exchange for “surrounding villages”. -Israeli Early warning stations inside the Palestinian state -Israeli control of Palestinian airspace -The right of Israel to deploy troops in the Palestinian state -Palestinian state was to be demilitarized So, how was their situation going to change from what it is now? What concessions was Israel planing on making?", 
        "reply": " Camp David Summit was equivalent to buying a car at the dealership! Car is worth $20,000 but when you get there it’s priced at $24,000; hence you spend the next 3 hours talking them down to $20,000.....dealer gets what he originaly wanted without any compromise, and the buyer gets the illusion of a “getting a great deal”! This message has been edited. Last edited by: Knele, Thu 19 March 2009 05:51 AM", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 05:10:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele. Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those. They could have been easily charged with \"soldiering in civil uniform\". I believe that there is a law against it. Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip.", 
        "intTime": 20090319, 
        "postID": 35, 
        "quote": "Originally posted by popsiq: quote: Originally posted by PanzerMeister: Hamas \"Police officers\" are terrorist in half civil camouflage. The same can be said of the children that died there and women, only their camouflage was completely civil. BTDTST. Give me a break Knele. Generally civilians, or even half-civilian police, don't get charged with 'war crimes'. Members of military organizations or their political 'commanders' do those.", 
        "reply": " They could have been easily charged with \"soldiering in civil uniform\". I believe that there is a law against it. Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 12:07:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip. I’m not sure where you are getting that information (rhetorical, I do ), but last year’s Human Rights Watch World report included over 75 countries. Including: Burma, China, Cuba, Eritrea, Libya, Iran, North Korea, Saudi Arabia, Vietnam....etc. +http://www.hrw.org/sites/default/files/reports/wr2k8_web.pdf", 
        "intTime": 20090319, 
        "postID": 36, 
        "quote": "Originally posted by PanzerMeister: Knele-Explain to me the following thing-Why almost each session the committee of human rights (that has such states as Libya in it), accuses Israel, and COMPLETELY ignores the rest of the world? The world is not only Gaza strip.", 
        "reply": " I’m not sure where you are getting that information (rhetorical, I do ), but last year’s Human Rights Watch World report included over 75 countries. Including: Burma, China, Cuba, Eritrea, Libya, Iran, North Korea, Saudi Arabia, Vietnam....etc. +http://www.hrw.org/sites/default/files/reports/wr2k8_web.pdf", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 12:43:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76?", 
        "intTime": 20090319, 
        "postID": 37, 
        "quote": "", 
        "reply": "....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76?", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 13:37:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "UN consists of 191 member states of course there are more than that Taiwan for one had its UN seat taken away in 1971 to appease the Chicoms", 
        "intTime": 20090319, 
        "postID": 38, 
        "quote": "", 
        "reply": "UN consists of 191 member states of course there are more than that Taiwan for one had its UN seat taken away in 1971 to appease the Chicoms", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 13:41:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: ....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76? What are you talking about? 75 countries were listed as having some issues with human rights(Raging from downright oppression to benign issues)?! There are 195 countries in the world (recognized by the UN or not)!", 
        "intTime": 20090319, 
        "postID": 39, 
        "quote": "Originally posted by PanzerMeister: ....And that is why USA have issued a statement to this effect more or less \"Have it more balanced please\". 75 out of how many? 1000? 100? 76?", 
        "reply": " What are you talking about? 75 countries were listed as having some issues with human rights(Raging from downright oppression to benign issues)?! There are 195 countries in the world (recognized by the UN or not)!", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 13:43:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "Knele"
    }, 
    {
        "content": "Oops, my mistake. I have somehow read \"75 times\" not 75 states.", 
        "intTime": 20090319, 
        "postID": 40, 
        "quote": "", 
        "reply": "Oops, my mistake. I have somehow read \"75 times\" not 75 states.", 
        "threadID": "672198221_6710089712001", 
        "time": "2009-03-19 14:05:00", 
        "title": "Justice experts seek Israel-Gaza war crimes inquiry", 
        "userID": "PanzerMeister"
    }
]