[
    {
        "content": "So Kim Jong Il finally allowed some freedoms or is this just another jury-rigged election to give the appearance of legtitimacy? From: Agence France-Presse - 3/8/2009 12:10 PM GMT quote: NKoreans vote in election seen as clue to succession North Koreans voted on Sunday in elections for a new parliament which analysts say could pave the way for an eventual transition of power in the impoverished communist nation. The vote is also being closely monitored around the world for clues as to whether the state, which tested an atomic weapon in October 2006, will soften its stance in international negotiations and dismantle its nuclear arsenal. Voting to the rubber-stamp parliament did not take place in 2008 when its five-year term expired amid fevered speculation over the health of reclusive leader Kim Jong-Il . The North's television showed soldiers in uniform using both hands to politely raise and drop a ballot into a box at a Pyongyang polling station where Kim was standing. It said they were \"voting for\" Kim. Kim himself \"voted for\" an army officer at a different district in Pyongyang, said the official Korean Central News Agency which reported a 93.1 percent turnout of registered voters at 2:00pm (0500 GMT). Polling stations stayed open from 9:00am to 6:00pm, with election results likely to be announced Monday, Seoul officials said. \"All the voters are going to the polls to consolidate the people's power as firm as a rock,\" the agency said, quoting the Central Election Commission. \"I am filled with joy to think that I am able to contribute to the strengthening of the revolutionary sovereign power through my vote,\" Park Mi-Hyang, a 22-year-old worker in Pyongyang, told Kyodo news agency. Seoul and Washington say Kim Jong-Il has recovered well from a stroke he suffered in August and is in control, but his health and age have inevitably led to talk abroad about who will succeed him. He inherited power from his father, Kim Il-Sung, in the communist world's only dynastic succession. But it is unclear whether he wants one of his three sons to succeed him -- and if so, which one. \"Kim Jong-Il will turn 72 when the next election comes, and given his ageing, it is likely that an idea about a post-Kim era will be reflected in the elections this time,\" Kim Yong-Hyun, a North Korea expert and professor at Dongguk University in Seoul, told AFP. Seoul's Yonhap news agency has said the leader has named his youngest son, Jong-Un, as his successor and that the 25-year-old is running in the election. The outcome is not in doubt -- candidates are picked by the government or ruling party, and only one stands in each district. The incoming assembly will re-elect Kim, 67, who is standing in a military district, as chairman of the National Defence Commission. The commission, which supervises the 1.2 million-strong military, is the North's most powerful organ, and its new line-up will be seen as an indicator of who is moving up the ladder of power and influence. A new parliament is often the prelude to a cabinet reshuffle. Assembly members commonly hold key posts in the ruling communist party as well as in the military and government, Seoul officials say. Dongguk University's Kim said the outcome of the election would not necessarily manifest a father-to-son succession but could see \"a generation change\" in the top ranks. \"The North will likely bring in the young to replace the elderly with a future possible power transition in mind,\" he said, adding Pyongyang's power elite was overhauled in the 1998 and 2003 polls. Kim Jong-Il last month called the elections \"significant\" in terms of reviving the economy by 2012, the 100th anniversary of the birth of his father, the nation's founding president. Seoul's state-backed Institute for National Security Strategy says it expects the North to use the polls to promote people with specialist knowledge in an attempt to save the economy. (...)", 
        "intTime": 20090308, 
        "postID": 1, 
        "quote": "NKoreans vote in election seen as clue to succession North Koreans voted on Sunday in elections for a new parliament which analysts say could pave the way for an eventual transition of power in the impoverished communist nation. The vote is also being closely monitored around the world for clues as to whether the state, which tested an atomic weapon in October 2006, will soften its stance in international negotiations and dismantle its nuclear arsenal. Voting to the rubber-stamp parliament did not take place in 2008 when its five-year term expired amid fevered speculation over the health of reclusive leader Kim Jong-Il . The North's television showed soldiers in uniform using both hands to politely raise and drop a ballot into a box at a Pyongyang polling station where Kim was standing. It said they were \"voting for\" Kim. Kim himself \"voted for\" an army officer at a different district in Pyongyang, said the official Korean Central News Agency which reported a 93.1 percent turnout of registered voters at 2:00pm (0500 GMT). Polling stations stayed open from 9:00am to 6:00pm, with election results likely to be announced Monday, Seoul officials said. \"All the voters are going to the polls to consolidate the people's power as firm as a rock,\" the agency said, quoting the Central Election Commission. \"I am filled with joy to think that I am able to contribute to the strengthening of the revolutionary sovereign power through my vote,\" Park Mi-Hyang, a 22-year-old worker in Pyongyang, told Kyodo news agency. Seoul and Washington say Kim Jong-Il has recovered well from a stroke he suffered in August and is in control, but his health and age have inevitably led to talk abroad about who will succeed him. He inherited power from his father, Kim Il-Sung, in the communist world's only dynastic succession. But it is unclear whether he wants one of his three sons to succeed him -- and if so, which one. \"Kim Jong-Il will turn 72 when the next election comes, and given his ageing, it is likely that an idea about a post-Kim era will be reflected in the elections this time,\" Kim Yong-Hyun, a North Korea expert and professor at Dongguk University in Seoul, told AFP. Seoul's Yonhap news agency has said the leader has named his youngest son, Jong-Un, as his successor and that the 25-year-old is running in the election. The outcome is not in doubt -- candidates are picked by the government or ruling party, and only one stands in each district. The incoming assembly will re-elect Kim, 67, who is standing in a military district, as chairman of the National Defence Commission. The commission, which supervises the 1.2 million-strong military, is the North's most powerful organ, and its new line-up will be seen as an indicator of who is moving up the ladder of power and influence. A new parliament is often the prelude to a cabinet reshuffle. Assembly members commonly hold key posts in the ruling communist party as well as in the military and government, Seoul officials say. Dongguk University's Kim said the outcome of the election would not necessarily manifest a father-to-son succession but could see \"a generation change\" in the top ranks. \"The North will likely bring in the young to replace the elderly with a future possible power transition in mind,\" he said, adding Pyongyang's power elite was overhauled in the 1998 and 2003 polls. Kim Jong-Il last month called the elections \"significant\" in terms of reviving the economy by 2012, the 100th anniversary of the birth of his father, the nation's founding president. Seoul's state-backed Institute for National Security Strategy says it expects the North to use the polls to promote people with specialist knowledge in an attempt to save the economy. (...)", 
        "reply": "So Kim Jong Il finally allowed some freedoms or is this just another jury-rigged election to give the appearance of legtitimacy? From: Agence France-Presse - 3/8/2009 12:10 PM GMT ", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-08 14:26:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "", 
        "reply": "Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-08 14:48:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81 At least when they're told, they'd all start bailing together. That seems better than 'mobbing' up at bow and stern for some blamin' and namin' while the ship of state goes down under both parties alike. PS: The 'geezer' was re-elected.", 
        "intTime": 20090309, 
        "postID": 3, 
        "quote": "Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81", 
        "reply": " At least when they're told, they'd all start bailing together. That seems better than 'mobbing' up at bow and stern for some blamin' and namin' while the ship of state goes down under both parties alike. PS: The 'geezer' was re-elected.", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-09 07:16:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: The outcome is not in doubt -- candidates are picked by the government or ruling party, and only one stands in each district. You WILL go out and vote.... For the Person WE tell you to vote for!!!!!!! Yup, democracy in action, N.Korea!?!?! Just appoint the Communist lap-dog, and be done with it!", 
        "intTime": 20090309, 
        "postID": 4, 
        "quote": "The outcome is not in doubt -- candidates are picked by the government or ruling party, and only one stands in each district.", 
        "reply": " You WILL go out and vote.... For the Person WE tell you to vote for!!!!!!! Yup, democracy in action, N.Korea!?!?! Just appoint the Communist lap-dog, and be done with it!", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-09 12:37:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "fmfdoc451"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81 At least when they're told, they'd all start bailing together. That seems better than 'mobbing' up at bow and stern for some blamin' and namin' while the ship of state goes down under both parties alike. PS: The 'geezer' was re-elected. I haven't looked up the stats, but I would bet good money the race was close... 99.9 for Kim? Or did he win in a squeeker with only 100 percent? Dave", 
        "intTime": 20090309, 
        "postID": 5, 
        "quote": "Originally posted by popsiq: quote: Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81 At least when they're told, they'd all start bailing together. That seems better than 'mobbing' up at bow and stern for some blamin' and namin' while the ship of state goes down under both parties alike. PS: The 'geezer' was re-elected.", 
        "reply": " I haven't looked up the stats, but I would bet good money the race was close... 99.9 for Kim? Or did he win in a squeeker with only 100 percent? Dave", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-09 14:43:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81 Why do we cator to china who is just as guilty as these people?", 
        "intTime": 20090309, 
        "postID": 6, 
        "quote": "Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81", 
        "reply": " Why do we cator to china who is just as guilty as these people?", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-09 15:40:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The clone of the Glorious Leader was re-elected to his 'parliamentary' seat. No surprise there. His three sons were running for office as well. None of them got the nod.", 
        "intTime": 20090310, 
        "postID": 7, 
        "quote": "", 
        "reply": "The clone of the Glorious Leader was re-elected to his 'parliamentary' seat. No surprise there. His three sons were running for office as well. None of them got the nod.", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-10 19:49:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "popsiq"
    }, 
    {
        "content": "a north korean election please vote by filling in the circle next to the name you selected. KIM O Unknown O (you will be shot in front of your family if you circle this bubble in.Thank you from your friendly ROKA)", 
        "intTime": 20090310, 
        "postID": 8, 
        "quote": "", 
        "reply": "a north korean election please vote by filling in the circle next to the name you selected. KIM O Unknown O (you will be shot in front of your family if you circle this bubble in.Thank you from your friendly ROKA)", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-10 23:43:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81 Why do we cator to china who is just as guilty as these people? Ya think it might be that they are the only country with money to loan us to keep 'stimulating' or economy? It's like kissing your sister! !", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Know how this one goes, one, two, three, vote counted, people elected to keep Dear Leader, one vote from dissident for parliament, dissident has been shot!... Respectfully, SUNLINER81 Why do we cator to china who is just as guilty as these people?", 
        "reply": " Ya think it might be that they are the only country with money to loan us to keep 'stimulating' or economy? It's like kissing your sister! !", 
        "threadID": "672198221_5820082712001", 
        "time": "2009-03-11 06:22:00", 
        "title": "North Koreans VOTING (Yes voting) for Parliament", 
        "userID": "busnrete8"
    }
]