[
    {
        "content": "Obama Unveils Afghan Plan to Add Troops and Set Goals WASHINGTON — President Obama said on Friday that he plans to further bolster American forces in Afghanistan, increase aid to Pakistan, and for the first time set benchmarks for progress in fighting Al Qaeda and the Taliban in both chaotic countries. In strikingly ominous tones, Mr. Obama warned — just as President George W. Bush did repeatedly over the years — of intelligence estimates that al Qaeda “is actively planning attacks on the U.S. homeland from its safe haven in Pakistan.” “The situation is increasingly perilous,” he told government officials, top military officers and diplomats in remarks at the White House. He added, “We have a clear and focused goal to disrupt, dismantle and defeat al Qaeda in Pakistan and Afghanistan, and to prevent their return to either country in the future.” But President Obama promised neither to write a “blank check” nor to “blindly stay the course” if his risky new strategy does not achieve its ambitious goals. Full article at > >http://www.nytimes.com/2009/03/26/washington/28prexy.html?_r=1&hp", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama Unveils Afghan Plan to Add Troops and Set Goals WASHINGTON — President Obama said on Friday that he plans to further bolster American forces in Afghanistan, increase aid to Pakistan, and for the first time set benchmarks for progress in fighting Al Qaeda and the Taliban in both chaotic countries. In strikingly ominous tones, Mr. Obama warned — just as President George W. Bush did repeatedly over the years — of intelligence estimates that al Qaeda “is actively planning attacks on the U.S. homeland from its safe haven in Pakistan.” “The situation is increasingly perilous,” he told government officials, top military officers and diplomats in remarks at the White House. He added, “We have a clear and focused goal to disrupt, dismantle and defeat al Qaeda in Pakistan and Afghanistan, and to prevent their return to either country in the future.” But President Obama promised neither to write a “blank check” nor to “blindly stay the course” if his risky new strategy does not achieve its ambitious goals. Full article at > >http://www.nytimes.com/2009/03/26/washington/28prexy.html?_r=1&hp", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 10:59:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said.", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "", 
        "reply": "President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 11:12:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "well hell obama might as well invite them on over and stay for awhile too.... hell already letting gitmo inmates to live and get welfare in the states... come on tailban hell the head of the tailban is a gitmo ex inmate so might as well....", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "", 
        "reply": "well hell obama might as well invite them on over and stay for awhile too.... hell already letting gitmo inmates to live and get welfare in the states... come on tailban hell the head of the tailban is a gitmo ex inmate so might as well....", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 11:23:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "outlaws93"
    }, 
    {
        "content": "War Monger! Cindy is pizzed at him!", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "", 
        "reply": "War Monger! Cindy is pizzed at him!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 11:45:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said. What I find very telling is that the intelligence experts (not the political appointees at the top) are saying that we need to get information on local conditions and power structures. We have been fighting in Afganistan since Oct. 2001 why don't we already have such BASIC information?", 
        "intTime": 20090327, 
        "postID": 5, 
        "quote": "Originally posted by IHAWKER: President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said.", 
        "reply": " What I find very telling is that the intelligence experts (not the political appointees at the top) are saying that we need to get information on local conditions and power structures. We have been fighting in Afganistan since Oct. 2001 why don't we already have such BASIC information?", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 12:45:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "I wonder if he will send them into Pakistan as he alluded to during the campaign.....", 
        "intTime": 20090327, 
        "postID": 6, 
        "quote": "", 
        "reply": "I wonder if he will send them into Pakistan as he alluded to during the campaign.....", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 13:14:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "sw614"
    }, 
    {
        "content": "I don’t even need to read it; I’m just glad there finally is a plan!", 
        "intTime": 20090327, 
        "postID": 7, 
        "quote": "", 
        "reply": "I don’t even need to read it; I’m just glad there finally is a plan!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 13:23:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all.", 
        "intTime": 20090327, 
        "postID": 8, 
        "quote": "Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan!", 
        "reply": " Having a plan, even a bad plan is always better than having no plan at all.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 16:52:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan.", 
        "intTime": 20090327, 
        "postID": 9, 
        "quote": "", 
        "reply": "President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 17:03:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always!", 
        "intTime": 20090327, 
        "postID": 10, 
        "quote": "Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all.", 
        "reply": " Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 17:05:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by xerello: President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan. the war in Afganistan started in Oct 2001 and the Bush Admin had a plan in Sept 2008 (after the Demos had taken control of Congress 2 years before0. Wow what an outstanding example of how important realist planning was to the Bush admin", 
        "intTime": 20090327, 
        "postID": 11, 
        "quote": "Originally posted by xerello: President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan.", 
        "reply": " the war in Afganistan started in Oct 2001 and the Bush Admin had a plan in Sept 2008 (after the Demos had taken control of Congress 2 years before0. Wow what an outstanding example of how important realist planning was to the Bush admin", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 21:32:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always! Actually the Japanese had a good plan they just did not implement it. They were supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to hold out longer and probably gotten a negotiated peace. This message has been edited. Last edited by: rayld2, Sat 28 March 2009 08:54 AM", 
        "intTime": 20090327, 
        "postID": 12, 
        "quote": "Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always!", 
        "reply": " Actually the Japanese had a good plan they just did not implement it. They were supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to hold out longer and probably gotten a negotiated peace. This message has been edited. Last edited by: rayld2, Sat 28 March 2009 08:54 AM", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 21:36:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always! Actually the Japanese had a good plan they just did not implement it. They ere supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to put out longer and probably gotten a negotiated peace. Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan!", 
        "intTime": 20090328, 
        "postID": 13, 
        "quote": "Originally posted by rayld2: quote: Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always! Actually the Japanese had a good plan they just did not implement it. They ere supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to put out longer and probably gotten a negotiated peace.", 
        "reply": " Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-28 04:28:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related?", 
        "intTime": 20090328, 
        "postID": 14, 
        "quote": "Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan!", 
        "reply": " Are you and outlaw related?", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-28 07:09:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related? Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages.", 
        "intTime": 20090328, 
        "postID": 15, 
        "quote": "Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related?", 
        "reply": " Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-28 09:32:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related? Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages. not necessarly related to any humans!", 
        "intTime": 20090329, 
        "postID": 16, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related? Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages.", 
        "reply": " not necessarly related to any humans!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 07:39:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "EAG154"
    }, 
    {
        "content": "Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran", 
        "intTime": 20090329, 
        "postID": 17, 
        "quote": "", 
        "reply": "Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:30:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "WesLemmon"
    }, 
    {
        "content": "quote: Originally posted by WesLemmon: If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! It will take years to properly train them.....somebody needs to do the job (stem the tide of inefficiency & corruption) in the mean time!", 
        "intTime": 20090329, 
        "postID": 18, 
        "quote": "Originally posted by WesLemmon: If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense!", 
        "reply": " It will take years to properly train them.....somebody needs to do the job (stem the tide of inefficiency & corruption) in the mean time!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:53:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Obama to seek NATO support for Afghanistan plan * Obama taking message of cooperation to Europe * Gathering support on Afghanistan an 'ongoing process' * Analysts say message might be tough sell (Adds analyst quote) By Caren Bohan WASHINGTON, March 29 (Reuters) - U.S. President Barack Obama will urge European allies to support his new strategy for Afghanistan, telling NATO partners this week their security could be at risk if the country falls into chaos. Making his first major foreign trip since taking office on Jan. 20, Obama will discuss the economic crisis at the London Group of 20 summit of major economic powers on Thursday. He will then attend the NATO summit in Strasbourg, France, on Friday and Saturday, marking the alliance's 60th anniversary. Just ahead of the NATO summit, Obama has unveiled a plan for Afghanistan, where violence is at its highest level since U.S.-led forces toppled the Taliban in 2001 and where the NATO mission has been criticized for disorganization. Obama's strategy broadens the U.S. focus to include Pakistan and puts as the highest priority the defeat of al Qaeda militants who he said were plotting new attacks on the United States. He will send 4,000 more U.S. troops to help train the Afghan army and will add more civilian personnel to help tackle problems such as a booming narcotics trade and government corruption. But Obama emphasized that international cooperation was crucial to the plan's success and promised to take that message to Europe, where the public has grown increasingly impatient with the Afghanistan effort. \"The world cannot afford the price that will come due if Afghanistan slides back into chaos or al Qaeda operates unchecked,\" Obama said in a speech in Washington on Friday. \"What's at stake now is not just our own security -- it is the very idea that free nations can come together on behalf of our common security. That was the founding cause of NATO six decades ago. That must be our common purpose today,\" he added. In a shift that has been welcomed in Europe, Obama, a Democrat, has promised a more consultative foreign policy than that of his Republican predecessor, George W. Bush. His administration hopes Obama's popularity abroad will raise the profile of his push for greater support for Afghanistan. In preparing the new Afghanistan strategy, Obama launched a 60-day review that included input from European allies as well as other countries with a stake in the region. +http://www.reuters.com/article/homepageCrisis/idUSN28261439._CH_.2400", 
        "intTime": 20090329, 
        "postID": 19, 
        "quote": "Obama to seek NATO support for Afghanistan plan * Obama taking message of cooperation to Europe * Gathering support on Afghanistan an 'ongoing process' * Analysts say message might be tough sell (Adds analyst quote) By Caren Bohan WASHINGTON, March 29 (Reuters) - U.S. President Barack Obama will urge European allies to support his new strategy for Afghanistan, telling NATO partners this week their security could be at risk if the country falls into chaos. Making his first major foreign trip since taking office on Jan. 20, Obama will discuss the economic crisis at the London Group of 20 summit of major economic powers on Thursday. He will then attend the NATO summit in Strasbourg, France, on Friday and Saturday, marking the alliance's 60th anniversary. Just ahead of the NATO summit, Obama has unveiled a plan for Afghanistan, where violence is at its highest level since U.S.-led forces toppled the Taliban in 2001 and where the NATO mission has been criticized for disorganization. Obama's strategy broadens the U.S. focus to include Pakistan and puts as the highest priority the defeat of al Qaeda militants who he said were plotting new attacks on the United States. He will send 4,000 more U.S. troops to help train the Afghan army and will add more civilian personnel to help tackle problems such as a booming narcotics trade and government corruption. But Obama emphasized that international cooperation was crucial to the plan's success and promised to take that message to Europe, where the public has grown increasingly impatient with the Afghanistan effort. \"The world cannot afford the price that will come due if Afghanistan slides back into chaos or al Qaeda operates unchecked,\" Obama said in a speech in Washington on Friday. \"What's at stake now is not just our own security -- it is the very idea that free nations can come together on behalf of our common security. That was the founding cause of NATO six decades ago. That must be our common purpose today,\" he added. In a shift that has been welcomed in Europe, Obama, a Democrat, has promised a more consultative foreign policy than that of his Republican predecessor, George W. Bush. His administration hopes Obama's popularity abroad will raise the profile of his push for greater support for Afghanistan. In preparing the new Afghanistan strategy, Obama launched a 60-day review that included input from European allies as well as other countries with a stake in the region.", 
        "reply": " +http://www.reuters.com/article/homepageCrisis/idUSN28261439._CH_.2400", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:54:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by WesLemmon: Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran The reason for the lawyers is to help setup effective courts and I have no doubt some of them will be Afgani refugees. The reason for the educators is to help setup schools. Neither of these can be done remotely they have to be done in place and working with the people or you get the first few years of Iraq and the time and money are guaranteed to be WASTED.", 
        "intTime": 20090329, 
        "postID": 20, 
        "quote": "Originally posted by WesLemmon: Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran", 
        "reply": " The reason for the lawyers is to help setup effective courts and I have no doubt some of them will be Afgani refugees. The reason for the educators is to help setup schools. Neither of these can be done remotely they have to be done in place and working with the people or you get the first few years of Iraq and the time and money are guaranteed to be WASTED.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:58:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "Obama Unveils Afghan Plan to Add Troops and Set Goals WASHINGTON — President Obama said on Friday that he plans to further bolster American forces in Afghanistan, increase aid to Pakistan, and for the first time set benchmarks for progress in fighting Al Qaeda and the Taliban in both chaotic countries. In strikingly ominous tones, Mr. Obama warned — just as President George W. Bush did repeatedly over the years — of intelligence estimates that al Qaeda “is actively planning attacks on the U.S. homeland from its safe haven in Pakistan.” “The situation is increasingly perilous,” he told government officials, top military officers and diplomats in remarks at the White House. He added, “We have a clear and focused goal to disrupt, dismantle and defeat al Qaeda in Pakistan and Afghanistan, and to prevent their return to either country in the future.” But President Obama promised neither to write a “blank check” nor to “blindly stay the course” if his risky new strategy does not achieve its ambitious goals. Full article at > >http://www.nytimes.com/2009/03/26/washington/28prexy.html?_r=1&hp", 
        "intTime": 20090327, 
        "postID": 21, 
        "quote": "", 
        "reply": "Obama Unveils Afghan Plan to Add Troops and Set Goals WASHINGTON — President Obama said on Friday that he plans to further bolster American forces in Afghanistan, increase aid to Pakistan, and for the first time set benchmarks for progress in fighting Al Qaeda and the Taliban in both chaotic countries. In strikingly ominous tones, Mr. Obama warned — just as President George W. Bush did repeatedly over the years — of intelligence estimates that al Qaeda “is actively planning attacks on the U.S. homeland from its safe haven in Pakistan.” “The situation is increasingly perilous,” he told government officials, top military officers and diplomats in remarks at the White House. He added, “We have a clear and focused goal to disrupt, dismantle and defeat al Qaeda in Pakistan and Afghanistan, and to prevent their return to either country in the future.” But President Obama promised neither to write a “blank check” nor to “blindly stay the course” if his risky new strategy does not achieve its ambitious goals. Full article at > >http://www.nytimes.com/2009/03/26/washington/28prexy.html?_r=1&hp", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 10:59:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said.", 
        "intTime": 20090327, 
        "postID": 22, 
        "quote": "", 
        "reply": "President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 11:12:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "well hell obama might as well invite them on over and stay for awhile too.... hell already letting gitmo inmates to live and get welfare in the states... come on tailban hell the head of the tailban is a gitmo ex inmate so might as well....", 
        "intTime": 20090327, 
        "postID": 23, 
        "quote": "", 
        "reply": "well hell obama might as well invite them on over and stay for awhile too.... hell already letting gitmo inmates to live and get welfare in the states... come on tailban hell the head of the tailban is a gitmo ex inmate so might as well....", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 11:23:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "outlaws93"
    }, 
    {
        "content": "War Monger! Cindy is pizzed at him!", 
        "intTime": 20090327, 
        "postID": 24, 
        "quote": "", 
        "reply": "War Monger! Cindy is pizzed at him!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 11:45:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said. What I find very telling is that the intelligence experts (not the political appointees at the top) are saying that we need to get information on local conditions and power structures. We have been fighting in Afganistan since Oct. 2001 why don't we already have such BASIC information?", 
        "intTime": 20090327, 
        "postID": 25, 
        "quote": "Originally posted by IHAWKER: President Barack Obama announced Friday that 4,000 paratroopers with the 82nd Airborne Division will head to Afghanistan this fall to train Afghan security forces. “For the first time, this will fully resource our effort to train and support the Afghan Army and Police,” Obama said. The deployment will fill the request by Gen. David McKiernan for a brigade of trainers, a White House official said.", 
        "reply": " What I find very telling is that the intelligence experts (not the political appointees at the top) are saying that we need to get information on local conditions and power structures. We have been fighting in Afganistan since Oct. 2001 why don't we already have such BASIC information?", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 12:45:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "I wonder if he will send them into Pakistan as he alluded to during the campaign.....", 
        "intTime": 20090327, 
        "postID": 26, 
        "quote": "", 
        "reply": "I wonder if he will send them into Pakistan as he alluded to during the campaign.....", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 13:14:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "sw614"
    }, 
    {
        "content": "I don’t even need to read it; I’m just glad there finally is a plan!", 
        "intTime": 20090327, 
        "postID": 27, 
        "quote": "", 
        "reply": "I don’t even need to read it; I’m just glad there finally is a plan!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 13:23:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all.", 
        "intTime": 20090327, 
        "postID": 28, 
        "quote": "Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan!", 
        "reply": " Having a plan, even a bad plan is always better than having no plan at all.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 16:52:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan.", 
        "intTime": 20090327, 
        "postID": 29, 
        "quote": "", 
        "reply": "President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 17:03:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always!", 
        "intTime": 20090327, 
        "postID": 30, 
        "quote": "Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all.", 
        "reply": " Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 17:05:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by xerello: President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan. the war in Afganistan started in Oct 2001 and the Bush Admin had a plan in Sept 2008 (after the Demos had taken control of Congress 2 years before0. Wow what an outstanding example of how important realist planning was to the Bush admin", 
        "intTime": 20090327, 
        "postID": 31, 
        "quote": "Originally posted by xerello: President Bush called for an evaluation of the war in Afghanistan last summer. He announced his new plan in September 2008. >http://www.america.gov/st/texttrans-english/2008/September/20080909101847xjsnommis0.2843134.html Much of the plan is what President Obama has announced today. President Bush just never got around to implementing his plan.", 
        "reply": " the war in Afganistan started in Oct 2001 and the Bush Admin had a plan in Sept 2008 (after the Demos had taken control of Congress 2 years before0. Wow what an outstanding example of how important realist planning was to the Bush admin", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 21:32:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always! Actually the Japanese had a good plan they just did not implement it. They were supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to hold out longer and probably gotten a negotiated peace. This message has been edited. Last edited by: rayld2, Sat 28 March 2009 08:54 AM", 
        "intTime": 20090327, 
        "postID": 32, 
        "quote": "Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always!", 
        "reply": " Actually the Japanese had a good plan they just did not implement it. They were supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to hold out longer and probably gotten a negotiated peace. This message has been edited. Last edited by: rayld2, Sat 28 March 2009 08:54 AM", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-27 21:36:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always! Actually the Japanese had a good plan they just did not implement it. They ere supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to put out longer and probably gotten a negotiated peace. Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan!", 
        "intTime": 20090328, 
        "postID": 33, 
        "quote": "Originally posted by rayld2: quote: Originally posted by EAG154: quote: Originally posted by IHAWKER: quote: Originally posted by Knele: I don’t even need to read it; I’m just glad there finally is a plan! Having a plan, even a bad plan is always better than having no plan at all. Having a bad plan to attack Pearl Harbor cost the Japanese two nuke hits, not necessarly better than having no plan, anyway not always! Actually the Japanese had a good plan they just did not implement it. They ere supposed to take out the repair slips and oil tanks and if they had there is a VERY good chance that they would have been able to take Australia and have consolidated their hold on the Pacific beforethe US could have done anything. If they had been in position and fortified they would have been able to put out longer and probably gotten a negotiated peace.", 
        "reply": " Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-28 04:28:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related?", 
        "intTime": 20090328, 
        "postID": 34, 
        "quote": "Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan!", 
        "reply": " Are you and outlaw related?", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-28 07:09:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related? Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages.", 
        "intTime": 20090328, 
        "postID": 35, 
        "quote": "Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related?", 
        "reply": " Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-28 09:32:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related? Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages. not necessarly related to any humans!", 
        "intTime": 20090329, 
        "postID": 36, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Knele: quote: Originally posted by EAG154: Actually they got their butts kicked, attacking the U.S. was a bad plan which was not as good as not haveing a plan! Are you and outlaw related? Knele I don't agree with EAG154 on many things he has posted but you are getting NASTY with this comment . EAG154 does not post almost exclusively one line attacks with no information in them, neener neener messages or your wrong because I say so messages.", 
        "reply": " not necessarly related to any humans!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 07:39:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "EAG154"
    }, 
    {
        "content": "Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran", 
        "intTime": 20090329, 
        "postID": 37, 
        "quote": "", 
        "reply": "Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:30:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "WesLemmon"
    }, 
    {
        "content": "quote: Originally posted by WesLemmon: If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! It will take years to properly train them.....somebody needs to do the job (stem the tide of inefficiency & corruption) in the mean time!", 
        "intTime": 20090329, 
        "postID": 38, 
        "quote": "Originally posted by WesLemmon: If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense!", 
        "reply": " It will take years to properly train them.....somebody needs to do the job (stem the tide of inefficiency & corruption) in the mean time!", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:53:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Obama to seek NATO support for Afghanistan plan * Obama taking message of cooperation to Europe * Gathering support on Afghanistan an 'ongoing process' * Analysts say message might be tough sell (Adds analyst quote) By Caren Bohan WASHINGTON, March 29 (Reuters) - U.S. President Barack Obama will urge European allies to support his new strategy for Afghanistan, telling NATO partners this week their security could be at risk if the country falls into chaos. Making his first major foreign trip since taking office on Jan. 20, Obama will discuss the economic crisis at the London Group of 20 summit of major economic powers on Thursday. He will then attend the NATO summit in Strasbourg, France, on Friday and Saturday, marking the alliance's 60th anniversary. Just ahead of the NATO summit, Obama has unveiled a plan for Afghanistan, where violence is at its highest level since U.S.-led forces toppled the Taliban in 2001 and where the NATO mission has been criticized for disorganization. Obama's strategy broadens the U.S. focus to include Pakistan and puts as the highest priority the defeat of al Qaeda militants who he said were plotting new attacks on the United States. He will send 4,000 more U.S. troops to help train the Afghan army and will add more civilian personnel to help tackle problems such as a booming narcotics trade and government corruption. But Obama emphasized that international cooperation was crucial to the plan's success and promised to take that message to Europe, where the public has grown increasingly impatient with the Afghanistan effort. \"The world cannot afford the price that will come due if Afghanistan slides back into chaos or al Qaeda operates unchecked,\" Obama said in a speech in Washington on Friday. \"What's at stake now is not just our own security -- it is the very idea that free nations can come together on behalf of our common security. That was the founding cause of NATO six decades ago. That must be our common purpose today,\" he added. In a shift that has been welcomed in Europe, Obama, a Democrat, has promised a more consultative foreign policy than that of his Republican predecessor, George W. Bush. His administration hopes Obama's popularity abroad will raise the profile of his push for greater support for Afghanistan. In preparing the new Afghanistan strategy, Obama launched a 60-day review that included input from European allies as well as other countries with a stake in the region. +http://www.reuters.com/article/homepageCrisis/idUSN28261439._CH_.2400", 
        "intTime": 20090329, 
        "postID": 39, 
        "quote": "Obama to seek NATO support for Afghanistan plan * Obama taking message of cooperation to Europe * Gathering support on Afghanistan an 'ongoing process' * Analysts say message might be tough sell (Adds analyst quote) By Caren Bohan WASHINGTON, March 29 (Reuters) - U.S. President Barack Obama will urge European allies to support his new strategy for Afghanistan, telling NATO partners this week their security could be at risk if the country falls into chaos. Making his first major foreign trip since taking office on Jan. 20, Obama will discuss the economic crisis at the London Group of 20 summit of major economic powers on Thursday. He will then attend the NATO summit in Strasbourg, France, on Friday and Saturday, marking the alliance's 60th anniversary. Just ahead of the NATO summit, Obama has unveiled a plan for Afghanistan, where violence is at its highest level since U.S.-led forces toppled the Taliban in 2001 and where the NATO mission has been criticized for disorganization. Obama's strategy broadens the U.S. focus to include Pakistan and puts as the highest priority the defeat of al Qaeda militants who he said were plotting new attacks on the United States. He will send 4,000 more U.S. troops to help train the Afghan army and will add more civilian personnel to help tackle problems such as a booming narcotics trade and government corruption. But Obama emphasized that international cooperation was crucial to the plan's success and promised to take that message to Europe, where the public has grown increasingly impatient with the Afghanistan effort. \"The world cannot afford the price that will come due if Afghanistan slides back into chaos or al Qaeda operates unchecked,\" Obama said in a speech in Washington on Friday. \"What's at stake now is not just our own security -- it is the very idea that free nations can come together on behalf of our common security. That was the founding cause of NATO six decades ago. That must be our common purpose today,\" he added. In a shift that has been welcomed in Europe, Obama, a Democrat, has promised a more consultative foreign policy than that of his Republican predecessor, George W. Bush. His administration hopes Obama's popularity abroad will raise the profile of his push for greater support for Afghanistan. In preparing the new Afghanistan strategy, Obama launched a 60-day review that included input from European allies as well as other countries with a stake in the region.", 
        "reply": " +http://www.reuters.com/article/homepageCrisis/idUSN28261439._CH_.2400", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:54:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by WesLemmon: Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran The reason for the lawyers is to help setup effective courts and I have no doubt some of them will be Afgani refugees. The reason for the educators is to help setup schools. Neither of these can be done remotely they have to be done in place and working with the people or you get the first few years of Iraq and the time and money are guaranteed to be WASTED.", 
        "intTime": 20090329, 
        "postID": 40, 
        "quote": "Originally posted by WesLemmon: Last week, Obama came out with a new proposal for Afghanistan - and, I support most of it: Here is part of his speech: ------------------------------- \"This push must be joined by a dramatic increase in our civilian effort. Afghanistan has an elected government, but it is undermined by corruption and has difficulty delivering basic services to its people. The economy is undercut by a booming narcotics trade that encourages criminality and funds the insurgency. The people of Afghanistan seek the promise of a better future. Yet once again, have seen the hope of a new day darkened by violence and uncertainty. To advance security, opportunity, and justice - not just in Kabul, but from the bottom up in the provinces - we need agricultural specialists and educators; engineers and lawyers. That is how we can help the Afghan government serve its people, and develop an economy that isn't dominated by illicit drugs. That is why I am ordering a substantial increase in our civilians on the ground.\" ----------------------------------------------------------------------- Forgive me for being a little skeptical; but, why in the hell, do we need to SEND EDUCATORS and LAWYERS to Afghanistan? If there is a need for Education Specialists and Lawyers in Afghanistan, then bring some potential Afghanistan Students here to the U.S. and CONTRACT their Training! Much less expense! Educators, engineers and lawyers will require protection while in Afghanistan (high costs for their physical protection and living expenses). On the surface, it doesn't make sense other than \"Obama is GROWING the U.S. Government!\" And, Paying Back \"Political Supporters\" for Voting for the Obama Ticket. From A Proud Vietnam Veteran", 
        "reply": " The reason for the lawyers is to help setup effective courts and I have no doubt some of them will be Afgani refugees. The reason for the educators is to help setup schools. Neither of these can be done remotely they have to be done in place and working with the people or you get the first few years of Iraq and the time and money are guaranteed to be WASTED.", 
        "threadID": "672198221_6610001912001", 
        "time": "2009-03-29 08:58:00", 
        "title": "Obama Unveils Afghan Plan to Add Troops and Set Goals", 
        "userID": "rayld2"
    }
]