[
    {
        "content": "More not so good financial news. \"www.drudgereport.com/flashocs.htm\"", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "", 
        "reply": "More not so good financial news. \"www.drudgereport.com/flashocs.htm\"", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-23 13:41:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: More not so good financial news. \"www.drudgereport.com/flashocs.htm\" I knew that, but am pretty suprised to hear Obama admit it.", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "Originally posted by gypsysnipe: More not so good financial news. \"www.drudgereport.com/flashocs.htm\"", 
        "reply": " I knew that, but am pretty suprised to hear Obama admit it.", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-23 17:32:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090523, 
        "postID": 3, 
        "quote": "", 
        "reply": "So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are... It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-23 17:35:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are... It's also the most expensive military in the world. If the medicare system were as effective, there might be a national funeral policy.", 
        "intTime": 20090523, 
        "postID": 4, 
        "quote": "Originally posted by FollowMeInfantry: So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are...", 
        "reply": " It's also the most expensive military in the world. If the medicare system were as effective, there might be a national funeral policy.", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-23 22:35:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are... We can invade another country and spend trillions of our own dollars re-building it.", 
        "intTime": 20090524, 
        "postID": 5, 
        "quote": "Originally posted by FollowMeInfantry: So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are...", 
        "reply": " We can invade another country and spend trillions of our own dollars re-building it.", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-24 02:31:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: More not so good financial news. \"www.drudgereport.com/flashocs.htm\" This has to fall directly into the 'no **** sherlock' category! Forget the deficit Bush left, obama tripled it just with the stimulus package! It continues to get worse with the new budget package and what were the Tea Parties referred to as 'astro turf' by pelosi. NOW a health care plan that will only add more to the deficit! NOTE: I haven't found a link to this statement but I know what I heard. The dems proposal says they want every company to provide health care or they will be fined by the Treasury Dept if they don't!", 
        "intTime": 20090524, 
        "postID": 6, 
        "quote": "Originally posted by gypsysnipe: More not so good financial news. \"www.drudgereport.com/flashocs.htm\"", 
        "reply": " This has to fall directly into the 'no **** sherlock' category! Forget the deficit Bush left, obama tripled it just with the stimulus package! It continues to get worse with the new budget package and what were the Tea Parties referred to as 'astro turf' by pelosi. NOW a health care plan that will only add more to the deficit! NOTE: I haven't found a link to this statement but I know what I heard. The dems proposal says they want every company to provide health care or they will be fined by the Treasury Dept if they don't!", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-24 03:26:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "busnrete8"
    }, 
    {
        "content": "And to see in that link, Obama doubting he could serve on the court, but he thinks (and apparently many do) that he can run the country????? Unbelievable that so many were so gullible. quote: SCULLY: William Howard Taft served on the court after his presidency, would you have any interest in being on the Supreme Court? OBAMA: You know, I am not sure that I could get through Senate confirmation...", 
        "intTime": 20090524, 
        "postID": 7, 
        "quote": "SCULLY: William Howard Taft served on the court after his presidency, would you have any interest in being on the Supreme Court? OBAMA: You know, I am not sure that I could get through Senate confirmation...", 
        "reply": "And to see in that link, Obama doubting he could serve on the court, but he thinks (and apparently many do) that he can run the country????? Unbelievable that so many were so gullible. ", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-24 15:47:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Thanks Obama!!!", 
        "intTime": 20090525, 
        "postID": 8, 
        "quote": "", 
        "reply": "Thanks Obama!!!", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-25 14:44:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "TheGoodOne"
    }, 
    {
        "content": "Wait till hyper inflation hits and there is no food on the store shelves, no fuel at the pump, no water, gas, heating oil or electricity in your home, no trash removal, police or fire services... Then of course, there is the ammunition shortage in the United States right now, have you checked the availability and prices lately?... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090525, 
        "postID": 9, 
        "quote": "", 
        "reply": "Wait till hyper inflation hits and there is no food on the store shelves, no fuel at the pump, no water, gas, heating oil or electricity in your home, no trash removal, police or fire services... Then of course, there is the ammunition shortage in the United States right now, have you checked the availability and prices lately?... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-25 16:00:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: QUOTE] We can invade another country and spend trillions of our own dollars re-building it. mixitup, Another super post by you. Spot on! Jack", 
        "intTime": 20090525, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: QUOTE] We can invade another country and spend trillions of our own dollars re-building it.", 
        "reply": " mixitup, Another super post by you. Spot on! Jack", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-25 17:17:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by FollowMeInfantry: So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are... We can invade another country and spend trillions of our own dollars re-building it. mrmixitup, Another super post by you! Jack", 
        "intTime": 20090525, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by FollowMeInfantry: So what? We have the most powerful military in the world. Let's just go steal it! According to the liberals, we already are... We can invade another country and spend trillions of our own dollars re-building it.", 
        "reply": " mrmixitup, Another super post by you! Jack", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-25 17:19:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "jackhunter1"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Wait till hyper inflation hits and there is no food on the store shelves, no fuel at the pump, no water, gas, heating oil or electricity in your home, no trash removal, police or fire services... Then of course, there is the ammunition shortage in the United States right now, have you checked the availability and prices lately?... One wonders... Respectfully, SUNLINER81 Liberals don't care about the future. They care about today. If any or all of the above things happen they will simply look to the government to \"fix\" it for them.", 
        "intTime": 20090525, 
        "postID": 12, 
        "quote": "Originally posted by SUNLINER81: Wait till hyper inflation hits and there is no food on the store shelves, no fuel at the pump, no water, gas, heating oil or electricity in your home, no trash removal, police or fire services... Then of course, there is the ammunition shortage in the United States right now, have you checked the availability and prices lately?... One wonders... Respectfully, SUNLINER81", 
        "reply": " Liberals don't care about the future. They care about today. If any or all of the above things happen they will simply look to the government to \"fix\" it for them.", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-25 18:30:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by SUNLINER81: Wait till hyper inflation hits and there is no food on the store shelves, no fuel at the pump, no water, gas, heating oil or electricity in your home, no trash removal, police or fire services... Then of course, there is the ammunition shortage in the United States right now, have you checked the availability and prices lately?... One wonders... Respectfully, SUNLINER81 Liberals don't care about the future. They care about today. If any or all of the above things happen they will simply look to the government to \"fix\" it for them. Can't fix it, when there is nothing to fix it with, no money or useless money means you can't buy the materials to distribute to the people and since we no longer manufacture most of our clothing and shoes and basic sundries such as tooth paste and tooth brushes and laundry and bath soaps, watch how quickly this nation descends into anarchy... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090525, 
        "postID": 13, 
        "quote": "Originally posted by stec74: quote: Originally posted by SUNLINER81: Wait till hyper inflation hits and there is no food on the store shelves, no fuel at the pump, no water, gas, heating oil or electricity in your home, no trash removal, police or fire services... Then of course, there is the ammunition shortage in the United States right now, have you checked the availability and prices lately?... One wonders... Respectfully, SUNLINER81 Liberals don't care about the future. They care about today. If any or all of the above things happen they will simply look to the government to \"fix\" it for them.", 
        "reply": " Can't fix it, when there is nothing to fix it with, no money or useless money means you can't buy the materials to distribute to the people and since we no longer manufacture most of our clothing and shoes and basic sundries such as tooth paste and tooth brushes and laundry and bath soaps, watch how quickly this nation descends into anarchy... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7310090422001", 
        "time": "2009-05-25 20:10:00", 
        "title": "Quote: \"The USA is out of money\"", 
        "userID": "SUNLINER81"
    }
]